{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "This dispatch details the debriefing of a CIA asset, AMFAUNA-14, after her arrest and interrogation by the DSE, including specific details about DSE officers and methods. It also reveals the identities and activities of other assets and sub-sources like AMFAUNA-1, AMCUTLER-2, and Luis Braulio VILLAR Negret. Revealing these details could compromise current and former assets and their operations. Quoting directly from the dispatch: “ABAD asked if she knew one Luis Braulio VILLAR Negret. AMPAUNA-14 said that she did not. ABAD said that this was strange, because VILLAR Negret knew her.”; “According to what the DSE officers told her, “El Negro” was arrested about 1 October and was to be shot.”",
  "security_level": "SECRET",
  "summary": "A dispatch detailing the debriefing of AMFAUNA-14 following her detention and interrogation by the DSE in Cuba, revealing information about her contacts, activities, and the methods used by Cuban intelligence.",
  "summary_one_paragraph": "This secret dispatch outlines the debriefing of AMFAUNA-14, a CIA asset, after her arrest by the DSE in Havana between 22 November and 2 December 1963. AMFAUNA-14's testimony reveals her connections with individuals like AMFAUNA-1 and Luis Braulio VILLAR Negret, her role as a cutout, and insights into DSE interrogation techniques and knowledge. The report covers her attempts to conceal information, her eventual cooperation under pressure, and the DSE's focus on her relationship with KUBARK agents and the flow of funds to anti-government groups.",
  "tags": [
    "CIA",
    "AMFAUNA-14",
    "DSE",
    "Debriefing",
    "Cuba",
    "Interrogation",
    "KUBARK",
    "Assets",
    "Counterintelligence"
  ],
  "title": "Debriefing of AMFAUNA-14",
  "date": "1963-12-09",
  "locations_mentioned": [
    "JMWAVE area",
    "Cuba",
    "Villa Maristas",
    "Havana",
    "Miami, FLA, USA",
    "Pinar del Rio Province",
    "Isle of Pines",
    "Luyano",
    "Miramar"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "AMFAUNA-14",
    "AMFAUNA-1",
    "Francisco ABAD",
    "Pedro CARRILLO",
    "Justo CARRILLO",
    "Fidel CASTRO",
    "Carlos (aka Samuel)",
    "Israel PADILLA",
    "Samuel RODILES Plana",
    "Maria Antonia CARCANO Araujo",
    "Jose Antonio FERNANDEZ Menert",
    "AMBIG-2",
    "Manuel COMPANIONI",
    "Luis Braulio VILLAR Negret",
    "Angel BRINGAS",
    "Julio",
    "AMCOG-2",
    "Segundo",
    "El Negro",
    "Aureliano SANCHEZ Arango",
    "Frank PAEZ",
    "Gladys",
    "AMCUTLER-2",
    "Lolin CORREOSO",
    "AMFAUNA-39",
    "AMWEE-28",
    "AMCOG-3",
    "AMFAUNA-24",
    "Manolo VILLAMANAN",
    "Raul"
  ],
  "recipient": "Chief, Special Affairs Staff",
  "sender": "Chief of Station, JMWAVE"
}