{
  "classification": "Operations",
  "document_type": "Dispatch",
  "security": "This dispatch concerns the operation of a press service called LIANCHOR, including details about its funding, personnel, and operational activities. Specifically, it mentions recruitment efforts, financial support through WOFIRM, and covert actions against Soviet poet Yevgenyi Yevtushenko. Disclosing these details could reveal sensitive intelligence methods, compromise active operations, and expose the identities and activities of involved individuals, potentially damaging the CIA’s operational capabilities and relationships with assets.",
  "security_level": "SECRET",
  "summary": "A progress report on the LIANCHOR project, a leftist writer press service, detailing its production, operational challenges, and plans for renewal, including personnel changes and covert actions, for the period of December 1967 to May 1968.",
  "summary_one_paragraph": "This dispatch from the Chief of the Western Hemisphere Division to the Chief of Station, Mexico City, provides a progress report on the LIANCHOR project from December 1967 to May 1968. It discusses the leftist writer press service's production of articles for Latin American newspapers, its failure to meet objectives, and planned changes, including dropping writers and replacing the P/A (LINLUCK). The report covers the formal organization of the LIANCHOR Press Service, difficulties in finding a replacement for P/A(LINLUCK), their involvement in covert action operations against Soviet poet Yevgenyi Yevtushenko, an assessment of LIANCHOR's effectiveness, and future plans, including potentially converting LIANCHOR to a roof project for singleton leftist writer assets.",
  "tags": [
    "CIA",
    "LIANCHOR",
    "WHM/MHSPAWN",
    "Mexico City",
    "Press Service",
    "Covert Action",
    "Yevgenyi Yevtushenko",
    "LINLUCK",
    "WOFIRM"
  ],
  "title": "OPERATIONAL/LIANCHOR Progress Report for December 1967 - May 1968",
  "date": "1968-06-03",
  "locations_mentioned": [
    "Mexico City",
    "Latin America",
    "Guatemala",
    "Miami",
    "Sofia",
    "Buenos Aires",
    "Montevideo",
    "Santiago",
    "Bogota",
    "Venezuela",
    "Bolivia",
    "Brazil",
    "Argentina",
    "Chile",
    "Colombia",
    "Ecuador"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "LINLUCK",
    "Ricardo GARIBAY Ortega",
    "Eunice ODIO Infante",
    "Alfonso MARTINEZ Estevez",
    "Jacobo ARBENZ",
    "Ernesto de la*PENA y Munoz",
    "Manuel CALVILLO",
    "Alicia REYES",
    "Francisco ZENDEJAS",
    "Leon TROTSKY",
    "Rodrigo GARCIA Trevino",
    "Rene ARTEAGA",
    "Rafael ARRIAGA Bosque",
    "Julio MENDEZ Montenegro",
    "Willard C. CURTIS",
    "Yevgenyi YEVTUSHENKO",
    "Margarita MICHELENA"
  ],
  "recipient": "Chief of Station, Mexico City",
  "sender": "Chief, Western Hemisphere Division"
}