{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "The ARRB took the following actions on CIA document/issues: Accepted CIA request to consider crypts/project names in Ford Presidential Library Documents (Rockefeller Commission) NBR, not believed relevant, protect until 2017; Accepted CIA request to retype the Australian document being released in sanitized form (Board voted to protect the liaison relationship and to delete any identifying information at previous meeting); Accepted CIA approved language for description of 4 pages dealing with the assassination from a sensitive foreign document know as the Mark Lane document. Rejected CIA request for reconsideration of previous decision to protect only the digraph of crypt, IJDECANTER [asset, dead, identity and relationship with Agency exposed in Dec 1997 LA Times article]; Rejected CIA request to deny in full JMWAVE org chart / Board voted 5-0 to open in full.",
  "security_level": "SECRET",
  "summary": "J. Barry Harrelson summarizes the results of an ARRB meeting on July 20 regarding CIA documents related to the JFK assassination, noting ARRB's decisions on CIA requests concerning crypts, project names, sanitized releases, and the handling of sensitive foreign documents.",
  "summary_one_paragraph": "J. Barry Harrelson, the JFK Project Officer, prepared a memorandum summarizing the outcomes of the July 20 ARRB meeting concerning CIA documents and issues related to the JFK assassination records. The ARRB accepted the CIA's requests to consider crypts/project names in Ford Presidential Library documents, to retype the Australian document for sanitized release protecting the liaison relationship, and to use CIA-approved language for describing four pages from the \"Mark Lane\" document; however, the ARRB rejected CIA requests to reconsider protecting only the digraph of crypt IJDECANTER and to deny the JMWAVE org chart, voting 5-0 to open it in full, with Harrelson seeking guidance on whether to appeal these rejections before the next board meeting on August 6.",
  "tags": [
    "ARRB",
    "CIA",
    "JFK Assassination",
    "Declassification",
    "Crypts",
    "Project Names",
    "Sanitization",
    "Mark Lane Document",
    "IJDECANTER",
    "JMWAVE",
    "Ford Presidential Library",
    "Rockefeller Commission"
  ],
  "title": "ARRB Meeting 20 July - Results",
  "date": "1998-07-22",
  "persons_mentioned": [
    "J. Barry Harrelson",
    "Lee S. Strickland",
    "Fredrick C. Wickham",
    "Mary Lou Cummings",
    "Barbara T. Blufer",
    "Teresa Wilcox",
    "Becky L. Rant",
    "William H. McNair",
    "Linda C. Cipriani",
    "Eileen M. Wukitch",
    "Edmund Cohen",
    "James R. Oliver",
    "Stephen M. White",
    "Martin J. Boland",
    "Mark Lane"
  ],
  "sender": "J. Barry Harrelson, JFK Project Officer, OIM/HRP"
}