{
  "classification": "John F. Kennedy Assassination Records Act of 1992",
  "document_type": "Message",
  "security": "Disclosing the identity of a sympathizer or source (REAM) could expose them to risk, damaging ongoing intelligence operations. The message mentions providing source protection to the FBI, INS, Senate Select Committee, and House Assassinations Subcommittee, highlighting sensitivity. 'WITH SOURCE PROTECTION TO FBI, INS AND TO BOTH SENATE SELECT COMMITTEE AND HOUSE ASSASSINATIONS SUBCOMMITTEE.'",
  "security_level": "SECRET",
  "summary": "This is a message from E/BNL/N to The Hague providing information and source protection details related to a sympathizer (REAM), with reference to previous communication. It includes dissemination instructions and file information.",
  "summary_one_paragraph": "On November 15, 1977, E/BNL/N (B. Rathjen) sent a deferred telepatch message to The Hague, relaying information concerning a sympathizer (identified by the code name REAM). The message indicates the information is being provided with source protection to the FBI, INS, Senate Select Committee, and House Assassinations Subcommittee. It references a previous communication from The Hague and includes file information (201-0155221) and dissemination instructions, with coordination from CI/OG, SA/DO/O, and LA/C/EU.",
  "tags": [
    "WNINTEL",
    "RYBAT",
    "REAM",
    "MHCOLOR",
    "Sympathizer",
    "Source Protection",
    "FBI",
    "INS",
    "Senate Select Committee",
    "House Assassinations Subcommittee"
  ],
  "title": "WNINTEL RYBAT REAM (SYMPATHIZER) MHCOLOR Y",
  "date": "1977-11-15",
  "origin_agency": "CIA",
  "sender": "E/BNL/N (B. RATHJEN) 90043% COORD: CI/OG (R. HOLMS - TC): SA/DO/O (E. VIDAL - INFO), LA/C/EU (B. BRAMSON) - TC): REL: AC/AE/BNL KRUMVIEDE). 03DATE: 15 NOV 77ORIG: RATHJEN JMGLOUNIT: E/BNL/N03EXT: 9004CI/OG - R. HOLMS (TELECOORD)SA/DO/O - E. VIDAL (FOR INFO)AC/E/BNLRELEASING OFFICERLA/C/EU - B. BRAMSON) (TELECOORD)COORDINATING OFFICERSAUTHENTICATING OFFICERCLASSIFICATION03E 2 IMPDETCL BY: 034537B/P/"
}