{
  "classification": "Liaison",
  "document_type": "Memorandum",
  "security": "Several parts of the document would not be wise to share. The identities of FBI confidential informants are being protected. The crypts and names of three former Soviet agents are also being protected. The real name of SHAMROCK may not be released because his identity has remained a secret for 30 years. We do not know if (MAKAREVICH is alive or dead, IB FBI and believe that exposure could damage him and his family. Tom RYAN's name should be deleted from the front cover of the SHAMROCK debriefing. Mr. RYAN retired under 11 cover, and is employed as an intelligence contractor on a sensitive project. The name and cover name of NARKULYANI (\"Greta\") IB FBI should be deleted.",
  "security_level": "SECRET",
  "summary": "This document involves coordination between the CIA and FBI regarding the release of JFK assassination-related documents, specifically addressing concerns about protecting the identities of informants and Soviet agents. It includes internal assessments of document authenticity and discussions regarding the release of agent-specific data.",
  "summary_one_paragraph": "This collection of memoranda, dated from 1963 to 1995, details coordination between the FBI and CIA concerning JFK assassination documents. Reviewer Barry Harrelson forwards an FBI memorandum from 1963 regarding relations with the CIA and Lee Harvey Oswald, including an account of confronting CIA Director John McCone about alleged false statements. Additional memos discuss the authenticity of a document linking Dorothy Kilgallen, Marilyn Monroe, and Robert Kennedy and the release of information on Soviet agents, with concerns about protecting their identities.",
  "tags": [
    "JFK Assassination",
    "FBI",
    "CIA",
    "Lee Harvey Oswald",
    "John McCone",
    "Informant Protection",
    "Soviet Agents",
    "Document Authenticity",
    "Historical Review Group"
  ],
  "title": "Coordination: JFK Assassination Document (FBI referral)",
  "date": "1993-03-25",
  "persons_mentioned": [
    "Barry Harrelson",
    "W. C. Sullivan",
    "D. J. Brennan, Jr.",
    "Lee Harvey Oswald",
    "Agent Papich",
    "John McCone",
    "Mr. DeLoach",
    "Drew Pearson",
    "President Johnson",
    "Alvarado",
    "Mr. Belmont",
    "Mr. Branigan",
    "Grant P. Harmon",
    "Dorothy Kilgallen",
    "Marilyn Monroe",
    "Robert Kennedy",
    "Castro",
    "Ellie Neiman",
    "Dmitriy Fedorovich POLYAKOV",
    "Nikolay Romanovich MAKAREVICH",
    "Aleksiy Isadorovich KULAK",
    "Tom RYAN",
    "NARKULYANI"
  ],
  "recipient": "DCI/FIO",
  "sender": "Barry Harrelson, Reviewer"
}