{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Outgoing Message",
  "security": "Disclosing the station's concerns could compromise ongoing or future interactions with the Argentine Federal Police and could alert the Council for the Americas to the station's awareness of potential security issues with Van Cleave. The message states: \"DCD HAS BEEN BRIEFED ON POTENTIAL PROBLEMS FOR BUENOS AIRES STATION INHERENT IN VAN CLEAVE AND COUNCIL FOR THE AMERICAS INVOLVE-MENT WITH ARGENTINE FEDERAL POLICE ON MATTERS RELATED TO TERRORIST KIDNAPPINGS, AND IS ADVISING THEIR FIELD OFFICES TO AVOID CONTACT, WITH VAN CLEAVE IN FUTURE.\"",
  "security_level": "SECRET",
  "summary": "An outgoing message from the Buenos Aires station reports that the Domestic Contact Division (DCD) interviewed Stephen Van Cleave, president of Intelligence Services, Ltd., regarding his activities in Argentina, specifically organizing security for Coca-Cola, and highlights potential problems with Van Cleave's and the Council for the Americas' involvement with the Argentine Federal Police on terrorist kidnapping matters.",
  "summary_one_paragraph": "This SECRET outgoing message from the Buenos Aires station, dated February 26, 1974, informs the Director and other offices that the Domestic Contact Division (DCD) interviewed Stephen Van Cleave about his trips to Argentina, where he organized a security force for Coca-Cola. The message relays that the DCD has been briefed on possible issues stemming from Van Cleave and the Council for the Americas’ engagement with the Argentine Federal Police concerning terrorist kidnappings, and is advising its field offices to cease contact with Van Cleave in the future.",
  "tags": [
    "CIA",
    "Buenos Aires",
    "Stephen Van Cleave",
    "Domestic Contact Division",
    "Council for the Americas",
    "Argentine Federal Police",
    "Coca-Cola",
    "Terrorist Kidnappings",
    "RYBAT",
    "MHSPIKE"
  ],
  "title": "Stephen Van Cleave Interview and Concerns Regarding Involvement with Argentine Federal Police",
  "date": "1974-02-26",
  "locations_mentioned": [
    "Argentina",
    "Washington, D.C.",
    "Miami"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Stephen Van Cleave",
    "Lillian I. Grant",
    "Bill Cantrell"
  ],
  "recipient": "Director",
  "sender": "David H. Deuhurst"
}