{
  "classification": "Personnel",
  "document_type": "Notification",
  "security": "Revealing official cover arrangements and backstop information could expose operational methods and personnel. Specifically, disclosing the existence of a Department of State cover, the SS number, and the mention of 'EUS-OVERT,' '5G-DAC,' and 'MEXICO STATE-ONE' could compromise past and future operations. The form explicitly states 'KEEP ON TOP OF FILE WHILE COVER IN EFFECT' and 'RETURN ALL OFFICIAL DOCUMENTATION TO CCS', emphasizing the sensitivity of the information. Unauthorized reproduction is prohibited.",
  "security_level": "SECRET",
  "summary": "This notification establishes or cancels official cover for Charlotte Bustos-Videla, an employee, specifying the type of cover provided (Department of State and DOD), the effective dates, and instructions for handling official documentation and record-keeping.",
  "summary_one_paragraph": "This document, dated 10 July 1974, notifies the establishment or cancellation of official cover for Charlotte Bustos-Videla (employee number 007667, SS number 069-24-3138) with the Department of State. The form specifies that basic cover is provided by the Department of Defense (DOD), indicates various cover assignments from August 1951 to June 1974 including EUS-OVERT, 5G-DAC, MEXICO STATE-ONE, ES-DAC, and TRINIDAD-21631, and outlines administrative actions required such as submitting forms for W-2 issuance, hospitalization cards, and changes affecting the cover. The notification emphasizes maintaining file security and returning all documentation to the Cover and Commercial Staff (CCS).",
  "tags": [
    "Official Cover",
    "Charlotte Bustos-Videla",
    "Department of State",
    "DOD",
    "Cover Establishment",
    "Cover Discontinuation",
    "Personnel Security",
    "CIA"
  ],
  "title": "Notification of Establishment or Cancellation of Official Cover",
  "date": "1974-07-10",
  "persons_mentioned": [
    "Charlotte Bustos-Videla",
    "James Th Franklion"
  ],
  "recipient": "Chief, Control Division, OP; Chief, Contract Personnel Division, OP; Chief, Operating Component",
  "sender": "Chief, Official Cover Branch, Cover and Commercial Staff, James Th Franklion"
}