{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "Revealing the approach to Benito Ruiz Grillo was facilitated via a CIRA convention with DPD approval could expose sources and methods.",
  "security_level": "SECRET",
  "summary": "A cable from Mexico City requests traces and a Proof of Action (POA) on Benito Ruiz Grillo and his wife, Ofelia Rodriguez, detailing their background, including former employment as American tourist guides and possible assistance to anti-Castro persons, and indicates a facilitated approach to Grillo via a convention.",
  "summary_one_paragraph": "This secret cable from Mexico City to the Director requests traces and Proof of Action concerning Benito Ruiz Grillo, born January 16 in Los Arabos, Matanzas, and his wife Ofelia Rodriguez, born March 7 in Santa Cruz del Sur, Havana Province. The cable highlights their marriage at the Hotel Nacional, Havana, their former employment as American tourist guides with ASTA, and their acquisition of American citizenship in the early 1960s, later relinquished around 1950. It also notes Grillo's allowance to attend an ASTA convention in Mexico City from October 21-25, access to travel information, alleged assistance to anti-Castro individuals, and knowledge of Bloc TECUS residents at the Hotel Nacional, reporting an approach to Grillo was facilitated through a CIRA convention with DPD approval in July 1959.",
  "tags": [
    "Benito Ruiz Grillo",
    "Ofelia Rodriguez",
    "Mexico City",
    "traces",
    "Proof of Action",
    "ASTA Convention",
    "Anti-Castro",
    "CIRA",
    "DOP",
    "ADDP",
    "C/CI",
    "C/SAS",
    "RYBAT"
  ],
  "title": "Request for Traces and POA on Benito Ruiz Grillo",
  "date": "Unknown",
  "locations_mentioned": [
    "Mexico City",
    "Los Arabos, Matanzas",
    "Santa Cruz del Sur, Havana Province",
    "Havana",
    "Santiago de Los Banos"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Benito Ruiz Grillo",
    "Ofelia Rodriguez",
    "Benito Lantin",
    "John Ruiz Lantin",
    "George Mason"
  ],
  "recipient": "Director",
  "sender": "Mexico City"
}