{
  "classification": "Personnel",
  "document_type": "Report",
  "security": "Revealing Mr. Andreas's relationship with the Domestic Contact Service and his role as a Principal Officer for a CIA funding mechanism would expose sensitive intelligence-gathering methods and potentially compromise current and former Agency assets.  Quoting directly: \"from April 1952 to the present has responded to intelligence requirements levied by the Central Intelligence Agency through his relationship with its Domestic Contact Service\" and \"Beginning in 1962, Mr. Andreas served as Principal Officer of the Andreas Foundation, (a funding mechanism of this Agency)\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This document outlines Dwayne Orville Andreas's background, including his role as Chairman of First Oceanic Corporation, his connection to the Watergate scandal through a $25,000 check, his long-standing relationship with the CIA's Domestic Contact Service, and his service as a Principal Officer for a CIA funding mechanism.",
  "summary_one_paragraph": "The report details Dwayne Orville Andreas's background, noting his position as Chairman of First Oceanic Corporation and his link to the Watergate scandal via a check deposited into Bernard L. Barker's account. It further reveals Andreas's relationship with the CIA's Domestic Contact Service from 1952 and his role as Principal Officer of the Andreas Foundation, a CIA funding mechanism, from 1962 to 1967. The report also mentions that Andreas's firm, Archer Daniels Midland Company, provided cover for five CIA operational assets between 1964 and 1969, with his brother Lowell W. Andreas serving as the primary contact, while Dwayne Andreas remained unaware of the cover arrangements.",
  "tags": [
    "Dwayne Orville Andreas",
    "First Oceanic Corporation",
    "Watergate",
    "Kenneth Dahlberg",
    "Bernard L. Barker",
    "CIA",
    "Domestic Contact Service",
    "Andreas Foundation",
    "Archer Daniels Midland Company",
    "Lowell W. Andreas",
    "Covert Operations"
  ],
  "title": "Dwayne Orville Andreas",
  "date": "1972-08-25",
  "locations_mentioned": [
    "Minneapolis, Minnesota",
    "Miami, Florida",
    "Worthington, Minnesota",
    "Decatur, Illinois"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Dwayne Orville Andreas",
    "Kenneth Dahlberg",
    "Bernard L. Barker",
    "Lowell W. Andreas"
  ]
}