{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "Disclosing details about the CIA's role in guiding and financing the Cuban Revolutionary Council (CRC), along with information about exile sentiments and internal organizational dynamics, could damage the Agency's reputation and reveal operational methods. Specifically, the memo states the organization was formed \"under the guidance of the U.S. Government\" and refers to the \"extent and scope of non-CIA support...to the CUBAN exiles.\" Revealing this guidance and support may damage ongoing or future operations.",
  "security_level": "SECRET",
  "summary": "This is a memorandum summarizing the Cuban Revolutionary Council (CRC), formed in 1961 under U.S. Government guidance to unify Cuban exile groups, detailing its structure, financing, and internal issues, as well as exile disappointment with U.S. policy towards Cuba.",
  "summary_one_paragraph": "This memorandum, dated November 1976, summarizes the activities of the Cuban Revolutionary Council (CRC) from 1961 through 1964. The CRC was formed in New York City on 22 March 1961, under the guidance of the U.S. Government, aiming to unify various exile groups. The file indicates exile disappointment with U.S. policy, featuring resignations, coalitions, in-fighting, political aspirations, and organizational structure. It references a 1963 cable noting uproar among exiles over travel restrictions, perceived as anti-U.S. and a sign of co-existence with Cuba, as well as a 1962 dispatch concerning CIA support to Cuban exiles and the Cuban underground.",
  "tags": [
    "Cuban Revolutionary Council",
    "CRC",
    "Cuban Exiles",
    "U.S. Government",
    "JFK Task Force",
    "AMBUD",
    "WAVE",
    "JMWAVE",
    "FOIA"
  ],
  "title": "Cuban Revolutionary Council (CRC)",
  "date": "1976-11-01",
  "locations_mentioned": [
    "New York City",
    "Dade County",
    "Cuba"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Marty Mille"
  ],
  "recipient": "Record"
}