{
  "classification": "John F. Kennedy Assassination",
  "document_type": "File Records",
  "security": "These files contain information about Joseph R. Merola's involvement with the CIA and other agencies, including details about his contacts, offers of assistance, and his role as a potential informant. Releasing specific information about Merola's activities, the agencies he worked with, and the nature of his intelligence contributions could expose sources and methods, compromise ongoing or future operations, and damage relationships with other agencies.",
  "security_level": "SECRET",
  "summary": "This file contains documents related to Joseph R. Merola, including FBI documents, a Department of Army document, and CIA documents concerning his contacts with the agency, particularly regarding Cuban matters and a Latin American senator associated with Che Guevara. It also includes information related to a fraud trial in San Diego where Merola's connections with the CIA were discussed.",
  "summary_one_paragraph": "This collection of documents from the House Select Committee on Assassinations Staff Records pertains to Joseph R. Merola and includes FBI reports from 1958-1959 focusing on Caribbean political activities, Panamanian revolutionary efforts, and Merola’s association with individuals like Ruben Oscar Miro Guardia. Also present are a Department of Army document from May 1959 and CIA correspondence from 1977 detailing Merola's contacts with the agency in the early 1960s, specifically regarding Cuban matters and a purported link between a Latin American senator and Che Guevara, as well as his later involvement as a witness in a criminal fraud trial in San Diego. The documents also reference Merola's DEA registration and potential involvement with anti-Castro organizations.",
  "tags": [
    "Joseph R. Merola",
    "FBI",
    "CIA",
    "Panama",
    "Cuba",
    "Fraud Trial",
    "Informant",
    "Caribbean Political Activities",
    "HSCA",
    "JFK Assassination Records Act"
  ],
  "title": "MEROLA, JOSEPH R.",
  "date": "1959-1977",
  "locations_mentioned": [
    "Cuba",
    "Panama",
    "Miami",
    "San Diego",
    "El Salvador",
    "Pittsburgh",
    "Pennsylvania"
  ],
  "origin_agency": "FBI, Department of Army, CIA",
  "persons_mentioned": [
    "Joseph R. Merola",
    "Ruben Oscar Miro Guardia",
    "B. Leonard Bird",
    "Robert Dillard",
    "Che Guevara",
    "Victor Carlucci",
    "Daniel Hanna",
    "Mathew McVane",
    "Dalton C. Smith",
    "John K. Greaney",
    "David M. Curry",
    "Raymond Warren",
    "Maurice A. Sovern",
    "Crocky Br",
    "Frederic McCann",
    "Frank Sturgis",
    "Fugeria (Rolando) Merturer",
    "Alfredo Borges",
    "E. Mac Amos, Jr.",
    "Douglas W. Haldane",
    "Robert Thaller",
    "Edward Stanton",
    "Gordon Thompson"
  ],
  "recipient": "David M. Curry, Esq.",
  "sender": "Maurice A. Sovern"
}