{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "Disclosing that the FBI is actively collecting information from Cuban exiles (MM T-1 and MM T-2), who are providing reliable intelligence, could jeopardize their safety and compromise future information gathering. Quoting directly: \"MM T-1, a former Cuban business executive...who has furnished some reliable information in the past...advised that an all-night session of the Council was held...\" and \"MM T-2, a Cuban exile who has furnished some reliable information in the past...advised that reaction among the Cuban exiles is 'very bad against the United States'\".",
  "security_level": "UNCLASSIFIED",
  "summary": "An FBI report detailing the Cuban Revolutionary Council's reaction to perceived changes in U.S. policy toward Cuba, including Dr. Jose Miro Cardona's potential resignation and the growing frustration among Cuban exiles.",
  "summary_one_paragraph": "This FBI report, dated April 16, 1963, from the Miami field office, outlines the internal dynamics of the Cuban Revolutionary Council in response to perceived shifts in U.S. policy toward Cuba. It details Dr. Jose Miro Cardona's initial offer to resign as head of the Council due to his belief that the U.S. lacks a concrete plan to liberate Cuba and favors peaceful co-existence with the Castro regime. While the Council initially rejected Cardona’s resignation, they expressed a serious crisis in relations with the U.S., affirming their commitment to continue the fight against the Soviet-Castro regime and appealing for continued American support, and frustration among the Cuban exiles due to the perception of abandonment by the United States.",
  "tags": [
    "Cuban Revolutionary Council",
    "Jose Miro Cardona",
    "Cuban Exiles",
    "U.S. Policy",
    "Fidel Castro",
    "John F. Kennedy",
    "FBI",
    "Internal Security",
    "Cuba"
  ],
  "title": "Cuban Revolutionary Council: Internal Security Cuba",
  "date": "1963-04-16",
  "locations_mentioned": [
    "Miami, Florida",
    "Cuba",
    "Washington, D.C.",
    "Havana",
    "Guantanamo"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "Jose Miro Cardona",
    "John F. Kennedy",
    "Fidel Castro",
    "JOSE FERNANDEZ BADUE",
    "CESAR BARO",
    "FRANCISCO CARRILLO",
    "FERNANDO FERNANDEZ CABADA",
    "RAUL MENDEZ PIREZ",
    "ORLANDO RODRIGUEZ",
    "GERARDO QUESADA",
    "JOSE E. MONTEAGUDO",
    "ENRIQUE HUERTAS",
    "TULIO DIAZ RIVERA",
    "MANUEL ANTONIO DE VARONA",
    "SERGIO CARBO",
    "RICARDO LORIE",
    "ANTONIO MACEO",
    "ANTONIO SILIO"
  ],
  "recipient": "Unknown",
  "sender": "Federal Bureau of Investigation (FBI), Miami, Florida"
}