{
  "classification": "Personnel",
  "document_type": "Memorandum",
  "security": "Disclosure of names and awards could be used to identify individuals involved in sensitive operations or roles. This could compromise their safety or the security of past and ongoing activities.",
  "security_level": "SECRET",
  "summary": "A memorandum listing individuals who have received foreign awards and decorations, seeking review and approval for their retention as per Public Law 89-673, and awaiting State Department concurrence via Central Cover Staff.",
  "summary_one_paragraph": "This SECRET memorandum, dated 15 November 1968, is from the Executive Secretary of the Honor and Merit Awards Board (Ellin B. Glenn) to the Security Advisor/HMAB, concerning a roster of individuals presented with foreign awards and decorations. It requests a review of the list as a basis for the Director of Personnel's approval for the individuals to retain their awards, in accordance with Public Law 89-673. The memo indicates that Central Cover Staff is managing liaison to obtain State Department concurrence, and that the Security Advisor's approval is solely for internal records.",
  "tags": [
    "Foreign Awards",
    "Decorations",
    "Public Law 89-673",
    "Central Cover Staff",
    "Personnel",
    "Honor and Merit Awards Board"
  ],
  "title": "Foreign Awards and Decorations",
  "date": "1968-11-15",
  "persons_mentioned": [
    "James C. Barb",
    "Gerard Daniels",
    "Kirk Dimmit",
    "Anthony F.J. Dralle",
    "Richard W Elliot",
    "John Enkoji",
    "Harold P. Ford",
    "Thomas Fosmire",
    "Christian Frederick",
    "Howard Freeman",
    "Leonard G. Gmirkin",
    "Norman J. Heyel",
    "John P. Horgan",
    "Richard L. Horne",
    "Ralph E. Johnson",
    "James W. Lair",
    "Lloyd P Landry",
    "David S. Morales",
    "Anthony Poshepny",
    "Jonathan Randall",
    "Richard Secord",
    "Roger W. Severt",
    "Theodore Shackley",
    "James D. Sheldon",
    "Colin R. Thompson",
    "Von der Muhll",
    "Melvin Dale Waites",
    "Joseph W. Weber",
    "Ellin B. Glenn"
  ],
  "recipient": "Security Advisor/HMAB",
  "sender": "Ellin B. Glenn, Executive Secretary, Honor and Merit Awards Board"
}