{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "Disclosing the specific individuals and entities about whom the CIA maintains files, along with the nature and dates of the information held, could compromise ongoing intelligence operations and expose sources and methods. For example, detailing the commercial asset in contact with George DeMohrenschildt or the nature of cover provided by Leo Cherne reveals sensitive operational activities.",
  "security_level": "UNCLASSIFIED",
  "summary": "A memorandum from H. Clark Schor to SA/DO/O providing additional information on individuals and entities cited in a request from the House Select Committee on Assassinations (HSCA), detailing the contents and dates of relevant files held by the Central Cover Staff (CCS). The memo references files on George DeMohrenschildt, Leo Cherne, William Harvey, the International Rescue Committee, Richard Helms, James Angleton, Raymond Rocca, and the Wackenhut Corporation.",
  "summary_one_paragraph": "This memorandum, authored by H. Clark Schor, Chief of Plans and Review Group, Central Cover Staff, supplements a previous memo regarding a request from the House Select Committee on Assassinations (HSCA). Dated January 26, 1978, it details specific files maintained by the CCS on individuals and entities of interest to the HSCA, including George DeMohrenschildt (contact reports with a commercial asset), Leo Cherne (cover provision for a NOC officer and files on the Research Institute of America), William Harvey (cover during his Agency career), the International Rescue Committee (non-use by the Agency and FOIA requests), Richard Helms, James Angleton, Raymond Rocca (TDY travel orders and cover documentation), and the Wackenhut Corporation (contacts with officials), covering various periods from 1947 to 1977.",
  "tags": [
    "HSCA",
    "Central Cover Staff",
    "George DeMohrenschildt",
    "Leo Cherne",
    "William Harvey",
    "International Rescue Committee",
    "Richard Helms",
    "James Angleton",
    "Raymond Rocca",
    "Wackenhut Corporation",
    "Cover",
    "Files",
    "JFK Assassination",
    "FOIA"
  ],
  "title": "House Select Committee on Assassinations (HSCA) Request",
  "date": "1978-01-26",
  "persons_mentioned": [
    "George DeMohrenschildt",
    "Leo Cherne",
    "William Harvey",
    "Richard Helms",
    "James Angleton",
    "Raymond Rocca",
    "H. Clark Schor"
  ],
  "recipient": "SA/DO/O",
  "sender": "H. Clark Schor, Chief, Plans and Review Group, Central Cover Staff"
}