{
  "classification": "Cuba",
  "document_type": "File",
  "security": "Revealing that Araujo was reported as an informant for the Cuban 6-2 (security police) and that information was collected from trained Cuban refugees could jeopardize current or future intelligence operations. The document mentions sensitive intelligence sources and methods. Quoting directly: \"SUBJECT HAD BEEN REPORTED AS A MILITANT COMMUNIST SINCE 1935...AN INFORMABENT OF THE CUBAN 6-2 (SECURITY POLICE), THIS INFORMATION HAS RECEIVED FROM A GROUP OF CUBAN REFUGEES, TRAINED IN INTELLIGENCE COLLECTION\"",
  "security_level": "SECRET",
  "summary": "This file contains documents related to Leopoldo Araujo Bernal, including information suggesting he was a militant communist and later an informant for Cuban security police. It includes cables and reports from the CIA, FBI, and State Department, focusing on his activities, associations, and travels.",
  "summary_one_paragraph": "This file, reviewed by the House Select Committee on Assassinations, compiles documents concerning Leopoldo Araujo Bernal (born June 9, 1912), identified as a potential militant communist since 1935 and later reported as an informant for Cuban security police (6-2) in 1961. The file includes a CIA outgoing message CIR-316/63356-77, dated November 10, 1977, based on information from Cuban refugees trained in intelligence collection. Additional documents consist of State Department records from 1960, FBI reports from 1961-1962, liaison cables from 1966-1971, and CIA cables from 1971. The material covers Araujo's activities, travels, and associations, including his role as president of the Cuban Medical Association.",
  "tags": [
    "ARAUJO-Bernal, Leopoldo",
    "Cuban Intelligence",
    "Communist Activities",
    "Medical Profession",
    "Travel",
    "Liaison",
    "CIA",
    "FBI",
    "State Department",
    "AMOT Report"
  ],
  "title": "ARAUJO-Bernal, Leopoldo",
  "date": "1977-11-10",
  "locations_mentioned": [
    "Pinar del Rio, Cuba",
    "Havana, Cuba",
    "Miami, Florida",
    "Mexico City",
    "Spain",
    "United Kingdom",
    "Europe",
    "Latin America",
    "Madrid"
  ],
  "origin_agency": "CIA, FBI, State Department",
  "persons_mentioned": [
    "Leopoldo Eduardo Araujo Bernal",
    "Verisimo Francisco Tomings",
    "Sanchez Barrio",
    "Justo Carrillo",
    "Jose Angel Bustamante O'Leary"
  ],
  "recipient": "Department of State, Federal Bureau of Investigation",
  "sender": "R Harris"
}