{
  "classification": "Security",
  "document_type": "Memorandum",
  "security": "This memo details the Agency's use of Lyon L. Tyler for backstopping and safehouse support. Disclosing this relationship, along with Tyler's background as a former FBI agent and his connections to prominent political figures, could compromise his ability to provide secure services to the Agency. As stated, \"One source of Tyler's income has been the Agency. He has been utilized by Central Cover Staff, the Office of Security and the Office of General Counsel to my knowledge. I do not think he has been heavily involved in operations, but rather has furnished backstopping and safehouse support.\"",
  "security_level": "SECRET",
  "summary": "A memo from Charles W. Kane, Deputy Director of Security, provides information on Lyon L. Tyler, a former FBI agent and attorney who has worked with the CIA, including details of his background, associations, and services provided to the Agency.",
  "summary_one_paragraph": "On January 9, 1968, Charles W. Kane, the Deputy Director of Security, sent a memorandum to the Director of Security detailing his knowledge of Lyon L. Tyler, also known as \"Slug,\" in response to a query. Kane outlines Tyler's background as a former FBI agent, his work on Capitol Hill for Lyndon B. Johnson when Johnson was a Senator, and his subsequent law practice. The memo reveals Tyler's involvement with the CIA, providing backstopping and safehouse support. Additionally, Kane describes Tyler's connections to Edward P. Morgan, another former FBI agent, and provides insights into Morgan's career and financial background.",
  "tags": [
    "Lyon L. Tyler",
    "Edward P. Morgan",
    "FBI",
    "CIA",
    "Security",
    "Backstopping",
    "Safehouse",
    "Former Agents",
    "Lyndon B. Johnson"
  ],
  "title": "TYLER, Lyon L.",
  "date": "1968-01-09",
  "persons_mentioned": [
    "Lyon L. Tyler",
    "Charles W. Kane",
    "Lyndon B. Johnson",
    "Edward P. Morgan",
    "Peggy",
    "Humphrey",
    "Stetter"
  ],
  "recipient": "Director of Security",
  "sender": "Charles W. Kane, Deputy Director of Security"
}