{
  "classification": "Personnel",
  "document_type": "Memorandum",
  "security": "The document contains personal information about CIA employees, including dates of birth, physical descriptions, and employment history. Disclosing this information could violate privacy and compromise the identities of individuals who may still be involved in sensitive work or have been in the past. It reveals information that is normally confidential to the agency. For example: \"June 1965 - CT (new employee) August 1968 - (Hamburg)\"",
  "security_level": "CONFIDENTIAL",
  "summary": "A memorandum from S. D. Breckinridge to Ray Reardon requesting photographs of Agency employees with the surname Bishop who were employed in the 1960s, in order to assist witnesses in identifying a man named Morris Bishop.",
  "summary_one_paragraph": "This Confidential memorandum, dated September 22, 1978, from S. D. Breckinridge to Mr. Ray Reardon in the Office of Security, concerns the gathering of photographs of Agency employees with the surname Bishop. Breckinridge explains that the Office of Personnel is collecting files of past and present employees from the 1960s, and he is compiling a book of photographs to show to two witnesses who believe they knew a man named Morris Bishop during that time. The memo requests that Reardon provide any photographs of the listed individuals from around the first half of the 1960s, with a promise of more names to follow, and emphasizes the importance of prioritizing this request.",
  "tags": [
    "CIA",
    "Personnel Records",
    "Employee Identification",
    "Morris Bishop"
  ],
  "title": "Agency Employees with the Surname of Bishop",
  "date": "1978-09-22",
  "persons_mentioned": [
    "Ray Reardon",
    "S. D. Breckinridge",
    "Doris Houdesheldt",
    "Morris Bishop",
    "Boyd Warrington Bishop",
    "Edwin Warren Bishop",
    "Frank Patrick Bishop",
    "Eugene Edward Bishop, Jr.",
    "Henry Charles Bishop",
    "Fred Margeson Bishop",
    "John Carl Bishop",
    "James Clarence Bishop",
    "Whit Moore Bishop"
  ],
  "sender": "S. D. Breckinridge (OLC-78-3040) Office of Security. Security, and past employees in the 60's.. Office of Personal is gathering files of the Agency who were on board in the 60's. Doris Houdesheldt shown from."
}