{
  "classification": "Administrative",
  "document_type": "Note/Memorandum/Briefing Outline",
  "security": "This collection of documents details the CIA's internal review processes, organization, and approach to handling JFK assassination records. Releasing this information could reveal internal CIA procedures for managing and sanitizing sensitive information, potentially exposing the agency's information handling practices. For example, descriptions of sanitization procedures (identity of agents, sensitive sources and methods, relations with foreign government, unwarranted invasion of privacy)",
  "security_level": "UNCLASSIFIED",
  "summary": "This collection of documents outlines the CIA's approach to reviewing JFK assassination records, including meetings with the Assassination Records Review Board (ARRB), descriptions of records under review, and issues related to sanitization and privacy.",
  "summary_one_paragraph": "This collection includes notes, memoranda, and briefing outlines related to the CIA's review of JFK assassination records and interactions with the Assassination Records Review Board (ARRB). It details the CIA's approach to organizing and reviewing records, including the Oswald 201 file, microfilm collections, and other related documents. The materials also address issues such as sanitization, privacy concerns, and the definition of 'assassination records,' as well as the CIA's efforts to cooperate with the ARRB and address their questions and concerns.",
  "tags": [
    "CIA",
    "JFK Assassination Records",
    "Assassination Records Review Board",
    "ARRB",
    "Record Review Process",
    "Sanitization",
    "Oswald 201 File",
    "Microfilm",
    "NARA"
  ],
  "title": "Meeting with JFK Board Staff",
  "date": "1994-12-07",
  "persons_mentioned": [
    "J. Barry Harrelson",
    "Gloria M. Boyd",
    "Barbara A. Standley",
    "John F. Pereira",
    "David Marwell",
    "Sheryl Walter",
    "Bob Eatinger",
    "Brian S. Latell",
    "Jim Lesar",
    "Gene Burpoe",
    "Jeremy Gunn",
    "Tom Samoluk",
    "Steve Tilly",
    "Terry",
    "Grant",
    "Newman",
    "Kermit Hall",
    "Henry Graff",
    "Anna Nelson",
    "William Joyce",
    "John R. Tunheim",
    "Barry Gibson",
    "John Goins",
    "Eleanor Neiman",
    "Linda Cipriani",
    "John Devine",
    "Donald Cryer",
    "Margaret Sanders",
    "Frederick Wickham",
    "Edgar T. McHenry",
    "George Frates",
    "Rodger S. Gabrielson"
  ],
  "recipient": "J. Barry Harrelson, Gloria M. Boyd, Barbara A. Standley",
  "sender": "John F. Pereira"
}