{
  "classification": "Mexico",
  "document_type": "Cable",
  "security": "Revealing the arrangement for SVLUCK!’s wife and children to live at the address of Eliodorina Garcia, a POR member and director of a Kearby School used by PCA readers, could expose Garcia, the school, and the PCA readers to scrutiny or compromise their activities. Quoting directly: \"S/1 ASSIGNED BY PARTY LEADERS HERE LIVE ALCHE IH KOHS OP ELIODORINA GARCIA, POR MEMBER, CALLE NO. 1, COLONIA: ROUTEZUMA CIA IS DIRECTOR OF KEARBY SCHOOL WHERE FIVE PCA READERS TEMPORARIL FARTERED. SI'S VIFE AND CHILDREN WILL LOVE WITH HIM AT ABOVE...PDRESS WHILE MEXI.\"",
  "security_level": "SECRET",
  "summary": "A cable from Mexico City details arrangements for ATS SVLUCK!'s wife and children to visit him, including a request for funds and their lodging at the residence of Eliodorina Garcia, a POR member.",
  "summary_one_paragraph": "A secret cable originating from Mexico City relays information regarding ATS SVLUCK!'s family visit; his wife is expected to arrive in Merida by air on December 23 and subsequently join him in Mexico City for Christmas. SVLUCK! requested $158 for his wife's visit and to buy a Santa Claus for his children and mentioned a Christmas bonus. The cable also details that SVLUCK!, assigned by party leaders, will reside at the home of Eliodorina Garcia, a POR member and director of the Kearby School, while his family is in Mexico. A follow-up meeting with ATS SVLUCK! is scheduled for December 23.",
  "tags": [
    "CIA",
    "Mexico City",
    "ATS SVLUCK!",
    "Family Visit",
    "Eliodorina Garcia",
    "POR Member",
    "Kearby School",
    "PCA Readers",
    "Funding Request"
  ],
  "title": "Arrangements for ATS SVLUCK!'s Family Visit",
  "date": "Unknown",
  "locations_mentioned": [
    "Mexico City",
    "Merida"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "ATS SVLUCK!",
    "Eliodorina Garcia"
  ],
  "recipient": "CI, CI/OPS, CI/IC 2, CI/CA, VR",
  "sender": "Director"
}