{
  "classification": "Personnel",
  "document_type": "Outgoing Message",
  "security": "Disclosing Oltmans' activities, particularly his contacts within communist countries and alleged Soviet ties, could compromise ongoing intelligence operations and relationships with foreign governments. The document states, \"OLTMANS WAS PLANNING TO MAKE A FILM IN THE USSR ON ECOLOGY...CLAIMED SUBJ HAD A 5-YR RETAINER FROM SOVIETS AS OVERT PR MAN.\"",
  "security_level": "SECRET",
  "summary": "This outgoing message details traces on Willem Leonard Oltmans, a Dutch journalist, including his expulsion from Yale, his relationships with Sukarno and communist countries, and his alleged ties to the Soviet Union.",
  "summary_one_paragraph": "This outgoing message, dated May 6, 1976, summarizes traces on Willem Leonard Oltmans, a Dutch journalist born on June 10, 1925. The message details Oltmans' expulsion from Yale for misbehavior, his work for Dutch newspapers, his introduction to President Sukarno and subsequent use by the Indonesian government for propaganda, his self-described anti-communist views juxtaposed with admiration for communism and contacts with communist countries including Cuba, legal action against Dutch Foreign Minister J. M. A. H. Luns, his connection to an obscure Dutch newspaper while at the UN, a claim to have sold an article to Ramparts magazine about the CIA in Indonesia (which was never printed), an interview with Jim Garrison about the Kennedy assassination, and an alleged five-year retainer from the Soviets as an overt PR man.",
  "tags": [
    "Willem Leonard Oltmans",
    "Sukarno",
    "Jim Garrison",
    "Soviet Union",
    "Propaganda",
    "Journalist",
    "CIA",
    "Counterintelligence"
  ],
  "title": "HQS Traces on Willem Leonard Oltmans",
  "date": "1976-05-06",
  "locations_mentioned": [
    "Huizen, Netherlands",
    "Yale University",
    "New York City",
    "Indonesia",
    "Europe",
    "Cuba",
    "Washington, D.C.",
    "USSR",
    "East Germany",
    "Czechoslovakia",
    "Poland",
    "Hungary",
    "Congo"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Willem Leonard Oltmans",
    "Sukarno",
    "J. M. A. H. Luns",
    "Jim Garrison"
  ],
  "recipient": "(LONDON), (JAKARTA), (THE HAGUE), (PARIS)",
  "sender": "PATSY WOL"
}