{
  "classification": "Security",
  "document_type": "Intel Cable",
  "security": "Disseminating information about suspected security penetrations within Cuban dissident groups, as it could endanger sources, compromise methods of intelligence gathering, and damage relationships with liaison services. Specifically, identifying individuals like Jorge ((Gonzales)), Vladimiro ((Roca)) Atunez, Guillermo ((Fernandez)) Donates, and Rafael ((Alcides)) as potential security risks reveals sensitive intelligence assessments. Releasing details of the Czech invitation to Bonne could compromise diplomatic relations.  As stated: \"LEADERS OF THE CUBAN CIVIC CURRENT (CORRIENTE CIVICA CUBANA)...SUSPECTED THREE MEMBERS OF THE GROUP, AND THE FORMER HUSBAND OF A GROUP MEMBER, OF BEING CUBAN SECURITY SOURCES OR PENETRATIONS... THE LEADERS OF THE DISSIDENT GROUP DID NOT HAVE ANY SPECIFIC EVIDENCE...BUT INCIDENTS...LED THE LEADERSHIP TO BECOME SUSPICIOUS... This kind of contact was anathema to the Cuban government.\"",
  "security_level": "SECRET",
  "summary": "An intelligence cable relays information regarding suspected Cuban security penetrations within Cuban human rights and dissident movements, identifying several individuals suspected of being sources or penetrations based on observed behavior and activities.",
  "summary_one_paragraph": "This SECRET intelligence cable, dated January 19, 1996, relays information to multiple locations, including Houston, Miami, Havana, Madrid, London, New York, Washington D.C., and Quarry Heights, concerning suspected Cuban security penetrations of the Cuban human rights and dissident movement. The cable identifies four individuals—Jorge ((Gonzales)), Vladimiro ((Roca)) Atunez, Guillermo ((Fernandez)) Donates, and Rafael ((Alcides))—as potential Cuban security sources or penetrations based on suspicious incidents and observations by leaders of the Cuban Civic Current (CCC). The CCC leadership grew suspicious due to several anomalies, including the surfacing of bogus information provided to Gonzales, inconsistencies in communication, and unusual invitations or contacts that raised security concerns.",
  "tags": [
    "Cuban Security Penetration",
    "Cuban Dissidents",
    "Human Rights",
    "MININT",
    "CCC",
    "Intelligence",
    "Counterintelligence",
    "Espionage"
  ],
  "title": "Relay of Intel Cable: Suspected Cuban Security Penetrations of the Cuban Human Rights/Dissident Movement in Cuba",
  "date": "1996-01-19",
  "locations_mentioned": [
    "Cuba",
    "Houston",
    "Miami",
    "Havana",
    "Madrid",
    "London",
    "New York",
    "Washington D.C.",
    "Quarry Heights",
    "Venezuela",
    "Czech Republic"
  ],
  "origin_agency": "INTEL",
  "persons_mentioned": [
    "Jorge ((Gonzales))",
    "Vladimiro ((Roca)) Atunez",
    "Guillermo ((Fernandez)) Donates",
    "Rafael ((Alcides))",
    "Osvaldo ((Paya)) Sardinas",
    "Elizardo ((Sanchez)) Santacruz",
    "Vladimir ((Martinez-Amores)) Alvarez",
    "Felix ((Diaz.))",
    "Felix ((Bonne)) Carcasses",
    "Mariana ((Badell))",
    "Fidel ((Castro))",
    "Carlos Alberto ((Montaner))",
    "Piotr ((Mikiska))",
    "Georgina De Las Mercedes ((Gonzalez)) Corbo",
    "Reinaldo ((Roque)) Malherbe",
    "Fabian ((Escalante)) Font",
    "Teresa ((Fernandez)) Mardones",
    "Ronaldo ((Roque))",
    "Raul ((Castro)) Ruz",
    "John F. Kennedy"
  ],
  "recipient": "Houston, Miami, Havana, Madrid, London, New York, WDC, Quarry Heights"
}