{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "Revealing the creation and use of special representative ID cards and supporting pocket litter in registered aliases, especially for recruitment purposes, could expose operational methods and compromise ongoing or future recruitments. Additionally, mentioning specific projects or operations, such as \"BKHERALD\" or \"JMWAVE tour\", and their potential compromise, directly exposes sensitive information. Quoting directly: \"The documentation will be used for a Cuban diplomat recruitment. Subject can not use his other registered aliases...since one is a registered name for BKHERALD identification, another is used in conjunction with his Mexican passport and the third was extensively used during his JMWAVE tour and may be compromised.\"",
  "security_level": "SECRET",
  "summary": "A memo from David A. Phillips, Chief of the Western Hemisphere Division, requests a Special Representative ID card and supporting documents for the new registered alias of Simon S. MARTINEZ to be used for a Cuban diplomat recruitment.",
  "summary_one_paragraph": "This secret memorandum, dated June 20, 1974, from David A. Phillips, Chief of the Western Hemisphere Division, requests that OTS/AB/DOCS expedite the creation of a Special Representative ID card and supporting 'pocket litter' for the newly registered alias 'Simon S. MARTINEZ.' This new identity is required because the subject's other registered aliases are unsuitable; one is linked to 'BKHERALD,' another to his Mexican passport, and a third may be compromised from his 'JMWAVE tour.' The documentation is intended for use in recruiting a Cuban diplomat, and an ID photograph is attached.",
  "tags": [
    "CIA",
    "Alias",
    "Identity",
    "Recruitment",
    "Cuban Diplomat",
    "BKHERALD",
    "JMWAVE",
    "Special Representative ID Card"
  ],
  "title": "Request for Special Representative ID Card/and Supporting Pocket Litter Simon S. MARTINEZ",
  "date": "1974-06-20",
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Simon S. MARTINEZ",
    "David A. Phillips"
  ],
  "recipient": "OTS/AB/DOCS",
  "sender": "David A. Phillips"
}