{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "This document discusses the CIA's commercial cover program, including the number of participating companies and the secrecy agreements in place. Disclosing the scale of the program (approximately 1,800 companies currently) and the details of the secrecy agreements could compromise the CIA's ability to operate under cover. As the document states, \"Attached is a copy of the secrecy agreement used from 1955 to 1988 and a copy of the agreement used from 1988 to the present.\"",
  "security_level": "SECRET",
  "summary": "A memorandum from the CIA to the Assassination Records Review Board (ARRB) providing answers to questions about the CIA's commercial cover program, including the number of participating companies and the secrecy agreements used.",
  "summary_one_paragraph": "This memorandum, dated 13 December 1996, is a response from the CIA to questions posed by the Assassination Records Review Board (ARRB) regarding the CIA's commercial cover program. It details that a few real businesses are loosely connected to the publications industry within the program, that approximately 500 companies participated in the 1960s, and around 1,800 participate currently. The memo also includes copies of the secrecy agreements used from 1955 to 1988 and from 1988 to the present, with an addendum added in 1991, emphasizing the need for the ARRB to return the memorandum and its attachments to the CIA after review.",
  "tags": [
    "CIA",
    "Assassination Records Review Board",
    "Commercial Cover Program",
    "Secrecy Agreement",
    "John F. Kennedy Assassination",
    "Administrative"
  ],
  "title": "Response to Questions Posed by the Assassination Records Review Board",
  "date": "1996-12-13",
  "persons_mentioned": [
    "John F. Pereira",
    "Linda A. Jasper",
    "Fredrick Wickham",
    "EMathias",
    "Ciprinai",
    "BHarrelson"
  ],
  "recipient": "Executive Director, Assassination Records Review Board",
  "sender": "John F. Pereira, Chief, Historical Review Group, Linda A. Jasper, Deputy Chief, Office of Central Cover (OCC, 1hLJasper,32435 18Nov96 file:jfkboard), IMS (Fredrick Wickham), OCC/EXO (EMathias), OGC (Ciprinai), His. Review Board(BHarrelson). The author is under cover and their name is classified.)"
}