{
  "classification": "Commission",
  "document_type": "Dispatch",
  "security": "This document discusses the internal assessments of the Christian Democratic movement in Latin America and its implications for U.S. foreign policy. Releasing details about which political parties the U.S. deems worthy of support or infiltration could compromise ongoing operations and destabilize relationships with the involved countries. The dispatch also reveals details of financial support from European organizations to Latin American parties, which, if disclosed, could harm diplomatic relations and create distrust. The dispatch says: “If so, it is incumbent on the Station to develop assets within the party and to examine the need for operational involvement. Station posture toward the CD movement must be based on the raw realities of the local situation, case by case.”",
  "security_level": "SECRET",
  "summary": "A dispatch from the WH Division to MI Division stations and bases providing an analysis of Christian Democracy in Latin America, assessing the current status, potential, and challenges of Christian Democratic parties in various countries. It also evaluates the role of organizations like ODCA and CLASC, the influence of European CD groups, and the implications for U.S. policy.",
  "summary_one_paragraph": "This dispatch, originating from the Chief of the WH Division, disseminates an analysis of Christian Democracy in Latin America to all MI Division Stations and Bases. The report reviews the status, potential, and challenges facing Christian Democratic parties across Latin American countries, highlighting key players such as Eduardo Frei and Rafael Caldera. It also evaluates the roles of organizations like ODCA, CLASC, and European CD groups, emphasizing the radicalization of youth wings and the failure to attract lower social classes. The document concludes that a country-by-country operational approach is necessary, advising stations to develop assets within parties deemed positive for national political stability and to assess the need for operational involvement based on local realities.",
  "tags": [
    "Christian Democracy",
    "Latin America",
    "ODCA",
    "CLASC",
    "European CD Groups",
    "Political Analysis",
    "Cold War",
    "FBI",
    "MOC",
    "Propaganda"
  ],
  "title": "Christian Democracy in Latin America",
  "date": "1967-08-30",
  "locations_mentioned": [
    "Latin America",
    "Chile",
    "Venezuela",
    "El Salvador",
    "Peru",
    "Dominican Republic",
    "Panama",
    "Brazil",
    "Guatemala",
    "Argentina",
    "Bolivia",
    "Colombia",
    "Costa Rica",
    "Ecuador",
    "Mexico",
    "Nicaragua",
    "Paraguay",
    "Uruguay"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Eduardo Frei",
    "Rafael Caldera",
    "José Napoleón Duarte",
    "Caonabo Javier",
    "Rene de Leon Schlotter",
    "Salvador Allende",
    "Horacio Sueldo",
    "Rene I Katale",
    "Marta Sosa",
    "Peter Molt",
    "Adolf Herkenrath",
    "Johannes Schauff",
    "Mariano Rumor",
    "August Vanistendael",
    "Tomas Reyes Vicuna"
  ],
  "recipient": "Chiefs, All Mi Stations and Bases",
  "sender": "Chief, Wil Division"
}