{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "Several documents discuss the activities and connections of Eloy Gutierrez Menoyo, a former anti-Castro combatant, and his attempts to communicate with exile groups. Disclosing details about Menoyo's contacts, such as Lazaro Gutierrez Menoyo and Pedro M. Diaz, could compromise intelligence sources and methods. The cable also mentions AMPALM-4 and CARLOS (SARACAT) as sources, whose identities and operational roles should remain protected.  Specifically, the cables state, \"QUANTUM-57 provided station with note dated 6 October 70 from Lazaro Gutierrez Menoyo...Main purpose of note was to attempt establish regular communications channel between writer, via addressee...and Pedro M. Diaz\", and \"AMPALM-4 informed station on 11 December that he had been told by Carlos (SARACAT), who important ALPHA 66 sub-chief...\"",
  "security_level": "SECRET",
  "summary": "These cables and documents pertain to Eloy Gutierrez Menoyo, a former leader of the Second Front of Escambray (SFNE) and his attempts to establish communication channels with exile groups while imprisoned in Cuba, as well as related intelligence gathering and file checks.",
  "summary_one_paragraph": "This collection of documents, including CIA cables and FBI reports, centers on Eloy Gutierrez Menoyo, a former Cuban rebel leader imprisoned in Cuba. The documents detail efforts to monitor his communications with anti-Castro groups in Miami, particularly through individuals like Lazaro Gutierrez Menoyo and Pedro M. Diaz. The cables involve intelligence sources like QUANTUM-57 and AMPALM-4, who provide information on Menoyo's attempts to establish contact with groups like Alpha 66. Additionally, the documents include file checks, name traces, and cross-references to related intelligence files concerning Menoyo and his associates.",
  "tags": [
    "Eloy Gutierrez Menoyo",
    "Cuba",
    "Alpha 66",
    "Second Front Escambray",
    "Communication Channels",
    "Intelligence Gathering",
    "File Checks",
    "Anti-Castro Groups",
    "QUANTUM-57",
    "AMPALM-4",
    "Pedro M. Diaz"
  ],
  "title": "Cables and Documents Regarding Eloy Gutierrez Menoyo and Cuban Exile Activities",
  "date": "1970-12-19",
  "locations_mentioned": [
    "Cuba",
    "Miami, Florida",
    "Madrid",
    "Habana"
  ],
  "persons_mentioned": [
    "Eloy Gutierrez Menoyo",
    "Lazaro Gutierrez Menoyo",
    "Pedro M. Diaz",
    "Carlos (SARACAT)",
    "AMPALM-4",
    "Tanya Salas de Guiterrez",
    "Ramon (Quesada) Gomez",
    "Gladys Rodriguez de la Obra"
  ]
}