{
  "classification": "Personnel",
  "document_type": "Personnel Records",
  "security": "This document contains personal information about E. Howard Hunt, Jr., including his home address, employment history, educational background, and security clearances. Releasing this information could violate his privacy and potentially expose him to harm.",
  "security_level": "SECRET",
  "summary": "This collection of documents pertains to the personnel records of E. Howard Hunt, Jr., including his separation from the CIA, employment history, security clearances, and personal details.",
  "summary_one_paragraph": "This document contains various personnel-related forms and information pertaining to E. Howard Hunt, Jr., including a certification of separating employee acknowledging receipt of various forms related to his departure from the CIA, records of his employment history including positions held at the Economic Cooperation Administration and details of his prior military service, and an application for federal employment providing insights into his education, skills, and background checks. The documents also contain loyalty oaths and affidavits signed by Hunt, along with notifications of personnel actions and records reviewed by the House Select Committee on Assassinations staff members.",
  "tags": [
    "Personnel Records",
    "E. Howard Hunt Jr.",
    "Separation",
    "Employment History",
    "Security Clearance",
    "Loyalty Oath",
    "House Select Committee on Assassinations",
    "FOIA"
  ],
  "title": "Certification of Separating Employee - Hunt E. Howard",
  "date": "1948-05-17",
  "locations_mentioned": [
    "Washington, D.C.",
    "Albany, New York",
    "Hamburg, New York",
    "New York, New York",
    "Miami Beach",
    "Orlando, Florida",
    "Catalina Island",
    "Providence, Rhode Island"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Hunt, E. Howard (Jr.)",
    "Dan Hardway",
    "Maj. Gen. J. Donovan",
    "John C. Farrar",
    "Raymond Rubicam",
    "V. L. Couch"
  ],
  "recipient": "Official Personnel Folder",
  "sender": "US Civil Service Commission"
}