{
  "classification": "Soviet",
  "document_type": "Dispatch and Message",
  "security": "The document details the surveillance and intelligence gathering on Ivan Dmitriyevich Obyedkov, suspected of being a RIS (Russian Intelligence Service) operative, including his activities at the Soviet Embassy in Mexico City and Tehran. The summary traces are intended for liaison, which means sharing information with foreign intelligence services. \"Paragraph 20 of the Summary is for passage to liaison.\" This information could compromise intelligence-sharing agreements and reveal the scope and methods of surveillance.",
  "security_level": "SECRET",
  "summary": "This document contains multiple dispatches and messages related to the surveillance and investigation of Ivan Dmitriyevich Obyedkov, a Soviet citizen suspected of being an intelligence operative (RIS), focusing on his activities in Mexico City and Tehran, and later in London, including details about his family, work, and contacts.",
  "summary_one_paragraph": "This collection of documents pertains to Ivan Dmitriyevich Obyedkov (born 1927), a Soviet guard suspected of intelligence affiliations (RIS). The documents detail Obyedkov's postings in Soviet embassies in Mexico City and Tehran, as well as concerns raised when he later worked as an electrician in London. Information includes his family (wife Yelena and son Vladimir), his duties, his security consciousness, and his interactions with other Soviets, some of whom were known GRU or KGB officers. The documents also reflect internal discussions regarding Obyedkov's RIS status, including discrepancies in biographical data and whether to continue carrying him as a suspect.",
  "tags": [
    "Ivan Dmitriyevich Obyedkov",
    "Soviet Embassy",
    "Mexico City",
    "Tehran",
    "London",
    "RIS",
    "KGB",
    "GRU",
    "Surveillance",
    "Counterintelligence",
    "Liaison",
    "Jaguar",
    "CKTOR"
  ],
  "title": "SERIUE RECORD IDENTIFICATION FOR RECORD GROUP 20 - OBYEDKOV, IVAN DMITRIYEVICH",
  "date": "1977-03-09",
  "locations_mentioned": [
    "Mexico City",
    "Tehran",
    "London",
    "Moscow",
    "Belgium",
    "Ryazanskaya Oblast"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Ivan Dmitriyevich Obyedkov",
    "Yelena Lvovna Obyedkova",
    "Vladimir Ivanovich Obyedkov",
    "Anatoliy Ivanovich Sukhov",
    "Valentin Vasilyevich Bakulin",
    "Valeriy Vladimirovich Kostikov",
    "Ivan Petrovich Karchin",
    "Boris Aleksandrovich Kazantsev",
    "Georgiy Stepanovich Visko",
    "Vyacheslav Aleksandrovich Yegorov",
    "Rafik Nazhaf-Ogly Abdullayev",
    "Aleksandr Mikhaylovich Denisov",
    "Aleksey Nikolayevich Ganin",
    "Sergey Semenovich Kukharenko",
    "Oleg Pavlovich Moskvichev",
    "Vladimir Nikolayevich Radvanskiy",
    "Vladimir Aleksandrovich Romanchenko",
    "Deryabin",
    "Rastvorov"
  ],
  "recipient": "LONDON",
  "sender": "SE/CI/X"
}