{
  "classification": "Personnel",
  "document_type": "File",
  "security": "This file contains information on David L. Christ's CIA career, including his positions, responsibilities, and awards. Revealing details about his work could potentially expose sensitive technical areas, programs, and capabilities of the agency. For example, the document lists technical areas like \"electronics, acoustics, optics, electro-optics, magnetics, electromagnetics, solid-state physics\" and typical programs involving \"RF systems, microphones, recorders, transmitters, receivers, amplifiers, control systems, signal processing and enhancement, radar systems, audio and video circuitry and devices.\"",
  "security_level": "SECRET",
  "summary": "This file contains documents related to David L. Christ's career at the CIA, including his resume detailing his technical expertise and roles within the agency, a memorandum regarding his Intelligence Medal of Merit award, and personnel action notices related to his retirement.",
  "summary_one_paragraph": "This collection of documents pertains to David L. Christ's career with the CIA from August 1950 to November 1974. It includes his detailed CIA resume, outlining his responsibilities as Deputy Chief and Chief within Applied Physics and Technical Applications, focusing on research, development, and supervision of technical programs. Also included is a memorandum announcing his receipt of the Intelligence Medal of Merit in December 1970 for his significant contributions to the agency, along with personnel action notices documenting his voluntary retirement in November 1970.",
  "tags": [
    "CIA",
    "David L. Christ",
    "Personnel File",
    "Intelligence Medal of Merit",
    "Retirement",
    "Applied Physics",
    "Technical Applications",
    "FOIA"
  ],
  "title": "CHRIST, DAVID L OPP",
  "date": "1950-08-23",
  "persons_mentioned": [
    "David L. Christ",
    "Robert M. Gaynor",
    "Richard Helms",
    "Robert S. Wattles",
    "F.Z. Connolly",
    "James Connolly",
    "Stephen L. Stich"
  ],
  "recipient": "David L. Christ",
  "sender": "Robert M. Gaynor, Honor and Merit Awards Board"
}