{
  "classification": "Administrative",
  "document_type": "Collection of Documents and Memoranda",
  "security": "Multiple documents within this collection are classified as SECRET or CONFIDENTIAL, with continued classification deemed necessary to protect intelligence sources and methods, as well as sensitive foreign relations. As stated in the included memorandum regarding Richard Doyle Mahoney's request, releasing document TDCSDB-3/656,740 would be “detrimental to current U.S./French foreign relations” and could compromise ongoing intelligence operations. Additionally, information pertaining to Elaine Fuller was denied under FOIA exemptions to protect sources, methods, and personal privacy.",
  "security_level": "SECRET",
  "summary": "This is a collection of documents and memoranda, primarily related to Freedom of Information Act (FOIA) requests and classification reviews, concerning individuals (Elaine Fuller, Richard D. Mahoney, Terry Catchpole, Peter A. Schey) and organizations (American Volunteer Group, Ku Klux Klan) with correspondence, referrals, and internal assessments regarding declassification and release decisions.",
  "summary_one_paragraph": "This compilation includes various memoranda, requests, and related documents pertaining to FOIA requests submitted by individuals like Elaine Fuller, Richard D. Mahoney, Terry Catchpole, and Peter A. Schey, as well as internal agency assessments of classification, declassification, and release decisions. The documents cover topics such as individuals’ requests for information about themselves, organizations (American Volunteer Group, Ku Klux Klan), CIA relationships with foreign governments, and justifications for withholding information under various FOIA exemptions and Executive Orders. It also shows the administrative processes involved in handling FOIA requests, including referrals to other agencies like the FBI and INS, and internal appeals processes.",
  "tags": [
    "FOIA",
    "Declassification",
    "Classification Review",
    "Elaine Fuller",
    "Richard D. Mahoney",
    "Terry Catchpole",
    "Peter A. Schey",
    "American Volunteer Group",
    "Ku Klux Klan",
    "French Relations",
    "Intelligence Sources and Methods"
  ],
  "title": "Collection of Documents re: FOIA Requests, Classification Reviews, and Related Correspondence",
  "date": "1977-01-26",
  "persons_mentioned": [
    "Offshard Neumann",
    "Harry Staas",
    "Innes",
    "Hann",
    "General Chatte",
    "Mr. J",
    "Mr. MRN",
    "Richard D. Mahoney",
    "Gene F. Wilson",
    "H. G. Bean",
    "Louis J. Dube",
    "John Mavrakos",
    "Martin Webb",
    "Elaine Fuller",
    "Charles A. Briggs",
    "Robert S. Young",
    "Terry Catchpole",
    "Peter A. Schey",
    "Carlton Goodlett",
    "Frederick C. Randall",
    "William W. Phelps",
    "Mack E. Wood"
  ],
  "sender": "Various CIA Officers (See Summary/Description)"
}