{
  "classification": "Cuba",
  "document_type": "Information Report",
  "security": "Disclosing the detailed intelligence objectives and methods outlined in this report—such as targeting specific political parties, infiltrating organizations, and gathering personal data on foreign officials ('Functions, characteristics, and personal data on members of the foreign service, and of the accredited diplomatic corps')—could severely compromise ongoing intelligence operations, reveal sources, and damage diplomatic relations.",
  "security_level": "SECRET",
  "summary": "This is a Central Intelligence Agency (CIA) information report detailing the policy guidance directives for Cuban intelligence representatives in the Dominican Republic, outlining their intelligence collection priorities and objectives, as of 1963.",
  "summary_one_paragraph": "This SECRET CIA information report, dated January 11, 1965, translates a 1963 document outlining directives from the Cuban General Directorate of Intelligence (DGI) for Cuban intelligence representatives operating in Santo Domingo, Dominican Republic. The directives prioritize collecting information on collective action against Cuba, the status of leftist forces, the Dominican Republic Armed Forces, the Dominican Communist Party, training camps, counterrevolutionary organizations, repressive corps, the CIA in Santo Domingo, political groups, the solidarity with Cuba movement, relations with the United States, and the Church. The report also identifies intelligence requirements, including data on members of the foreign service, the press, the national economy, and the structure of the Dominican government.",
  "tags": [
    "CIA",
    "Cuban Intelligence",
    "Dominican Republic",
    "DGI",
    "Intelligence Gathering",
    "Political Analysis",
    "Counterintelligence",
    "Juan Bosch",
    "Foreign Relations"
  ],
  "title": "Policy Guidance Directives for Cuban Intelligence Representatives in the Dominican Republic",
  "date": "1965-01-11",
  "locations_mentioned": [
    "Cuba",
    "Dominican Republic",
    "Santo Domingo"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Juan Bosch Gaviño",
    "Miguel Angel Quevedo",
    "Carlos Prío"
  ],
  "recipient": "See Attached Page CI/I.S",
  "sender": "Central Intelligence Agency (CIA)"
}