{
  "classification": "Personnel",
  "document_type": "Report",
  "security": "Revealing that the CIA provided 'considerable efforts which had been made to assist him in establishing a new life here in the FEDREP-- a new life story, legal documentation, the opportunity to look for employment for a period of more than a year while receiving subsistence from us, etc.' could expose methods and compromise the security of future resettlement operations.  The agreement that 'both parties shall hereafter disavow that the relationship ever existed' is explicitly intended to keep the program secret.",
  "security_level": "SECRET",
  "summary": "This file contains documents related to WIROGUE, a former agent, including a termination agreement, contact reports, and memoranda detailing his resettlement, attempts to assist him in finding employment, and concerns about his potential to reveal sensitive information.",
  "summary_one_paragraph": "The WIROGUE file consists of various documents spanning from January to September 1964, detailing the CIA's interactions with a former agent. These include reports of meetings, memoranda discussing his resettlement and attempts to find employment in Germany, and a termination agreement where WIROGUE acknowledges his relationship with the U.S. government and agrees to maintain secrecy. The documents also reveal concerns about WIROGUE's potential to seek employment with foreign intelligence services and the measures taken to manage his knowledge of sensitive information.",
  "tags": [
    "WIROGUE",
    "Agent Termination",
    "Resettlement",
    "Contact Report",
    "Memorandum",
    "Secrecy Agreement"
  ],
  "title": "WIROGUE File: Agent Termination and Contact Reports",
  "date": "1964-09-30",
  "locations_mentioned": [
    "Frankfurt/Main",
    "Kuhwaldstr.",
    "Munich",
    "Paris",
    "Congo",
    "U.S.",
    "Canada",
    "Australia",
    "South America"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "WIROGUE",
    "Mr. Murmann",
    "Arthur A. Lifall",
    "Bochler",
    "Dave",
    "Orme K. Daronnat",
    "Nagely",
    "Clarence Schmidt",
    "Art Stimpson",
    "John Wilms",
    "Simon Sanders",
    "Frank Simon Sanders",
    "Sam Markowtiz",
    "Doctor Filner",
    "President Johnson",
    "Georg F. Sanders",
    "William Miman"
  ],
  "recipient": "Chief, HARVARD",
  "sender": "Orme K. Daronnat"
}