{
  "classification": "Administrative",
  "document_type": "Historical Review Program",
  "security": "Releasing mission statements and organizational charts, even sanitized, could reveal sensitive operational capabilities, internal structures, and the evolution of technical intelligence efforts within the CIA.  The document details the functions of the Deputy Director for Science and Technology, which includes the operation of technical collection projects and the research and development of the means used by them.  Releasing these details may provide adversaries insights on collection methods.  Additionally, the document makes reference to 'certain highly sensitive technical collection programs' which the AD/SA are charged to operate, revealing potential sensitivity. ",
  "security_level": "SECRET",
  "summary": "This document outlines the Directorate of Science and Technology's mission statements and organizational charts from 1959 to 1975, indicating which documents can be fully released under the JFK Assassination Records Act.",
  "summary_one_paragraph": "This CIA Historical Review Program document lists Directorate of Science and Technology (DS&T) materials that can be released in full and those pending re-review under the JFK Assassination Records Act of 1992. It includes mission statements and organizational charts from various offices within the DS&T, such as the Photographic Intelligence Center, National Photographic Interpretation Center (NPIC), Office of Special Activities, and Office of Technical Service, spanning from 1959 to 1975. The released materials aim to provide historical context and transparency regarding the CIA's science and technology directorate during this period.",
  "tags": [
    "CIA",
    "Historical Review Program",
    "Directorate of Science and Technology",
    "Mission Statement",
    "Organizational Chart",
    "Photographic Intelligence",
    "National Photographic Interpretation Center",
    "Office of Special Activities",
    "Office of Technical Service",
    "JFK Assassination Records Act"
  ],
  "title": "Directorate of Science and Technology Documents Release",
  "date": "1998",
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "H. Gates Lloyd"
  ]
}