{
  "classification": "Security",
  "document_type": "Memorandum",
  "security": "Disclosing the affiliations of (Thomas L. Roberts) and (Robert Delson) with the CIA, as well as their connections to Herbert Itkin and Projects DTPILLAR and WUBRINY, could compromise ongoing operations and put individuals at risk. The memo also discusses potential criminal prosecution of Roberts, which could damage the CIA's reputation. Quoting directly: \"The most critical aspect would appear to be the knowledge or suspicion that Itkin may have known of (Roberts) affiliation with CIA.\" and \"...there are some rather ominous allegations against members of the firm of (Delson, Levin and Gordon) indicating that one member of the firm was a card-carrying member of the Communist Party.\"",
  "security_level": "SECRET",
  "summary": "This memo discusses the ramifications of a confrontation with the New York FBI office regarding Herbert Itkin, and requests additional information on Thomas L. Roberts and Robert Delson, who have connections to the CIA and Itkin.",
  "summary_one_paragraph": "This memorandum, dated January 31, 1969, documents a meeting among CIA officials regarding the Herbert Itkin case and a confrontation with the New York FBI office. It outlines requests for additional information on Thomas L. Roberts, a CIA Staff Agent with past affiliations to Itkin and assignments involving a foundation exposed in the MHDOWEL exposures and cover assignments at Radio Corporation of America, and Robert Delson, who was considered for Project DTPILLAR and Project WUBRINY. The memo also notes potential criminal prosecution against Roberts and allegations against Delson's law firm, including a member's alleged Communist Party affiliation.",
  "tags": [
    "Herbert Itkin",
    "Thomas L. Roberts",
    "Robert Delson",
    "FBI",
    "CIA",
    "Security",
    "DTPILLAR",
    "WUBRINY",
    "MHDOWEL"
  ],
  "title": "Herbert Itkin",
  "date": "1969-01-31",
  "locations_mentioned": [
    "New York",
    "West Africa",
    "Dakar",
    "Geneva, Switzerland"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Herbert Itkin",
    "Rocca",
    "Houston",
    "Warner",
    "Thomas L. Roberts",
    "Robert Delson",
    "Ward Greene",
    "Eugene Milligan",
    "Sam Papich",
    "Hogan"
  ],
  "recipient": "CIA",
  "sender": "John K. Greaney"
}