{
  "classification": "Cuba",
  "document_type": "Classified Message",
  "security": "Disclosing that Batista contracted French army officers experienced in guerrilla warfare could strain relations with France. Quoting directly: “Batista has contracted for services 2 French Army officers experienced in guerrilla warfare to advise Cuban Army.”",
  "security_level": "SECRET",
  "summary": "A classified message reports on the movements of Ernesto Guevara and rebel activities in Cuba, including efforts to disrupt highway traffic, replace labor officials, and a planned meeting between Manuel Ray and Fidel Castro. It also notes Batista's contracting of French officers to advise the Cuban army and FEU's arms purchase.",
  "summary_one_paragraph": "This secret message, dated December 16, 1958, details the westward movement of Ernesto Guevara and his forces in Cuba, aiming to cut off traffic west of Santa Clara. It also reports on the 26th of July Movement's replacement of labor officials on captured sugar centrales, led by Conrad Bequer Diaz. Manuel Ray, the MRC chief, is set to meet with Fidel Castro to discuss dissolving the MRC and incorporating it into the 26th of July Movement. Additionally, a small FEU force is active near Coliseo in Matanzas, and Batista has contracted two French army officers to advise the Cuban army. The message ends with instructions for oral dissemination.",
  "tags": [
    "Ernesto Guevara",
    "Fidel Castro",
    "Batista",
    "Cuba",
    "Revolution",
    "French Officers",
    "MRC",
    "26th of July Movement",
    "FEU",
    "Arms Shipment",
    "FOIA"
  ],
  "title": "Movement of Ernesto Guevara and Rebel Activities in Cuba",
  "date": "1958-12-16",
  "locations_mentioned": [
    "Cuba",
    "Las Villas",
    "Manacas",
    "Santa Clara",
    "Santo Domingo",
    "Sierra Maestra",
    "Coliseo",
    "Matanzas",
    "Cayo Hueso, Florida"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Ernesto Guevara",
    "Fidel Castro",
    "Manuel Ray",
    "Batista",
    "Conrad Bequer Diaz",
    "George K. Harper",
    "Harry Graham"
  ],
  "recipient": "Director",
  "sender": "HAVANA"
}