{
  "classification": "Administrative",
  "document_type": "File Review/Routing Sheet/Memoranda/Letters",
  "security": "The memos and letters discuss the confinement and interrogation of Nosenko, as well as the legal justifications provided by the Department of Justice. Releasing this information could reveal internal CIA protocols and legal interpretations related to the handling of defectors, which are highly sensitive.",
  "security_level": "TOP SECRET",
  "summary": "This file contains materials reviewed by the House Select Committee on Assassinations staff, including routing sheets, memoranda, and letters related to Yuriy Ivanovich Nosenko, a Soviet KGB officer who defected in 1964 and was subsequently confined by the CIA. The documents cover legal justifications for Nosenko's confinement, agency awareness, and discussions with the Department of Justice.",
  "summary_one_paragraph": "The file consists of Top Secret materials reviewed by the House Select Committee on Assassinations staff concerning Yuriy Ivanovich Nosenko, a Soviet KGB defector. It includes routing sheets and memoranda detailing the CIA's handling of Nosenko, legal justifications for his confinement as discussed with the Department of Justice, and agreements regarding his parole status. The documents cover the period from Nosenko's defection in 1964 to discussions about his status and treatment up to 1975, including details about briefings for congressional staff and his eventual employment as a consultant for the Agency.",
  "tags": [
    "CIA",
    "House Select Committee on Assassinations",
    "Yuriy Ivanovich Nosenko",
    "Defector",
    "KGB",
    "Department of Justice",
    "Confinement",
    "Parole Status",
    "Richard Helms",
    "Lawrence Houston"
  ],
  "title": "TS Material from Deryabin Safe",
  "date": "1978-06-19",
  "persons_mentioned": [
    "Yuriy Ivanovich Nosenko",
    "Richard Helms",
    "Lawrence R. Houston",
    "David E. Murphy",
    "Mr. Katzenbach",
    "Mr. Foley",
    "J. Walter Yeagley",
    "Raymond F. Farrell",
    "Louis Wienckowski",
    "Frank E. Bartos",
    "Victor R. White",
    "McGeorge Bundy",
    "Thomas H. Karamessines",
    "Marshall S. Carter",
    "Jack M. Bauman",
    "John D. Noble, Jr.",
    "John M. Maury",
    "S. Breckinridge",
    "C. W. Kane",
    "Charles Phalen",
    "Bruce Solie"
  ],
  "sender": "Rodger S. Gabrielson (OLC/C&R )"
}