{
  "classification": "Operations",
  "document_type": "Message Form",
  "security": "This cable pertains to the search for Eric Starvo Galt, suspected of assassinating Martin Luther King, Jr. Disclosing the details of the investigation, including Galt's aliases, physical description, and reported attributes ('lone wolf', 'armed and extremely dangerous'), could compromise ongoing efforts to locate and apprehend him. The cable explicitly requests addressees to 'make every effort determine if Galt is or has been in your area' and to pass Galt's description 'to liaison and any other likely sources.' Revealing the specific details of the search could alert Galt or his associates, hindering their apprehension and endangering those involved in the investigation.",
  "security_level": "SECRET",
  "summary": "A CIA cable disseminating information about Eric Starvo Galt (aliases Harvey Lowmyer, John Willard), the suspected assassin of Martin Luther King, Jr., to multiple stations worldwide, requesting assistance in locating him.",
  "summary_one_paragraph": "This SECRET-classified cable, dated April 18, 1968, originates from the CIA Director and is addressed to numerous CIA stations globally, providing information about Eric Starvo Galt, also known as Harvey Lowmyer and John Willard, who is suspected of assassinating Martin Luther King, Jr. The message includes Galt's physical description (height, weight, hair color, eye color, complexion, race), reported characteristics ('lone wolf', armed, dangerous), and requests addressees to determine if Galt has been in their area, passing the information to liaison contacts and other relevant sources; a photo of Galt is available upon request, and any information should be reported with reliability assessment and as much detail as possible, with positive replies cabled to HQS and passed to the legal attaché.",
  "tags": [
    "CIA",
    "Eric Starvo Galt",
    "Harvey Lowmyer",
    "John Willard",
    "Martin Luther King Jr.",
    "Assassination",
    "LNERGO",
    "Worldwide Search"
  ],
  "title": "Information Concerning Suspect in Martin Luther King, Jr. Assassination",
  "date": "1968-04-18",
  "persons_mentioned": [
    "Eric Starvo Galt",
    "Harvey Lowmyer",
    "John Willard",
    "Martin Luther King, Jr."
  ],
  "recipient": "Asuncion, Bangkok, Barcelona, Beirut, Berlin, Bern, Bogota, Caracas, Brasilia, Brussels, Buenos Aires, Caracas, Copenhagen, Frankfurt, Geneva, Georgetown, Guatemala City, Guayaquil, The Hague, Hamburg, Helsinki, Hong Kong, Kingston, La Paz, Lima, London, Madrid, Managua, Montevideo, New Delhi, Lisbon, Manila, Munich, Oslo, Panama City, Paris, Port Au Prince, Port of Spain, Porto Alegre, Quito, Recife, Rawalpindi, Rio de Janeiro, Rome, San Jose, Santo Domingo, San Salvador, Santiago, Santiago de los Caballeros, São Paulo, Stockholm, Tegucigalpa, Tokyo, Vienna, Zurich",
  "sender": "CIA Director"
}