{
  "classification": "Personnel",
  "document_type": "Biographic Profile and Memoranda",
  "security": "Disclosing Newton S. Miler's consultant status, contract details, or counterintelligence roles could compromise past or future agency operations and relationships with personnel. For example, mentioning specific termination dates, contract entitlements, and staff assignments reveals internal administrative practices that, if exposed, could be exploited. Quoting directly: 'Contract Termination -Mr. N. Scott Miler' highlights the sensitive nature of disclosing personnel actions.",
  "security_level": "SECRET",
  "summary": "A collection of documents pertaining to Newton S. Miler, including a biographic profile, transportation orders, notifications of personnel action, and memoranda regarding his contract termination as a consultant.",
  "summary_one_paragraph": "This compilation of documents focuses on Newton S. Miler, detailing his background, authorization for transporting household goods from Chanchai, China in 1948, contract details from 1972-1975 including salary and entitlements, and the termination of his consultant contract with the Agency effective September 30, 1975. Memoranda indicate the DCI's approval of Miler's termination, along with others, and internal routing within the Counterintelligence Staff regarding the termination process.",
  "tags": [
    "Newton S. Miler",
    "Consultant",
    "Personnel Action",
    "Contract Termination",
    "Counterintelligence",
    "Biographic Profile",
    "FOIA"
  ],
  "title": "Newton S. Miler Personnel Records",
  "date": "1975-09-30",
  "locations_mentioned": [
    "Chanchai, China",
    "Washington, D.C."
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Newton S. Miler",
    "Donald L. Galloway",
    "Charles W. Sandman",
    "Joseph R. Barager",
    "James J. Croke",
    "George A. Doole, Jr.",
    "Herbert Pollack",
    "James Angleton",
    "Kenneth E. Clark",
    "John M. Clarke",
    "Raymond G. Rocca",
    "Morgan G. Smith",
    "Bronson Tweedy",
    "W. Howard Wrigeins",
    "George J. Kalaris",
    "Hilde Olson",
    "MDMcCallum"
  ],
  "recipient": "Director of Finance, Chief Special Payroll Operations Branch",
  "sender": "Charles W. Sandman, George J. Kalaris"
}