{
  "classification": "Cuba",
  "document_type": "Current Intelligence Memorandum",
  "security": "This document details specific Cuban activities to promote subversion in Latin American countries, including training guerrillas, providing financial support, and guiding front organizations. It also names specific individuals and organizations involved in these activities, such as Che Guevara, the Worker-Student-Peasant Movement (MOEC), and the United Front for Revolutionary Action (FUAR). Revealing these details could compromise intelligence sources, disrupt ongoing operations, and expose methods of Cuban subversion, potentially harming relationships with the affected Latin American countries. Quoting directly: 'Nevertheless, evidence presented in the accompanying country-by-country index shows that Cuba has continued since the first of the year to promote, finance, and otherwise support pro-Castro groups and individuals in Argentina, Brazil...and other countries.'",
  "security_level": "SECRET",
  "summary": "This memorandum discusses Cuban subversive efforts in Latin America since July 1963, detailing Cuba's continued support for pro-Castro groups, guerrilla training, and financial assistance despite recent setbacks, while also assessing the impact of these efforts on various countries in the region.",
  "summary_one_paragraph": "This Current Intelligence Memorandum, dated June 4, 1964, outlines Cuban subversive activities in Latin America since July 1963, reporting that despite recent setbacks in Venezuela and Brazil, Cuba continues to promote, finance, and support pro-Castro groups in Argentina, Brazil, Chile, Panama, and British Guiana. The report highlights Cuban training of Latin Americans in guerrilla warfare, the establishment of front organizations, and the provision of financial support, while also detailing specific instances of Cuban involvement in various countries, such as supporting extremist Peronist groups in Argentina and providing funds to subversives in Colombia. It also notes that Cuba is exploiting peasant unrest and using its embassy in Mexico to support subversive activities in Central America.",
  "tags": [
    "Cuban Subversion",
    "Latin America",
    "Guerrilla Training",
    "Pro-Castro Groups",
    "Financial Assistance",
    "Front Organizations",
    "Che Guevara"
  ],
  "title": "Cuban Subversion in Latin America",
  "date": "1964-06-04",
  "locations_mentioned": [
    "Latin America",
    "Venezuela",
    "Brazil",
    "Argentina",
    "Chile",
    "Panama",
    "British Guiana",
    "Colombia",
    "Costa Rica",
    "Dominican Republic",
    "Ecuador",
    "El Salvador",
    "Guatemala",
    "Haiti",
    "Honduras",
    "Mexico",
    "Nicaragua",
    "Paraguay",
    "Peru",
    "Uruguay"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Fidel Castro",
    "Che Guevara",
    "Juan Lechin",
    "Paz Estenssoro",
    "Francisco Juliao",
    "Leonel Brizola",
    "Cheddi Jagan",
    "Clinton Adlum",
    "Janet Jagan",
    "Salvadore Allende",
    "Victor Rico Galan",
    "Rene Depestre",
    "Mario Sosa",
    "Luis de la Puente",
    "Salomon Bolo"
  ],
  "recipient": "OCI (Office of Current Intelligence)",
  "sender": "OCI (Office of Current Intelligence)"
}