{
  "classification": "Administrative",
  "document_type": "Transmittal Slip",
  "security": "This document contains references to various projects and operations, such as LIRULE, KAPOK, LIPAIL, LIVACATE, and KUWOLF, some of which are marked RYBAT (a sensitive communications security channel). Disclosing these project names and their connections to specific individuals or operations could compromise ongoing intelligence activities and reveal classified methods.",
  "security_level": "S-E-C-R-E-T",
  "summary": "This document is a collection of transmittal slips associated with various CIA projects, operations, and individuals, primarily related to the Western Hemisphere (WH) division. It includes references to projects like LIRULE, LIPAIL, LIVACATE, KUWOLF, and individuals involved in these activities, along with document reference numbers, dates, and routing information.",
  "summary_one_paragraph": "This collection of transmittal slips, dated from the late 1950s to the mid-1970s, primarily in 1963, details the routing and control of documents related to CIA activities, mainly within the Western Hemisphere Division (WH). The slips reference various projects such as LIRULE, LIPAIL, LIVACATE, and KUWOLF, alongside individuals like Camilo Chavez, Edelmiro Maldonado Leal, and Francisco Villanueva Otones. Each slip provides document reference numbers, forwarding dates, and routing codes, indicating the flow of information within the agency concerning political actions, propaganda guidance, dissident correspondence, and operational security.",
  "tags": [
    "Transmittal Slip",
    "CIA",
    "HMYA",
    "HMMT",
    "LIRULE",
    "LIPAIL",
    "LIVACATE",
    "KUWOLF",
    "MHBORIC",
    "KAPOK",
    "Western Hemisphere",
    "Mexico",
    "Propaganda",
    "Political Action",
    "Operations"
  ],
  "title": "Incoming transmittal documents",
  "date": "1977-06-16",
  "locations_mentioned": [
    "Mexico",
    "Mexico City",
    "Matamoros de la Laguna",
    "Coahuila",
    "Monterrey",
    "Nuevo Leon",
    "Nayarit",
    "Czech"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Camilo Chavez",
    "Luis Lauro Escamilla Martinez",
    "MHBORIC",
    "Edelmiro Maldonado Leal",
    "Francisco Villanueva Otones",
    "Kenneth Z. Friskmuth",
    "Aurelia Campos Morales",
    "Marta Maldonado",
    "Salvador Bravo de la Torre",
    "Eduardo L. Suarez Galindo",
    "Luis G. Olloqui Guerra",
    "Rodolfo de León Garza",
    "Luis Macias",
    "Tereso Gonzalez",
    "Victor Canavati Samur",
    "David Martell Mendez",
    "Julian Gascon Mercado",
    "Carlos Amador",
    "Enrique Pinto Garcia",
    "Camilo Chavez Melgoza",
    "Wallace C. Rikon",
    "Simon D. Clackett",
    "Yolanda D. Garcia",
    "Carol K. Zinsmeister",
    "Joseph B. Garcia",
    "Emilio Luis Riera"
  ]
}