{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Memorandum",
  "security": "The memorandum discusses the review and sterilization of Office of Security (OS) file material containing DDO (Directorate of Operations) information before it is passed to the Senate Select Committee on Intelligence (SSCI). It specifically mentions the protection of sensitive sources and methods. For example, regarding the STURGIS file, it states, \"None of the above or any part may be passed on the grounds of protection of sensitive sources and methods.\"",
  "security_level": "SECRET/SENSITIVE",
  "summary": "This memorandum outlines procedures for reviewing and sterilizing Office of Security (OS) files containing DDO information before releasing them to the Senate Select Committee on Intelligence (SSCI), ensuring the protection of sensitive sources and methods.",
  "summary_one_paragraph": "A memorandum dated October 12, 1976, from Philip F. Fendig of SA/DO/O to the Director of Security, addresses the Senate Select Committee on Intelligence (SSCI) request for Office of Security (OS) file material. It details the process by which SA/DO/O reviews OS files containing DDO information prior to their release to the SSCI, with the aim of removing sensitive information. The memo confirms an agreement that DDO material in OS files will not be reviewed by House or Senate Committee staff without prior clearance from the Directorate of Operations and includes an annex listing specific files (Sturgis, Rorke, Moss, Rothman, Socarras, Maceo, Artime, and Varona) and recommendations for what information should be withheld to protect sources and methods.",
  "tags": [
    "CIA",
    "Senate Select Committee on Intelligence",
    "Office of Security",
    "DDO",
    "Sources and Methods",
    "FOIA",
    "SSCI",
    "Sterilization"
  ],
  "title": "Senate Select Committee on Intelligence Request for Office of Security File Material",
  "date": "1976-10-12",
  "persons_mentioned": [
    "Maurice A. Sovern",
    "Philip F. Fendig",
    "Sturgis",
    "Douglas K. Gentzkow",
    "Alexander Rorke",
    "Thomas J. Dodd",
    "Edward K. Moss",
    "Norman Rothman",
    "Carlos Prio Socarras",
    "Antonio Jaime Maceo Mackle",
    "Manuel F. Artime-Buesa",
    "Rafael Ovintero",
    "Manuel Antonio de Varona Loredo",
    "Hunt"
  ],
  "recipient": "Director of Security",
  "sender": "Philip F. Fendig, SA/DO/O"
}