{
  "classification": "Personnel",
  "document_type": "Dispatch",
  "security": "Revealing the subject's name, SLI number, and visa information could compromise her privacy and potentially expose her to unwanted attention or security risks. The mention of specific operations like REDCOAT/LCI/IMPROVE/AELADLE could also reveal sensitive operational details. Specifically, “Subject was interviewed for an immigrant visa on 7 July 65… In response to these questions, we are told that SLIOOR gave thoughtful consideration to each question and probably truthfully replied that although she has met several Soviet diplomats, no approaches for cooperation were made to her.” ",
  "security_level": "Background Use Only",
  "summary": "A dispatch from the Chief of Station in Helsinki to the Chief of WE and Chief of SR regarding Tabe Maria Ingeborg SLIOOR's immigrant visa interview, where she was questioned about Soviet contacts but received her visa after being deemed truthful.",
  "summary_one_paragraph": "This dispatch, dated 14 July 1965, details the immigrant visa interview of Tabe Maria Ingeborg SLIOOR (SLI 201-763030) conducted by the Helsinki station. The interviewing officer questioned SLIOOR about her associations with Soviets, particularly regarding any cooperation attempts, to which she responded thoughtfully and honestly, denying any such approaches. Despite her acquaintance with Soviet diplomats Griferiv GOB and Georgiy STERING, SLIOOR was granted her visa immediately, and her U.S. address is listed as Fort Hood, Texas.",
  "tags": [
    "Immigrant Visa",
    "Soviet Contacts",
    "REDCOAT",
    "LCI",
    "IMPROVE",
    "AELADLE",
    "Tabe Maria Ingeborg SLIOOR",
    "Helsinki Station",
    "VALIK traces",
    "Griferiv GOB",
    "Georgiy STERING",
    "Fort Hood",
    "Clastonbury"
  ],
  "title": "REDCOAT/LCI/IMPROVE/AELADLE Tabe Maria Ingeborg SLI (201-763030)",
  "date": "1965-07-14",
  "locations_mentioned": [
    "Helsinki",
    "Fort Hood, Texas",
    "U.S."
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Tabe Maria Ingeborg SLIOOR",
    "Griferiv GOB",
    "Georgiy STERING",
    "Clastonbury"
  ],
  "recipient": "Chief, WE; Chief, SR",
  "sender": "Chief of Station, Helsinki 14-1"
}