{
  "classification": "Operations",
  "document_type": "Dispatch",
  "security": "This dispatch discusses a proposal to recruit an individual (Carlene Hatcher Polite, Identity A) to collaborate with the government in reporting on Communist and radical forces influencing the civil rights movement. It explicitly details methods of approach, including emphasizing respect for her civil rights commitment and offering financial incentives. Disclosing such operational methods, particularly the targeting and potential recruitment of individuals within activist groups, could damage ongoing intelligence operations and compromise sources. Quoting directly: “RODIGAST suggests that any approach to her must stress respect for her commitment to the civil rights movement…As an alternative to this direct approach, we believe that consideration should be given to the desirability of merely stating that because her activity in the civil rights movement she has been thrown into contact with Vietnamese, Cubans, etc. of interest to WOPIRM and on whom we would welcome reports. Reinforcing the approach RODIGAST suggests that she be offered a small payment of, say, $200 per month to assist her in meeting the obligations of living abroad.”",
  "security_level": "SECRET/RYBAT",
  "summary": "A dispatch outlining a proposal to recruit Identity A (Carlene Hatcher Polite), a person involved with the Paris SNCC group, to gather intelligence on Communist, Castroist, and radical influences within the civil rights movement, with a focus on foreign attempts to exploit the situation.",
  "summary_one_paragraph": "This SECRET/RYBAT dispatch, dated April 17, 1968, from the Chief of Station, London, the Chief of WOMUSE, and the Chief of EUR Division to the Chief of WOLIME, details a proposal to recruit Carlene Hatcher Polite (Identity A), who is involved with the Paris SNCC group, as a collaborator. The dispatch suggests that Polite, who has become influential within SNCC due to her sophistication and moderate views, could provide valuable information on attempts by Communist, Castroist, and radical forces to influence and exploit the civil rights movement. The recommended approach involves emphasizing respect for her commitment to civil rights, offering financial assistance, and focusing on foreign influences, while also considering the urgency of the situation before she potentially withdraws from SNCC activities.",
  "tags": [
    "CIA",
    "SNCC",
    "Civil Rights Movement",
    "Recruitment",
    "RODIGAST",
    "Carlene Hatcher Polite",
    "WOFIRM",
    "Communist Influence",
    "Paris",
    "Intelligence Gathering"
  ],
  "title": "MHALPHA/XHPROBE/RODIGAST: Chief, LCPIPIT/London",
  "date": "1968-04-17",
  "locations_mentioned": [
    "Paris",
    "Detroit",
    "North Vietnam",
    "USA"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Carlene Hatcher Polite",
    "Martin Luther King",
    "Emily Moore",
    "Julia Herve'",
    "Che Guevara"
  ],
  "recipient": "Chief, WOLIME",
  "sender": "Chief of Station, London; Chief, WOMUSE; Chief, EUR Division"
}