{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "Releasing information about ongoing covert actions, such as financial support to political parties and labor unions in foreign countries, could seriously damage U.S. foreign relations and compromise ongoing operations. Revealing the specifics of how the Agency handles alias documentation and accommodation addresses could provide valuable insights to adversaries. As the document indicates protecting alias is critical: “-- Protect all references to official documents reflecting the alias such as SSN, Drivers Permit, etc.”, “-- Protect elements of accommodation addresses to avoid identifying specific locations”. The release of organization charts or information related to the CIA's penetration of the Cuban Embassy could also expose sensitive intelligence operations and personnel.",
  "security_level": "SECRET",
  "summary": "This memorandum outlines pending ARRB (Assassination Records Review Board) issues for an EXDIR (Executive Director) information brief, covering topics such as covert actions, alias documentation, organizational materials, Mexico City tapes, a CIA penetration of the Cuban Embassy (LITAMIL-9), and a CIA asset named Richard Gibson.",
  "summary_one_paragraph": "This SECRET memorandum, dated April 8, 1998, from J. Barry Harrelson to Lee Strickland, details several unresolved issues concerning the ARRB's review of CIA materials related to the JFK assassination. The memo addresses the status of covert actions (financial support to foreign political parties and labor unions), alias documentation (specifically regarding David Morales), organizational materials (including DO and JMWAVE charts), Mexico City tapes (surveillance of Cuban and Soviet facilities), the identity of LITAMIL-9 (a CIA penetration of the Cuban Embassy), the status of CIA asset Richard Gibson, and the files of CIA officials, including those of DDCI Charles Cabell and Richard Helms. The memo provides updates on ARRB staff recommendations, potential compromises, and ongoing reviews by the DO JFK Team and FBI.",
  "tags": [
    "ARRB",
    "JFK Assassination",
    "Covert Actions",
    "Alias Documentation",
    "Mexico City Tapes",
    "LITAMIL-9",
    "Richard Gibson",
    "CIA Officials",
    "JMWAVE",
    "DO",
    "EXDIR Info Brief",
    "Oswald",
    "Anti-Castro Activities"
  ],
  "title": "Pending ARRB Issues for EXDIR Info Brief",
  "date": "1998-04-08",
  "locations_mentioned": [
    "Peru",
    "Greece",
    "Italy",
    "Brazil",
    "France",
    "Mexico City",
    "Cuba",
    "England"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Lee Strickland",
    "J. Barry Harrelson",
    "Richard Helms",
    "David Morales",
    "John Newman",
    "Richard Gibson",
    "Charles Cabell",
    "Marshall Carter",
    "Richard Bissell",
    "Lawrence Houston",
    "William Harvey",
    "Oswald"
  ],
  "recipient": "Lee Strickland",
  "sender": "J. Barry Harrelson"
}