{
  "classification": "Soviet",
  "document_type": "Study",
  "security": "This document concerns the bona fides of KGB defector Yuriy I. Nosenko. It details CIA's assessment of his claims, background, and connections within the KGB. Disclosing sources and methods used to evaluate Nosenko, as well as specific details about KGB operations and personnel, could compromise intelligence gathering capabilities and endanger sources. Specifically, the document states, \"WARNING NOTICE - SENSITIVE INTELLIGENCE SOURCES AND METHODS INVOLVED.\"",
  "security_level": "TOP SECRET",
  "summary": "This document is a cover note for a Top Secret study concerning the bona fides of KGB defector Yuriy I. Nosenko, specifically referencing pages with deletions to protect ongoing CIA operations.",
  "summary_one_paragraph": "This Top Secret document accompanies selected pages from a 1968 study, \"The Examination of the Bona Fides of a KGB Defector - Yuriy I. NOSENKO,\" originally sent for review. The attached pages (vi, vii, 20, 46, 47, 49, 50, 266, 277, 278, 281, 294, 295, 297, 313, 324, 325, 326, 336 and 357) have undergone redactions to safeguard ongoing CIA operations and related intelligence. The study copy, Annex A, and Attachment are requested to be returned upon completion of the review.",
  "tags": [
    "CIA",
    "KGB",
    "Defector",
    "Yuriy I. Nosenko",
    "Counterintelligence",
    "Operations",
    "Security",
    "Soviet",
    "Top Secret",
    "FOIA"
  ],
  "title": "The Examination of the Bona Fides of a KGB Defector - Yuriy I. NOSENKO",
  "date": "1968-02-01",
  "persons_mentioned": [
    "Yuriy I. Nosenko",
    "Ivan I. Nosenko",
    "General Gribanov",
    "KGB General Kobulov",
    "Artamonov",
    "Frippel",
    "Johannes Preisfreund",
    "Golitsin",
    "Shakhov",
    "S.H. Golubev",
    "S.K. Tsarapkin",
    "Rastvorov",
    "Petrov",
    "Deryabin",
    "Yu.I. Guk",
    "M.S. Tsymbal",
    "Kislov",
    "Slesinger",
    "Yu. M. Dvorkin",
    "Koten",
    "Alexander Svenchanskiy",
    "Shubin",
    "A.A. Vetlitskiy",
    "General Sokolov",
    "Cherepanov",
    "S.M. Fedoseyev",
    "Koseiko"
  ],
  "recipient": "Unknown",
  "sender": "Unknown"
}