{
  "classification": "World Affairs",
  "document_type": "World Brief",
  "security": "Several items are marked CONFIDENTIAL which means that revealing them would cause damage to national security. For example: “Supports a growing confidence in Hanoi that insurgents can sustain and improve their position despite US backing of the South Vietnamese government.” Also, details are given on British foreign policy under Douglas-Home regarding East-West dialogue. Sharing of this information with unauthorized individuals would be detrimental to national interests.",
  "security_level": "SECRET",
  "summary": "A world brief summarizing political and military situations across the globe, including Berlin, Yugoslavia, North Vietnam, Cuba, USSR, Italy, various African countries, the UK, British Guiana, France, Finland, South Korea, Turkey, Congo and Laos.",
  "summary_one_paragraph": "This document is a 'World Brief' that gives a high-level overview of international events as of December 1963. It covers topics such as the Communist view of talks between East and West Berlin, Tito's reduced role in Yugoslav affairs, North Vietnam's propaganda efforts, Cuba's increasing military involvement with the Soviets, economic shifts in the USSR, the viability of the Moro government in Italy, Cuba's outreach to African countries, shifts in British foreign policy, political attacks in British Guiana, trade relations between France and Communist China, a cabinet crisis in Finland, political dynamics in South Korea, a cabinet crisis in Turkey, the precarious situation of the Adoula regime in the Congo and military negotiations in Laos.",
  "tags": [
    "World Affairs",
    "Berlin",
    "Yugoslavia",
    "North Vietnam",
    "Cuba",
    "USSR",
    "Italy",
    "Africa",
    "UK",
    "British Guiana",
    "France",
    "Finland",
    "South Korea",
    "Turkey",
    "Congo",
    "Laos",
    "Cold War"
  ],
  "title": "World Brief",
  "date": "1963-12",
  "locations_mentioned": [
    "Berlin",
    "Yugoslavia",
    "North Vietnam",
    "Cuba",
    "USSR",
    "Italy",
    "Tanganyika",
    "Africa",
    "UK",
    "British Guiana",
    "France",
    "Finland",
    "South Korea",
    "Turkey",
    "Congo",
    "Laos"
  ],
  "persons_mentioned": [
    "Willy Brandt",
    "Tito",
    "Khrushchev",
    "Moro",
    "Castro",
    "Douglas-Home",
    "Butler",
    "Jagan",
    "Pak Chong-hui",
    "Kim Chong-pil",
    "Choe Tu-son",
    "Inonu",
    "Mobutu",
    "Nendara",
    "Mabika-Kalanda",
    "Thomas Kanza",
    "Reino Lehto",
    "Souphanouvong",
    "Souvanna Phouma"
  ]
}