{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Dispatch",
  "security": "Sharing the details about GSFEW/1's personnel, their assignments, the location of GSFEW/1's office (in his apartment), and the information that he doesn't have a telephone could potentially compromise the security of the personnel and operations. Additionally, the dispatch mentions plans for a SRAC system, including leasing an apartment and potential vulnerabilities in their communication security. Exposing this infrastructure could undermine their operational capabilities.",
  "security_level": "SECRET",
  "summary": "This dispatch concerns GSFEW/1 personnel in Libya and related technical matters, including a list of personnel assigned to various locations, biographic data on some personnel, and proposed expansion of the UHF radio system.",
  "summary_one_paragraph": "This dispatch, dated September 26, 1970, from an unidentified sender to multiple recipients including the Chief of the Africa Division and Chiefs of Station in Tripoli and Benghazi, concerns GSFEW/1 personnel in Libya and their associated technical operations. It includes a list of GSFEW/1 personnel (identified as Idens A through M) and their assignments, along with biographic sketches of most of them, and discusses technical capabilities and issues, such as the recipient of pornographic literature via international mail. The dispatch also outlines plans for a SRAC system, including leasing another apartment, and explores how to enable GSFEW/1 to transmit from his location while maintaining security.",
  "tags": [
    "CIA",
    "Libya",
    "GSFEW/1",
    "Personnel",
    "Technical Matters",
    "SRAC System",
    "Communication",
    "Security",
    "Africa Division",
    "MKVIVID",
    "Benghazi",
    "Tripoli"
  ],
  "title": "List of GSFEW/1 Personnel in Libya and Related Technical Matters",
  "date": "1970-09-26",
  "locations_mentioned": [
    "Libya",
    "Athens",
    "Benghazi",
    "Tripoli",
    "Tobruk",
    "Copenhagen",
    "West Germany",
    "Friedberg, Germany"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Arthur E. NEUWIRTH",
    "Wallen U. KLANN",
    "Quintin V. PROCHASKA",
    "L. Wayne Rogers",
    "Franz-Josef STEFFENS",
    "Charles W. SPENCE",
    "Richard L. KING",
    "Ray EDWARDS",
    "Vince KENNY",
    "Donald C. BEASLEY",
    "Charles BUTERA",
    "Raymond E. FLEARY",
    "Robert T. SONNENBERG",
    "Clyde Long COMBS, Jr.",
    "Rita BRANDT",
    "James Brandt"
  ],
  "recipient": "Chief, Africa Division; Chief, MKVIVID, Athens; Chief of Base, Benghazi; Chief of Station, Tripoli",
  "sender": "Unknown"
}