{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "Disclosing that the DCD Miami office uses an unidentified contact who is in communication with Oscar FREELY, who is writing a book on STURGIS, could compromise the DCD's intelligence-gathering methods and potentially expose the contact to STURGIS or other individuals. Also, the details about STURGIS's acquisition of cryptographic material and plans to turn it over to Senator Baker could reveal sensitive information about intelligence activities or sources.",
  "security_level": "SECRET",
  "summary": "A memo details Frank STURGIS's upcoming appearance on the Tomorrow Show, his acquisition of cryptographic material related to Albania from Marita LORENZ in New York, and his attempt to contact Senator Baker to turn over the material; DCD is monitoring the situation.",
  "summary_one_paragraph": "On 23 August 1976, a memorandum for the record reports that Frank STURGIS is scheduled to appear on the Tomorrow Show on 24 August, after recently returning from New York where he taped the show. While in New York, STURGIS met with Marita LORENZ and obtained a book from her, believed to contain cryptographic material related to Albania, which STURGIS is attempting to give to Senator Baker. DCD Miami learned this information from an unidentified contact who obtained it from Oscar FREELY, who is writing a book on STURGIS. DCD is monitoring STURGIS's efforts to contact Senator Baker.",
  "tags": [
    "Frank STURGIS",
    "Marita LORENZ",
    "DCD",
    "cryptographic material",
    "Albania",
    "Senator Baker",
    "Oscar FREELY",
    "Tomorrow Show",
    "Miami",
    "Jon French",
    "FOIA"
  ],
  "title": "Call from Jon French of DCD Concerning Frank STURGIS",
  "date": "1976-08-23",
  "persons_mentioned": [
    "Jon French",
    "Frank STURGIS",
    "Oscar FREELY",
    "Tom Schneider",
    "Marita LORENZ",
    "Senator Baker",
    "Chris Hopkins",
    "ADDO",
    "Phil FENDIG"
  ],
  "sender": "Chris Hopkins (LA/COG/CIOS)"
}