{
  "classification": "Personnel",
  "document_type": "Memo",
  "security": "Disclosing that the subject was previously considered for a P/I and was dropped due to suspected misuse of funds and untrustworthy character (“unscrupulous investor dealer” and a promoter of grandiose schemes). Giving this information may reveal sources and methods employed to evaluate potential assets, and that the agency had an interest in subject in 1959.",
  "security_level": "SECRET",
  "summary": "A memo from CIA Headquarters to the Miami Field Office concerning an individual (Mr. Bruce Kalavaring) who had previously been of interest to the Agency but was deemed untrustworthy and suspected of misusing funds. The memo advises the Miami office to accept any information he offers but make no further commitments.",
  "summary_one_paragraph": "This SECRET memo, dated January 8, 1974, from CIA Headquarters to the Miami Field Office, concerns Mr. Bruce Kalavaring, an individual who was of interest to the Agency in 1959. After granting him a P/I (Premises/Installation) in August 1959, it was cancelled in October when he was found to be of little value and suspected of using Agency funds for personal gain; also portraying himself as an Agency employee. The memo advises the Miami office that if Kalavaring contacts them again, they should accept any information he offers but make no further commitments, noting that he is well-known to the appropriate Desk and of doubtful character.",
  "tags": [
    "CIA",
    "Miami Field Office",
    "Bruce Kalavaring",
    "Personnel",
    "Domestic Collection Division",
    "P/I",
    "untrustworthy",
    "misuse of funds"
  ],
  "title": "Subject: Mr. Bruce Kalavaring",
  "date": "1974-01-08",
  "locations_mentioned": [
    "Abaco Island"
  ],
  "origin_agency": "CIA Headquarters",
  "persons_mentioned": [
    "Bruce Kalavaring",
    "Mitchell L. Verbell, III",
    "Jackson B. Horton"
  ],
  "recipient": "Chief, Miami Field Office",
  "sender": "Chief, Domestic Collection Division (Support Branch/083)"
}