{
  "classification": "Personnel",
  "document_type": "File",
  "security": "Revealing that Bagley was involuntarily retired and considered \"surplus to the needs of the Service\" could damage his reputation. Quoting directly from the memo: \"the Head of his Career Service stating that he is surplus to the needs of the Service and that his retirement will be recommended to the Director under the provisions of the CIA Retirement and Disability System pertaining to involuntary retirement, in no way implies an adverse action.\"",
  "security_level": "SECRET",
  "summary": "Personnel file documenting Tennent H. Bagley's CIA career, including reassignments, promotions, and involuntary retirement in 1972, highlighting his service in Brussels and the Soviet Bloc Division.",
  "summary_one_paragraph": "This file contains documents related to the career of Tennent H. Bagley within the CIA from 1949 to 1972. Key events documented include his reassignment to Brussels as an Attache and later as Chief of Station, his promotion recommendations, and his eventual involuntary retirement in June 1972 due to being \"surplus to the needs of the Service\". The file also contains letters of commendation and administrative memos detailing the terms of his retirement and instructions on how to address inquiries about his departure.",
  "tags": [
    "CIA",
    "Personnel File",
    "Tennent H. Bagley",
    "Retirement",
    "Brussels",
    "Soviet Bloc Division",
    "Involuntary Retirement",
    "FOIA"
  ],
  "title": "BAGLEY, Tennent H. \"PETE\"",
  "date": "1972-06-21",
  "locations_mentioned": [
    "Brussels, Belgium",
    "Washington D.C.",
    "La Jolla, California"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Tennent H. Bagley",
    "William C. Cooley",
    "Richard Helms",
    "Harry L. Ficher",
    "Ronald Gage",
    "Thomas H. Karumessines",
    "John L. Hart",
    "David E. Murphy",
    "William D. O'Ryan",
    "Rolfe Kingsley"
  ],
  "recipient": "House Select Committee on Assassinations Staff Members",
  "sender": "CIA Headquarters"
}