{
  "classification": "Administrative",
  "document_type": "Letter and Memorandum",
  "security": "The document discusses internal CIA processes related to declassification, including the establishment of a Historical Review Group and coordination with other agencies and the OMB. Releasing details about these internal procedures could reveal the CIA's decision-making processes regarding classified information and potentially undermine its ability to protect sensitive intelligence sources and methods. For instance, the outline of testimony on the JFK resolution details concerns with resolutions and suggests that 'CIA or other agencies that originate documents should conduct initial review of material to determine whether it can be released.'",
  "security_level": "UNCLASSIFIED",
  "summary": "This collection includes correspondence between the CIA and the House and Senate regarding the release of JFK assassination records, detailing the CIA's efforts to declassify and review documents, its holdings related to the House Select Committee on Assassinations (HSCA), and potential concerns about the Assassination Materials Disclosure Act of 1992.",
  "summary_one_paragraph": "This collection primarily includes communications from the CIA to the House and Senate in April and May 1992, responding to inquiries about JFK assassination records and the proposed Assassination Materials Disclosure Act. It covers the CIA's possession of approximately 300,000 pages of records, including those from the HSCA and Warren Commission, its efforts to declassify documents through a new Historical Review Group, and potential concerns about protecting intelligence sources and methods. The documents also summarize a House Government Operations Committee hearing on the JFK Materials Resolution, noting the strong sentiment toward disclosure and the impact of Oliver Stone's testimony.",
  "tags": [
    "CIA",
    "JFK Assassination",
    "Declassification",
    "House Select Committee on Assassinations",
    "Warren Commission",
    "Freedom of Information Act",
    "Assassination Materials Disclosure Act of 1992",
    "Historical Review Group",
    "Oliver Stone"
  ],
  "title": "Agency Records on the JFK Assassination",
  "date": "1992-04-23",
  "locations_mentioned": [
    "Washington, D.C.",
    "Cuba",
    "USSR",
    "Mexico City",
    "New Orleans"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "John Conyers, Jr.",
    "Stanley M. Moskowitz",
    "John F. Kennedy",
    "Lee Harvey Oswald",
    "Fidel Castro",
    "Martin Luther King, Jr.",
    "Robert M. Gates",
    "Williams Sessions",
    "David L. Boren",
    "Arlen Specter",
    "Louis Stokes",
    "James Lesar",
    "Ernest May",
    "Athan Theoharis",
    "Oliver Stone",
    "Howard Willens",
    "James Johnston",
    "Leslie Harris",
    "Herbert Parmet",
    "Harold Rellyea",
    "Gary Foster",
    "Earl Warren",
    "Lyndon B. Johnson"
  ],
  "recipient": "John Conyers, Jr., Robert M. Gates",
  "sender": "Stanley M. Moskowitz"
}