{
  "classification": "Personnel, Operations",
  "document_type": "Dispatch",
  "security": "This dispatch concerns the recruitment and activities of LIHUFF/1, identified as Alfonso Rudolph Wichtrich, an outside agent for KUBARK. Revealing his role in organizing student groups, distributing propaganda, and initiating harassment activities could compromise ongoing operations and endanger Wichtrich. Quoting directly, 'In addition to acting as the contact between the Mexico Station and the LIHUFF/2 Institute, LIHUFF/1 is responsible for organizing and directing the KUWOLF student groups in the LIHUFF/2 project; printing and distributing of propaganda; planning and initiating student harassment activities.'",
  "security_level": "SECRET",
  "summary": "A dispatch from the Chief of Station in Mexico City details the activities and payment of LIHUFF/1, Alfonso Rudolph Wichtrich, who acts as an outside agent for KUBARK, managing student groups and propaganda efforts. It requests Headquarters to process a monthly contract for Wichtrich for $500.",
  "summary_one_paragraph": "This secret dispatch from the Chief of Station in Mexico City, dated April 30, 1963, outlines the roles and responsibilities of LIHUFF/1, identified as Alfonso Rudolph Wichtrich, who serves as a cutout and outside agent for KUBARK. Wichtrich is responsible for coordinating with the LIHUFF/2 Institute, organizing KUWOLF student groups, disseminating propaganda, and initiating student harassment activities. The dispatch requests that Headquarters approve a monthly payment of $500 for Wichtrich to compensate for the time spent on these activities, noting his social security number is 255-58-5834. Enclosed are forms to complete Headquarters’ records.",
  "tags": [
    "CIA",
    "KUBARK",
    "LIHUFF/1",
    "Alfonso Rudolph Wichtrich",
    "Mexico City",
    "Student Groups",
    "Propaganda",
    "Cutout",
    "Outside Agent",
    "Recruitment",
    "FOIA"
  ],
  "title": "LIHUFF/1",
  "date": "1963-04-30",
  "locations_mentioned": [
    "Mexico City",
    "Mexico",
    "Willcox, Arizona",
    "Tucson, Arizona",
    "El Paso, Texas",
    "Falls Church, Virginia"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Alfonso Rudolph Wichtrich",
    "Rachel (Esther Williams) Wichtrich",
    "John Allen Wichtrich",
    "Janet Rae Wichtrich",
    "Ellen Anne Wichtrich",
    "William Gus Wichtrich",
    "Patricia Jean Wichtrich",
    "Gustaf Wichtrich",
    "Fermina Esparza",
    "Margaret Anderson",
    "Charlette Edelman"
  ],
  "recipient": "Chief, WH Division, Headquarters",
  "sender": "Chief of Station, Mexico City"
}