{
  "classification": "Personnel",
  "document_type": "Report",
  "security": "Disclosing Charles J. Seitz's involvement in Project WUBETON and his pending Proprietary Approval by DOD could jeopardize the project, reveal Agency methods of using unwitting individuals, and expose proprietary entities. Quoting: 'Charles J. SEITZ who is currently being considered for a Proprietary Approval by DOD for Project WUBETON. He is to be used as a flight instructor on an unwitting basis for an Agency proprietary entity in Newton, Kansas.'",
  "security_level": "SECRET",
  "summary": "This document concerns Charles Seitz, a pilot associated with Leslie Norman Bradley and currently being considered for a Proprietary Approval by DOD for Project WUBETON, involving his unwitting use as a flight instructor for an Agency proprietary entity.",
  "summary_one_paragraph": "A SECRET report dated August 29, 1968, details information on Charles Seitz, a pilot linked to Leslie Norman Bradley and being evaluated for Proprietary Approval by the Department of Defense for Project WUBETON. Seitz is intended to serve as a flight instructor on an unwitting basis for an Agency proprietary entity in Newton, Kansas. The report includes Seitz’s background, such as his birthdate, residence in Wichita, Kansas, his employment as a test pilot with Cessna Aircraft Company, his U.S. Army service with tours in Vietnam and Thailand from 1963 to 1966, and his father's employment history with Jack R. FLOURNOY Flying Service.",
  "tags": [
    "CIA",
    "Project WUBETON",
    "Proprietary Approval",
    "Charles Seitz",
    "Leslie Norman Bradley",
    "FLOURNOY Flying Service",
    "DOD",
    "Pilot"
  ],
  "title": "SEITZ, Charles",
  "date": "1968-08-29",
  "locations_mentioned": [
    "Miami",
    "Newton, Kansas",
    "Steele City, Nebraska",
    "Wichita, Kansas",
    "Hollenberg, Kansas",
    "Vietnam",
    "Thailand"
  ],
  "persons_mentioned": [
    "Charles Seitz",
    "Leslie Norman Bradley",
    "President Kennedy",
    "Charles William Seitz",
    "Jack R. Flournoy"
  ]
}