{
  "classification": "Administrative",
  "document_type": "Draft History",
  "security": "This is a draft history which has not been forwarded for review outside the DCI History Staff. Handle via (BYEMAN) Control System",
  "security_level": "TOP SECRET",
  "summary": "This document is a draft history of John A. McCone's tenure as the sixth Director of Central Intelligence, focusing on his involvement in the Bay of Pigs invasion, the Cuban Missile Crisis, and the early stages of the Vietnam War, including the coup against Diem and the initial reactions to President Kennedy's assassination.",
  "summary_one_paragraph": "This TOP SECRET working draft details John A. McCone's experiences and perspectives as DCI during critical events such as the Bay of Pigs invasion, where he critiqued the dismemberment of the operation and emphasized thorough planning, and the Cuban Missile Crisis, during which he uniquely foresaw the potential for Soviet offensive missiles in Cuba. It further discusses McCone's role in Operation MONGOOSE, his relationship with Robert Kennedy, and his continued advocacy for aggressive actions against Castro's Cuba. The document also touches on the escalating situation in Vietnam, including the coup against Diem, President Kennedy's concerns about the new government, and McCone's initial interactions with President Lyndon B. Johnson following Kennedy's assassination.",
  "tags": [
    "John A. McCone",
    "DCI",
    "CIA",
    "Bay of Pigs",
    "Cuban Missile Crisis",
    "Operation MONGOOSE",
    "Vietnam War",
    "Diem Coup",
    "Kennedy Assassination",
    "Intelligence",
    "BYEMAN"
  ],
  "title": "John A. McCone: The Sixth Director of Central Intelligence",
  "date": "1987",
  "persons_mentioned": [
    "John A. McCone",
    "Walter Elder",
    "Mary S. McAuliffe",
    "John F. Kennedy",
    "Maxwell Taylor",
    "Robert Kennedy",
    "Allen Dulles",
    "Arleigh Burke",
    "Lyman Kirkpatrick",
    "Richard Bissell",
    "Walt Rostow",
    "Edward Lansdale",
    "Richard Helms",
    "Nikita Khrushchev",
    "Dean Rusk",
    "Robert McNamara",
    "Alexis Johnson",
    "Lyman Lemnitzer",
    "McGeorge Bundy",
    "Philippe de Vosjoli",
    "Fidel Castro",
    "William Colby",
    "Harry Felt",
    "Ngo Dinh Diem",
    "Ngo Dinh Nhu",
    "Lyndon B. Johnson",
    "Lou Conein",
    "Harkins"
  ],
  "recipient": "DCI History Staff",
  "sender": "Walter Elder, Edited by Mary S. McAuliffe, DCI Staff Historian, DCI"
}