{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "This cable discusses a potential fugitive under narcotics indictment, Albert Larrain Maestre, and his alleged admission to involvement in bombings with Rosenthal. Revealing information about active investigations, sources of information, and operational contacts (AMCLEVE/15) could compromise ongoing law enforcement or intelligence activities. Specifically, the cable requests station traces, which may expose sensitive intelligence gathering methods. Quoting directly: \"REQUEST STATION TRACES ALBERT LARRAIN MAESTRE... REQUEST STATION COMMENT ANCLEVE-15 EVER RECEIVE SUCH ADMISSION FROM LARRAIN MAESTRE.\"",
  "security_level": "SECRET",
  "summary": "A cable discusses Albert Larrain Maestre, a fugitive under narcotics indictment who allegedly admitted involvement in bombings with Rosenthal, and requests station traces; additionally it explores AMCLEVE/15's connection to the case and FBI involvement.",
  "summary_one_paragraph": "This cable details queries from the Justice Department regarding AMCLEVE/15's contact with Frank \"Lefty\" Rosenthal, specifically questioning AMCLEVE/15's sources and transactions related to procurement of arms and munitions. The cable references a fugitive, Albert Larrain Maestre, who is allegedly involved in bombings and is under narcotics indictment, and it requests information about whether AMCLEVE/15 received any admissions from Maestre regarding these activities. The communication also explores AMCLEVE/15's reporting of events to the FBI, seeking to clarify discrepancies between JMWAVE records and information provided by AMCLEVE/15.",
  "tags": [
    "Albert Larrain Maestre",
    "AMCLEVE/15",
    "Frank \"Lefty\" Rosenthal",
    "JMWAVE",
    "FBI",
    "Narcotics",
    "Bombings",
    "Justice Department",
    "Cuba",
    "KAPOK TYPIC",
    "Arms Procurement"
  ],
  "title": "AMCLEVE/15 Contact with Frank \"Lefty\" ROSENTHAL",
  "persons_mentioned": [
    "Robert Bladergroen",
    "Albert Larrain Maestre",
    "Rosenthal",
    "Frank \"Lefty\" Rosenthal",
    "Diego (Borges) Torres",
    "Herminio Diaz Sandalio",
    "Norman Rothman",
    "Francisco (Rodriguez) Tamayo",
    "Domingo (Chemendia) Escalante",
    "William V. Bros",
    "Earl J. Williamson",
    "R.A. Ortman"
  ],
  "sender": "Chief of Station, JMWAVE; William V. Bros (C/WHD); R.A. Ortman (WH/COG/NO). DE WH/COG"
}