{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Classified Message/Dispatch/Memorandum",
  "security": "Several messages discuss LICOOKY-1 and her interactions with Soviet and Central American individuals, including potential REDCOAT operations. Revealing these operations and LICOOKY-1's identity could compromise ongoing intelligence activities and endanger the individual involved. Also, discussion of exploiting personal weaknesses for recruitment purposes is evident. Quoting directly: \"She should not be used make recruitment since not experienced recruiter, failure would completely blur. Her. To SOS OSCE and since her relationship with LINLUCK known, could be unfavorable blowback on LINLUCK\", and \"L-1, who had seen Zuniga briefly...says his attitude toward her has changed. He now friendly, talkative and appears want se friend, but has not mentioned PCH or any difficulties to L-1...may Be susceptible recruitment approach.\"",
  "security_level": "SECRET",
  "summary": "Collection of classified messages, dispatches, and memoranda related to Lyle Stuart, LICOOKY-1, and potential operations involving individuals with connections to the Soviet Union and Central American leftist groups.",
  "summary_one_paragraph": "This collection of documents includes classified messages, dispatches, and a memorandum primarily concerning Lyle Stuart and intelligence operations. The documents address Lyle Stuart's dealings with Juan Jose Arevalo, the potential use of LICOOKY-1 in REDCOAT operations against Soviet targets, and her interactions with Central American figures. They also discuss the possible recruitment of Luis Manuel Zuniga Saravia. The documents outline the CIA's assessment of individuals' vulnerabilities and potential operational risks, as well as the need for caution in involving LICOOKY-1 due to her known associations and limited clearance.",
  "tags": [
    "CIA",
    "Lyle Stuart",
    "LICOOKY-1",
    "REDCOAT Operation",
    "Luis Manuel Zuniga Saravia",
    "Soviet Union",
    "Central America",
    "Counterintelligence",
    "Recruitment",
    "Operations",
    "Mexico City",
    "Warren Commission",
    "FOIA"
  ],
  "title": "Lyle Stuart and LICOOKY-1 Operations",
  "date": "1964-08-19",
  "locations_mentioned": [
    "Mexico",
    "Mexico City",
    "Soviet Union",
    "Central America",
    "United States",
    "Chicago"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Lyle Stuart",
    "Viola June Cobb",
    "Juan Jose Arevalo",
    "Angela delli Sante Arrocha",
    "Charleton Beals",
    "Dr. Osegueda",
    "Eileen Brant",
    "Fidel Castro",
    "Bartolome Costa Amic",
    "Mario Monteforte Toledo",
    "Isabel A. Guillen Zelaya",
    "Mario Sosa Navarro",
    "Carlos Sosa",
    "Ricardo Freiji",
    "Dionicio Bejarano Ramos",
    "Ricosberto Padilla Rush",
    "Luis Manuel Zuniga Saravia",
    "Abel Cuenca Martinez",
    "Sergey Semyonovich Kucharenko",
    "Kobysh",
    "Desmond Fitzgerald"
  ],
  "recipient": "Director, Federal Bureau of Investigation; Director; Mexico City"
}