{
  "classification": "John F. Kennedy Assassination",
  "document_type": "File",
  "security": "Several documents within the file refer to Susan Warren's connections with the US-China People's Friendship Association and contacts with Chinese officials. Releasing information about these contacts could expose intelligence-gathering operations related to monitoring individuals and groups associated with China during the Cold War. As the document states, 'Susan Warren (201-191098) is well known for extensive contacts with Chicoms.'",
  "security_level": "SECRET",
  "summary": "This file contains documents related to Susan Heligman Frank (also known as Susan Warren), including FBI reports, CIA extracts, and information concerning her activities and contacts, particularly her involvement with the US-China People's Friendship Association.",
  "summary_one_paragraph": "This file, reviewed by the House Select Committee on Assassinations staff, contains documents pertaining to Susan Heligman Frank (aka Susan Warren), focusing on her connections to the US-China People's Friendship Association (USCPFA) and alleged contacts with officials of the People's Republic of China (PRC). The file includes FBI reports, CIA extracts detailing Warren's activities, and references to Richard C. Frank. One memo mentions a meeting between PRC Embassy officials and Richard C. Frank in Ottawa, with surveillance potentially conducted by SMABOVE. The documents also indicate concerns about the USCPFA being dominated by apologists for the 'Chicom cause'.",
  "tags": [
    "Susan Heligman Frank",
    "Susan Warren",
    "US-China People's Friendship Association",
    "Richard C. Frank",
    "FBI",
    "CIA",
    "China",
    "Cold War",
    "Ottawa",
    "SMABOVE",
    "KOBIRD",
    "LNERGO"
  ],
  "title": "FRANK, SUSAN HELIGMAN",
  "date": "1971-12-14",
  "locations_mentioned": [
    "New York",
    "Ottawa",
    "China",
    "Peking",
    "Washington D.C.",
    "San Francisco",
    "Los Angeles",
    "Canada"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Susan Heligman Frank",
    "Susan Warren",
    "Richard C. Frank",
    "Lo Yi-ching",
    "Ya o, Jen-liu",
    "Chou En-Lai",
    "Kuo Mo-jo",
    "Keng Piao",
    "Pablo \"Yoruba\" Guzman",
    "Huey Newton",
    "Elaine Brown",
    "Robert Bay",
    "Carmelita Hinton",
    "Max Granich",
    "Mike Gold",
    "William Epton",
    "Jack Belden",
    "Hoscah Williams",
    "John S. Service",
    "Henry Wilcox",
    "Samuel Rosen",
    "Victor W. Sidel",
    "Geoffrey Collins"
  ],
  "recipient": "ALL ADDRESSEES",
  "sender": "RID/POSTIAK ELAINE"
}