{
  "classification": "Personnel",
  "document_type": "File",
  "security": "Disclosing details about Winston's medical condition (blindness and brain tumor) and his treatment in the Soviet Union could be seen as a breach of his personal privacy and raise ethical concerns about government surveillance and data collection. Quoting from the document: 'Winston remained abroad for two and a half years. During this period he underwent examination and treatment by Soviet doctors for his virtual blindness.'",
  "security_level": "SECRET",
  "summary": "A file compiled on Henry Winston, a leading figure in the Communist Party USA (CPUSA), detailing his background, activities, affiliations, health issues, and travels, with information gathered by the CIA and other agencies.",
  "summary_one_paragraph": "This file contains extensive information on Henry Winston, a prominent leader within the CPUSA. It covers his early involvement in communist organizations, travels to socialist countries (including medical treatment in the Soviet Union for blindness), and key roles within the CPUSA leadership. The file includes details about his testimony, indictments, arrests, physical appearance, habits, and personality traits, as well as summaries of his political statements and activities related to international communist meetings and support for figures like Angela Davis. The file also contains indications of CIA interest in Winston and references to his denunciations of U.S. policy.",
  "tags": [
    "Henry Winston",
    "CPUSA",
    "Communist Party USA",
    "Soviet Union",
    "Surveillance",
    "FOIA",
    "Medical Information",
    "Angela Davis",
    "Communist Activities"
  ],
  "title": "WINSTON, HENRY",
  "date": "1966",
  "locations_mentioned": [
    "Kansas City, Missouri",
    "New York City",
    "Soviet Union",
    "East Germany",
    "Hungary",
    "Czechoslovakia",
    "Bulgaria",
    "Red China",
    "Korea",
    "Indonesia",
    "Santiago, Chile",
    "Washington D.C.",
    "Nigeria",
    "Budapest"
  ],
  "origin_agency": "House Select Committee on Assassinations (HSCA)",
  "persons_mentioned": [
    "Henry Winston",
    "Gus Hall",
    "Angela Davis",
    "Nixon",
    "Agnew",
    "Reagan",
    "Ulyanovskiy",
    "Bassey",
    "Fatogun",
    "Goodluck",
    "Erich Honecker"
  ],
  "recipient": "CIS Headquarters",
  "sender": "House Select Committee on Assassinations Staff Members"
}