{
  "classification": "JFK",
  "document_type": "PAPER, TEXTUAL DOCUMENT",
  "security": "This document details the CIA's efforts to tailor intelligence briefings to President Lyndon B. Johnson's preferences and habits, including the content and format of the President's Daily Brief (PDB). It reveals specific interactions with White House staff, such as Bromley Smith, and their influence on what information reached the President. Sharing these internal communications and preferences could expose the CIA's methods of tailoring intelligence to political leadership, potentially compromising the perceived objectivity of intelligence assessments.",
  "security_level": "TOP SECRET",
  "summary": "This document outlines the CIA's efforts to adapt its intelligence briefings to President Lyndon B. Johnson following Kennedy's assassination, focusing on the creation and evolution of the President's Daily Brief (PDB) and the challenges of ensuring its content aligned with the President's needs and preferences.",
  "summary_one_paragraph": "This CIA document describes the process of adjusting intelligence briefings for President Lyndon B. Johnson after John F. Kennedy's assassination, detailing the transition from the Checklist system to the President's Daily Brief (PDB). It highlights the challenges of aligning intelligence content with President Johnson's preferences, managing the flow of information through White House staff like Bromley Smith, and ensuring the PDB met his specific needs amidst evolving foreign policy crises such as the Dominican Republic uprising and the Vietnam War. The document illustrates the CIA's efforts to maintain effective communication channels and provide timely, relevant intelligence to the President.",
  "tags": [
    "CIA",
    "LBJ White House",
    "Intelligence Briefings",
    "President's Daily Brief",
    "PDB",
    "Bromley Smith",
    "Lyndon B. Johnson",
    "John F. Kennedy",
    "Vietnam War",
    "Dominican Republic",
    "National Security"
  ],
  "title": "DRAFT OF PAPER ON INTELLIGENCE RELATIONS WITH THE LBJ WHITE HOUSE",
  "date": "1999-11-29",
  "locations_mentioned": [
    "South Vietnam",
    "Laos",
    "Berlin",
    "Venezuela",
    "Texas",
    "Washington",
    "Cyprus",
    "Santo Domingo",
    "Dominican Republic",
    "West Africa",
    "Hanoi",
    "North Vietnam",
    "Pakistan",
    "Soviet Union",
    "Europe",
    "Panama"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Lyndon B. Johnson",
    "John F. Kennedy",
    "R. J. Smith",
    "John McCone",
    "Bromley Smith",
    "Gen. Clifton",
    "DDI Cline",
    "McGeorge Bundy",
    "John Heidemann",
    "Chancellor Erhard",
    "Philip Kennedy",
    "Richard Lehman",
    "Bill Moyers",
    "Jack Valenti",
    "James C. Graham",
    "Ray Cline",
    "Secretary Rusk",
    "Secretary McNamara",
    "Admiral William Raborn",
    "E. Drexel Godfrey",
    "Richard Helms",
    "Walt Rostow",
    "Allen Valpey",
    "Thomas Patton",
    "Archer C. Bush",
    "Ky",
    "Ceausescu",
    "Maurer",
    "Shelepin"
  ],
  "sender": "OCO/CIA"
}