{
  "classification": "Personnel",
  "document_type": "Personnel File",
  "security": "This document contains various security approvals and clearances for William Morris Kent, including cryptographic clearance, covert security clearance, and access to classified information through TOP SECRET. Releasing details about these security measures and Kent's assignments (e.g., as an Ops Officer in New Orleans under JMPOPLAR) could reveal sensitive operational details and compromise security protocols. Specifically, the document states: 'A covert security clearance is granted for the covert use of the Subject as described in your request as set forth in Paragraph 1 above' and 'Subject has been approved for the appointment specified in your request under the provisions of Headquarters Regulations 10-3 and 20-5 including access to classified information through TOP SECRET.'",
  "security_level": "SECRET",
  "summary": "This document comprises various security-related memos and approvals for William Morris Kent, spanning from 1951 to 1970, detailing his security clearances, assignments, and language training.",
  "summary_one_paragraph": "This collection of documents pertains to William Morris Kent's CIA personnel file and includes memos regarding his security clearances, approvals for access to classified information, and assignments within the agency. Spanning from December 1951 to February 1970, the memos detail Kent's provisional clearances, cryptographic clearance, covert security clearance for Project HYPOTHESIS in Fort Amador, Canal Zone, and his role as an Ops Officer in New Orleans under JMPOPLAR. Additionally, it contains records of his language training at the Latin American Institute, including courses in Spanish, French, and Portuguese, along with his attendance record in San Salvador, El Salvador.",
  "tags": [
    "CIA",
    "Personnel File",
    "Security Clearance",
    "William Morris Kent",
    "Project HYPOTHESIS",
    "JMPOPLAR",
    "Language Training",
    "Fort Amador",
    "Covert Operations"
  ],
  "title": "CIA/DDO-HOUSE COMMITTEE ON ASSASSINATIONS RECORDS - CIA PERSONNEL FILES",
  "date": "1980-08-26",
  "locations_mentioned": [
    "New Orleans, La.",
    "Fort Amador, Canal Zone",
    "San Salvador, El Salvador"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "William Morris Kent",
    "Oliver H. Corboston",
    "Robert H. Cunningham",
    "Steven L. Kuhn"
  ],
  "recipient": "Chief, Covert Personnel Division",
  "sender": "Chief, Security Division"
}