{
  "classification": "Personnel",
  "document_type": "Memorandum",
  "security": "Providing details about current or former agency employees could risk exposing sensitive information and potentially endanger individuals connected to the agency. Specifically, revealing employee locations and roles (e.g., 'August 1963 - Rhein Main', 'June 1965 - CT (new employee)') could compromise operational security.",
  "security_level": "CONFIDENTIAL",
  "summary": "A memorandum from S. D. Breckinridge to Ray Reardon requesting photographs of Agency employees with the surname Bishop who were employed in the 1960s, for use in identifying a person named Morris Bishop by witnesses.",
  "summary_one_paragraph": "S. D. Breckinridge sent a memo to Ray Reardon on September 22, 1978, requesting assistance in gathering photographs of past and present Agency employees with the surname Bishop who were on board in the 1960s. This request is part of an effort to assemble a book of photographs to show to two witnesses who believe they knew a man named Morris Bishop during the same period, with the goal of identifying him. Breckinridge includes brief excerpts from the OPFs (Official Personnel Files) of the first group of employees and asks that Reardon prioritize providing relevant photographs from the early to mid-1960s.",
  "tags": [
    "Personnel Files",
    "Employee Identification",
    "Morris Bishop",
    "Witness Identification",
    "Office of Security",
    "Office of Personnel",
    "HSCA"
  ],
  "title": "Agency Employees with the Surname of Bishop",
  "date": "1978-09-22",
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Ray Reardon",
    "S. D. Breckinridge",
    "Doris Houdesheldt",
    "Morris Bishop",
    "Whit Moore Bishop",
    "James Clarence Bishop",
    "Fred Margeson Bishop",
    "Frank Patrick Bishop",
    "Eugene Edward Bishop, Jr.",
    "Edwin Warren Bishop",
    "Boyd Warrington Bishop",
    "John Carl Bishop",
    "Henry Charles Bishop"
  ],
  "recipient": "Ray Reardon",
  "sender": "S. D. Breckinridge"
}