{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "Disclosing the relationship with the Grand Bahama Development Company could expose sensitive Agency connections with individuals associated with organized crime, potentially harming the reputations of U.S. citizen businessmen cooperating with the Agency. As stated in the memo, \"mere proximity to unsavory elements is sufficient for some to suggest guilt by association,\" and efforts should be made to contain the substance of the memorandum to preclude unwarranted acrimony and suspicion.",
  "security_level": "SECRET",
  "summary": "Andrew J. Percival addresses concerns regarding Agency connections with the Grand Bahama Development Company, advising the severance of relationships with individuals associated with it to protect cooperating U.S. businessmen from guilt by association.",
  "summary_one_paragraph": "Andrew J. Percival, from the Office of General Counsel, wrote a memorandum addressing concerns about the Agency's connections with the Grand Bahama Development Company and its potential links to criminal elements. Percival suggests severing ties with individuals associated with the company to protect cooperating U.S. businessmen—Major General William P. Fisher, Mr. John P. Roulett, and Mr. Albert Whisnant—from potential guilt by association. The memo also emphasizes the need to contain the information due to General Fisher's son being a [DDO case officer], to prevent unwarranted acrimony and suspicion.",
  "tags": [
    "Grand Bahama Development Company",
    "Organized Crime",
    "Guilt by Association",
    "Agency Relationships",
    "Ethics",
    "General Counsel",
    "Bahamas",
    "CCS",
    "DDO",
    "Fisher",
    "Roulett",
    "Whisnant",
    "FOIA"
  ],
  "title": "Agency Connections with the Grand Bahama Development Company",
  "date": "1976-09-15",
  "locations_mentioned": [
    "Bahamas"
  ],
  "origin_agency": "Office of General Counsel",
  "persons_mentioned": [
    "Andrew J. Percival",
    "William P. Fisher",
    "John P. Roulett",
    "Albert Whisnant",
    "Morrison",
    "Isenstead",
    "Koehler",
    "Gambino"
  ],
  "sender": "Andrew J. Percival"
}