{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "Revealing the true affiliation of Mr. David Murphy, an Agency official under State Department cover, could compromise his cover and embarrass the Department. The memo states, \"he requested that his true affiliation not be revealed at this time. He is still under cover and uncoordinated revelation of his true status could become an embarrassment to the (Department)\". Additionally, premature disclosure of dealings with defectors and the determination of their legitimacy is deemed undesirable, as the memo notes that Documents C and D \"would go beyond what we want to release now about our dealings with defectors and the determination of their legitimacy.\"",
  "security_level": "SECRET",
  "summary": "This memorandum discusses the review of four Warren Commission documents for possible declassification, recommending the continued withholding of certain information regarding an agent under cover and information about dealings with defectors.",
  "summary_one_paragraph": "Raymond G. Rocca, Deputy Chief of Counter Intelligence Operations, informs the General Counsel that the National Archives has requested a review of four Warren Commission documents for declassification. While document B and parts of document A are recommended for release, Mr. David Murphy, an Agency official under State Department cover, requested that his true affiliation remain classified. Additionally, documents C and D are to remain classified to protect information about dealings with defectors and their legitimacy. A suggested reply to the National Archives, recommending the continued classification of specific information, is attached for the General Counsel's signature.",
  "tags": [
    "Warren Commission",
    "Declassification",
    "Counter Intelligence",
    "National Archives",
    "David Murphy",
    "Defectors",
    "Covert Operations"
  ],
  "title": "Declassification of Warren Commission Documents",
  "date": "1964",
  "persons_mentioned": [
    "David Murphy",
    "Raymond G. Rocca",
    "Marion Johnson"
  ],
  "recipient": "General Counsel",
  "sender": "Raymond G. Rocca, Deputy Chief, Counter Intelligence Operations"
}