{
  "classification": "Commission",
  "document_type": "Summary",
  "security": "Releasing information about the \"political action program\" could risk an adverse reaction from the Mexicans, which would likely include calls for an examination by the Mexican Government of current CIA activities.  This could lead to increased scrutiny of Station operations and personnel and could jeopardize our unilateral activities.  It could also have a chilling effect on activities conducted jointly with the Mexican services, who will be reluctant to engage in programs that could become subject to public scrutiny and political debate.",
  "security_level": "SECRET",
  "summary": "This document summarizes the Assassination Records Review Board's actions on the security classified HSCA testimony of John Scelso, detailing modifications, postponements, and releases of information. It also includes a memorandum from the CIA requesting reconsideration of certain releases, specifically regarding a political action program in Mexico City, liaison with Mexican police, and references to Phillip Agee's book.",
  "summary_one_paragraph": "This document provides a summary of the Assassination Records Review Board's (ARRB) actions on the security-classified HSCA testimony of John Scelso, noting modifications, postponements, and releases of specific lines and pages. Additionally, it includes a memorandum from John F. Pereira of the CIA to the ARRB Executive Director, requesting reconsideration of the release of information related to a \"political action program\" in Mexico City, the CIA's liaison with Mexican police, and references to Phillip Agee's book exposing CIA operations. The memo argues that releasing this information could damage current CIA operations and relationships with Mexican authorities.",
  "tags": [
    "John Scelso",
    "HSCA Testimony",
    "Assassination Records Review Board",
    "Security Classification",
    "CIA",
    "Mexico City",
    "Political Action Program",
    "Phillip Agee",
    "Mexican Police",
    "Liaison",
    "Warrenton"
  ],
  "title": "Summary of August 1996 Review Board Actions on Security Classified HSCA Testimony of John Scelso",
  "persons_mentioned": [
    "John Scelso",
    "Phillip Agee",
    "Louis Stokes",
    "Frank Carlucci",
    "David Marwell",
    "Jeremy Gunn",
    "Mary McAuliffe",
    "Thomas Karamessinas",
    "Sylvia Deran"
  ],
  "sender": "John F. Pereira, J. Barry Harrelson, Linda C. Cipriani, Executive Director Assassination Records Review Board, From the Desk of Linda C. Cipriani"
}