{
  "classification": "Operations",
  "document_type": "Memorandum",
  "security": "This collection of memoranda and routing slips details CIA interest in Luis Albert Ferre and the Antilles Materials Company (AMCO) as part of Project WUBRINY. Discussions involve leveraging SKEWER/1 (Antonio Luis Ferre's father) for information and potentially placing an officer within AMCO to monitor Cuban activities in the Caribbean. Releasing these operational details could compromise ongoing intelligence efforts and expose sources and methods. Quoting the document: 'Stress would be laid upon assessment of the long-term commercial viability of AMCO because KUBARK is ostensibly interested in placing an officer in a managerial position in AMCO, or some other similar firm, in order to monitor Castro's activities in the Caribbean area.'",
  "security_level": "SECRET",
  "summary": "A collection of memoranda detailing CIA interest in Luis Albert Ferre and the Antilles Materials Company (AMCO) as part of Project WUBRINY, involving discussions with SKEWER/1 for information and potential placement of an officer within AMCO to monitor Cuban activities.",
  "summary_one_paragraph": "This collection of documents outlines CIA interest in Luis Albert Ferre and the Antilles Materials Company (AMCO) through Project WUBRINY. It includes memoranda detailing meetings with SKEWER/1 (Antonio Luis Ferre), a cleared Agency contact, to gather information on AMCO's viability and potential for commercial collaboration. The CIA aimed to place an officer in AMCO to monitor Cuban activities in the Caribbean, involving discussions about leveraging SKEWER/1's influence and obtaining covert security approvals for individuals involved. The documents also assess AMCO's financial status and its relationship with the Puerto Rican Cement Company.",
  "tags": [
    "CIA",
    "WUBRINY",
    "AMCO",
    "SKEWER/1",
    "Luis Albert Ferre",
    "Antonio Luis Ferre",
    "KUBARK",
    "Covert Operation",
    "Cuba",
    "Caribbean"
  ],
  "title": "Project WUBRINY - Antilles Materials Company, Ltd.",
  "conspiracy": "These memos provide insight into some of the CIA's operations and how they gathered information but do not contain details that help clarify or expand the understanding of who killed JFK, why they did it, and how it took place.",
  "date": "1965-01-13",
  "locations_mentioned": [
    "Puerto Rico",
    "Caribbean",
    "Cuba",
    "Dominican Republic"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Luis Albert Ferre",
    "Antonio Luis Ferre",
    "Gale W. Allen",
    "Edward Stanulis",
    "Alvin T. Philpotts Jr.",
    "Train",
    "Fred Imbert",
    "Trujillo",
    "Carter",
    "Malia",
    "Victor R. White",
    "David McGrath"
  ],
  "recipient": "DOCO/SA, Gale W. Allen",
  "sender": "Gale W. Allen, Deputy Director of Security"
}