{
  "classification": "JFK Assassination/CIA Operations",
  "document_type": "Fax Transmission/Briefing Questions",
  "security": "Several questions pertain to sensitive CIA operations, including potential backchannel communications (Questions 14A-C), electronic surveillance (Question 6), and covert projects like QKENCHANT (Questions 16-23). Revealing details could expose sources, methods, and operational tactics, potentially damaging ongoing intelligence activities.",
  "security_level": "SECRET",
  "summary": "This document is a fax transmission from Michelle Combs to Barry Harrelson, containing briefing questions for the ARRB (Assassination Records Review Board) regarding CIA's DS&T (Directorate of Science and Technology) and DO (Directorate of Operations). It includes questions about records related to the HTLINGUAL project, Castro assassination plots, destroyed records, Mexico City station activities, operational funding, relationships with journalists, the QKENCHANT project and Clay Shaw.",
  "summary_one_paragraph": "On March 31, 1997, Michelle Combs sent a classified fax to Barry Harrelson at the ARRB, containing briefing questions concerning CIA's DS&T and DO. These questions probe CIA's record-keeping practices, including the types of records maintained on the HTLINGUAL project and Castro assassination plots. Also targeted are DO's procedures for documenting destroyed records, technical and surveillance operations in Mexico City, processes for operational funding, relationships with journalists and publishing houses, and the identities on the Interagency Source Register. Specific queries focus on backchannel communications, annual station reports for Mexico City, and the QKENCHANT project's connections to Clay Shaw, to ascertain a more complete picture of events surrounding JFK's assassination.",
  "tags": [
    "ARRB",
    "DS&T",
    "DO",
    "HTLINGUAL",
    "Castro Assassination Plots",
    "CIA Records",
    "Mexico City Station",
    "Operational Funding",
    "Journalists",
    "Publishing Houses",
    "Interagency Source Register",
    "QKENCHANT",
    "Clay Shaw",
    "Backchannel Communications"
  ],
  "title": "DS&T and DO Briefing Questions",
  "persons_mentioned": [
    "Barry Harrelson",
    "Michelle Combs",
    "Fidel Castro",
    "Tom Mangold",
    "George Kalaris",
    "Lee Harvey Oswald",
    "Clay Shaw",
    "J. Monroe Sullivan",
    "Howard Hunt",
    "Jack S. Martin",
    "Louis Ivon",
    "C. P. Cabell",
    "Ramsey Clark",
    "Hunter Leake",
    "V. Vermakov",
    "M.D. Stevens",
    "George Lardner, Jr.",
    "Clem Bertrand",
    "ROSSO",
    "FERRIE"
  ],
  "recipient": "Barry Harrelson",
  "sender": "Michelle Combs"
}