{
  "classification": "Operations",
  "document_type": "Contact Report",
  "security": "Revealing details about potential investments in Greece, discussions on personnel management, and operations in Martinique and Haiti could compromise ongoing or future operations. For example, discussing 'isolating' WUBRINY/4 and sending him to Greece reveals operational planning and personnel management. Quoting directly: 'it may be necessary to isolate him elsewhere...and taper him off for termination' and 'send him to Greece'.",
  "security_level": "UNCLASSIFIED",
  "summary": "This report details a conversation between WUBRINY/1 and an unnamed individual on May 9, 1963, covering topics such as a tire recap plant investment in Greece, concerns regarding WUBRINY/4, arrangements in Martinique, and observations about H. Charles and George de Mohrenschildt at the National Airport in Washington.",
  "summary_one_paragraph": "On May 9, 1963, WUBRINY/1 contacted an individual from Washington to discuss several operational matters. The conversation included updates on a tire recap plant investment in Greece involving the Mohawk people and potential contributions from Lodi and WUSALINE. Concerns were raised about WUBRINY/4, with a plan to have RECKREY address suspicions and possibly isolate him within the WUBRINY Interests, potentially sending him to Greece. Arrangements for a Martinique operation involving pumice were finalized, and a decision on RECKREY's contribution was requested. Finally, the report noted an encounter with H. Charles and George de Mohrenschildt at the National Airport, where Charles mentioned his belief that they would \"bring down Papa Doc\" in Haiti.",
  "tags": [
    "WUBRINY",
    "Tire Recap Plant",
    "Greece",
    "WUBRINY/4",
    "Martinique",
    "Pumice",
    "Haiti",
    "H. Charles",
    "George de Mohrenschildt",
    "Operations"
  ],
  "title": "Contact Report",
  "date": "1963-05-09",
  "locations_mentioned": [
    "Washington",
    "New York",
    "Greece",
    "Martinique",
    "Haiti",
    "Chicago"
  ],
  "persons_mentioned": [
    "WUBRINY/1",
    "Luis Borme",
    "RECKREY",
    "H. Charles",
    "George de Mohrenschildt",
    "Papa Doc"
  ],
  "sender": "C. Frank Stone III"
}