{
  "classification": "Soviet",
  "document_type": "File",
  "security": "Disclosing Halperin's connections to Soviet espionage could reveal intelligence-gathering methods, harm relationships with academic institutions, or reignite negative public sentiment against individuals with past Communist affiliations. The document mentions his dismissal from Boston University and alleged involvement in espionage, stating, \"According to the State Department, he had previously been involved in Soviet espionage in wartime Washington.\"",
  "security_level": "SECRET",
  "summary": "This file contains information on Maurice Hyman Halperin, a former OSS official and Boston University professor, suspected of Soviet espionage and working for the Soviet government. The documents include FBI files, information on his activities in Mexico, and a request for traces on Halperin, including newspaper clippings and publications.",
  "summary_one_paragraph": "This file, compiled by the House Select Committee on Assassinations, contains documents related to Maurice Hyman Halperin, a former OSS official suspected of Soviet espionage. Included are FBI files, reports on his activities in Mexico including alleged assistance to suspected spies, information on his family, publications, and newspaper articles detailing his dismissal from Boston University and subsequent employment with the Soviet government. The file also includes a request from the CIA to London and Ottawa for traces on Halperin and approval to pass information to JAGUAR (likely a code name).",
  "tags": [
    "Maurice Halperin",
    "Soviet Espionage",
    "OSS",
    "FBI",
    "Mexico",
    "KUBARK",
    "JAGUAR",
    "State Department",
    "Communist Activities",
    "HSCA"
  ],
  "title": "HALPERIN MAURICE HYMAN",
  "conspiracy": "The document mentions that Halperin was associated with individuals who fled to Czechoslovakia to avoid extradition to the United States related to espionage charges. However, the document does not explicitly link Halperin to the JFK assassination.",
  "date": "1962-01-01",
  "locations_mentioned": [
    "Moscow",
    "Mexico",
    "Cuba",
    "Oklahoma City",
    "Boston",
    "Washington D.C.",
    "Israel",
    "Italy",
    "Greece",
    "Spain",
    "England",
    "British Columbia"
  ],
  "persons_mentioned": [
    "Maurice Hyman Halperin",
    "Edith Evelyn Halperin",
    "Martha Dodd",
    "ALTEK",
    "Maria Velez",
    "David Carlos",
    "Judith Yvonne",
    "Morton Halperin",
    "Fidel Castro",
    "Victor Lasky",
    "Elizabeth Terril Bentley",
    "Senator Keating",
    "Alfred K. Stern",
    "Jack Soble",
    "Ives Morros",
    "Senator Thomas J. Dodd",
    "Francis E. Walter",
    "Berdeen F. Mitchell",
    "William H. Martin",
    "Gary Powers",
    "Harold C. Case"
  ],
  "recipient": "YEURB, LONDON, OTTAWA",
  "sender": "DIRECTOR (CIA)"
}