{
  "classification": "Personnel",
  "document_type": "Contract",
  "security": "All information related to this agreement conveyed through instructions, this instrument, or otherwise, is secret and shall not be divulged to any person, organization or Government in any form or manner, except as authorized by the representative of the Government executing this agreement. outline and be an immediate and final breach of this agreement and will result in forfeiture by you of any and all benefits which may then have accrued to you by reason of this agreement.",
  "security_level": "SECRET",
  "summary": "A contract between the U.S. Government and Raymond H. Gerende for the purchase of confidential information and related services, effective October 1, 1955, detailing compensation, travel, operational expenses, and secrecy obligations.",
  "summary_one_paragraph": "This document outlines a secret contract between the United States Government and Raymond H. Gerende, effective October 1, 1955, replacing any prior agreements with a new contract for the purchase of confidential information and related services. The agreement specifies an annual compensation of $3600, reimbursement for authorized operational travel and approved operational expenses, and outlines conditions for repayment of advanced funds. Gerende is recognized as not being a government employee and is bound by strict secrecy obligations, with any unauthorized disclosure resulting in immediate breach of the agreement and forfeiture of benefits; the contract is set to last for two years and may be renewed, subject to funding availability.",
  "tags": [
    "Contract",
    "Raymond H. Gerende",
    "Confidential Information",
    "Secrecy",
    "Employment Agreement",
    "U.S. Government"
  ],
  "title": "Contract Agreement with Raymond H. Gerende",
  "date": "1955-10-01",
  "persons_mentioned": [
    "Raymond H. Gerende"
  ],
  "recipient": "Mr. Raymond H. Gerende",
  "sender": "Contracting Officer, United States Government"
}