{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Disclosing operational details such as targeting individuals, establishing contact under false pretenses, and fabricating information to influence visa decisions could compromise ongoing operations, damage relationships with foreign governments, and undermine public trust. For instance, paragraph 2 states 'Contact was established with him in about August 1957 as a consequence of his non-immigrant visa application, and about six meetings have been held with him since that time, ostensibly for the purpose of fully clarifying his visa status.' Additionally, paragraph 3 mentions 'fabricated information mentioned in paragraph 2B of Attachment A is that reported in HKH-954, 5 January 1955, and HKH-943, 28 December 1954.' These actions, if revealed, could have serious repercussions.",
  "security_level": "SECRET",
  "summary": "A dispatch from the Havana CIA station provides details on Max Lesnick y Menendez, a JMKEEL target, including his anti-Communist stance and the station's efforts to secure his non-immigrant visa, while also acknowledging the use of fabricated information in his case.",
  "summary_one_paragraph": "This dispatch, dated October 31, 1957, from the Acting Chief of Station in Havana, details the case of Max Lesnick y Menendez, a prominent Orthodox youth leader and JMKEEL target. The CIA established contact with Lesnick under the guise of clarifying his visa status and furnished a memorandum to COACID reviewing derogatory information on him. The dispatch acknowledges that fabricated information was previously reported about Lesnick but that a favorable decision on his non-immigrant visa case was recommended.",
  "tags": [
    "CIA",
    "JMKEEL",
    "Max Lesnick",
    "Cuba",
    "Visa",
    "Fabrication",
    "Communism",
    "FOIA"
  ],
  "title": "Communist Matters: Lionel Guillermo SOTO Prieto and Operational/JKEEL re: Max Lesnick",
  "date": "1957-11-27",
  "locations_mentioned": [
    "Habana, Cuba",
    "New York City",
    "Brooklyn, New York",
    "Mexico",
    "Washington, D.C.",
    "Moscow",
    "Guatemala"
  ],
  "persons_mentioned": [
    "Lionel Guillermo SOTO Prieto",
    "Barnardo GARCIA",
    "Salvador HASSIP",
    "Salvador HASSIP Valdes",
    "Agusto CALZAT",
    "Cilberto Lada",
    "L.A. Rossarch Daream",
    "Anibal ESCALANTE",
    "Maria Teresa GARCIA",
    "Andrea BERJILA",
    "Ren ANTILLAS",
    "Alejandro 0002",
    "Shelby L. Overstreet",
    "B. Tomlin Bailey",
    "Ramiro ARANGO Alainas",
    "Rafael GARCIA Barcena",
    "Fidel Castro",
    "BATISTA",
    "Andrew F. Merton",
    "Herminio Maria FUENTES Dasa",
    "Gloria Heria FUENTES Dasa",
    "José A. SORTS Linares",
    "Salomon L. Viroro",
    "Amalia IMSS Peres",
    "Antonio sulez Jimanes",
    "Amalia IMSS Peres"
  ],
  "recipient": "Chief, MID; Chief, WHD",
  "sender": "Chief of Station, Habana; Act Chief of Station, Habana"
}