{
  "classification": "Legislative Liaison",
  "document_type": "Journal",
  "security": "Several entries detail interactions with the House Select Committee on Assassinations, including setting up meetings and acknowledging Privacy Act requests from committee staff. Sharing this information could compromise ongoing or future interactions with congressional committees. Quoting directly: \"Called Professor G. Robert Blakey...and informed him that we had received six Privacy Act requests from members of the Select Committee staff asking for any security information on them which is held by the Agency.\"",
  "security_level": "SECRET",
  "summary": "A journal from the Office of Legislative Counsel detailing daily activities, including employment requests, liaison with congressional offices and committees, and security matters.",
  "summary_one_paragraph": "This journal, dated November 10, 1977, from the CIA's Office of Legislative Counsel, outlines daily activities including responding to employment inquiries, forwarding press releases to congressional offices, providing Agency publications to legislative staff, arranging meetings with the House Select Committee on Assassinations (HSCA), acknowledging Privacy Act requests from HSCA staff, and facilitating Senate Select Committee on Intelligence staff access to security-related documents.",
  "tags": [
    "Office of Legislative Counsel",
    "Employment Requests",
    "Liaison",
    "House Select Committee on Assassinations",
    "Privacy Act",
    "Senate Select Committee on Intelligence",
    "Security Services"
  ],
  "title": "Journal - Office of Legislative Counsel",
  "date": "1977-11-10",
  "persons_mentioned": [
    "Douglas Applegate",
    "Robert Sensibaugh",
    "Mario Biaggi",
    "Ted Winicov",
    "Richard T. Schulze",
    "G. Robert Blakey",
    "Sidney Stembridge",
    "Cummins",
    "Keith Raffel",
    "Evvy Vidal"
  ],
  "recipient": "Office of Legislative Counsel",
  "sender": "MLG, MG, KSN, DTC, RJK, Evvy Vidal"
}