{
  "classification": "Personnel",
  "document_type": "Memorandum",
  "security": "The memo identifies individuals who were Agency employees and the time frame of their employment, and that some of these individuals retired with Covert (DAC) status. Sharing this information could jeopardize sources and methods, and could potentially expose former employees.",
  "security_level": "SECRET",
  "summary": "This 1978 memo from the Central Cover Staff (CCS) responds to a request from the House Select Committee on Assassinations (HSCA) by providing information on five individuals, including their Agency employment history and cover status, as found in CCS files.",
  "summary_one_paragraph": "In response to an HSCA request, a memorandum dated 24 March 1978, from the CIA's Central Cover Staff (CCS) details information found in CCS files regarding five individuals: Mrs. G. Stanley Brown (Verna Deane Stebbens Brown), David E. Murphy, Grayson (Grayston) Lynch, Robert Moore, and Bill Logay. The memo outlines their Agency employment histories, cover maintenance, and forwarding addresses upon retirement or resignation, with a warning that Robert Moore retired with Covert (DAC) status and his Agency affiliation remains classified. CCS files contained no information on the remaining individuals listed in the HSCA request.",
  "tags": [
    "HSCA",
    "Central Cover Staff",
    "Covert Operations",
    "Agency Employees",
    "Personnel Records",
    "FOIA",
    "Verna Deane Stebbens Brown",
    "David E. Murphy",
    "Grayson Lynch",
    "Robert Moore",
    "Bill Logay"
  ],
  "title": "House Select Committee on Assassinations (HSCA) Request",
  "date": "1978-03-24",
  "origin_agency": "Central Cover Staff, CIA",
  "persons_mentioned": [
    "Mrs. G. Stanley Brown",
    "Verna Deane Stebbens Brown",
    "George Stanley Brown",
    "David E. Murphy",
    "Grayson (Grayston) Lynch",
    "Robert Moore",
    "Robert Butler Moore",
    "Robert T. Moore, Jr.",
    "Bill Logay",
    "William John Logay",
    "M. L. Latta"
  ],
  "recipient": "DDO/ISS/IF/EIS",
  "sender": "Plans and Review Group, Central Cover Staff"
}