{
  "classification": "Administrative",
  "document_type": "Memorandum/Note",
  "security": "Disclosing the internal deliberations on how to handle the JFK Board's prepublication review could undermine the CIA's ability to protect classified information. Specifically, revealing the consideration of 'bluffing' the Board or the reliance on the Snepp case could damage the CIA's credibility and effectiveness in enforcing secrecy agreements. As stated in the document, 'Provide a specific security exit briefing for the Board which expressly mentions that they have an obligation to submit for prepublication review any future writings they plan to publish...and hope the Board does not ask for the source of this obligation (since we cannot provide them with any signed secrecy agreements). In essence, we bluff the Board.' Also, discussing legal vulnerabilities (e.g., unenforceability of agreements) could impede future efforts to secure compliance.",
  "security_level": "FOR OFFICIAL USE ONLY/CONFIDENTIAL/SECRET",
  "summary": "This document details the process of security clearances for JFK Assassination Records Review Board members and staff, focusing on coordination between the ARRB, CIA, FBI, and other agencies, and the issues surrounding secrecy agreements and prepublication review for Board members.",
  "summary_one_paragraph": "This collection of memoranda, notes, and letters from 1994 to 1998 covers the administrative processes for security clearances and related issues concerning the JFK Assassination Records Review Board (ARRB) and its staff. The documents reveal coordination between the ARRB, CIA, FBI, and other entities to grant clearances, manage SCI access, address logistical concerns like facility security and PC support, and grapple with the discovery that the ARRB members may not have signed secrecy agreements, leading to discussions on how to ensure prepublication review of their writings to protect classified information.",
  "tags": [
    "JFK Assassination Records Review Board",
    "Security Clearances",
    "SCI Access",
    "Prepublication Review",
    "Secrecy Agreements",
    "CIA",
    "FBI",
    "ARRB",
    "INFOSEC"
  ],
  "title": "JFK Board Clearances and Security Matters",
  "date": "1994-05-11",
  "persons_mentioned": [
    "Ed Howell",
    "Henry Graff",
    "Craig Livingston",
    "Chuck Easley",
    "Tracy Shycoff",
    "John Pereira",
    "Terry O'Connor",
    "Tim Bower",
    "Jeanette Dale Wantingere",
    "David Marwell",
    "Harrelson Boyd",
    "Scott Nann",
    "Thomas J. Gunn",
    "Thomas E. Samoluk",
    "Sheryl Walter",
    "Mary McAuliffe",
    "Michelle Seguin",
    "Manuel Legaspi",
    "Laura A. Denk",
    "Philip D. Golrick",
    "Robert J. Skwirot",
    "Eileen A. Sullivan",
    "Kevin G. Tiernan",
    "Joan G. Zimmerman",
    "Christopher M. Barger",
    "Joseph P. Freeman",
    "Noelle C. Gray",
    "Tammi S. Long",
    "Charles C. Rhodes",
    "Dennis J. Quinn",
    "Valerie M. Sails",
    "Carolyn Carpenter",
    "W. Curtis (Curt) Chaloner",
    "Roger Martin",
    "Karen Gilbert",
    "Douglas Horne",
    "J. Barry Harrelson",
    "Eileen",
    "Frank",
    "Calvin Snowden",
    "Patti Postel",
    "Marvin Crisloff",
    "Jack Tunheim",
    "Kermit L. Hall",
    "William L. Joyce",
    "Anna K. Nelson",
    "T. Jeremy Gunn",
    "Thomas E. Samoluk",
    "Jim Oliver",
    "Martha Lutz",
    "John Hedley",
    "Donald Rumsfeld",
    "James R. Oliver",
    "Ramona G. Dunn-C-",
    "Marty Boland",
    "R. Bruce Burke",
    "Marne Jensen-Kendrick",
    "Dawn Eilenberger"
  ],
  "recipient": "Various CIA personnel and ARRB staff",
  "sender": "Various CIA and ARRB personnel, including Ed Howell, Tracy Shycoff, John Pereira, Karen Gilbert, and others"
}