{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "This memo discusses a potential relationship with a Cuban refugee group involved in activities against the Cuban government, including establishing reception groups and supplying medical supplies, ammunition, and weapons. Revealing this would expose intelligence-gathering methods, potential covert operations, and compromise the safety of individuals involved. \"As you know from our discussions, they are seeking help in the form of supplies, etc. (Hauer understands that no help will be given without some measure of control by our Agency, and he agreed to provide the names for Agency consideration.\"",
  "security_level": "SECRET SENSITIVE",
  "summary": "A memo from the Chief of the Minneapolis Office to the Chief of the Contact Division regarding a Cuban refugee group seeking assistance from the Agency for activities against the Cuban government, including establishing reception groups and supplying medical supplies and weapons.",
  "summary_one_paragraph": "A memorandum from the Chief of the Minneapolis Office, Vernon R. Sando, to the Chief of the Contact Division, ATTN: Support Branch (Crowley), dated August 31, 1962, concerns a Cuban refugee group led by Ernesto Rodrigues y Moreno, Laureano Batista, and Victor Paneque, seeking assistance from the Agency. The group is involved in shuttling back and forth to Cuba to establish reception groups, supply medical supplies, ammunition, and weapons, and bring out Cubans wishing to leave the country. George Hauer of Cleveland, Ohio, who previously worked with the Agency, provided the names and understands that any Agency assistance would come with a measure of control. Sando requests expedited checking and an expression of interest, emphasizing Hauer's potential usefulness to the Agency.",
  "tags": [
    "Cuban Refugee Group",
    "Covert Operations",
    "Contact Division",
    "George Hauer",
    "Ernesto Rodrigues y Moreno",
    "Laureano Batista",
    "Victor Paneque",
    "Cuba",
    "Minneapolis Office"
  ],
  "title": "Cuban Refugee Group",
  "date": "1962-08-31",
  "locations_mentioned": [
    "Cuba",
    "Cleveland, Ohio",
    "Minneapolis",
    "Marathon Shores, Florida",
    "Miami, Florida",
    "Havana, Cuba"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "George Hauer",
    "Ernesto Rodrigues y Moreno",
    "Laureano Batista",
    "Victor Paneque",
    "Gene Rittenburg",
    "Vernon R. Sando",
    "Crowley"
  ],
  "recipient": "Chief, Contact Division",
  "sender": "Chief, Minneapolis Office"
}