{
  "classification": "Operations",
  "document_type": "Dispatch and Routing Sheet",
  "security": "Several sections discuss covert operations, recruitment, and the use of individuals with specific covers. Releasing details about operations like ZACACTUS, code names like FULMINATER, or operational roles (e.g., “Cut-outs, agents, etc.”) could compromise ongoing activities, expose intelligence sources, and risk the safety of individuals involved. For example, the document states: 'It is suggested that FULMINATER-1 be employed on a regular State-side salary basis and that he be authorized a small staff to assist him in the actual handling of all field projects.'",
  "security_level": "SECRET",
  "summary": "This collection of documents pertains to the termination and potential reuse of Paul D. Langevin (agent pseudonym) and the consideration of David Atlee Philips (FULMINATER-1) for operational roles, specifically in the ZACACTUS project in Chile, along with related administrative matters.",
  "summary_one_paragraph": "This collection of documents includes dispatches, routing sheets, and a personal record questionnaire, detailing various operational and administrative matters related to CIA activities in Santiago and Beirut. Key subjects include the termination of Paul D. Langevin as an agent, the potential utilization of David Atlee Philips (codename FULMINATER-1) in the ZACACTUS project in Chile, and administrative requests such as travel orders for Michael M. CHOADEN. The documents also touch on recruitment, security considerations, and internal routing procedures within the CIA.",
  "tags": [
    "CIA",
    "ZACACTUS",
    "Paul D. Langevin",
    "David Atlee Philips",
    "Chile",
    "Operations",
    "Recruitment",
    "Personnel",
    "Administrative",
    "FULMINATER-1",
    "KUGOWN"
  ],
  "title": "Operational Matters, Termination of Paul D. LANGEVIN and ZACACTUS Operations in Chile",
  "date": "1954-02-04",
  "locations_mentioned": [
    "Santiago, Chile",
    "Fort Worth, Texas",
    "Beirut, Lebanon",
    "New York",
    "Los Angeles",
    "Havana, Cuba",
    "Washington"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Paul D. Langevin",
    "Jerome C. Dunbar",
    "James G. Collett",
    "Martin J. CORINTUS",
    "David Atlee Philips",
    "William ROSS",
    "General ACKERMAN",
    "Dennis K. COPELAND",
    "Michael M. CHOADEN",
    "Gustavo De Los Reyes",
    "Michael Michoa Den",
    "Jean Nickerson"
  ],
  "recipient": "Chief, WHD, Director",
  "sender": "Chief of Station, Santiago; Director, CIA; Chief of Station, Beirut"
}