{
  "classification": "Security",
  "document_type": "Memorandum",
  "security": "Disseminating information about Court Foster Wood outside the FBI is prohibited. Quoting directly: 'The above information is for your use only and should not be disseminated outside your Bureau.' Sharing this information could compromise ongoing investigations or operations.",
  "security_level": "SECRET",
  "summary": "A CIA memorandum to the FBI regarding Court Foster Wood, focusing on his association with Michael Weimer Stratton, a CIA employee, and requesting any additional information the FBI might have on Wood and Stratton's past interactions.",
  "summary_one_paragraph": "In a memorandum dated October 7, 1961, the CIA's Acting Director of Security, R. L. Bannerman, informs the FBI's Mr. Sam J. Papich about Court Foster Wood, whose activities have raised concerns within the CIA. The memo references previous investigative reports on Wood and details information obtained from Michael Weimer Stratton, a CIA employee who knew Wood in high school. Stratton’s knowledge of Wood’s activities and associates caused the CIA to advise Stratton to discontinue contact with Wood. The CIA requests that the FBI provide any additional information on Wood, particularly any past associations between Wood and Stratton, with the stipulation that this information is for internal use only and not to be disseminated outside the FBI.",
  "tags": [
    "CIA",
    "FBI",
    "Internal Security",
    "Cuba",
    "Court Foster Wood",
    "Michael Weimer Stratton",
    "Fair Play for Cuba Committee",
    "Background Check"
  ],
  "title": "COURT FOSTER WOOD INTERNAL SECURITY - CUBA",
  "date": "1961-10-07",
  "locations_mentioned": [
    "Austin, Texas",
    "Falls Church, Virginia",
    "Washington, D.C.",
    "University of Virginia Extension School",
    "Cuba",
    "Mexico",
    "Arlington, Virginia",
    "Philadelphia"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Court Foster Wood",
    "Michael Weimer Stratton",
    "Sam J. Papich",
    "R. L. Bannerman",
    "Castro",
    "Kennedy"
  ],
  "recipient": "Federal Bureau of Investigation",
  "sender": "R. L. Bannerman, Acting Director of Security"
}