{
  "classification": "Personnel",
  "document_type": "File",
  "security": "Disclosing that the CIA maintained a file on Virginius Frank Coe, and details about his alleged involvement in espionage with the Soviet Union and Communist China, as well as his contacts and family members, could damage the CIA's reputation and reveal sources and methods. Specifically, the document mentions his association with Isidore Gibby NEEDLEVAN, a suspected Soviet espionage agent. Revealing this relationship could compromise intelligence operations or sources.",
  "security_level": "SECRET",
  "summary": "This file contains documents related to Virginius Frank Coe, including his alleged involvement in espionage activities, his connections to Communist organizations, and his family members. The documents include memos, reports, and cables from the CIA and FBI, and references to investigations by the House Select Committee on Assassinations.",
  "summary_one_paragraph": "This file, reviewed by the House Select Committee on Assassinations staff, contains various documents related to Virginius Frank Coe (201-169934), including memos, reports, and cables from the CIA and FBI. The file details Coe's alleged involvement in espionage activities, his connections to Communist organizations such as the Fund for Social Analysis, his employment in the Communist State Economic apparatus in Peking, and his family members. It also includes information about his association with individuals such as Isidore Gibby Needle van, Alger Hiss, and Harry Dexter White, as well as references to investigations by the McCarthey Senate Investigation subcommittee.",
  "tags": [
    "Virginius Frank Coe",
    "Espionage",
    "Communism",
    "FBI",
    "CIA",
    "House Select Committee on Assassinations",
    "KUBARK",
    "China",
    "Soviet Union"
  ],
  "title": "COE, VIRGINIUS FRANK",
  "date": "1978-04-06",
  "persons_mentioned": [
    "Virginius Frank Coe",
    "Ruth Coe",
    "Robert Coe",
    "Elizabeth Coe",
    "Milton Harry Freedman",
    "Leibel Bergman",
    "Arthur William Galston",
    "Robert Stephen Cole",
    "Milton FATEWAY",
    "Tom JONES",
    "Jeremiah C. INGEFSCII",
    "Harriet and Chao Ting CHI",
    "Isidore Gibby NEEDLEVAN",
    "Harry Dexter White",
    "Alger Hiss",
    "Henry Collins",
    "John Abt",
    "Nathor Gregory Silvermaster",
    "Elizabeth Bentley",
    "Eric Adams",
    "Frank Cook",
    "Liao Cheng Chih",
    "Kuo Mo-Jo",
    "Chu Chien-Hua",
    "Ho Nai-Hua",
    "Tien Tseng Cheng"
  ],
  "sender": "Jackie (IPEIB2), Bill Newman (Office of security), N. FAMATY FID/CE"
}