{
  "classification": "Cuba",
  "document_type": "Memorandum and News Release",
  "security": "The attached document, marked TOP SECRET, lists a series of proposed actions against Cuba, including Operations SMASHER, FREE RIDE, TURN ABOUT, DEFECTOR, BREAK-UP, COVER-UP, DIRTY TRICK, FULL-UP, PHANTOM, BINGO, and GOOD TIMES, outlining various means to destabilize the Cuban government and potentially justify US military intervention. Disclosing these specific plans could reveal sensitive intelligence operations and compromise current or future covert actions.",
  "security_level": "TOP SECRET/UNCLASSIFIED/CONFIDENTIAL",
  "summary": "The Assassination Records Review Board (ARRB) is working to declassify and release military records related to U.S. policy toward Cuba from 1962-64, specifically seeking a multi-agency review of Joseph Califano's Army papers and Joint Staff/JCS records to expedite the declassification process, culminating in a public release of approximately 1,500 pages of records in November 1997.",
  "summary_one_paragraph": "The Assassination Records Review Board (ARRB) facilitated the declassification of military records from 1962-64 related to U.S. policy toward Cuba, including the papers of Joseph Califano and selected Joint Chiefs of Staff (JCS) records. The ARRB proposed a multi-agency concurrent review to expedite the declassification, setting deadlines for review to meet their sunset date. These efforts resulted in the release of approximately 1,500 pages of previously classified documents in November 1997, illuminating U.S. strategies to remove Castro from power. The ARRB also released a memorandum to the CIA setting up a joint declassification session for the Califano Papers and Joint Staff/JCS Records and subsequently inviting them to a second session.",
  "tags": [
    "Assassination Records Review Board",
    "Declassification",
    "Joseph Califano",
    "Joint Chiefs of Staff",
    "Cuba",
    "U.S. Policy",
    "JFK Act",
    "Military Records",
    "Operation Mongoose",
    "CIA"
  ],
  "title": "Proposal for Multi-Agency Declassification Review of Joseph Califano's Army Papers and Joint Staff/JCS Records under the JFK Act",
  "date": "1997-06-09",
  "locations_mentioned": [
    "Cuba",
    "Washington, DC",
    "College Park, Maryland",
    "Mexico City",
    "Caracas"
  ],
  "origin_agency": "Assassination Records Review Board",
  "persons_mentioned": [
    "Stewart F. Aly",
    "Joseph Califano",
    "James R. Moore, Jr.",
    "Dan Burton",
    "John R. Tunheim",
    "Henry F. Graff",
    "Kermit L. Hall",
    "William L. Joyce",
    "Anna K. Nelson",
    "David G. Marwell",
    "Toni Bowie",
    "Steven D. Tilley",
    "J. Barry Harrelson",
    "Nina Noring",
    "Richard S. Werksman",
    "William Leary",
    "Carol Keeley",
    "Lyman Lemnitzer",
    "Maxwell Taylor",
    "Earle Wheeler",
    "Edmund McBride",
    "T. Jeremy Gunn",
    "Thomas E. Samoluk",
    "Eileen Sullivan",
    "George Bush",
    "Bill Clinton",
    "Doug Horne",
    "Charles A. Briggs",
    "Kathleen Puchnick",
    "Richard D. Kovar",
    "Eileen M. Wukitch",
    "Mary V. Amoia",
    "William Perkins",
    "Barbara Standley"
  ],
  "recipient": "Stewart F. Aly, Edmund McBride, J. Barry Harrelson",
  "sender": "T. Jeremy Gunn"
}