{
  "classification": "Security",
  "document_type": "Memorandum",
  "security": "Revealing Itkin's connections to the Mafia and his role as an FBI informant, along with MONCURE's contacts and the Agency's attempts to manage the fallout from Itkin's legal issues, could expose sensitive intelligence sources and methods. MONCURE's association with a Mafia figure and his concern about retaliation also present security risks. Quoting directly: “WARNING NOTICE SENSITIVE INTELLIGENCE SOURCES AND METHODS INVOLVED” and “MONCURE, who was apprehensive of Mafia retaliation because of his involvement with Itkin.”",
  "security_level": "SECRET",
  "summary": "William H. Godson reviews the Herbert Itkin file, detailing Itkin's use as an informant on Haitian exiles and his subsequent efforts to involve the CIA in a custody battle, which exposed CIA agent Bernard E. MONCURE and his relationship with Itkin.",
  "summary_one_paragraph": "William H. Godson's memorandum reviews the Herbert Itkin file, highlighting Itkin's involvement as an unpaid informant in a 1963 operation concerning Haitian exiles attempting to unseat President Duvalier, during which CI Staff agent Bernard E. MONCURE made operational contacts. The memo also covers Itkin's later attempts to leverage his CIA connections, fabricating aspects of his service to help his wife gain custody of her children, exposing MONCURE's CIA relationship in the process. The Agency sought to manage the situation to protect MONCURE, especially given Itkin's concurrent role as an FBI informant and witness in Mafia cases, while also noting that Itkin’s fraudulent activities cast suspicion on Thomas L. Roberts, a former law partner who became a CIA agent.",
  "tags": [
    "Herbert Itkin",
    "Bernard E. MONCURE",
    "CIA",
    "FBI",
    "Haiti",
    "Mafia",
    "Custody Battle",
    "Counterintelligence",
    "Freedom of Information Act",
    "Golitsyn",
    "Seymour Hersh"
  ],
  "title": "Herbert Itkin File",
  "date": "1977-11-01",
  "persons_mentioned": [
    "William H. Godson",
    "Herbert Itkin",
    "Bernard E. MONCURE",
    "Duvalier",
    "Frederick Hersh",
    "Harold Stassen",
    "Allen Dulles",
    "Thomas L. Roberts",
    "Marcus",
    "Lenzieri",
    "Will Kerbe",
    "Golitsyn",
    "John K. Greaney",
    "Seymour Hersh",
    "Bud Sudin"
  ],
  "sender": "William H. Godson (CI/R&A/O)03 1592"
}