{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "The cable discusses sensitive JMWAVE operations, including combined operations facilities, activities, and personnel. It mentions specific sites in Naples, such as the \"Sokoch Pass area\" and \"Cayo Gordo,\" as well as the cover corporation GULFLANT. Revealing these details could expose ongoing clandestine activities and compromise the security of personnel and facilities. The cable also refers to the potential exposure of \"TVO-FACED ATTITUDE OF U.S. GOVT\" which stops anti-communist exile fighters from using the U.S.",
  "security_level": "SECRET",
  "summary": "A cable reports on Orlando Bosch's suspended sentence, potential exposure of JMWAVE activities by exile groups, and increased vigilance at combined operations sites in Naples following concerns about security breaches.",
  "summary_one_paragraph": "This cable, dated October 1966, reports that Orlando Bosch received a suspended sentence in Naples for transporting explosives and discusses the potential exposure of JMWAVE operations by exile groups like HIRR and ANC. These groups, including Felipe Rivero, aim to publicize the \"two-faced attitude of the U.S. government\" by revealing JMWAVE's activities and personnel, to ridicule those Cubans who work for JMWAVE, and promote themselves as activist organizations. The station has increased vigilance at combined operation sites but does not plan to change cover procedures, evaluating the incident as having no significant adverse effect on overall station security.",
  "tags": [
    "JMWAVE",
    "Orlando Bosch",
    "Cuban Exiles",
    "Combined Operations",
    "Security Breach",
    "HIRR",
    "ANC",
    "Felipe Rivero",
    "GULFLANT",
    "Naples",
    "CIA"
  ],
  "title": "Report on Orlando Bosch Sentence and Potential Exposure of JMWAVE Activities",
  "date": "1966-10",
  "locations_mentioned": [
    "Naples",
    "Cuba",
    "Miami"
  ],
  "persons_mentioned": [
    "Orlando Bosch",
    "Jorge Guiterez Ulla",
    "Jorge Vega",
    "Felipe Rivero"
  ],
  "recipient": "Director",
  "sender": "JMWAVE"
}