{
  "classification": "Personnel",
  "document_type": "Collection of Documents/Dispatches/Memoranda",
  "security": "Disclosing the cover arrangements, including the notional organizations and their backstopping, for Harold R. Noemayr could compromise ongoing operational security and the witting individuals involved. As quoted from one document: 'Cover has been contrived for you with two notional organizations, Public Surveys Institute and Betwins Travel Folders...The above address is in actuality that of a telephone answering service where all normal calls of inquiry are handled by unwitting personnel...This person is adequately prepared to acknowledge your relationship with your cover firm...'",
  "security_level": "SECRET",
  "summary": "This collection of documents pertains to Ion Grozdea and Arthur C. Vaivada, along with cover story details and operational assignments for Harold R. Noemayr, including communication regarding his cover as a representative for notional public polling and travel service firms.",
  "summary_one_paragraph": "This collection of documents primarily relates to personnel matters, operational assignments, and cover stories within the CIA. Included is information about Ion Grozdea's political affiliations, dispatches concerning Arthur C. Vaivada's operational suitability, particularly for Communist Party (CP) penetration work in Latin America, and detailed documentation pertaining to Harold R. Noemayr's cover as a representative of the notional Public Surveys Institute and Betwins Travel Folders, outlining his activities, financial arrangements, and potential risks.",
  "tags": [
    "Personnel",
    "Operational Assignments",
    "Cover Story",
    "Ion Grozdea",
    "Arthur C. Vaivada",
    "Harold R. Noemayr",
    "KUBARK",
    "Public Surveys Institute",
    "Betwins Travel Folders"
  ],
  "title": "Personal Information (Grozdea, Ion (Dr.), Vaivada, Arthur C., Hoemayr, Harold R.)",
  "date": "1958-05-19",
  "locations_mentioned": [
    "Rumania",
    "Mexico City",
    "Havana, Cuba",
    "Costa Rica",
    "Guatemala City",
    "Washington, D.C.",
    "Dallas, Texas",
    "New York, New York"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Ion Grozdea",
    "Harold R. Noemayr",
    "Arthur C. Vaivada",
    "Albert E. Johnson",
    "Charles H. Betwin",
    "Rose Lester Crozier",
    "Eventina de los Angeles Cordero Calderen",
    "Lillian Caridad Crozier",
    "Jeremy A. Tolking",
    "Floyd Postany"
  ],
  "recipient": "Chief of Station, Mexico City; Chief of Station, Habana; Director",
  "sender": "Chief, WHD; J. C. King; Operations Division, Medical Staff; Chief, CCB/NC"
}