{
  "classification": "Cuba",
  "document_type": "Intelligence Report",
  "security": "This report details suspected Cuban security penetrations into the Cuban human rights/dissident movement, naming specific individuals and their alleged activities. Releasing this information could compromise intelligence sources and methods, as well as endanger individuals mentioned in the report. As stated in the document, 'REPORT CLASS SECRET-WARNING NOTICE-INTELLIGENCE SOURCES OR METHODS INVOLVED--NOT RELEASABLE TO FOREIGN NATIONALS.'",
  "security_level": "SECRET",
  "summary": "An intelligence report from January 1996 details suspected Cuban security penetrations of the Cuban human rights/dissident movement, identifying several individuals believed to be sources or agents of the Ministry of Interior (MININT). The report is based on information from a mid-level technician with extensive contact with dissident groups in Cuba.",
  "summary_one_paragraph": "This January 1996 intelligence report, originating from the CIA, outlines suspicions within the Cuban Civic Current (CCC), a dissident group in Cuba, regarding potential security penetrations by the Cuban Ministry of Interior (MININT). Based on information from a mid-level technician (CUB-04298), the report identifies Jorge Gonzalez, Vladimiro Roca, Guillermo Fernandez Donates, and Rafael Alcides as individuals suspected of being Cuban security sources due to various incidents and behaviors. The report details specific events, such as the surfacing of bogus information provided to Gonzalez during MININT interviews, and suspicious activities involving Roca, including his alleged undermining of fellow dissidents and his wife's dissemination of rumors about Elizardo Sanchez. The report also notes Guillermo Fernandez Donates' history of arrests and suspected provocateur activities, as well as Rafael Alcides' potential ties to the Cuban government through his involvement with the UNEAC and his attendance at Fidel Castro's sister's funeral.",
  "tags": [
    "CIA",
    "Cuba",
    "Human Rights",
    "Dissident Movement",
    "Security Penetration",
    "MININT",
    "Cuban Civic Current",
    "Intelligence Report",
    "ESCALANTE FONT"
  ],
  "title": "Suspected Cuban Security Penetrations of the Cuban Human Rights/Dissident Movement in Cuba",
  "date": "1996-01-19",
  "locations_mentioned": [
    "Cuba",
    "Venezuela",
    "Havana",
    "Madrid",
    "Miami"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "ESCALANTE FONT",
    "Jorge Gonzalez",
    "Vladimiro Roca",
    "Guillermo Fernandez Donates",
    "Rafael Alcides",
    "Osvaldo Paya Sardinas",
    "Elizardo Sanchez Santacruz",
    "Vladimir Martinez-Amores",
    "Felix Diaz",
    "Felix Bonne Carcasses",
    "Mariana Badell",
    "Fidel Castro",
    "Carlos Alberto Montaner",
    "Jorge de Orueta",
    "Piotr Mikiska",
    "Georgina de las Mercedes Gonzalez Corbo",
    "Reinaldo Roque",
    "Ronaldo Roque",
    "Teresa Fernandez Mardones",
    "Raul Castro Ruz",
    "John F. Kennedy"
  ],
  "recipient": "WITHHELD",
  "sender": "Headquarters"
}