{
  "classification": "Personnel",
  "document_type": "Knowledgeability Briefs",
  "security": "These briefs detail the background and knowledge of a potential intelligence source, WASH-32615, including her employment history, family details, and contact information. Sharing this information could expose intelligence-gathering methods, compromise the individual's privacy, and jeopardize future interactions with her. Specifically, the documents state: 'WARNING NOTICE - SENSITIVE INTELLIGENCE SOURCES AND METHODS INVOLVED/NOT RELEASABLE TO FOREIGN NATIONALS' and contains recontact info.",
  "security_level": "CONFIDENTIAL",
  "summary": "These confidential knowledgeability briefs pertain to WASH-32615, a 52-year-old former Soviet radio broadcasting engineer and ethnic Jew who worked at the Gorizont Television Plant in Minsk; it assesses her knowledge of the plant and potential intelligence value after her emigration to the U.S.",
  "summary_one_paragraph": "These records consist of three knowledgeability briefs created in December 1992 by the CIA's Emigre Coordination Center, assessing WASH-32615, a 52-year-old former Soviet engineer who emigrated to the U.S. from Belarus in April 1992. The briefs detail her employment history at the Gorizont Television Plant in Minsk from 1966 to 1991, noting that Lee Harvey Oswald reportedly worked there in 1959-1960, and assess her limited knowledgeability about sensitive activities at the plant, stating she had no security clearance and claims to know only about unclassified production. The documents provide personal data, education, and collector's comments, as well as guidance on processing requirements related to this potential source.",
  "tags": [
    "CIA",
    "Knowledgeability Brief",
    "Emigre Coordination Center",
    "WASH-32615",
    "Gorizont Plant",
    "Minsk",
    "Soviet Union",
    "Belarus",
    "Intelligence Source"
  ],
  "title": "Knowledgeability Brief",
  "locations_mentioned": [
    "Minsk, Belarus (BO)",
    "Vitebsk, Belarus (UR)",
    "United States"
  ],
  "origin_agency": "CIA/NR (DDO NR EMIGRE COORDINATION CENTER)",
  "persons_mentioned": [
    "WASH-32615",
    "Lee Harvey Oswald",
    "Igor Pitkevich",
    "Thomas R. Winters"
  ],
  "recipient": "AIG 4511",
  "sender": "CIA WASH DC//DDO NR EMIGRE COORDINATION CENTER//, CHAIRMAN, EMIGRE JOINT WORKING GROUP"
}