{
  "classification": "Mexico, Personnel, Security",
  "document_type": "File and Classified Messages",
  "security": "Disclosing information about PERRY's past employment with the Agency and the Agency's contact with USIA could reveal operational methods and compromise security protocols. Likewise, revealing details about sources like LIFEAT/LITHOSPHERE and their information on American Communists in Mexico could expose sources and compromise future intelligence gathering. Quoting directly: 'PERRY was not to disclose his past employment with this Agency...Security, on the basis of the above request by WH Division, contacted the appropriate person in USIA and advised them on a controlled basis of PERRY's former affiliation with this Agency.' and 'The following information concerning American Communists in Mexico and their contacts has been developed.'",
  "security_level": "SECRET",
  "summary": "This file contains documents relating to James A. Perry, his connections to Maurice Halperin, and investigations into American Communists in Mexico. It includes details of Perry's employment with the Agency, his relationship with Halperin (suspected of Soviet ties), and information gathered on individuals like Robert Strand, Frederick Vanderbilt Field, and Noah Seborer.",
  "summary_one_paragraph": "This collection of documents, dated primarily in 1955, focuses on James A. Perry's connections to the CIA and his association with individuals linked to Communist activities. Key contents include: a memo detailing Perry’s accidental disclosure of his CIA affiliation, his relationship with Maurice Halperin (who was suspected of Soviet ties), and a report on American Communists in Mexico, including Robert Strand, Frederick Vanderbilt Field, and Noah Seborer; and multiple messages regarding James Leigh White and Sylvia Ageloff. The file also includes documentation of information sharing between the CIA and USIA regarding Perry's employment history.",
  "tags": [
    "James A. Perry",
    "Maurice Halperin",
    "American Communists in Mexico",
    "Robert Strand",
    "Frederick Vanderbilt Field",
    "Noah Seborer",
    "USIA",
    "Mexico City",
    "CIA",
    "James Leigh White",
    "Sylvia Ageloff"
  ],
  "title": "HSCA Staff File #62-1161-W Volume 44",
  "date": "1955-09-22",
  "locations_mentioned": [
    "Washington, D.C.",
    "South America",
    "Brazil",
    "Mexico City",
    "Guatemala",
    "New York",
    "London",
    "Spain",
    "Vermont"
  ],
  "origin_agency": "House Select Committee on Assassinations (HSCA), CIA",
  "persons_mentioned": [
    "James A. Perry",
    "Severino D. Gomez",
    "M. Leal Gomez",
    "En Consaltes",
    "Maurice Hyman Halperin",
    "Elizabeth Bentley",
    "S.H. Johnson",
    "Robert Strand",
    "Frederick Vanderbilt Field",
    "Noah Seborer",
    "James Leigh White",
    "Maria Cruz Carrocera Mirte Horn",
    "Sylvia Ageloff",
    "Acques Mornard",
    "Maxim Leider",
    "Albert Naltz",
    "Anna Seghers",
    "Boud Verge",
    "Frank Jellinek",
    "Han Hoffman",
    "Minna Halperin",
    "Vittorio Vidali",
    "Carlos Contreras",
    "Poonelle Maria Hoan",
    "Juan Negein",
    "Frank Ell Neck"
  ],
  "recipient": "Mexico City",
  "sender": "Chief CI/SRS, Director"
}