{
  "classification": "Security",
  "document_type": "Memorandum",
  "security": "Identifying defectors as 'unpredictable, unstable, and/or violent' and sharing that information with the Secret Service could violate their privacy and potentially lead to unjustified surveillance or harassment. Designating individuals based on subjective assessments carries a risk of unfairly targeting them. Additionally, referencing defectors who 'call the Soviets at the UN Mission and talks of re-defection' could compromise ongoing intelligence operations.",
  "security_level": "SECRET",
  "summary": "A CIA memorandum details a meeting to determine which defectors should be watched by the Secret Service during the BREZHNEV visit, assessing their stability and potential for causing trouble.",
  "summary_one_paragraph": "This memorandum, dated June 14, 1973, summarizes a meeting held by CIA personnel to identify defectors who should be monitored by the Secret Service during BREZHNEV's visit. The meeting involved reviewing lists of defectors considered unpredictable, unstable, and/or violent, including Antanas SUTKUS, ZAVOROSKIY, and CHALLY, among others. The attendees assessed each individual's potential risk, and based on these evaluations, determined whether to pass their names to the Secret Service for monitoring.",
  "tags": [
    "CIA",
    "Defector Watch List",
    "Secret Service",
    "BREZHNEV visit",
    "Counterintelligence",
    "Defectors",
    "Security",
    "Surveillance"
  ],
  "title": "CIA Defector Watch List For The Secret Service",
  "date": "1973-06-14",
  "persons_mentioned": [
    "Jack Shaffer",
    "Ernest Weidul",
    "Jack Friedlander",
    "Negoy",
    "Radulovich",
    "Jerry Post",
    "Tsikerdanos",
    "Antanas SUTKUS (AEMIGALE)",
    "ZAVOROSKIY (AEGOLD)",
    "SAKHAROV (AECLUSTER)",
    "PETROV (AELENIS)",
    "CHALLY",
    "TROFIMOV (AEFISSION)",
    "OGANESYAN (AEGAIN)",
    "GOLENIEWSKI (AEVISION)",
    "NOSENKO (AEDONOR)",
    "GOLITZYN (AELADLE)",
    "BIMBLI (AEFLEBE)",
    "VAGUINE (AECRUTCH)",
    "TEREKHOV (AESTUNT)",
    "ROCHANSKI (BEGOOD)",
    "SEREGIN",
    "MARININ",
    "TERESILOKOV",
    "KYZYUK",
    "Jameson",
    "Charles Bohrer",
    "Howard Osborne",
    "Angleton",
    "President Nixon",
    "Brezhnev"
  ],
  "recipient": "The Record",
  "sender": "Ernest J. Tsikerdanos (SA/C/CI/OPS)"
}