{
  "classification": "Personnel",
  "document_type": "Memo",
  "security": "Releasing the true names of persons to whom we have promised confidentiality, thereby harming our ability to recruit in the future...unable to articulate specific current harm, beyond the general chilling effect",
  "security_level": "SECRET",
  "summary": "This memo discusses the JFK Board's decision to release the true name of Jose Marie Mankel and the inability to successfully appeal that decision due to a lack of specific current harm that would ensue. It details Mankel's history as a ZRRIFLE agent and his previous involvement with illegal narcotics operations.",
  "summary_one_paragraph": "This memo, dated October 23, 1997, from Teresa Wilcox at DST to J. Barry Harrelson, addresses the JFK Board's decision to release Jose Marie Mankel's true name. Wilcox explains that an appeal is unlikely to succeed due to the inability to demonstrate specific current harm, as the program Mankel was linked to and the crypt have already been released. The memo notes Mankel's past as a ZRRIFLE agent involved in procuring foreign code and cypher materials, his earlier contact with the Agency in 1958 regarding narcotics, and the fact that his name is already in the public domain via Oliver Stone's film manuscript. Despite the potential chilling effect on future recruitment, DS&T will not appeal the decision without additional information.",
  "tags": [
    "JFK Board",
    "Jose Marie Mankel",
    "ZRRIFLE",
    "DS&T",
    "CIA",
    "OGC/Litigation Division",
    "Confidentiality",
    "Recruitment",
    "Oliver Stone",
    "Nixon"
  ],
  "title": "Re: JFK Board 14 October Meeting -- Results",
  "date": "1997-10-23",
  "persons_mentioned": [
    "J. Barry Harrelson",
    "Teresa Wilcox",
    "Jose Marie Mankel",
    "Linda Cipriani",
    "Oliver Stone",
    "Thomas J. Benjamin",
    "Patricia B. Cameresi",
    "Joseph P. Hayes"
  ],
  "recipient": "J. Barry Harrelson",
  "sender": "Teresa Wilcox@ DST"
}