{
  "classification": "Personnel",
  "document_type": "Personnel File Documents",
  "security": "The file documents information about Ann L. Goodpasture's career at the CIA, including assignments, performance reviews, and medical retirement. Releasing the details of her assignments and performance could reveal sensitive operational information and potentially identify individuals she worked with, which could endanger them. The citation reads '...Miss Goodpasture served in support of the successful coup against the communist government in Guatemala in 1954 and completed tours of duty in Bombay, Monterrey and Mexico City…Mr. Scott, a stern task- master, described Miss Goodpasture over these years as “intelligent, hard- working, conscientious, versatile, valuable and unquestionably one of the most competent CI/CE officers he ever had the privilege of working with.”'",
  "security_level": "SECRET",
  "summary": "This file documents Ann L. Goodpasture's CIA career, including her disability retirement, commendations, and service record.",
  "summary_one_paragraph": "This collection of documents pertains to Ann L. Goodpasture, a long-serving CIA employee, detailing her career from 1944 to 1973. It includes a request for personnel action regarding her disability retirement effective June 30, 1973, a letter from Director W. E. Colby acknowledging her service, a memorandum noting the approval of the Career Intelligence Medal for her, and the Honor and Merit Awards Board report recommending the medal for her exceptional achievement. Goodpasture’s service included supporting the coup in Guatemala and assignments in Bombay, Monterrey, and Mexico City, with commendations for her competence and dedication.",
  "tags": [
    "CIA",
    "Personnel File",
    "Disability Retirement",
    "Career Intelligence Medal",
    "Guatemala",
    "Mexico City",
    "Bombay",
    "Ann L. Goodpasture",
    "Winfield Scott"
  ],
  "title": "Goodpasture, Ann L.",
  "date": "1973-06-28",
  "locations_mentioned": [
    "Washington, D.C.",
    "Guatemala",
    "Bombay",
    "Monterrey",
    "Mexico City",
    "Livingston, Tennessee"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Ann L. Goodpasture",
    "M. D. McCallum",
    "W. E. Colby",
    "John F. Blake",
    "R. L. Austin, Jr.",
    "Winfield Scott",
    "David A. Phillips",
    "C. H. Goodpasture"
  ],
  "recipient": "Ann L. Goodpasture",
  "sender": "M. D. McCallum, W. E. Colby, R. L. Austin, Jr., David A. Phillips"
}