{
  "classification": "Liaison",
  "document_type": "Dispatch/FBI Report",
  "security": "Several documents refer to querying liaison services for information on individuals, specifically Semen Spiridon Pohorilyj and Jozef Kozak. For example, a dispatch states, \"To Paris: We would appreciate any information available on KOZAK's current activities and contacts. You may query liaison.\" Revealing such cooperative relationships with foreign intelligence entities, if exposed, could jeopardize the trust and security of ongoing collaborations.",
  "security_level": "SECRET",
  "summary": "This file contains dispatches and FBI reports from 1962 concerning Semen Spiridon Pohorilyj and Jozef Kozak, focusing on their backgrounds, activities, and potential connections to Soviet intelligence. It includes requests to various stations for information, queries to liaison services, and details on individuals associated with the subjects.",
  "summary_one_paragraph": "This collection of documents, dated from early to late 1962, centers on CIA and FBI investigations into Semen Spiridon Pohorilyj and Jozef Kozak, with concerns about their potential links to Soviet activities. Dispatches from the Chief of Station in Paris to Chiefs in SR, WE, EE, and Vienna, detail actions such as querying liaison contacts, tracing Kozak's background, and sharing FBI reports on interviews with individuals connected to Pohorilyj. The documents reveal collaborative efforts between the CIA and FBI to gather intelligence on these individuals, including their activities, contacts, and biographical information, with specific instructions to query liaison services for further details.",
  "tags": [
    "Semen Spiridon Pohorilyj",
    "Jozef Kozak",
    "CIA",
    "FBI",
    "Liaison",
    "Soviet Intelligence",
    "Counterintelligence",
    "Austria",
    "France"
  ],
  "title": "Semen Spiridon Pohorilyj and Jozef Kozak Investigation",
  "date": "1962-09-29",
  "locations_mentioned": [
    "Washington D.C.",
    "Philadelphia",
    "Paris",
    "Vienna",
    "Szrdoriben, USSR",
    "La Seine, France",
    "Salzburg, Austria",
    "Czerkassy, Kiev",
    "Praenyal, Poland",
    "Didkowitscze, Ukraine",
    "Russia",
    "Poland",
    "Kostppol, Ukraine"
  ],
  "origin_agency": "CIA/FBI",
  "persons_mentioned": [
    "Semen Spiridon Pohorilyj",
    "Jozef Kozak",
    "S.J. Papich",
    "Andrij Didkowskyj",
    "Antin Mykyporuk",
    "Nikita Khrushchev",
    "Gregor Krivenko",
    "Vera Burchart",
    "Christine R. Kerbe",
    "Doris M. Killgo",
    "Paul K. Stockwood",
    "Mortimer F. Bingham",
    "Wira Sergel"
  ],
  "recipient": "Chief of Station, Paris; Chiefs SR, WE, EE, and Vienna; Director, FBI",
  "sender": "Chief, SR; Chief, EE; Chief, WE; Deputy Director (Plans)"
}