{
  "classification": "Intelligence",
  "document_type": "Checklist",
  "security": "These checklists contain updates on South Vietnam’s internal affairs, indicating growing tensions between civilian politicians, the military, and General Ton That Dinh: “There are…signs of dissension…the able but opportunistic General Ton That Dinh…seems bent on developing his own independent base of power. He is a man to watch.” Information could expose political instability in Vietnam.",
  "security_level": "TOP SECRET",
  "summary": "A series of President's Intelligence Checklists from November 21-23, 1963, covering global intelligence including political instability in Iraq and South Vietnam, Soviet missile capabilities, US-Cuba relations, terrorist actions in Venezuela, and Soviet activity in Berlin.",
  "summary_one_paragraph": "These are three issues of the President’s Intelligence Checklist, a report created by the CIA, covering the period of November 21 to November 23, 1963. The reports contain time-sensitive intelligence on various global hotspots and topics, including the new Iraqi cabinet, conciliatory statements from Indonesia regarding Malaysia, political issues in the Congo, the intended withdrawal of Ethiopian troops, the political stalemate in Yemen, and political changes in Turkey. Notes cover the crash of a U-2 plane over Cuba, Soviet actions in Berlin, and a variety of other issues, including US aid, Soviet missile tests, and potential conflicts in the World Peace Council.",
  "tags": [
    "CIA",
    "President's Intelligence Checklist",
    "Iraq",
    "Indonesia",
    "Congo",
    "Ethiopia",
    "Yemen",
    "Turkey",
    "Cuba",
    "Berlin",
    "Albania",
    "USSR",
    "Iran",
    "Venezuela",
    "South Vietnam",
    "France",
    "Israel",
    "Egypt",
    "Bolivia",
    "Cambodia"
  ],
  "title": "The President's Intelligence Checklist",
  "date": "1963-11-22",
  "locations_mentioned": [
    "Iraq",
    "Indonesia",
    "Congo",
    "Ethiopia",
    "Yemen",
    "Turkey",
    "Cuba",
    "Berlin",
    "Albania",
    "USSR",
    "Iran",
    "Venezuela",
    "South Vietnam",
    "France",
    "Israel",
    "Egypt",
    "Bolivia",
    "Cambodia",
    "Japan",
    "Czechoslovakia",
    "Mali"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Sukarno",
    "Nasution",
    "Adoula",
    "Haile Selassie",
    "Faysal",
    "Inonu",
    "Khrushchev",
    "Brezhnev",
    "Ikeda",
    "Sihanouk",
    "Arif",
    "Nasir",
    "Betancourt",
    "Paz",
    "Lechin",
    "Diem",
    "Ton That Dinh"
  ]
}