{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "Disclosing the proprietary relationships and methods of communication between WH/Miami, MIMUTUAL, McKERCHER and AVANT, and NORTHWEST MANAGEMENT SERVICES, INC. could compromise ongoing operations. Quoting: 'Among other duties performed by the proprietary are the monthly checks sent to the dependents of imprisoned assets which are signed in true name by PAULA...EVANS feels secure as far as (NORTHWEST MANAGEMENT) and (MCKERCHER and AVANT) are concerned. (EVANS) mentioned that the bona fide law firm occupying the other portion of the (MHMUTUAL) offices are the attorneys for (John DEAN. (These lawyers are cleared and witting.)'",
  "security_level": "SECRET",
  "summary": "A memo regarding a media inquiry made to Cuban exile journalist Rene VIERA Gonzalez about Cuban involvement in the Watergate case and attitudes in Miami, including details about various individuals and proprietary connections.",
  "summary_one_paragraph": "This memorandum, dated 7 May 1973, addresses a media inquiry made to Rene VIERA Gonzalez, a Cuban exile journalist in Miami, by someone believed to be Sanford GOTTLIEB, regarding Cuban involvement in the Watergate case and related sentiments in the Miami area. GOTTLIEB's questions concerned the activities of individuals like Reinaldo PICO, Orlando PIEDRA, Rolando MASFERRER, Joaquin SANJENIS Perdome, Juan A. PAULA, and Edgardo BUTTARI, and their potential links to the case. The memo details various connections, including PAULA's employment by an OGC proprietary, proprietary relationships between WH/Miami and MIMUTUAL, and the utilization of firms like McKERCHER and AVANT and NORTHWEST MANAGEMENT SERVICES, INC.",
  "tags": [
    "CIA",
    "Cuban Exile",
    "Miami",
    "Watergate",
    "Media Inquiry",
    "Proprietary",
    "Rene VIERA Gonzalez",
    "Sanford GOTTLIEB",
    "Reinaldo PICO",
    "Orlando PIEDRA",
    "Rolando MASFERRER",
    "Joaquin SANJENIS Perdome",
    "Juan A. PAULA",
    "Edgardo BUTTARI",
    "Charles \"Bebe\" Rebozo"
  ],
  "title": "Media Inquiry to Cuban Exile Journalist in Miami re Cuban Involvement in Watergate Case and Attitudes in Miami Area",
  "date": "1973-05-07",
  "locations_mentioned": [
    "Miami",
    "Washington",
    "Kensington, MD",
    "West Tampa, Florida",
    "Venezuela",
    "Nassau",
    "Japan",
    "Europe"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Rene VIERA Gonzalez",
    "Sanford GOTTLIEB",
    "Reinaldo PICO",
    "Orlando PIEDRA",
    "Rolando MASFERRER",
    "Joaquin SANJENIS Perdome",
    "Juan A. PAULA",
    "Edgardo BUTTARI",
    "Charles \"Bebe\" Rebozo",
    "Ernesto BETANCOURT",
    "Marvin L. EVANS",
    "Antonio Felix GENOVA Corzo",
    "John Dean",
    "Howard Hunt",
    "James E. Flannery"
  ],
  "recipient": "Deputy Director for Operations",
  "sender": "James E. Flannery, Acting Chief, Western Hemisphere Division"
}