{
  "classification": "Security",
  "document_type": "Report",
  "security": "This document reveals sensitive operational contacts with Robert Maheu, including his involvement in projects related to Fidel Castro, President Sukarno, and King Hussein. It also mentions a wiretapping incident and potential leaks of information, which could damage the CIA's reputation. Quoting directly: 'In August of 1960 Mr. Richard Bissell approached the then Director of Security, Colonel Sheffield Edwards, to determine if the Office of Security had any assets that might assist in a sensitive mission requiring gangster-type action. The mission target was Fidel Castro.' and 'In 1966 information was received by the Agency indicating that the Senate Administrative Practices Subcommittee, under the chairmanship of Senator Edward V. Long, had advised Maheu that his testimony was desired concerning his relationship with Onassis, Savros Niarchos, Sam Giancana and ...The Subcommittee interest was invasion of privacy and particularly the use of audio devices by private investigators.'",
  "security_level": "UNCLASSIFIED",
  "summary": "This document outlines the background and activities of Robert A. Maheu, a CIA asset involved in various sensitive operations, including those related to Fidel Castro, President Sukarno, and King Hussein, as well as a wiretapping incident and potential information leaks.",
  "summary_one_paragraph": "This report details the CIA's relationship with Robert A. Maheu, a key asset recruited in 1954 for covert operations. It covers Maheu's background, including his previous FBI employment and a bankruptcy, his recruitment by the Office of Security, and his involvement in projects such as investigating Aristotle Onassis, procuring female companionship for King Hussein, and participating in a plot to assassinate Fidel Castro with the help of Johnny Roselli and Sam Giancana. The report also touches on Maheu's alleged involvement in a Mann Act violation, a planned film to discredit President Sukarno, and a Senate investigation into his activities, ultimately leading to the termination of his clearances in 1971.",
  "tags": [
    "Robert Maheu",
    "CIA",
    "Covert Operations",
    "Fidel Castro",
    "King Hussein",
    "Sukarno",
    "Johnny Roselli",
    "Sam Giancana",
    "Wiretapping",
    "LPHIDDEN",
    "TWIXT",
    "HARPSTAR",
    "Roselli Matter",
    "FOIA"
  ],
  "title": "Robert A. Maheu",
  "persons_mentioned": [
    "Robert A. Maheu",
    "Robert H. Cunningham",
    "Carmine S. Bellino",
    "Aristotle Onassis",
    "Stavros Niarchus",
    "Harold Stassen",
    "Scott McLeod",
    "Joan Foster Dulles",
    "J. Edgar Hoover",
    "Vice President Nixon",
    "President Sukarno",
    "Al Ulmer",
    "Samuel Halpern",
    "Edward Bennett Williams",
    "James O'Connell",
    "Joseph Smith",
    "Elizabeth Hogarth (Elizabeth Harter)",
    "Hugh Tovar",
    "Richard M. Bissell",
    "Edward V. Long",
    "Michael G. Merhige",
    "Peter Robert Maheu",
    "King Hussein",
    "Norman Paul",
    "Fred Larrash",
    "William Aras",
    "Sheffield Edwards",
    "J. C. King",
    "Johnny Roselli",
    "Sam Gold (Momo Salvatore Giancana)",
    "Santos Trafficant",
    "Juan Orta",
    "Anthony Verona",
    "William Harvey",
    "Ed Morgan",
    "Thomas Waddin",
    "Helms",
    "Jack Anderson",
    "Paul Evans",
    "James R. Phelan",
    "Wallace Turner",
    "Carl Duckett",
    "Robert Kennedy"
  ],
  "recipient": "DCI",
  "sender": "Director of Security (Office of Security)"
}