{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "The memo discusses the reconsideration of releasing the location of Warrenton, VA as the CIA Record Center, which could expose sensitive information about the Agency's facilities. Additionally, it refers to a CIA employee being under \"integrated State cover,\" the release of which could compromise intelligence operations and damage relations with the State Department. Quoting directly: \"some Board members consider CIA use of state cover as an 'open secret' and are inclined to release.\"",
  "security_level": "SECRET",
  "summary": "This memo outlines CIA issues for the upcoming ARRB meeting on November 17, 1997, including the release of the CIA Record Center location, the opening date of the Nosenko NBR material, the release of information on CIA employees under State cover, and the handling of Cuban Revolutionary Council (CRC) financial records.",
  "summary_one_paragraph": "This memorandum from J. Barry Harrelson, JFK Project Officer, to John Pereira, Fred Wickham, Lee Strickland, Kathryn Dyer, and Linda Cipriani, dated November 5, 1997, details CIA items to be discussed at the November 17 ARRB meeting. Key issues include reconsidering the release of Warrenton, VA as the CIA Record Center location, the proposed advancement of the Nosenko NBR material release date to 2010, the potential release of information regarding CIA employees under \"integrated State cover\", and the handling of Cuban Revolutionary Council (CRC) financial records. The memo requests feedback on the CRC records and advises on the deadline for informing the ARRB staff about briefing plans.",
  "tags": [
    "CIA",
    "ARRB",
    "JFK Act",
    "Nosenko",
    "State Cover",
    "Cuban Revolutionary Council",
    "Warrenton",
    "FOIA"
  ],
  "title": "17 November JFK Board Meeting-- CIA issues (update)",
  "date": "1997-11-05",
  "locations_mentioned": [
    "Warrenton, VA"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "John Pereira",
    "Fred Wickham",
    "Lee Strickland",
    "Kathryn Dyer",
    "Linda Cipriani",
    "J. Barry Harrelson",
    "Eileen Wukitch",
    "Becky Rant",
    "Chairman Tunheim",
    "Nosenko"
  ],
  "recipient": "John Pereira, Fred Wickham, Lee Strickland, Kathryn Dyer, Linda Cipriani",
  "sender": "J. Barry Harrelson"
}