{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "This dispatch details operational plans for penetrating and potentially disrupting anti-Castro groups, including the use of double agents and informants. It directly names individuals and organizations involved in these activities.  Revealing these details could compromise ongoing operations, endanger sources, and damage relationships with involved parties. Specifically, the dispatch mentions 'G-2 Penetration Action Against AMSPELL Organization and \"Other Groups\" in PBRUMEN' and details specific interactions and intelligence gathered from sources like QUANTUM-51 and AMHINT-33. Sharing this information could expose these individuals and their roles, leading to potential retaliation or operational failure.",
  "security_level": "SECRET",
  "summary": "This dispatch outlines an operational plan to penetrate and disrupt anti-Castro groups in PBRUMEN using G-2 agents and informants, focusing on the AMSPELL organization and other related groups.",
  "summary_one_paragraph": "This secret dispatch from January 1963 details an operation (GYROSE/KUDESK/KUWOLF) by Task Force W and JMWAVE to penetrate anti-Castro groups, specifically the AMSPELL organization, within PBRUMEN. It reports on information from AMHINT-27 and QUANTUM-51, who identified Jorge MEDINA Bringuier and AEDO as G-2 agents tasked with infiltrating and dismantling AMSPELL. The dispatch also covers AMHINT-33's activities and contacts, including concerns about G-2 infiltration within anti-Castro movements, and mentions potential targets like the MRR, MRP, MDC, and the 30th of November Groups. JMWAVE is tasked with additional investigation and security review based on the information provided.",
  "tags": [
    "CIA",
    "Task Force W",
    "JMWAVE",
    "GYROSE",
    "KUDESK",
    "KUWOLF",
    "AMSPELL",
    "PBRUMEN",
    "G-2",
    "Counterintelligence",
    "Cuba",
    "Castro",
    "Infiltration",
    "QUANTUM-51",
    "AMHINT-33",
    "MRR",
    "MRP",
    "MDC"
  ],
  "title": "Operational GYROSE/KUDESK/KUWOLF, G-2 Penetration Action Against AMSPELL Organization and Other Groups in PBRUMEN",
  "date": "1963-01-22",
  "locations_mentioned": [
    "New York City",
    "PBRUMEN",
    "JMWAVE area",
    "Uruguayan Embassy",
    "Mexico City",
    "Las Villas Province",
    "New Orleans",
    "Cuba",
    "Spain",
    "Italy"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Jorge MEDINA Bringuier",
    "AEDO",
    "AMRINT-53",
    "Iden A",
    "Chelin",
    "AMFRET-7",
    "QUANTUM-55",
    "Blanca MARTINEZ de Hoya",
    "Cuca",
    "Cuchi",
    "AMHINT-33",
    "REBELLON",
    "Inu",
    "Eduardo BRINGAS",
    "GOUMI",
    "Carlos PRADO",
    "Raul",
    "AMSTRUT-1",
    "Maria Teresa MEDINA",
    "Consuelo C. de RIVAS",
    "Faustino PRADO Garcia",
    "Che GUEVARA",
    "Clara ARTIME",
    "Josefina ARTIME",
    "AMGLEN-9",
    "AMSTRUT-2",
    "Angel Prado",
    "Mongo",
    "Hipolito LAZARO",
    "Jorge HAEDO",
    "AMCOG-3"
  ],
  "recipient": "Chief of Station, JMWAVE",
  "sender": "Chief, Task Force W"
}