{
  "classification": "Cuba",
  "document_type": "Document Extract/Outgoing Message",
  "security": "Revealing the identities of CIA agents and informants, as well as their operational roles and locations, poses a significant risk to their safety and the integrity of ongoing intelligence operations. The document explicitly names individuals like 'JOHN VALDAVIAN, a CIA operator in the area of LA FLURIDA' and 'ANSELMO ALLIEGRO...a CIA agent-informant in MIAMI,' alongside details of their activities. This information, if exposed, could lead to targeting of these individuals by hostile entities, disrupt intelligence gathering, and deter potential future cooperation with the CIA. The exposure of the \"HY FLOWER\" building as a safehouse could also jeopardize future operations.",
  "security_level": "SECRET",
  "summary": "This document contains extracted information and outgoing messages related to Rolando Masferrer, a former Cuban senator, including allegations of CIA involvement in his assassination and investigations into his possible connections with other individuals and activities in the Cuban exile community.",
  "summary_one_paragraph": "This document includes extracts from a 201 file on Rolando Masferrer, a former Cuban senator and newspaper publisher, revealing allegations of his involvement in a training camp in the Florida Everglades in 1974. It details CIA communications from April and December 1975, referencing a Prensa Latina story accusing the CIA of murdering anti-Castro leaders, with specific claims from Manuel de Armas about 'Operation Abdala' and CIA officers involved, including a supposed plot to rupture relations between Venezuela and Cuba using Fred Duncan and Dough Phillips. The outgoing messages discuss efforts to investigate Masferrer's possible relationship to Alberto del Rio Aguilera and the bombing of the Cuban ambassador's auto, also noting FBI traces were negative and directing checks within the Cuban community.",
  "tags": [
    "CIA",
    "Rolando Masferrer",
    "Cuba",
    "Assassination",
    "Operation Abdala",
    "Manuel de Armas",
    "Fred Duncan",
    "Dough Phillips",
    "Alberto del Rio Aguilera",
    "Cuban Exile",
    "Venezuela",
    "FBI"
  ],
  "title": "MASFERREX, Y ROJAS, ROLANDO",
  "date": "1976-04-22",
  "locations_mentioned": [
    "Florida Everglades",
    "Miami, Florida",
    "New York",
    "McLean, Virginia",
    "Puerto Rico",
    "Caracas, Venezuela",
    "Cuba",
    "Santo Domingo",
    "Mexico City"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Rolando Masferrer",
    "Manuel de Armas",
    "Richard Tomley",
    "Juan de Dios",
    "Orlando Bosch",
    "Jose de la Torriente",
    "Robert Bud Miles",
    "Lazard Averee",
    "Alberto Tur",
    "Fred Duncan",
    "Dough Phillips",
    "John Valdavian",
    "Luis Cesa Soto",
    "Anselmo Allegro",
    "Justo Alfonso",
    "Ricardo Morales Navarrete",
    "Armand Aules",
    "Antonio de Leon",
    "Henry S. Pachankis",
    "Alberto del Rio Aguilera",
    "Bill Waghefelf",
    "PJ McNamara"
  ],
  "recipient": "DIRECTOR, MIAMI, MEXICO CITY, ASUNCION, CARACAS, PANAMA CITY"
}