{
  "classification": "Liaison",
  "document_type": "Collection of Teletype, Memoranda, Airtel, and Press Release",
  "security": "These documents reveal internal FBI and CIA coordination and information sharing, including sources and methods. Specifically, the memorandum regarding the Committee to Investigate Assassinations notes CIA concerns over ex-employees’ appearances and their agency’s coverage of the conference, promising to share data developed, revealing the intelligence-gathering activities of the CIA. Disclosing these practices and sources could compromise ongoing intelligence operations and damage relationships with sources and other agencies.",
  "security_level": "Multiple (SECRET, Unspecified)",
  "summary": "This collection of documents from April 1968 to November 1973 includes FBI teletypes and memoranda, along with a CIA press release, related to investigations into the assassinations of Martin Luther King Jr. and President John F. Kennedy. The documents cover various leads, potential suspects, and the monitoring of individuals and groups critical of the FBI and CIA.",
  "summary_one_paragraph": "This collection comprises a teletype and several memoranda and press release, spanning from April 1968 to November 1973, detailing the FBI and CIA's investigative activities surrounding the assassinations of Martin Luther King Jr. and President Kennedy. The material includes urgent requests for verifying allegations related to King’s assassination, information on potential suspects such as Hernan Henriquez Lora and Gerald Lee Richards, and CIA’s concerns about the Committee to Investigate Assassinations. Additionally, it contains information on currency possibly linked to the Communist Party of Colombia and the monitoring of outspoken critics of the FBI, such as those participating in a conference at Georgetown University.",
  "tags": [
    "FBI",
    "CIA",
    "Martin Luther King Jr.",
    "John F. Kennedy",
    "Assassination",
    "Hernan Henriquez Lora",
    "Gerald Lee Richards",
    "Committee to Investigate Assassinations",
    "Communist Party of Colombia",
    "Surveillance",
    "Wiretap"
  ],
  "title": "Assassination Investigations and Related Information",
  "persons_mentioned": [
    "Martin Luther King Jr.",
    "Hernan Henriquez Lora",
    "H. Rap Brown",
    "Stokely Carmichael",
    "Gerald Lee Richards",
    "Tom Wolman",
    "Douglas Harry Hulbard",
    "Eric Starvo Galt",
    "Joe Musgaque",
    "James Earl Ray",
    "John F. Kennedy",
    "William Turner",
    "Fred Cook",
    "Mark Lane",
    "Harold Weisberg",
    "Victor Marchetti",
    "George O'Toole",
    "Klaus Steer",
    "Norman Mailer",
    "Bernard Fensterwald Jr."
  ],
  "recipient": "LEGAT Santo Domingo, Mr. D. J. Brennan Jr., Mr. W. C. Sullivan, SAC Washington Field",
  "sender": "Director FBI, J. A. Sizoo, S. J. Papich, W. A. Branigan, Committee to Investigate Assassinations (Press Release by Andrea Wyatt) Executive Director Bernard Fensterwald Jr. and Research Director Robert Smith and Counsel James Lesar, and conference coordinator Andrea Wyatt . . . . Note that they list Sylvanus Olympio Abdul Karim Kassem Medgar Evers Ngo Dinh Diem Jigme Dorji Acib Al Shishakli Pierre Ngendandumwe Hassan Ali Mansour Malcolm X Viola Liuzzo Mario Mendez Montenegro Sit Abubakar Balewa J.T.V. Ironsi Aguiyi Hendrik Verwoerd Tran Van Van George Lincoln Rockwell Che Guevara Martin Luther King Rosep F Kennedy Eduardo Mondlane 10M Mboya. A.A. Shermarke Ceorge Wallace Salvadore Allen. . .   and others as people in their conference ad materials . . . . . Note that the listing of these people doesn't imply they were necessarily part of any group or part of the conspiracy . .  but rather that the committee to investigate assassinations and some others viewed them as victims of assassinations as is apparent from their ad materials . . .   and their program which is detailed on the other ad material . . . . . . . . . . . . .. . . . . . . . . .   and also they say the last presidential elections have been decided by bullets 1961 result decided by the assassination of President John F. Kennedy 1968 result decided by the assassination of Senator Robert F. Kennedy 1972 result decided by the near assassination of Governor Gesige Wallace . . . . . . . . .  ..  Note their comments don't imply Senator Robert Kennedy or Governor Gesige Wallace are part of any conspiracy either."
}