{
  "classification": "Operations",
  "document_type": "Report",
  "security": "Revealing the identities of KUBARK staffers and agents involved in the AMLASH operation, such as STOCKFOOD, GLOADEN, RODANER, UNSHAFU/5, UNSHAFU/9, and others, could compromise their safety and ongoing intelligence activities. The document states, 'It was also apparent by the time ANLASH/1 left that he knew UNSHAFU/5 was working for KUBARK and we knew that UNSHAFU/5 was aware to some extent of ANLASH/1's plans'.",
  "security_level": "UNCLASSIFIED",
  "summary": "This report details the Paris Station's involvement with AMLASH/1 from 1962 to 1965, including recruitment, training in explosives, contacts with various KUBARK assets, and meetings related to a plan to assassinate AMPED, with mentions of ONTRICH's involvement and DAI HOID's participation to seek ODYOKE's blessing.",
  "summary_one_paragraph": "This document outlines Paris Station's interactions with AMLASH/1 from 1962 to 1965, beginning with his contact by UNRUMBLE/? at the Helsinki Youth Festival and subsequent recruitment. AMLASH/1 received explosives training, maintained contact with Peter J. KIMINGHAM, and later connected with AMBFORT/1 (QUEFORT) and the Headquarters TYPIC officer, ONTRICH, to discuss plans for assassinating AMPED. These discussions involved DAI HOID to obtain ODYOKE approval. Subsequent meetings in Paris involved KUBARK staffers STOCKFOOD, GLOADEN, and RODANER, and agents UNSHAFU/5 and UNSHAFU/13, revealing ANLASH/1's awareness of UNSHAFU/5's KUBARK affiliation and ANLASH/1’s role in UNSHAFU/5's hospitalization after a breakdown.",
  "tags": [
    "AMLASH/1",
    "Paris Station",
    "KUBARK",
    "Assassination Plot",
    "AMPED",
    "ODYOKE",
    "UNSHAFU/5",
    "STOCKFOOD",
    "GLOADEN",
    "RODANER",
    "Peter J. KIMINGHAM",
    "ONTRICH",
    "DAI HOID"
  ],
  "title": "AMLASH/1 - Paris Station Aspect",
  "date": "1966-03-07",
  "locations_mentioned": [
    "Paris",
    "Helsinki",
    "PERUM",
    "Porto Alegre, Brasil",
    "Madrid"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "AMLASH/1",
    "UNRUMBLE/?",
    "Peter J. KIMINGHAM",
    "OHMX",
    "AMBFORT/1 (QUEFORT)",
    "AMHIP/1",
    "ONTRICH (F)",
    "AMPED",
    "DAI HOID",
    "STOCKFOOD",
    "ASHIP/1",
    "UNSHAFU/5",
    "UNSHAFU/9",
    "UNSHAFU/13",
    "GLOADEN",
    "RODANER",
    "ANBIDDY/2",
    "ANBANG/1",
    "ANLASH/2",
    "ANLASH/3",
    "Wallace A. GROWERY",
    "Dr. Lipsich"
  ],
  "recipient": "Unknown",
  "sender": "Peter N. GLOADEN"
}