{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Memorandum",
  "security": "Revealing that DALZELL had contact with the Addis Ababa station and is of interest due to the Garrison investigation could expose intelligence interests and potentially compromise sources or methods. The memo requests traces but cautions against field traces outside the station, indicating a concern for operational security.",
  "security_level": "SECRET",
  "summary": "A memorandum from Richard H. Long to DC/CI/R&A regarding William Wayne DALZELL, stating that Addis Ababa Station has no traces on the subject and desk traces reveal no new information beyond his existing 201 file. A second memo, initiating the trace request, indicates DALZELL is of interest due to the Garrison investigation and had contact with the Addis Ababa station in 1956.",
  "summary_one_paragraph": "This document comprises two memoranda concerning William Wayne DALZELL. The first memo, dated 27 June 1968, from Donovan E. Pratt (DC/CI/R&A) to C/AF/6 requests desk and station traces on DALZELL, noting his connection to the Garrison investigation and his 1956 contact with the Addis Ababa station. The second memo, dated 5 July 1968, from Richard H. Long (AC/AP/6) responds to the trace request, reporting that Addis Ababa Station files contain no traces on DALZELL and desk traces provide no additional information beyond his existing 201 file, also cautioning against field traces outside the station.",
  "tags": [
    "William Wayne DALZELL",
    "Garrison Investigation",
    "Addis Ababa Station",
    "CIA",
    "Traces",
    "FOIA"
  ],
  "title": "William Wayne DALZELL (201-126265)",
  "date": "1968-07-05",
  "locations_mentioned": [
    "Addis Ababa",
    "Ethiopia"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "William Wayne DALZELL",
    "Richard H. Long",
    "Donovan E. Pratt",
    "Jim Garrison"
  ],
  "recipient": "DC/CI/R&A",
  "sender": "Richard H. Long"
}