{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "Several cables concern Frank Sturgis's involvement in activities against the Cuban and Angolan governments, his contacts with Cuban exiles, and alleged plans to establish a Cuban government in exile. For example, one cable notes Sturgis's discussions about establishing a Cuban government in exile on Angolan soil with the help of Holden Roberto. Revealing these activities could compromise ongoing intelligence operations, expose sources providing information, and damage relationships with other countries.",
  "security_level": "SECRET",
  "summary": "These documents relate to Frank Sturgis' activities, including alleged plots against Fidel Castro and the Angolan government, his connections with Cuban exile groups, and his interactions with U.S. government agencies and media figures.",
  "summary_one_paragraph": "This collection of documents, primarily cables and memoranda from the CIA and FBI, covers Frank Sturgis' activities from the early 1970s through 1977. The documents detail Sturgis' alleged involvement in anti-Castro activities, including a supposed plot to poison Fidel Castro with Marita Lorenz, and his efforts to organize Cuban exiles against the Cuban government. They also discuss his purported plans to establish a Cuban government in exile in Angola, his contacts with various individuals and groups, and his interactions with U.S. government agencies and media figures such as Jack Anderson and Senator Howard Baker. The documents further highlight Sturgis' attempts to provide information to the CIA and FBI and his concerns about being identified as a police informant.",
  "tags": [
    "Frank Sturgis",
    "Fidel Castro",
    "Cuban Exiles",
    "Angola",
    "CIA",
    "FBI",
    "Marita Lorenz",
    "Jack Anderson",
    "Holden Roberto",
    "Cryptographic Material"
  ],
  "title": "STURGIS, Frank Anthony JAN 69 - 201-24225 VOL.V",
  "persons_mentioned": [
    "Frank Sturgis",
    "Fidel Castro",
    "Marita Lorenz",
    "Jack Anderson",
    "Holden Roberto",
    "Robert Morgan",
    "Gary Van Dyk",
    "Daniel Gipenda",
    "Victor Fernandez",
    "Mobutu",
    "Howard Baker"
  ],
  "recipient": "DCD/HEAD QUARTERS",
  "sender": "DCD/MIAMI"
}