{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "The document details actions taken by the CIA and other U.S. government entities to counteract Cuban subversion in Latin America. Disclosing specific intelligence-gathering methods (such as surveillance of Cuban flights, clandestine collection of information), could harm ongoing operations and compromise relationships with foreign governments. Quoting directly, the document reveals activities such as 'Developed highly useful information on frequency of Cuban \"chartered\" flights to Brazil, names and nationalities of passengers and crew, and lax measures of control followed by Brazilian authorities' and 'Maintained close watch over travel to and from Cuba.' These details could allow hostile entities to deduce sources and methods, potentially undermining future intelligence efforts.",
  "security_level": "SECRET",
  "summary": "A report from September 1963 summarizes actions taken by the U.S. government, including the CIA, Department of State, Department of Defense, and USIA, to combat Castro-Communist subversion in Latin America during July and August. It details efforts to control travel to and from Cuba, movement of Cuban propaganda and guerrillas, transfer of funds, and to strengthen counter-insurgency capabilities.",
  "summary_one_paragraph": "This memorandum, dated September 30, 1963, reports on the activities undertaken by a Subcommittee on Cuban Subversion to counteract Castro-Communist influence in the Western Hemisphere during July and August. The report details the actions of the CIA, Department of State, Department of Defense, and USIA in controlling travel to and from Cuba, suppressing Cuban propaganda, monitoring guerrilla movements, restricting fund transfers, and enhancing counter-insurgency capabilities, including military communications and training. Specific efforts include urging foreign governments to restrict travel to Cuba, monitoring Cuban flights, and providing intelligence to local security organizations, with varying degrees of cooperation from countries like Brazil and those in Central America.",
  "tags": [
    "JFK Assassination",
    "Cuban Subversion",
    "CIA",
    "Department of State",
    "Department of Defense",
    "USIA",
    "Latin America",
    "Castro",
    "Communism",
    "Guerrilla Warfare",
    "Propaganda",
    "Travel Restrictions",
    "Counter-Insurgency"
  ],
  "title": "Report for July - August on Actions Taken to Combat Castro-Communist Subversion",
  "date": "1963-09-30",
  "locations_mentioned": [
    "Cuba",
    "Brazil",
    "Argentina",
    "Havana",
    "Chile",
    "Santiago",
    "Costa Rica",
    "Mexico City",
    "Vera Cruz",
    "Conakry",
    "Guinea",
    "Rio de Janeiro",
    "Cayman Islands",
    "Curacao",
    "The Hague",
    "Ottawa",
    "Montreal",
    "Georgetown",
    "British Guiana",
    "London",
    "Mexico",
    "Canada",
    "Jamaica",
    "Netherlands",
    "Port of Spain",
    "Barbados",
    "Chile",
    "Nicaragua",
    "Tegucigalpa",
    "Honduras",
    "Colombia",
    "Ecuador",
    "Panama Canal Zone",
    "Central America",
    "Peru",
    "Puerto Maldonado",
    "Guatemala",
    "La Paz",
    "Bolivia",
    "Soviet Union",
    "Miami"
  ],
  "origin_agency": "DOS",
  "persons_mentioned": [
    "Castro",
    "Mr. Wheeler",
    "Col. Haig",
    "Mr. Vagley",
    "Mr. Mort",
    "Mr. Geoghegpa",
    "Lur Herina Hernandes Salaser",
    "Carios Cullion",
    "Fidel Castro",
    "Che Guevara",
    "Adolfo Carcia Zorberena",
    "Alberto Sorroco",
    "Hector Logentes Jacks",
    "Chedei Jagma",
    "Mohammed Eassin",
    "Raul Roa Kouri",
    "Francisco Julião",
    "Villalon",
    "John William Cooke",
    "Schick (President of Nicaragua)",
    "Adam Watson",
    "Richard Phillips",
    "Camilo Cienfuegos",
    "Mao Tse-tung"
  ],
  "recipient": "Members of Subcommittee on Castro-Communist Subversion",
  "sender": "Chairman, Subcommittee on Cuban Subversion"
}