{
  "classification": "Internal Security",
  "document_type": "Memorandum",
  "security": "These documents reveal FBI methods, such as telephone surveillances, used to gather intelligence on domestic political organizations. Specific details on surveillance targets and the types of information sought, such as ‘plans for racial violence,’ ‘connections with the Black Panther Party and Puerto Rican independence groups,’ and 'whereabouts of Weatherman members', could compromise future investigations and intelligence gathering efforts. Also, the Attorney General's approval is also sought, possibly exposing legal oversight and compliance procedures that are meant to maintain legal integrity and oversight of such investigations.",
  "security_level": "SECRET",
  "summary": "This collection of FBI memoranda to the Attorney General details requests for authorization of telephone surveillances on various domestic organizations including the Black Panther Party, Students for a Democratic Society (SDS), and the Young Lords. The memos outline the justification for each surveillance based on alleged extremist activities and potential threats to national security.",
  "summary_one_paragraph": "This collection of FBI memoranda, primarily addressed to the Attorney General, spans from 1965 to 1971 and details requests for authorization to conduct telephone surveillances on various domestic organizations labeled as threats to internal security. These organizations include the Black Panther Party (BPP), Students for a Democratic Society (SDS) and its Weatherman faction, and the Young Lords. Justifications for these surveillances range from preventing potential acts of violence and sabotage to gathering intelligence on organizational structures, member activities, and connections with other groups deemed subversive. The documents highlight the FBI's concerns over revolutionary actions, anti-government sentiments, and potential criminal violations associated with these groups, leading to the approval of surveillance operations aimed at monitoring their activities and disrupting their operations.",
  "tags": [
    "FBI",
    "COINTELPRO",
    "Black Panther Party",
    "Students for a Democratic Society",
    "Young Lords",
    "Telephone Surveillance",
    "Internal Security",
    "New Left",
    "Extremism",
    "Attorney General",
    "Hoover"
  ],
  "title": "Memoranda Regarding Black Panther Party, Students for a Democratic Society, and Young Lords Organization",
  "date": "1969-03-20",
  "locations_mentioned": [
    "Berkeley, California",
    "Los Angeles, California",
    "New York City, New York",
    "Eugene, Oregon",
    "Fresno, California",
    "Watts, Los Angeles, California",
    "Syracuse, New York",
    "Harrisburg, Pennsylvania",
    "Columbus, Ohio",
    "Bronx, New York",
    "Chicago, Illinois",
    "Detroit, Michigan",
    "Buffalo, New York",
    "Brooklyn, New York",
    "Washington, D.C.",
    "Ann Arbor, Michigan",
    "Princeton, New Jersey",
    "Cambridge, Massachusetts",
    "Newark, New Jersey",
    "Algiers, Algeria",
    "Oakland, California",
    "Cuba",
    "China",
    "Puerto Rico"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "J. Edgar Hoover",
    "Bobby George Seale",
    "Joudan Ford",
    "Mark Rudd",
    "Theodore Gold",
    "Diana Oughton",
    "Cathlyn Wilkerson",
    "William Ayers",
    "Dianne Donghi",
    "Naomi Jaffe Safier",
    "Oliver Fein",
    "Kathie Boudin",
    "Michael Klonsky",
    "Eldridge Cleaver",
    "Huey P. Newton",
    "Michael Tabor",
    "Connie Matthews Tabor",
    "Richard Moore",
    "Edward Joseph",
    "Ronald Morris",
    "Mitchell (Attorney General)"
  ],
  "recipient": "Attorney General",
  "sender": "John Edgar Hoover"
}