{
  "classification": "House Select Committee on Assassinations (HSCA)",
  "document_type": "Teletype/Memoranda",
  "security": "Several items within this document request information about FBI informants and their activities, as well as about ongoing investigations. Revealing these details could compromise sources, disrupt investigative efforts, and damage relationships with cooperating agencies and individuals. For instance, the document states, “SL 1495-E (former) (Bureau file 134-19686) was operated from January, 1970, to approximately September, 1971, primarily targeted against White Hate Groups.” and that the HSCA wants to interview him.",
  "security_level": "CONFIDENTIAL",
  "summary": "This document contains various communications between the FBI, its field offices (St. Louis, Chicago, New Orleans, Memphis, London), and the House Select Committee on Assassinations (HSCA) regarding investigations into the assassinations of Martin Luther King Jr. and John F. Kennedy, including requests for files, informant information, and agent photographs.",
  "summary_one_paragraph": "This collection of documents dated from January to February 1978, consists of teletypes and memoranda exchanged between the FBI headquarters, various field offices (St. Louis, Chicago, New Orleans, Memphis, and London), and the House Select Committee on Assassinations (HSCA). It details requests from the HSCA for FBI files and informant information related to the Martin Luther King Jr. assassination, specifically focusing on the \"MURKIN\" investigation, COINTELPRO activities, and the role of informant SL 1495-E in gathering information on white hate groups. The documents also include requests for photographs of Atlanta agents assigned to King’s security detail, and extended access to files. There is also a request about the London Metropolitan Police and James Earl Ray.",
  "tags": [
    "FBI",
    "House Select Committee on Assassinations (HSCA)",
    "Martin Luther King Jr. Assassination",
    "John F. Kennedy Assassination",
    "COINTELPRO",
    "Informants",
    "James Earl Ray",
    "Jerry Ray",
    "National States Rights Party (NSRP)"
  ],
  "title": "House Select Committee on Assassinations (HSCA) Investigation Documents",
  "date": "1978-02-10",
  "locations_mentioned": [
    "St. Louis",
    "Chicago",
    "New Orleans",
    "Memphis",
    "London",
    "Atlanta",
    "Savannah, Georgia",
    "Florissant, Missouri"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "G. Robert Blakey",
    "Martin Luther King Jr.",
    "James Earl Ray",
    "Jerry Ray",
    "J. B. Stoner",
    "Richard Geppert",
    "Stephen M. Callender",
    "Joseph T. Sylvester Jr.",
    "Joe C. Hester",
    "Burl F. Johnson",
    "Joseph H. Kearney Jr.",
    "Howell S. Lowe",
    "Marjorie Louise Fetters",
    "Griffin B. Bell",
    "Robert L. Keuch",
    "Danny O. Coulson",
    "Michael Eberhardt",
    "Louis Stokes",
    "Richard Brewster"
  ],
  "recipient": "Director, FBI (ATTN: Congressional Inquiry Unit, Records Management Division)",
  "sender": "SAC, ST. LOUIS; SAC, CHICAGO; NEW ORLEANS; MEMPHIS; AMEMBASSY LONDON"
}