{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "Disclosing details of electronic surveillance and investigations into political figures (Martin Luther King Jr., Andrew Young, Julian Bond), including potential COINTELPRO involvement, could reveal sensitive operational methods and compromise sources. For example: \"What was the objective of the investigation of King and SCLC? A. To determine possible communist influence of King and SCLC.\" or \"I feel compelled to apologize if I appear particularly dense as to the utilization of this phrase COINTELPRO.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This memorandum summarizes Alan G. Sentinella's testimony before the Senate Select Committee (SSC) on May 21, 1975, regarding FBI investigations into Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison, focusing on electronic surveillance and potential communist influence.",
  "summary_one_paragraph": "On May 21, 1975, Alan G. Sentinella, a retired FBI Special Agent, testified before the Senate Select Committee (SSC) regarding his involvement in investigations concerning Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison. During the session, led primarily by Lester B. Seidel, Sentinella answered questions about telephone surveillance on King and Levison, the characterization of Levison as having CP connections, and the objectives of investigating King and the SCLC for potential communist influence. Sentinella also discussed his knowledge of investigations into Hunter Pitts O'Dell, Bayard Rustin, and Harry Wachtel, as well as electronic surveillance related to Coretta King, SNCC, and the absence of any efforts to influence political campaigns, including those of Andrew Young and Julian Bond.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Alan G. Sentinella",
    "Martin Luther King Jr.",
    "SCLC",
    "Stanley Levison",
    "Electronic Surveillance",
    "COINTELPRO",
    "Communist Influence",
    "Andrew Young",
    "Julian Bond"
  ],
  "title": "Testimony of Retired FBI Special Agent (SA) Alan G. Sentinella Before SSC Executive Session",
  "date": "1975-05-21",
  "persons_mentioned": [
    "Alan G. Sentinella",
    "Robert Morgan",
    "Lester B. Seidel",
    "Jack Smith",
    "John Bailey",
    "Paul Daly",
    "Martin Luther King Jr.",
    "Stanley Levison",
    "Charles Harding",
    "Richard Hamilton",
    "Hunter Pitts O'Dell",
    "Bayard Rustin",
    "Harry Wachtel",
    "Coretta King",
    "Alden Miller",
    "Andrew Young",
    "William Sullivan",
    "Bob Nichols",
    "Julian Bond",
    "Lester Maddox",
    "Donald Burgess",
    "Richard Davis",
    "Brian O'Shea",
    "Henry Rouse"
  ],
  "sender": "Alan G. Sentinella (retired FBI Special Agent (SA))"
}