{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Memorandum",
  "security": "These documents reveal FBI counterintelligence tactics against civil rights and political groups, potentially undermining these groups' effectiveness and infringing on civil liberties. Methods include informant penetration, disruption of meetings, and spreading disinformation, such as suggesting klan control within the John Birch Society. Quoting, \"Once their activities, etc., are determined through informant coverage proper action can be taken to disrupt and neutralize their activities and efforts can be directed to frustrate their plans.\" and \"An anonymous letter be mailed to the National Office of John Birch Society, Belmont, Massachusetts, pointing out that the KKK is in full control of the John Birch Society Chapter in Pine Bluff.\" This could damage the FBI's reputation and erode public trust.",
  "security_level": "UNCLASSIFIED",
  "summary": "This collection of FBI memoranda details counterintelligence programs (COINTELPRO) aimed at disrupting hate groups, particularly the Ku Klux Klan (KKK), in Jacksonville, Florida, Charlotte, North Carolina, and Little Rock, Arkansas. The documents outline tactics, informant activities, and recommendations for neutralizing Klan activities and influencing public perception.",
  "summary_one_paragraph": "This collection includes FBI memoranda from 1964 detailing counterintelligence programs (COINTELPRO) targeting hate groups, specifically the Ku Klux Klan (KKK) and related organizations in Jacksonville, Charlotte, and Little Rock. The documents describe strategies such as informant penetration to gather intelligence, planned disruptions of Klan meetings, and deceptive tactics like spreading disinformation to create internal dissension and influence public opinion. It outlines specific actions taken, including contacting local officials, monitoring communications, and planned anonymous letters intended to undermine the KKK’s influence and credibility, as well as broader efforts to exploit vulnerabilities within Klan organizations.",
  "tags": [
    "FBI",
    "COINTELPRO",
    "Ku Klux Klan",
    "Hate Groups",
    "Informants",
    "Disruption",
    "Counterintelligence",
    "Internal Security",
    "John Birch Society",
    "Civil Rights",
    "Memorandum"
  ],
  "title": "Counter Intelligence Program Internal Security: Disruption of Hate Groups",
  "date": "1964-09-23",
  "locations_mentioned": [
    "Jacksonville, Florida",
    "Charlotte, North Carolina",
    "Little Rock, Arkansas",
    "Pine Bluff, Arkansas",
    "Mississippi",
    "McComb, Mississippi"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "K. William O'Connor",
    "Samuel Bowers",
    "Julius Harper",
    "Billy Buckles",
    "A.C. Harrington",
    "Ernest Gilbert",
    "Paul Foster",
    "Ace Weathers",
    "Paul Johnson",
    "Odell Anders",
    "James R. Jones",
    "Robert Echols Scoggins",
    "John Alden Munn",
    "Bill Williams",
    "Barry Goldwater",
    "Orval E. Faubus",
    "Norman D. Young",
    "J. F. Butram",
    "Charles D. Cuthbertson",
    "John Kennedy"
  ],
  "recipient": "DIRECTOR, FBI",
  "sender": "SAC (Special Agent in Charge), Jacksonville, Charlotte, Little Rock"
}