{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "This document details an FBI agent's testimony before a Senate Select Committee regarding investigations into Martin Luther King Jr., the SCLC, and Stanley Levison, potentially revealing investigative techniques and sources. It also includes information about electronic surveillance and internal FBI procedures, the disclosure of which could compromise law enforcement methods. For example, details about the handling of informants and the objectives of investigations (Q. What was the objective of the investigation of King and SCLC? A. To determine possible communist influence of King and SCLC.) could be misused by those seeking to obstruct justice or undermine the credibility of past investigations.",
  "security_level": "UNCLASSIFIED",
  "summary": "Alan G. Sentinella's recollection of his testimony before the Senate Select Committee (SSC) on May 21, 1975, concerning investigations into Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison.",
  "summary_one_paragraph": "This memorandum summarizes Alan G. Sentinella's testimony before the Senate Select Committee (SSC) on May 21, 1975, focusing on investigations into Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison. Sentinella, a former FBI Special Agent, discussed the surveillance of King and SCLC, including details about discontinued telephone surveillance, the lack of authorized continuation at King's new residence, and the absence of evidence establishing Communist Party connections for King or his associates, such as Levison, O'Dell, Rustin and Wachtel. He also addressed questions about COINTELPRO, surreptitious entries, and the FBI's efforts to determine communist influence within these organizations, clarifying his involvement and recollection of events and procedures.",
  "tags": [
    "Senate Select Committee",
    "Alan G. Sentinella",
    "FBI",
    "Martin Luther King Jr.",
    "SCLC",
    "Stanley Levison",
    "Surveillance",
    "COINTELPRO",
    "Communist Influence"
  ],
  "title": "Testimony before the Senate Select Committee (SSC)",
  "date": "1975-05-21",
  "persons_mentioned": [
    "Alan G. Sentinella",
    "Robert Morgan",
    "Lester B. Seidel",
    "Jack Smith",
    "John Bailey",
    "Paul Daly",
    "Martin Luther King Jr.",
    "Stanley Levison",
    "Charles Harding",
    "Richard Hamilton",
    "Hunter Pitts O'Dell",
    "Bayard Rustin",
    "Harry Wachtel",
    "Coretta King",
    "Al Miller",
    "Andrew Young",
    "William Sullivan",
    "Bob Nichols",
    "Donald Burgess",
    "Richard Davis",
    "Brian O'Shea",
    "Henry Rouse"
  ],
  "recipient": "Mr. J. B. Adams, Mr. J. A. Mintz, Mr. W. R. Wannall, Mr. J. G. Deegan, Mr. R. L. Shackelford, Mr. W. O. Cregar, Mr. S. F. Phillips, Mr. James A. Wilderotter, K. William O'Connor",
  "sender": "S.F. Phillips"
}