{
  "classification": "Liaison",
  "document_type": "Memorandum/Report/Abstract",
  "security": "This document contains intelligence information about foreign communist support for revolutionary protest movements in the U.S. Disclosing this information could reveal sensitive sources and methods used for intelligence collection. Specifically, the document states: \"when prepared consideration was given to concealment and protection of original source.\" and that the review indicates that some material undoubtedly came from third agencies and/or foreign sources but is set forth in a manner not to pinpoint any specific agency or foreign source.",
  "security_level": "TOP SECRET",
  "summary": "This file relates to documents provided to the Senate Select Committee (SSC) concerning the Huston Plan, COINTELPRO, and other practices, including a report on foreign communist support for revolutionary protest movements in the U.S.",
  "summary_one_paragraph": "This collection of documents pertains to the FBI's response to requests from the Senate Select Committee on Intelligence Activities (SSC) regarding the Huston Plan, COINTELPRO, and related matters. It includes memoranda detailing the provision of documents to the SSC, an abstract summarizing information provided (specifically a letter from Tom Charles Huston regarding foreign communist support of revolutionary youth activities), and a report dated June 30, 1969, titled 'Foreign Support for Revolutionary Protest Movements in the United States.' Access to certain documents was restricted to review at FBI Headquarters, and some materials were excised to protect sensitive sources and methods. The CIA, NSA, and DIA were consulted regarding the Huston request, and the report was disseminated to Tom Huston at the White House.",
  "tags": [
    "Huston Plan",
    "COINTELPRO",
    "Senate Select Committee",
    "Intelligence Activities",
    "Foreign Communist Support",
    "Revolutionary Protest Movements",
    "FBI",
    "CIA",
    "NSA",
    "DIA"
  ],
  "title": "Documents Pertaining to the 'Huston Plan,' COINTELPRO, and Other Practices and Programs",
  "date": "1975-06-25",
  "locations_mentioned": [
    "United States",
    "Washington, D.C."
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "J. B. Adams",
    "J. A. Mintz",
    "W. R. Wannall",
    "W. O. Cregar",
    "Ivan Conrad",
    "Martin Luther King",
    "Leon Ulman",
    "K. William O'Connor",
    "Levi",
    "Peyton Ford",
    "Hoover",
    "Robert Mardian",
    "Kevin Maroney",
    "Frank Church",
    "John T. Elliff",
    "Clarence M. Kel",
    "Tom Charles Huston",
    "Walt Elder",
    "Benson Buffham",
    "Kenneth R. Bailey"
  ],
  "recipient": "Attorney General, Director FBI, Senate Select Committee"
}