{
  "classification": "Commission",
  "document_type": "Memorandum and Teletype",
  "security": "Several teletypes discuss monitoring of former FBI agents who might be contacted by the Senate Select Committee, raising concerns about disclosing sensitive Bureau operations. For example, one teletype notes a former agent \"MAY REFUSE TO BE INTERVIEWED, BUT IF HE CONSENTS TO BE INTERVIEWED HE WILL REQUEST PRESENCE OF FRI AGENT, IF QUESTIONS ARE ASKED RELATIVE TO SENSATIVE TO BUREAU OPERATIONS.\"",
  "security_level": "Unclassified (with one 'Secret' enclosure)",
  "summary": "This collection of documents relates to the FBI's response to requests from the Senate Select Committee (SSC) investigating intelligence activities, including materials provided and monitoring of former agents.",
  "summary_one_paragraph": "This document collection details the FBI's interactions with the Senate Select Committee (SSC) in 1975, providing materials like policies, procedures, and excerpts from the FBI Manual of Instructions, some of which are unclassified, while one section is classified 'Secret.' Additionally, it includes memoranda regarding the authentication of Hoover's memos from 1936 and the teletypes reflecting the monitoring of former FBI agents, such as William P. George, John J. Quinn and Donald G. Hanning, who might be contacted by the SSC, and research conducted at the Franklin D. Roosevelt Library concerning President Roosevelt's meetings and communications in 1936.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Intelligence Activities",
    "FBI Manual of Instructions",
    "Hoover Memoranda",
    "Franklin D. Roosevelt Library",
    "Monitoring",
    "Senstudy 75",
    "American Indian Movement",
    "Douglas Durham",
    "Counterintelligence"
  ],
  "title": "Material for Senate Select Committee (SSC) Investigating Intelligence Activities",
  "date": "1975-04-30",
  "locations_mentioned": [
    "Washington, D.C.",
    "Omaha",
    "Minneapolis",
    "Alexandria, VA",
    "Mc Lean, VA",
    "St. Anne, Guadalupe",
    "Chevy Chase, Maryland",
    "Hyde Park, NY"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "S. F. Phillips",
    "William Miller",
    "Douglas Durham",
    "Keith E. Uhl",
    "Frank Church",
    "W. R. Wannall",
    "J. A. Mintz",
    "W. O. Cregar",
    "A. L. Lacey",
    "James Wilderotter",
    "Alonzo L. Lacey",
    "Donald B. Schewe",
    "Franklin D. Roosevelt",
    "Cordell Hull",
    "John Edgar Hoover",
    "Tamm",
    "White",
    "Oberg",
    "Mortimer",
    "Carey",
    "Dawey",
    "Edwards",
    "Egan",
    "Farverth",
    "Glavin",
    "Hasko",
    "Jester",
    "Nichols",
    "Quisa",
    "Schiller",
    "Tracy",
    "Cand",
    "William P. George",
    "Harold P. Leinbaugh",
    "Donald G. Hanning",
    "John J. Quinn"
  ],
  "recipient": "SACs (Special Agents in Charge) of various FBI field offices",
  "sender": "S. F. Phillips, W. R. Wannall, Various FBI Field Offices"
}