{
  "classification": "Commission",
  "document_type": "Testimony",
  "security": "Testimony discusses FBI surveillance techniques, including electronic surveillance and surreptitious entry, which were under specific policy guidelines. Disclosing these methods could compromise current law enforcement and intelligence practices. For example, the testimony mentions, 'During my period with the Bureau, from the beginning, such activity had to be approved by the Bureau... the policy had changed to...obtaining authority was virtually impossible.' This kind of detail, if revealed, could potentially be exploited.",
  "security_level": "UNCLASSIFIED",
  "summary": "Alan G. Sentinella's May 21, 1975, testimony before the Senate Select Committee (SSC) details his involvement in investigations of Martin Luther King, Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison, focusing on telephone surveillance, alleged communist connections, and the FBI's operational policies.",
  "summary_one_paragraph": "On May 21, 1975, Alan G. Sentinella, a former Special Agent, testified before the Senate Select Committee (SSC) regarding his work on investigations related to Martin Luther King, Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison. During the testimony, led primarily by Lester B. Seidel, Sentinella discussed the scope and limitations of telephone surveillance on King and Levison, the process of characterizing individuals with alleged CP connections, and the FBI's policies on surreptitious entries. He also clarified discrepancies between his earlier interview and this testimony, attributed to conferring with another former agent, Charles Harding. The session covered specific instances of surveillance, potential communist influence within the SCLC, and the Bureau's response to King's allegations of unresponsive civil rights complaints.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Alan G. Sentinella",
    "Martin Luther King Jr.",
    "SCLC",
    "Stanley Levison",
    "Telephone Surveillance",
    "Communist Influence",
    "COINTELPRO",
    "Civil Rights",
    "Testimony"
  ],
  "title": "Testimony of Alan G. Sentinella before the Senate Select Committee",
  "date": "1975-05-21",
  "persons_mentioned": [
    "Alan G. Sentinella",
    "Robert Morgan",
    "Lester B. Seidel",
    "Jack Smith",
    "John Bailey",
    "Paul Daly",
    "Martin Luther King Jr.",
    "Stanley Levison",
    "Charles Harding",
    "Richard Hamilton",
    "Hunter Pitts O'Dell",
    "Bayard Rustin",
    "Harry Wachtel",
    "Coretta King",
    "Alden Miller",
    "William Sullivan",
    "Bob Nichols",
    "Henry Rouse",
    "Arthur Murtagh",
    "Richard Davis",
    "Donald Burgess",
    "Randall McGough",
    "Timothy Dorsch",
    "Charles Haynes",
    "Brian O'Shea",
    "Andrew Young",
    "J. Edgar Hoover"
  ],
  "recipient": "Senate Select Committee (SSC)",
  "sender": "Alan G. Sentinella"
}