{
  "classification": "Assassinations",
  "document_type": "Teletype/Memoranda",
  "security": "Several documents discuss ongoing investigations into Martin Luther King Jr.'s assassination and the activities of informants. Disclosing details about these informants and investigative methods could compromise current or future investigations and potentially endanger individuals. For instance, the teletype from St. Louis mentions contacting a former informant, SL 1495-E, and advising him of the HSCA's interest, including details about the protection and confidentiality measures being considered.",
  "security_level": "TOP SECRET/SECRET/CONFIDENTIAL/LIMITED OFFICIAL USE",
  "summary": "This collection of documents pertains to the House Select Committee on Assassinations' (HSCA) investigation into the assassinations of Martin Luther King Jr. and John F. Kennedy, including FBI responses to HSCA requests for files, information on informants, and details of investigations related to individuals and groups like the National States Rights Party.",
  "summary_one_paragraph": "This series of documents, dated primarily in January and February 1978, reveals the FBI's interactions with the House Select Committee on Assassinations (HSCA) regarding investigations into the deaths of Martin Luther King Jr. and potentially John F. Kennedy. The communications include FBI responses to the HSCA’s requests for access to files, specifically those concerning Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), COINTELPRO activities, and individuals connected to the National States Rights Party (NSRP). The documents also detail efforts to contact and manage FBI informants, such as SL 1495-E, and address the logistics of providing the HSCA with requested materials, including photographs of Atlanta agents and letters from Jerry Ray.",
  "tags": [
    "HSCA",
    "FBI",
    "Martin Luther King Jr.",
    "Assassination Investigation",
    "COINTELPRO",
    "Informants",
    "National States Rights Party",
    "Jerry Ray",
    "James Earl Ray",
    "G. Robert Blakey"
  ],
  "title": "House Select Committee on Assassinations (HSCA) - Investigation Documents",
  "date": "1978-02-10",
  "locations_mentioned": [
    "St. Louis",
    "Chicago",
    "New Orleans",
    "Memphis",
    "London",
    "Washington, D.C.",
    "Savannah, Georgia",
    "Atlanta"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "G. Robert Blakey",
    "Martin Luther King Jr.",
    "Jerry Ray",
    "James Earl Ray",
    "Griffin B. Bell",
    "Danny O. Coulson",
    "Louis Stokes",
    "Stephen M. Callender",
    "Joseph T. Sylvester Jr.",
    "Joe C. Hester",
    "Burl F. Johnson",
    "Joseph H. Kearney Jr.",
    "Howell S. Lowe",
    "Lawrence J. Olson",
    "Marjorie Louise Fetters",
    "Richard Geppert",
    "J. B. Stoner"
  ],
  "recipient": "Director, FBI",
  "sender": "SAC, St. Louis; SAC, Chicago; New Orleans; St. Louis; AMEMBASSY LONDON; House Select Committee on Assassinations; Director, FBI; Memphis"
}