{
  "classification": "Assassinations",
  "document_type": "Teletype/Airtel/Letter",
  "security": "Disclosing the identities of FBI informants, their operational details, and the FBI's investigative techniques could jeopardize informant safety, compromise ongoing investigations, and allow adversaries to circumvent FBI methods. The coordination with legal and congressional affairs units also highlights internal procedures that, if revealed, could be exploited. For example, the note that SL 1495-E reported Jerry Ray stated he knew there was another party involved in the killing of King and that his brother was the one who pulled the trigger.",
  "security_level": "TOP SECRET/SECRET/CONFIDENTIAL/LIMITED OFFICIAL USE",
  "summary": "This collection of documents from 1978 details communications between the FBI, the House Select Committee on Assassinations (HSCA), and other agencies regarding investigations into the assassinations of Martin Luther King Jr. and potentially John F. Kennedy, focusing on specific informants and related files.",
  "summary_one_paragraph": "This compilation of FBI teletypes, airtels, and letters from January and February 1978, reveals interactions between the FBI and the House Select Committee on Assassinations (HSCA) concerning investigations into the assassinations of Martin Luther King Jr. and John F. Kennedy. The documents detail the FBI's efforts to provide the HSCA with requested files, informant information (specifically SL 1495-E and Richard Geppert), and agent photographs, while also managing informant confidentiality and legal considerations. Key exchanges involve the HSCA's interest in Jerry Ray's claims about the King assassination, the activities of White Hate Groups and the National States Rights Party (NSRP), and the cooperation of former informants, as well as the coordination with the Department of Justice and other agencies.",
  "tags": [
    "FBI",
    "HSCA",
    "Martin Luther King Jr.",
    "Assassination",
    "Informant",
    "COINTELPRO",
    "Jerry Ray",
    "James Earl Ray",
    "National States Rights Party",
    "NSRP",
    "John F. Kennedy",
    "Investigation"
  ],
  "title": "House Select Committee on Assassinations (HSCA) Investigations",
  "conspiracy": "The documents contain information about Jerry Ray's claim that there was another party involved in the killing of Martin Luther King Jr., and that his brother was the one who pulled the trigger. This could be interpreted as support for a conspiracy theory.",
  "date": "1978-02-10",
  "locations_mentioned": [
    "St. Louis",
    "Chicago",
    "New Orleans",
    "Memphis",
    "Washington, D.C.",
    "Savannah, Georgia",
    "Springfield",
    "London",
    "Atlanta"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "G. Robert Blakey",
    "Jerry Ray",
    "James Earl Ray",
    "Martin Luther King Jr.",
    "J. B. Stoner",
    "Richard Geppert",
    "Louis Stokes",
    "Griffin B. Bell",
    "Robert L. Keuch",
    "Stephen M. Callender",
    "Joseph T. Sylvester, Jr.",
    "Joe C. Hester",
    "Burl F. Johnson",
    "Joseph H. Kearney, Jr.",
    "Howell S. Lowe",
    "Danny O. Coulson"
  ],
  "recipient": "Director, FBI",
  "sender": "SAC, St. Louis; SAC, Chicago; New Orleans; Memphis; AMEMBASSY LONDON"
}