{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "This document discusses CIA's support of the exile group Movimiento de Recuperacion Revolucionaria (MRR), including their potential involvement in the attack on the Spanish vessel 'Sierra Aranzazu'. Disclosing this information could reveal U.S. backing of exile groups and their operations, which are unknown to Spanish authorities: 'CIA deals with MRR based upon policy established by a Special Group...CIA claimed it did not direct any of the MRR operations...Details regarding CIA'S support of this group, of course, are unknown to Spanish authorities.'",
  "security_level": "Top Secret",
  "summary": "FBI memorandum regarding the attack on the Spanish vessel Sierra Aranzazu by the Movimiento de Recuperacion Revolucionaria (MRR), an anti-Castro exile group receiving U.S. backing, and the subsequent investigation involving the FBI, CIA, and State Department.",
  "summary_one_paragraph": "This September 25, 1964, FBI memorandum from W.R. Wannall to W.C. Sullivan addresses the attack on the Spanish vessel Sierra Aranzazu, which the anti-Castro organization Movimiento de Recuperacion Revolucionaria (MRR) claimed responsibility for, mistakenly believing it was a Cuban vessel. The memo details how the Spanish Ambassador reported his concerns to the U.S. government, and notes that the CIA indicated the MRR, an exile group receiving U.S. support, was behind the attack. The FBI is investigating the matter, sharing results with the State Department and the Internal Security Division, while the memo advises the Director on how to respond to the Spanish Ambassador's inquiries, suggesting that the State Department is the more appropriate point of contact.",
  "tags": [
    "FBI",
    "CIA",
    "State Department",
    "Sierra Aranzazu",
    "Movimiento de Recuperacion Revolucionaria",
    "MRR",
    "Neutrality Matters",
    "Anti-Castro",
    "Cuba",
    "Liaison",
    "Spanish Vessel",
    "Merry del Val",
    "Secret Organization of Continental Action",
    "OSAC"
  ],
  "title": "Attack on Spanish Vessel \"Sierra Aranzazu,\" 9/13/64",
  "date": "1964-09-25",
  "locations_mentioned": [
    "United States",
    "Miami",
    "Puerto Rico",
    "Spain",
    "Cuba"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Wannall, W. R.",
    "Sullivan, W. C.",
    "Merry del Val",
    "Marshall Carter",
    "Dean Rusk",
    "John Crimmins",
    "Yeagley",
    "Kennedy, Former Attorney General",
    "Belmont",
    "Holmes",
    "Evans",
    "Nasca"
  ],
  "recipient": "Sullivan, W. C.",
  "sender": "Wannall, W. R."
}