{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "This document discusses the creation of a list of individuals hostile to the Bureau (FBI) to avoid interviewing them during applicant and loyalty investigations. The Executives Conference felt that it would be undesirable for the Bureau to embark upon a program of advising the field to not interview certain individuals in connection with various types of investigations conducted by the Bureau. The Executives Conference realized that the hostile attitude toward the Bureau stems not from our criminal investigative work but from the Eureau's investigative activity in the field of applicant investigations and the Loyalty Program. The Conference feels that the blacklisting of individuals is fundamentally bad and will ultimately result in extreme embarrassment to the Bureau.",
  "security_level": "UNCLASSIFIED",
  "summary": "This collection of memos from 1949-1975 concerns Della Coover, who wrote under the pseudonym Bella Stumbo, including monitoring of her income reporting, and FBI procedures regarding applicant investigations and the creation of a list of individuals hostile to the FBI.",
  "summary_one_paragraph": "This collection of documents includes memos and correspondence related to the investigation of Della Coover, a writer for the Los Angeles Times who also used the pseudonym Bella Stumbo, with concerns about her income reporting and articles she wrote; this includes a letter to the Internal Revenue Service with enclosed articles by Coover. Also, memos discuss FBI procedures for applicant investigations and the handling of references, addressing concerns about interviewing individuals hostile to the Bureau and the potential creation of a \"blacklist\".",
  "tags": [
    "FBI",
    "Della Coover",
    "Bella Stumbo",
    "Applicant Investigations",
    "Internal Revenue Service",
    "Adverse Reporting"
  ],
  "title": "Investigation of Della Coover, FBI Procedures for Applicant Investigations",
  "date": "1972-06-05",
  "locations_mentioned": [
    "Los Angeles, California",
    "Monterey Park",
    "El Monte",
    "Mexico",
    "Norwalk"
  ],
  "persons_mentioned": [
    "Della Coover",
    "Bella Stumbo",
    "Lynn Sullivan",
    "Harold Ickes",
    "J. Edgar Hoover",
    "Wesley G. Grapp",
    "Gilbert G. Benjamin",
    "G.C. Callan"
  ],
  "recipient": "Internal Revenue Service, U.S. Senate Select Committee on Intelligence Activities (SSC), Mr. Tolson",
  "sender": "Sabert C. Benjamin, Attorney General, J. P. Mohr, Joe D. Jamieson"
}