{
  "classification": "Liaison",
  "document_type": "Memorandum/Teletype",
  "security": "The memorandum from the FBI Laboratory details specific technical equipment purchased from the CIA, potentially revealing sensitive capabilities. For example, it mentions \"intercepting cryptographic machine emanations would come as no surprise...confirmation of a functioning system could encourage implementation of countermeasures.\" The teletype from Philadelphia reveals an FBI source divulging that Daniel O'Flaherty, employed with the Church Committee, removed and Xeroxed a CIA memorandum containing derogatory information on Senator Henry Jackson, potentially compromising the integrity of the committee and the confidentiality of CIA information.",
  "security_level": "SECRET",
  "summary": "This collection of documents pertains to FBI-CIA liaison activities, including assessments of potential damage from disclosing information to the Senate Select Committee (SENSTUDY 75), FBI purchases of technical equipment from the CIA, and an investigation into a leak from the Church Committee involving a CIA memorandum.",
  "summary_one_paragraph": "This collection of documents primarily covers FBI-CIA liaison. It includes assessments regarding the potential risks of releasing certain information to the Senate Select Committee (SENSTUDY 75), with particular attention to specific technical equipment the FBI acquired from the CIA. The documents also cover FBI actions related to press allegations, use of Arabic linguists, imagery enhancement techniques, and purchases of cameras from the CIA. Further, there is a teletype concerning a U.S. Navy Commander's information on Daniel O'Flaherty, an employee with the Church Committee, removing and xeroxing a CIA memorandum on Senator Henry Jackson. Finally, there's a request from the Senate Select Committee for FBI materials.",
  "tags": [
    "FBI",
    "CIA",
    "SENSTUDY 75",
    "Senate Select Committee",
    "Technical Equipment",
    "Surveillance",
    "Leak Investigation",
    "Church Committee",
    "Arabic Linguists",
    "Imagery Enhancement"
  ],
  "title": "SENSTUDY 75 and Related FBI-CIA Liaison Activities",
  "date": "1975-07-28",
  "locations_mentioned": [
    "Washington, D.C.",
    "Philadelphia",
    "San Francisco",
    "Nashville, Tennessee",
    "South Vietnamese Embassy"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "W. R. Wannall",
    "W. O. Cregar",
    "R. L. Shackelford",
    "K. A. Mendenhall",
    "Mr. Cochran",
    "T. F. Kelleher",
    "Mr. McNiff",
    "J. Edgar Hoover",
    "Egil Krogh",
    "Robert Thweat",
    "Daniel O'Flaherty",
    "Senator Henry Jackson",
    "Senator Morris Udall",
    "Mr. Katz",
    "Claire (Anna) Chennault",
    "Spiro Agnew",
    "Charles E. Radford",
    "George Berley",
    "Wilfred Bergeron",
    "William D. Campbell",
    "Richard Suter",
    "William Tucker",
    "Terry O'Connor",
    "Joseph English",
    "Les Aspin",
    "Phil Claridge",
    "William Jackson"
  ],
  "recipient": "Mr. W. R. Wannall, Mr. Cochran, Director",
  "sender": "R. L. Shackelford, T. F. Kelleher, PHILADELPHIA (62-0-23222)"
}