{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "The document details the FBI's investigation into Cuban exile groups, specifically Cuban Power and MIRR, and their involvement in bombings and threats. It reveals the use of confidential informants (Oscar Angulo), CIA covert assets (Harry Randall), and sensitive intelligence gathering methods. Sharing this level of detail could compromise ongoing investigations, expose sources, and hinder future intelligence operations. For example, the document states: 'This information is being furnished on a need-to-know basis and is not to be disseminated outside the Bureau. It is classified \"SECRET\"'.",
  "security_level": "Secret",
  "summary": "An FBI report details investigations into Cuban exile groups, particularly Cuban Power and MIRR, focusing on bombings in Miami and related activities, with intelligence gathered from various sources including CIA contacts and confidential informants.",
  "summary_one_paragraph": "This FBI report, dated March 8, 1968, summarizes investigations into Cuban exile groups such as Cuban Power and MIRR, detailing their alleged involvement in bombings in Miami. Information was gathered from CIA covert assets like Harry Randall and informants such as Oscar Angulo, revealing details about the groups' activities, key figures including Orlando Bosch and Jorge Gonzalez, and their connections to bombings, threats, and arms procurement. The report outlines specific incidents, conversations, and surveillance activities, highlighting the FBI's efforts to monitor and understand the actions of these exile groups.",
  "tags": [
    "FBI",
    "Cuban Power",
    "MIRR",
    "Bombings",
    "Miami",
    "Orlando Bosch",
    "Jorge Gonzalez",
    "Informant",
    "CIA",
    "Oscar Angulo",
    "Harry Randall",
    "Key West",
    "Explosives"
  ],
  "title": "OBA, INTV, TRANSCRIPT OF ANONYMOUS CALL, SUSP, ARREST OF RMN, LIST OF BOMBINGS, LAB AND INDENT RPT",
  "date": "1968-03-08",
  "locations_mentioned": [
    "Miami, Florida",
    "New Jersey",
    "New York City",
    "Havana, Cuba",
    "Mexico",
    "Key West, Florida",
    "Washington, D.C.",
    "Orlando, Florida"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Leonard C. Peterson",
    "James D. Hayes",
    "Harry Randall",
    "Ricardo Morales",
    "Harvard Swilley",
    "Francisco Rodriguez Tamayo",
    "Manuel Penabaz",
    "Eduardo Fernandez",
    "Orlando Bosch",
    "Andres Jorge Gonzalez Gonzalez",
    "Paulino Mario Gutierrez Vidal",
    "Felipe Rivero",
    "Jorge Mascanosa",
    "Luis Conte Agero",
    "Edwin Peter Krieger",
    "Robert G. Strong",
    "Samuel W. Jones",
    "Oscar Oscar Angulo Reyes",
    "Angela Garcia De Angulo",
    "Fausto Diaz",
    "Norman Diaz Artiles",
    "Juan Amador Rodriguez",
    "Sergio Vidal Cayro",
    "Julio Aton Constanzo Palau",
    "Roberto Domeq Rodriguez",
    "Nestor Rodda Meoqui",
    "Manuel Villa Fana Martinez",
    "Mario Ferrere Perez",
    "Rolando Arcadio Masferrer Rojas",
    "Alfredo Barad",
    "Claudio Medina Hernandez",
    "Fidel Castro"
  ],
  "recipient": "Director, FBI",
  "sender": "Peterson, Leonard C."
}