{
  "classification": "JFK Assassination",
  "document_type": "Identification Form/Memo/Summary",
  "security": "This document contains information regarding Richard Gibson, also known as \"Sugar,\" and his connections to various organizations, including the Fair Play for Cuba Committee (FPCC), and individuals with ties to communist activities. Disclosure of Gibson's role as a CIA operative and the Agency's operational interest in him could compromise ongoing intelligence activities. Further, revelation of sources such as CG 7262-S could lead to their identification and endangerment. As stated in the document, unauthorized disclosure could compromise CG 7262-S as well as a CIA source and thus cause severe damage to defense interests.",
  "security_level": "Top Secret/Secret/Confidential",
  "summary": "This document is a collection of memos, summaries, and reports regarding Richard Thomas Gibson, also known as \"Sugar,\" his activities, and his connections with various organizations, including the Fair Play for Cuba Committee (FPCC). It details his involvement with communist activities, his travels, and his contacts, as well as the FBI and CIA's interest in him.",
  "summary_one_paragraph": "This compilation of documents, including an identification form and several memos and summaries, focuses on Richard Thomas Gibson, cryptonym \"Sugar,\" and his multifaceted activities from 1960 to 1972. Gibson, a former Acting Executive Secretary of the Fair Play for Cuba Committee (FPCC) and a journalist, is described as having connections to communist entities and involvement in various organizations across the United States, Europe, and Africa. The documents detail FBI and CIA surveillance of Gibson, noting his travels, associations, and role as a CIA source. The collection includes information from confidential sources, congressional testimonies, and reports from international agencies, providing a comprehensive overview of Gibson's activities and the intelligence community's interest in him.",
  "tags": [
    "Richard Thomas Gibson",
    "Sugar",
    "FBI",
    "CIA",
    "FPCC",
    "Fair Play for Cuba Committee",
    "Communist Activities",
    "Arab Terrorist Activities",
    "Oswald",
    "Warren Commission"
  ],
  "title": "[Restricted] (Richard Thomas Gibson)",
  "date": "1967-10-05",
  "persons_mentioned": [
    "Richard Thomas Gibson",
    "Davida Fineman",
    "Rene Raindorf",
    "Roger Padgett",
    "Gloria Steinem",
    "Aron Raindorf",
    "Albert Manchanda",
    "Luc Dupire",
    "Yvonne Sterck",
    "Daniel H. Watts",
    "Fidel Castro",
    "Anton Emil Kuerti",
    "J. Mitchell",
    "Michael Edward Lyons",
    "David Dellinger",
    "Sarah Gibson",
    "Esther Jackson",
    "John Henrik Clarke",
    "William Worthy",
    "Robert Tabor",
    "Raul Roa Garcia",
    "Lee Harvey Oswald",
    "Robert Alexander Wood",
    "John Taylor",
    "Jacques Verges",
    "Hodee W. Edwards",
    "Susan Heiligman Frank"
  ],
  "sender": "[Restricted] (See Title). Relayed by CIA via Courier on June 15, 1972 (0-146). (TREG-22 105-93072-182/EX-116 17 JUN 22 1972). DIRECTOR, FBI (105-186336). LEGAT, PARIS (105-5616) (P). UNITED STATES DEPARTMENT OF JUSTICE FEDERAL BUREAU OF INVESTIGATION WASHINGTON, D.C. 20535. Main File No: 105-93072 Date: 4/21/71, Analyst Coordinator Approved, Charles E. Rader Josephine Telleri Lawrence B. Brady (CER:sak). Correlator's Note, (Edwards). CIA furnished copies of letters dated 8/13 through 20/65, from Hodee W. Edwards (100-397465) to Sugar. CIA advised on 1/28/66, that \"Sugar\" had reported that Susan Heiligman Frank (100-339235). Edwards Letter to Chicago dated 10/7/65 (Living in England-Frequent Contact With Richard Gibson). Bundesamt Fuer Verfassungsschutz, (BFV- West German Federal Agency for the Protection of the Constitution). Conf. Source Rene Pelleya Justiz (protect identity) advised on 11/8/63. John Stanley Peters, son of Hannah Ida Peters (105-121441) advised on 7/24/63, that his father, Edward Stanley Peters. NY 3164-S advised on 2/27/61, (Also 3/29/62). NY 3246-S (in February 1963 and May 1963- about Freedomways Magazine/African Revolution). NY 3877-S* advised that on 7/30/63, an individual who identified himself as Taylor Adams. CV 489-S and CV 288-S advised that Anton Emil Kuerti (105-144287). Norman Driscoll, Chief Clerk, Chase Manhattan Bank, NYC. DN 215-S advised that on 6/18/61. CG 6474-S stated that in August, 1961 (also August 28, 1962, Rossen). CG 6259-S advised that Rossen. The State Department advised that on 1/10/63, March Schleifer. Former SE 736-S (Lyons). *Not searched. See page 21 of search slip/ See page 2 for abbreviated notes on information in main document for use. Notes also at end of document for correlation notes and some files. Page numbers for files and references listed in document after name in list. Page 21 says source is CG 7262-S, it being noted Fineman stayed at informant's residence in Chicago during the period 2/11-14/72. "
}