{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "Releasing information about sources and methods used to gather information about individuals. Specifically, 'MEX-42 protect identity who has furnished reliable information in the past, advised on 5/15/61 that the address at Calle Rhin 29 is a building known as the Hotel Carmen.'",
  "security_level": "CONFIDENTIAL",
  "summary": "The FBI, via the Legat in Mexico City, is investigating Louis Henry Jones, Lenna Schweitzer Jones, Beth Michel Wolland, and John Arthur Sweetman in relation to Cuba, checking their records and movements in Mexico and their possible departure to Cuba.",
  "summary_one_paragraph": "A memorandum from the FBI's Legat in Mexico City to the Director, FBI, dated May 26, 1961, concerns an investigation into Louis Henry Jones, Lenna Schweitzer Jones, Beth Michel Wolland, and John Arthur Sweetman, all identified as being related to Cuba. The memo details the registration information of Louis and Lenna Jones from the U.S. Embassy in Mexico, revealing passport details, dates of birth, addresses, and intended absence from the U.S. for one year. Further investigation at the Hotel Carmen, the address provided by the Joneses, indicated they resided there with Beth Michel Wolland until May 5, 1961, and their current whereabouts are unknown. The CIA Station in Mexico, D.F., has been requested to furnish any information in their files for the subjects. Additional copies of this memo were furnished to the Cleveland, Chicago, Detroit, Indianapolis, and Washington Field Offices.",
  "tags": [
    "FBI",
    "Louis Henry Jones",
    "Lenna Schweitzer Jones",
    "Beth Michel Wolland",
    "John Arthur Sweetman",
    "Cuba",
    "Mexico City",
    "Investigation",
    "Passports",
    "Hotel Carmen",
    "Citizenship Records"
  ],
  "title": "LOUIS HENRY JONES, LENNA SCHWEITZER JONES, BETH MICHEL WOLLAND, JOHN ARTHUR SWEETMAN IS - CUBA",
  "date": "1961-05-26",
  "locations_mentioned": [
    "Mexico City",
    "Arlington Heights, Ohio",
    "New York City",
    "Lebanon, Ohio",
    "Ann Arbor, Michigan",
    "Cuba"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Louis Henry Jones",
    "Lenna Schweitzer Jones",
    "Beth Michel Wolland",
    "John Arthur Sweetman",
    "Wallace R. Heitman",
    "Morton D. Schweitzer",
    "Earl Rojones"
  ],
  "recipient": "Director, FBI",
  "sender": "LEGAT, Mexico City"
}