{
  "classification": "Administrative",
  "document_type": "FBI Records",
  "security": "The enclosed LHM is classified confidential to protect sources of continuing value.",
  "security_level": "Confidential",
  "summary": "This FBI file contains various documents related to the Black Panther Party (BPP), Secret Army Organization (SAO), and Frank August Drager, Jr.'s activities with the Ku Klux Klan, including characterizations of these groups and individuals, as well as dissemination of information to other agencies.",
  "summary_one_paragraph": "This collection of FBI records includes documents dated from 1968 to 1975, focusing primarily on the Black Panther Party (BPP), Secret Army Organization (SAO), and the activities of Frank August Drager, Jr., associated with the Ku Klux Klan. It contains characterizations of these groups, details about investigations, dissemination of information to other agencies, and specific incidents such as a possible burglary attempt by BPP members and the discovery of dynamite at the United Nations General Assembly. The records also document FBI efforts to assess the presence and activities of the BPP in Detroit, including monitoring a television program featuring local black militants.",
  "tags": [
    "FBI",
    "Black Panther Party",
    "Secret Army Organization",
    "Frank August Drager Jr.",
    "Ku Klux Klan",
    "COINTELPRO",
    "Subversive Organizations",
    "Extremist Groups",
    "Internal Security"
  ],
  "title": "FBI Records on Black Panther Party, Secret Army Organization, and Frank August Drager, Jr.",
  "date": "1975-12-18",
  "locations_mentioned": [
    "Oakland, California",
    "San Diego, California",
    "Newark, New Jersey",
    "New York, New York",
    "Detroit, Michigan",
    "Alexandria, Virginia",
    "Richmond, Virginia",
    "Berea, Kentucky",
    "Washington, D.C."
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "Huey P. Newton",
    "Bobby George Seale",
    "Eldridge Cleaver",
    "George Mason Murray",
    "Frank August Drager, Jr.",
    "Michael Halsey Brown",
    "Lonnie Peeks",
    "Luke Tripp",
    "Leonard Brown",
    "Victor Stewart",
    "Marian Kramer",
    "John Williams",
    "Lonnie Peeks",
    "George Wallace",
    "Mao Tse-tung"
  ],
  "recipient": "Director, FBI",
  "sender": "SAC, Newark; SAC, Richmond; SAC, Detroit"
}