{
  "classification": "Cuba",
  "document_type": "Airtel",
  "security": "Revealing investigative leads, the sources of funds and arms, and the location of involved planes could compromise ongoing investigations and expose confidential sources. Quoting the document: 'Every effort should be made to identify all participants, the source of funds, the source of arms and the location of planes, if any, which were to be utilized in the bombing attack on Cuba.' This instruction highlights sensitive investigative techniques and the importance of secrecy in these matters.",
  "security_level": "UNCLASSIFIED",
  "summary": "This FBI Airtel directs Miami, New Orleans, Newark, Atlanta, and Jacksonville offices to investigate Victor Dominador Espinosa Hernandez and others involved in neutrality matters related to a planned bombing raid on Cuba, focusing on identifying participants, funding sources, arms sources, and plane locations.",
  "summary_one_paragraph": "An FBI Airtel, dated August 2, 1963, instructs multiple field offices, including Miami, New Orleans, and Atlanta, to investigate Victor Dominador Espinosa Hernandez and associates concerning neutrality violations linked to a proposed bombing of Cuba. The directive emphasizes immediate interviews of potential suspects, such as Michael McLaney and Antonio Soto, as well as logical former Cuban pilots. The investigation aims to identify all participants, uncover funding and arms origins, and locate any planes involved in the plot, with significant developments to be reported to the Bureau by teletype. The Bureau also asks for an accurate estimate of the value of the seized explosives and material.",
  "tags": [
    "FBI",
    "Victor Dominador Espinosa Hernandez",
    "Neutrality Matters",
    "Cuba",
    "Bombing Raid",
    "Michael McLaney",
    "Antonio Soto",
    "Explosives",
    "Seized Material"
  ],
  "title": "VICTOR DOMINADOR ESPINOSA HERNANDEZ, et al. NEUTRALITY MATTERS",
  "date": "1963-08-02",
  "locations_mentioned": [
    "Miami",
    "New Orleans",
    "Newark",
    "Atlanta",
    "Jacksonville",
    "Cuba"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Victor Dominador Espinosa Hernandez",
    "Michael McLaney",
    "William Julius McLaney",
    "Antonio Soto",
    "Evelio Alpizar",
    "Miguel Alvarez",
    "Sam Benton",
    "Jose de Jesus Basulto Leon",
    "Gonzalo Herrera"
  ],
  "recipient": "SAC, MM",
  "sender": "Director, FBI"
}