{
  "classification": "Liaison",
  "document_type": "Memorandum",
  "security": "Disclosing the specific items requested by the SSC could reveal the scope and focus of the Senate's inquiry into intelligence activities related to Martin Luther King Jr. and the FBI's counterintelligence programs. Providing precise details on what materials were deemed responsive and delivered to the SSC could indirectly expose ongoing or past FBI investigative methods and sources.",
  "security_level": "TOP SECRET",
  "summary": "This document outlines the FBI's response to requests from the U.S. Senate Select Committee on Intelligence Activities (SSC) for materials related to Martin Luther King, Jr., and the Southern Christian Leadership Conference, detailing which items were provided and which could not be located.",
  "summary_one_paragraph": "A memorandum dated October 10, 1975, details the FBI's response to the U.S. Senate Select Committee on Intelligence Activities' (SSC) request for documents and information pertaining to Martin Luther King, Jr., and the Southern Christian Leadership Conference (SCLC). It specifies that certain materials, as per the SSC's September 8, 1975, request, are being forwarded for approval and delivery to the Committee, while also noting that some requested items, such as materials reflecting approval of Mr. Sullivan's recommendations on 'Communism and the Negro Movement' or contacts between Mr. Sullivan and others, could not be located; the memo also provides insight into the handling and tracking of these materials between the FBI and the Senate Committee.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Intelligence Activities",
    "Martin Luther King Jr.",
    "Southern Christian Leadership Conference",
    "Domestic Intelligence",
    "Counterintelligence",
    "FOIA"
  ],
  "title": "Response to U. S. Senate Select Committee on Intelligence Activities (SSC) Request",
  "date": "1975-10-10",
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "J. A. Mintz",
    "J. B. Hotis",
    "W. R. Wannall",
    "W. O. Cregar",
    "J. G. Deegan",
    "E. F. Glenn",
    "Michael E. Shaheen, Jr.",
    "Frank Church",
    "John T. Elliff",
    "Robert Kennedy",
    "Hunter Fitts O'Dell",
    "Courtney Evans",
    "Burke Marshall",
    "William C. Sullivan",
    "A. H. Belmont",
    "Ralph McGill",
    "Alden F. Miller",
    "Eugene Patterson",
    "James R. Malley",
    "John Doar",
    "Hubert H. Humphrey",
    "Mildred Stegall",
    "William D. Campbell",
    "John Matter",
    "Fred Bennett",
    "Stanley David Levison",
    "Nicholas A. Kourambis",
    "G. C. Moore",
    "W. C. Sullivan",
    "M. A. Jones",
    "Rosen",
    "Hoover"
  ],
  "recipient": "The Attorney General, Director, FBI, U. S. Senate Select Committee on Intelligence Activities (SSC)",
  "sender": "Unknown"
}