{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "This document details internal FBI communications and processes related to responding to requests from the Senate Select Committee on Intelligence Activities (SSC). Disclosing these internal procedures could potentially reveal the FBI's methods for organizing, retrieving, and sharing information, which could be exploited to circumvent or hinder future oversight. As noted in the document: \"This document is prepared in response to request and is not for dissemination outside your Committee. Its use is limited to official proceedings by your Committee and the content may not be disclosed to unauthorized personnel without the express approval of the FBI.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This document pertains to the FBI's response to requests from the Senate Select Committee on Intelligence Activities (SSC) regarding superseded sections of the Manual of Instructions, electronic surveillance, and the elimination of the FBI Crime Records Division.",
  "summary_one_paragraph": "The document consists of several memoranda from June 1975, primarily addressed to the Attorney General and Director of the FBI, concerning responses to requests from the Senate Select Committee on Intelligence Activities (SSC). These requests include providing superseded sections of the FBI's Manual of Instructions (MOI), information related to electronic surveillance, and documents pertaining to the elimination of the FBI Crime Records Division. The FBI details the materials provided, notes instances where requested information could not be located, and includes observations regarding the relevance of the information to the Committee's mandate.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Intelligence Activities",
    "Manual of Instructions",
    "Electronic Surveillance",
    "Crime Records Division",
    "FOIA"
  ],
  "title": "Responses to Senate Select Committee Inquiries",
  "date": "1975-06-17",
  "locations_mentioned": [
    "Washington, D.C.",
    "Newark, New Jersey",
    "Atlantic City, New Jersey"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "J. A. Mintz",
    "J. B. Hotis",
    "W. R. Wannall",
    "W. O. Cregar",
    "K. A. Mendenhall",
    "Mark Gitenstein",
    "Paul V. Daly",
    "K. William O'Connor",
    "James W. Johnson",
    "Dennis R. Dickson",
    "Louis J. Brune",
    "William N. Preusse",
    "Thomas J. McNiff",
    "George J. Lex",
    "Howard W. Dare, Jr.",
    "Edward P. Grigalus",
    "Robert D. Shea",
    "Leo T. Clark",
    "Frederick Baumgardner",
    "DeLoach",
    "W. C. Sullivan",
    "D. W. Moore",
    "R. L. Moore",
    "David Divan",
    "M. A. Jones",
    "Bishop",
    "Gray",
    "Fletcher Thompson",
    "W. M. Felt",
    "Jenkins",
    "L. M. Walters"
  ],
  "recipient": "The Attorney General, Director, FBI",
  "sender": "FBI"
}