{
  "classification": "Domestic Intelligence Division",
  "document_type": "Inspection Report",
  "security": "Recommend entire document be classified \"Secret,\" XGDS 1, 2, 3. Information which could identify sources or sensitive techniques. Names of individuals or organizations whose privacy requires protection. Information which would reveal our overall success or lack of success in a given investigative area. Information from \"Third Agencies\" or friendly foreign agencies. Identities of Bureau personnel below the Section Chier level. A policy decision is necessary as to whether we Want to pinpoint, through release of \"Adequacy of Personnel\" sections of these inspection reports, precisely how much or ho little manpower we have on specific types of investigations.",
  "security_level": "Secret (Recommended)",
  "summary": "This is a Domestic Intelligence Division inspection report from August-September 1971, recommending 'Secret' classification for the entire document. It details specific division operations, accomplishments, surveys, projects, and intensification programs, as well as administrative and personnel matters.",
  "summary_one_paragraph": "This Domestic Intelligence Division inspection report, covering the period from August 17 to September 9, 1971, recommends that the entire document be classified as 'Secret' to protect sources, techniques, individual privacy, and foreign agency information. The report includes sections on specific operations like the Ellsberg case and East Coast Conspiracy, accomplishments of various sections (Internal Security, Research, New Left, etc.), surveys and projects such as the Security Index Program and Counterintelligence efforts against White Hate Groups, and administrative matters concerning dividing the Domestic Intelligence Division. It also addresses personnel adequacy, suggestion memorandums, and legal attache offices' foreign liaison activities.",
  "tags": [
    "FBI",
    "Domestic Intelligence Division",
    "Inspection Report",
    "Ellsberg Case",
    "Counterintelligence",
    "Surveillance",
    "Security Index Program",
    "Black Extremists",
    "Communist Activities",
    "Legal Attache",
    "Personnel",
    "Informants"
  ],
  "title": "Domestic Intelligence Division Inspection Report",
  "date": "1971-09-09",
  "persons_mentioned": [
    "E. S. Miller",
    "Daniel Ellsberg",
    "J. William Fulbright",
    "Charles E. Goodell",
    "George S. McGovern",
    "Paul N. McCloskey, Jr.",
    "Neil Sheehan",
    "Susan Sheehan",
    "H. R. Haldeman",
    "France Raine",
    "Kissinger",
    "Robert C. Mardian",
    "Tolson",
    "Sullivan",
    "Brennan",
    "Bishop",
    "John Martin",
    "D. E. Moore",
    "Wannall",
    "G. G Liddey",
    "H. J. Morgan",
    "J. R. Hagy",
    "L. E. Belanger",
    "Wagoner"
  ],
  "recipient": "Domestic Intelligence Division",
  "sender": "E. S. Miller (Inspector)"
}