{
  "classification": "JFK Assassination",
  "document_type": "Paper, Textual Document",
  "security": "This document contains information about CIA operations, including potential contributions to the National Council of Churches and the existence of a 'safe house' at Airlie House, Warrenton, Virginia. Disclosing such information could compromise ongoing CIA activities and reveal sensitive operational details. For example, '...CIA had contributed at least one million dollars to the National Council of Churches. He also advised that the CIA maintains a safe house at the Airle House, Warrenton, Virginia.'",
  "security_level": "Secret",
  "summary": "This document contains FBI memos and airtels from 1967 regarding relations with the CIA, investigations into individuals, and requests for information related to CIA activities, including potential funding of the National Council of Churches and the handling of alien interview requests.",
  "summary_one_paragraph": "This collection of FBI documents from 1967 includes memos and airtels covering a range of topics, such as an investigation into Wendell R. Melquist and Anthony Lennon who registered at a motel in Biloxi, Mississippi; the restoration of covert inquiry capabilities in Macau by the CIA; the potential kidnapping threat against the children of a CIA employee in Venezuela, resulting in the FBI obtaining fingerprints; discussions between the FBI and CIA regarding coordination and information sharing, and an investigation into allegations that the CIA contributed funds to the National Council of Churches and maintained a safe house in Warrenton, Virginia; and a request for a tour of the FBI Laboratory by CIA technical personnel.",
  "tags": [
    "FBI",
    "CIA",
    "National Student Assoc",
    "Picketing",
    "Demonstration",
    "Wendell R. Melquist",
    "Anthony Lennon",
    "Macau",
    "Communist Party of Venezuela",
    "Kidnapping",
    "National Council of Churches",
    "Airlie House",
    "Alien Interview Requests",
    "JFK"
  ],
  "title": "CIA, NATIONAL STUDENT ASSOC, PICKETING, DEMONSTRATION",
  "date": "1967-02-16",
  "locations_mentioned": [
    "Biloxi, Mississippi",
    "Eugene, Oregon",
    "Flushing, New York",
    "Hong Kong",
    "Macau",
    "Venezuela",
    "Warrenton, Virginia",
    "Washington, D.C."
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Wendell R. Melquist",
    "Anthony Lennon",
    "Louise Skelton",
    "Richard Helms",
    "Emil R. Sveilis",
    "Lon Thomas",
    "Joseph Hall",
    "Stanley Schultz",
    "Jane Roman",
    "Joseph Edward Keogh",
    "Thomas Patrick Keogh, Jr.",
    "Christina Margarita Keogh",
    "Elizabeth Teresa Keogh",
    "Francis Xavier Keogh",
    "Thomas Patrick Keogh, III",
    "Maria Rita Keogh",
    "Carl Volker",
    "W. C. Sullivan",
    "D. J. Brennan, Jr.",
    "J. P. Mohr",
    "I. W. Conrad",
    "W. O. Cregar",
    "Leo Dunn",
    "J. W. Brown",
    "Eugene Young",
    "Becky Vaughn"
  ],
  "recipient": "SECRETARY OF STATE",
  "sender": "DIRECTOR, FBI"
}