{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "Disclosing specific investigative techniques, internal deliberations about handling sensitive information, and the identities of FBI personnel involved in these matters could compromise ongoing investigations and damage the Bureau's reputation. For example, the document refers to the monitoring of Martin Luther King, Jr., and the Southern Christian Leadership Conference, which could be seen as an abuse of power if revealed. The document also discusses the dissemination of information to external parties, such as Ralph McGill, which could be viewed as improper influence.",
  "security_level": "TOP SECRET",
  "summary": "This memorandum details the FBI's response to the Senate Select Committee's request for documents and information related to Martin Luther King, Jr., and the Southern Christian Leadership Conference (SCLC), outlining which items were provided and noting instances where requested materials could not be located.",
  "summary_one_paragraph": "In October 1975, a memorandum was prepared for the Attorney General and distributed to various FBI officials, concerning the delivery of FBI materials to the U.S. Senate Select Committee on Intelligence Activities (SSC) regarding Martin Luther King, Jr., and the Southern Christian Leadership Conference (SCLC). The memo references a September 1975 SSC request and details the FBI's response to specific items, including materials related to alleged communist influence, contacts between FBI officials and external figures, and internal discussions about King. It notes that some requested materials, such as approvals for certain recommendations and records of specific communications, could not be located, while others had already been provided under previous requests.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Martin Luther King, Jr.",
    "Southern Christian Leadership Conference",
    "Intelligence Activities",
    "Internal Security",
    "Communism",
    "COINTELPRO"
  ],
  "title": "Response to U. S. SENATE SELECT COMMITTEE ON INTELLIGENCE ACTIVITIES (SSC)",
  "date": "1975-10-10",
  "persons_mentioned": [
    "J. A. Mintz",
    "J. B. Hotis",
    "W. R. Wannall",
    "W. O. Cregar",
    "J. G. Deegan",
    "E. F. Glenn",
    "Michael E. Shaheen, Jr.",
    "John T. Elliff",
    "Robert Kennedy",
    "Burke Marshall",
    "Courtney Evans",
    "John Doar",
    "James R. Malley",
    "William C. Sullivan",
    "A. H. Belmont",
    "Hubert H. Humphrey",
    "Mildred Stegall",
    "Ralph Abernathy",
    "Moyers",
    "John Edgar Hoover",
    "Clyde Tolson",
    "Ralph McGill",
    "Alden F. Miller",
    "Eugene Patterson",
    "Fred Bennett"
  ],
  "recipient": "The Attorney General",
  "sender": "Director, FBI (possibly from J. Edgar Hoover)"
}