{
  "classification": "Liaison",
  "document_type": "Memorandum",
  "security": "Disclosing the specific requests from the Senate Select Committee (SSC) and the FBI's responses, including details on investigations related to Martin Luther King Jr. and the Southern Christian Leadership Conference, could reveal sensitive investigative methods and intelligence-gathering activities. For instance, detailing the FBI’s efforts to gather information on King's connections with communism, as reflected in requests pertaining to Sullivan's memoranda, could expose the extent and nature of FBI surveillance and counterintelligence operations. Sharing specific materials or the lack thereof could also reveal the scope of the FBI’s record-keeping and information dissemination practices.",
  "security_level": "TOP SECRET",
  "summary": "This memorandum discusses the delivery of FBI materials to the U.S. Senate Select Committee on Intelligence Activities (SSC) in response to their requests, particularly concerning Martin Luther King, Jr., and the Southern Christian Leadership Conference (SCLC). It details the specific items requested and the FBI's ability to locate and provide those materials.",
  "summary_one_paragraph": "This October 10, 1975, memorandum addresses the FBI's response to the U.S. Senate Select Committee on Intelligence Activities (SSC) regarding their requests for materials related to Martin Luther King, Jr., and the Southern Christian Leadership Conference (SCLC). The memo, sent from the FBI to the Attorney General and others, outlines the specific items requested by the SSC, including materials reflecting approval of Mr. Sullivan's recommendations, contacts between Mr. Sullivan and other individuals, and various documents and analyses. The memo indicates whether the requested materials could be located and provided, noting instances where no responsive materials were found or where materials had been previously furnished.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Martin Luther King Jr.",
    "Southern Christian Leadership Conference",
    "Intelligence Activities",
    "Domestic Intelligence",
    "Internal Security",
    "Counterintelligence"
  ],
  "title": "U. S. SENATE SELECT COMMITTEE ON INTELLIGENCE ACTIVITIES (SSC)",
  "date": "1975-10-10",
  "persons_mentioned": [
    "J. A. Mintz",
    "J. B. Hotis",
    "W. R. Wannall",
    "W. O. Cregar",
    "J. G. Deegan",
    "E. F. Glenn",
    "Michael E. Shaheen, Jr.",
    "John T. Elliff",
    "Robert Kennedy",
    "Hunter Fitts O'Dell",
    "Courtney Evans",
    "Burke Marshall",
    "William C. Sullivan",
    "A. H. Belmont",
    "Ralph McGill",
    "Alden F. Miller",
    "Eugene Patterson",
    "James R. Malley",
    "John Doar",
    "Hubert H. Humphrey",
    "Fred Bennett",
    "Stanley David Levison",
    "Nicholas A. Kourambis",
    "Frank Church",
    "Walter Mondale",
    "Philip A. Hart",
    "Gary Hart",
    "Howard H. Baker, Jr.",
    "Barry Goldwater",
    "Charles Mc C. Mathias, Jr.",
    "Richard S. Schweiker"
  ],
  "recipient": "The Attorney General",
  "sender": "FBI"
}