{
  "classification": "Soviet",
  "document_type": "Memorandum/Airtel",
  "security": "Disclosing Jaffe's cooperation could jeopardize his safety and career, as it reveals his role in providing information about Soviet nationals to the FBI.  As stated in the document: 'Informant is most security conscious and has repeatedly stated that if it became known that he was furnishing information to the Bureau on a confidential basis his career as a news reporter would be jeopardized.'",
  "security_level": "CONFIDENTIAL",
  "summary": "This document pertains to Samuel Adason Jaffe, a CBS news reporter acting as a confidential informant for the FBI, providing information on Soviet and satellite nationals in New York City; it details his contacts, the information he provided, and concerns about potential exposure due to marital difficulties.",
  "summary_one_paragraph": "These memoranda and airtels detail the FBI's relationship with Samuel Adason Jaffe, a CBS news reporter who has been a confidential informant since 1951, providing information about Soviet and satellite nationals, their activities, and contacts within the UN and NYC. The documents outline Jaffe's reporting activities, his reliability, security consciousness, and the value of the information he provides, as well as concerns about his marital difficulties and the potential threat of his wife revealing his informant status to the Soviets, which could jeopardize his career and safety; the FBI is advised to maintain contact while remaining aware of these risks.",
  "tags": [
    "FBI",
    "Informant",
    "Soviet Nationals",
    "Samuel Jaffe",
    "CBS",
    "Confidential Source",
    "Espionage",
    "UN",
    "Counterintelligence"
  ],
  "title": "Sam Jaffe",
  "date": "1959-09-28",
  "locations_mentioned": [
    "New York City",
    "Moscow",
    "Reno, Nevada",
    "Cape Cod, Massachusetts",
    "China",
    "London"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "Sam Jaffe",
    "J. Edgar Hoover",
    "Mr. Tolson",
    "C. D. DeLoach",
    "SAC Foster",
    "Nikita Khrushchev",
    "Viktor Osipov",
    "Roswell Garst",
    "Fred J. Cook",
    "Carey McWilliams",
    "George G. Kerstein",
    "GEORGE KENNAN HOURWICH",
    "CHARLES H. LIEB",
    "LOUIS F. BUDENZ",
    "FRANCIS X. PLANT",
    "ARTHUR ADAMS",
    "JOSEPH ISRAELS",
    "T. Scott Miller",
    "PETR BORISSOV",
    "VADIM BOGOSLOVSKI",
    "IMRE HOLLAI",
    "VLADIMIR P. SUSLOV",
    "VLADIMIR B. BARKOVSKY",
    "BORIS N. IVANOV",
    "VALDIMIR N. KRESTYANOV",
    "NIKOLAI S. KALININ"
  ],
  "recipient": "Director, FBI",
  "sender": "SAC, New York"
}