{
  "classification": "Personnel",
  "document_type": "Testimony",
  "security": "Disclosing specific details about FBI surveillance techniques, sources of information (characterizations), and the existence of programs like COINTELPRO, even if the agent claims ignorance, could jeopardize current or future investigations. For example, the document mentions: 'A characterization of an individual or organization at that time was prepared by the field office concerned, submitted to Bureau Headquarters for its approval... A characterization would not indicate the source of the information, unless public source information was utilized, otherwise the reliability or lack thereof of the source or sources would be indicated but not their identity.'",
  "security_level": "UNCLASSIFIED",
  "summary": "This document summarizes Alan G. Sentinella's testimony before the Senate Select Committee (SSC) on May 21, 1975, regarding investigations into Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison.",
  "summary_one_paragraph": "This document outlines the testimony of retired FBI Special Agent Alan G. Sentinella before the Senate Select Committee (SSC) on May 21, 1975, concerning investigations related to Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison; the testimony, prompted by a subpoena, addresses topics such as telephone surveillance practices, the characterization of individuals with alleged Communist Party connections, the Bureau's objectives in investigating King and the SCLC, and Sentinella's limited knowledge of COINTELPRO; Sentinella clarifies prior statements made during an interview on May 12, 1975, and answers questions about the surveillance of King's residences, the involvement of other individuals with CP connections, and the FBI's response to King's allegations of inadequate civil rights protections.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Alan G. Sentinella",
    "Martin Luther King Jr.",
    "SCLC",
    "Stanley Levison",
    "Surveillance",
    "COINTELPRO",
    "Testimony"
  ],
  "title": "Testimony before the Senate Select Committee (SSC)",
  "date": "1975-05-21",
  "locations_mentioned": [
    "Atlanta, Georgia",
    "Albany, Georgia",
    "South Georgia",
    "Birmingham"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "Alan G. Sentinella",
    "Robert Morgan",
    "Lester B. Seidel",
    "Jack Smith",
    "John Bailey",
    "Paul Daly",
    "Martin Luther King, Jr.",
    "Stanley Levison",
    "Charles Harding",
    "Richard Hamilton",
    "Hunter Pitts O'Dell (Jack O'Dell)",
    "Bayard Rustin",
    "Harry Wachtel",
    "Coretta King",
    "Al Miller (Alden Miller)",
    "William Sullivan",
    "Bob Nichols",
    "Andrew Young",
    "Henry Rouse",
    "Arthur Murtagh",
    "Richard Davis",
    "Donald Burgess",
    "Randall McGough",
    "Timothy Dorsch",
    "Charles Haynes",
    "Brian O'Shea",
    "J.B. Adams",
    "J.A. Mintz",
    "W.R. Wannall",
    "J.G. Deegan",
    "R.L. Shackelford",
    "W.O. Cregar",
    "S.F. Phillips",
    "K. Willian O'Connor"
  ],
  "recipient": "J. B. Adams, J. A. Mintz, W. R. Wannall, J. G. Deegan, R. L. Shackelford, W. O. Cregar, S. F. Phillips",
  "sender": "Alan G. Sentinella"
}