{
  "classification": "Liaison",
  "document_type": "Letter",
  "security": "The document mentions that the collection of political intelligence was concealed from the State Department and that there are a large number of CIA employees assigned to the U.S. Embassy at Kuala Lumpur. Revealing these details could damage relations with the State Department and expose CIA operations.",
  "security_level": "UNCLASSIFIED",
  "summary": "This letter transmits 23 documents to the Senate Select Committee (SSC) regarding contacts between the FBI, the President, and the Department of State on the subject of legal attaches during 1971.",
  "summary_one_paragraph": "On June 23, 1975, a letter from the FBI was sent to the United States Senate Select Committee (SSC) in response to the SSC's request for documents pertaining to the FBI and Department of Justice. The letter includes 23 enclosed documents related to meetings and contacts during 1971 between the President and the Director of the FBI, as well as between FBI and State Department officials concerning legal attaches. The letter specifies that contacts pertaining to individual legal attaches were excluded, and it notes that information about concealing the primary purpose of legal attaches (political intelligence collection) from the State Department and the presence of numerous CIA employees at the U.S. Embassy in Kuala Lumpur is included.",
  "tags": [
    "FBI",
    "Department of Justice",
    "Senate Select Committee",
    "Legal Attaches",
    "Political Intelligence",
    "CIA",
    "State Department"
  ],
  "title": "FURTHER DOCUMENTS PERTAINING TO THE FBI AND DEPARTMENT OF JUSTICE ORGANIZATION, STRUCTURE, AND JURISDICTION",
  "date": "1975-06-23",
  "locations_mentioned": [
    "Tel Aviv",
    "Kuala Lumpur"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "J. A. Mintz",
    "J. B. Hotis",
    "W. R. Wannall",
    "W. O. Cregar",
    "R. L. Moore",
    "The Attorney General"
  ],
  "recipient": "UNITED STATES SENATE SELECT COMMITTEE (SSC)",
  "sender": "FBI"
}