{
  "classification": "Commission",
  "document_type": "Report of Proceedings",
  "security": "Revealing details about FBI internal investigations and activities, like attempting to discredit Martin Luther King Jr. and the existence of sensitive information which is subject of ongoing operation is sensitive and could potentially harm ongoing operations and damage the FBI's reputation. Quoting directly: 'there is certain information which today, from an ongoing operation is sensitive and which, of course, we have made known to you and certain staff members.' Also, discussing motives behind actions, particularly those involving deceased individuals like Hoover, may raise privacy and ethical concerns.",
  "security_level": "UNCLASSIFIED",
  "summary": "This is a report of proceedings from a Senate Select Committee hearing in 1975 regarding intelligence activities, focusing on the FBI's domestic intelligence operations and potential abuses of power. Senator Mondale and Chairman Church express concerns about the FBI's surveillance and harassment of American citizens, particularly the attempts to discredit Martin Luther King Jr.",
  "summary_one_paragraph": "The document summarizes a hearing held on November 19, 1975, by the United States Senate Select Committee to Study Governmental Operations with Respect to Intelligence Activities. The hearing, chaired by Frank Church, included testimony from James B. Adams and Raymond Wannall of the FBI, addressing concerns raised by Senator Mondale about the FBI's domestic intelligence operations. Senator Mondale criticizes the FBI's surveillance of American citizens and its attempts to undermine individuals like Martin Luther King Jr., highlighting potential abuses of power and the need for accountability. Adams acknowledges certain improper actions by the FBI, such as attempts to discourage colleges from honoring King and interfering with King’s potential visit with the Pope, but claims a lack of clear understanding of the motives behind these actions.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Intelligence Activities",
    "Domestic Intelligence",
    "Abuse of Power",
    "Martin Luther King Jr.",
    "Surveillance",
    "Accountability",
    "Frank Church",
    "Walter Mondale",
    "James B. Adams",
    "Raymond Wannall"
  ],
  "title": "Intelligence Investigation: Report of Proceedings",
  "persons_mentioned": [
    "James B. Adams",
    "Raymond Wannall",
    "Frank Church",
    "Walter Mondale",
    "Martin Luther King Jr.",
    "Coretta King",
    "Frederick A.O. Schwarz, Jr.",
    "Curtis R. Smothers",
    "Hart (Michigan)",
    "Huddleston",
    "Hart (Colo)",
    "Baker",
    "Tower",
    "Gold",
    "Mathias",
    "Schweiker",
    "J. Edgar Hoover",
    "Mr. Sullivan",
    "President Roosevelt",
    "Justice Brandeis"
  ],
  "sender": "United States Senate Select Committee to Study Governmental Operations With Respect to Intelligence Activities"
}