{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "Releasing details about FBI investigative techniques, such as the use of characterizations of individuals with alleged CP connections without revealing the source of the information, could compromise current and future investigations. The memo states, 'A characterization would not indicate the source of the information, unless public source information was utilized, otherwise the reliability or lack thereof of the source or sources would be indicated but not their identity.'",
  "security_level": "CONFIDENTIAL",
  "summary": "This memorandum summarizes the testimony of retired FBI Special Agent Alan G. Sentinella before the Senate Select Committee (SSC) on May 21, 1975, regarding investigations into Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison, detailing electronic surveillance and alleged communist connections.",
  "summary_one_paragraph": "On June 9, 1975, a memorandum was created summarizing the May 21, 1975, testimony of retired FBI Special Agent Alan G. Sentinella before the Senate Select Committee (SSC) concerning FBI investigations of Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison. Sentinella's testimony, conducted primarily by Lester B. Seidel, covered topics such as the discontinuation of telephone surveillance at King's residence, the absence of direct surveillance on Levison in Atlanta, and the use of characterizations to denote alleged communist affiliations of Levison, O'Dell, Rustin, and Wachtel. The memo also recounts Sentinella's denial of involvement in efforts to disrupt Andrew Young’s political campaign and details the limited scope of surreptitious entries and electronic surveillance during his involvement.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Alan G. Sentinella",
    "Martin Luther King Jr.",
    "SCLC",
    "Stanley Levison",
    "Electronic Surveillance",
    "Communist Influence",
    "COINTELPRO"
  ],
  "title": "Testimony of Retired FBI Special Agent (SA) Before SSC Executive Session",
  "date": "1975-05-21",
  "persons_mentioned": [
    "Alan G. Sentinella",
    "Robert Morgan",
    "Lester B. Seidel",
    "Jack Smith",
    "John Bailey",
    "Paul Daly",
    "Martin Luther King Jr.",
    "Stanley Levison",
    "Charles Harding",
    "Richard Hamilton",
    "Hunter Pitts O'Dell",
    "Bayard Rustin",
    "Harry Wachtel",
    "Coretta King",
    "Al Miller",
    "Andrew Young",
    "William Sullivan",
    "Bob Nichols",
    "Donald Burgess",
    "Richard Davis",
    "Brian O'Shea",
    "Henry Rouse",
    "Arthur Murtagh",
    "Alden Miller",
    "Richard Davis",
    "Donald Burgess",
    "Randall McGough",
    "Timothy Dorsch",
    "Charles Haynes"
  ],
  "recipient": "Mr. J. B. Adams, Mr. J. A. Mintz, Mr. W. R. Wannall, Mr. J. G. Deegan, Mr. R. L. Shackelford, Mr. W. O. Cregar, Mr. S. F. Phillips",
  "sender": "S.F. Phillips (SFP)"
}