{
  "classification": "Liaison",
  "document_type": "Airtel",
  "security": "Sharing the details of this memo would reveal the identity of a confidential source (TP 41-C) and could compromise ongoing or future investigations. Disclosing Trafficante's known associates and residences could also hinder law enforcement efforts to monitor his activities. This document contains neither recommendations nor conclusions of the FBI. It is the property of the FBI and is loaned to your agency; it and its contents are not to be distributed outside your agency.",
  "security_level": "UNCLASSIFIED",
  "summary": "An FBI airtel from the Tampa field office to the FBI Director regarding Santo Trafficante, Jr.'s recent travels to London and associated gambling activities, including a Letterhead Memorandum (LHM) for transmittal to Legat London and photographs taken in New York.",
  "summary_one_paragraph": "On October 20, 1966, the FBI's Tampa office sent an airtel to the FBI Director concerning Santo Trafficante, Jr., reporting that Trafficante had recently mentioned his profitable gambling activities in London during Labor Day weekend. The airtel includes copies of a Letterhead Memorandum (LHM) destined for Legat London, two photographs of Trafficante from September 1966 in New York, and identifies the confidential source (TP 41-C) who provided the information. The FBI considered Trafficante armed and dangerous and included his physical description, known residences in Tampa, Miami, and St. Petersburg Beach, and his association with Dino Cellini in London.",
  "tags": [
    "FBI",
    "Santo Trafficante Jr.",
    "Gambling",
    "London",
    "Letterhead Memorandum",
    "Confidential Source",
    "Organized Crime"
  ],
  "title": "SANTO TRAFFICANTE, JR., aka",
  "date": "1966-10-20",
  "locations_mentioned": [
    "Tampa, Florida",
    "London, England",
    "St. Petersburg Beach, Florida",
    "Miami, Florida",
    "New York, New York"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Santo Trafficante, Jr.",
    "Dino Cellini",
    "John A. Ambler"
  ],
  "recipient": "Director, FBI",
  "sender": "SAC, TP"
}