{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "This document details requests from the Senate Select Committee on Intelligence Activities (SSC) to the FBI for materials related to Martin Luther King, Jr. and the Southern Christian Leadership Conference. It includes specific items requested, responses indicating whether materials could be located, and internal routing information. Revealing the specific investigative targets and the FBI's methods of compliance could expose ongoing intelligence activities and sources. The document notes, 'TOP SECRET MATERIAL ATTACHED ROUTE IN ENVELOPE TELETYPE UNIT'.",
  "security_level": "TOP SECRET",
  "summary": "This memorandum discusses the FBI's response to requests from the U.S. Senate Select Committee on Intelligence Activities (SSC) for materials related to Martin Luther King, Jr., and the Southern Christian Leadership Conference, detailing which items were provided and explaining instances where requested information could not be located.",
  "summary_one_paragraph": "On October 10, 1975, a memorandum was prepared to address the U.S. Senate Select Committee on Intelligence Activities' (SSC) request for FBI documents pertaining to Martin Luther King, Jr., and the Southern Christian Leadership Conference. The memo, addressed to the Attorney General, outlines the FBI's responses to specific items requested by the SSC, noting instances where materials reflecting approvals, contacts, or other information could not be located. It details the efforts made to provide the SSC with the requested information while maintaining records of the furnished materials and ensuring delivery through the Legal Counsel Division.",
  "tags": [
    "FBI",
    "Senate Select Committee on Intelligence Activities",
    "Martin Luther King Jr.",
    "Southern Christian Leadership Conference",
    "Intelligence Activities",
    "Document Request",
    "Top Secret"
  ],
  "title": "U. S. SENATE SELECT COMMITTEE ON INTELLIGENCE ACTIVITIES (SSC)",
  "date": "1975-10-10",
  "persons_mentioned": [
    "J. A. Mintz",
    "J. B. Hotis",
    "W. R. Wannall",
    "W. O. Cregar",
    "J. G. Deegan",
    "E. F. Glenn",
    "Michael E. Shaheen, Jr.",
    "Martin Luther King, Jr.",
    "Sullivan",
    "Belmont",
    "Mohr",
    "DeLoach",
    "Tolson",
    "Moore",
    "Ralph McGill",
    "Alden F. Miller",
    "Eugene Patterson",
    "John Doar",
    "James R. Malley",
    "Hoover",
    "Burke Marshall",
    "Hunter Fitts O'Dell",
    "Courtney Evans",
    "William D. Campbell",
    "John Matter",
    "Fred Bennett",
    "Stanley David Levison",
    "Nicholas A. Kourambis",
    "Frank Church",
    "Mildred Stegall",
    "Hubert H. Humphrey",
    "Abernathy (Reverend Ralph Abernathy)"
  ],
  "recipient": "The Attorney General",
  "sender": "Unknown"
}