{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "This document discusses CIA activities, including the incarceration of a Soviet defector, financial support to the FBI through the KORSAJ Program, arrangements for purchasing audio equipment to circumvent Federal statutes, and electronic penetration operations against foreign establishments, including the Chilean Embassy. Some of these operations were conducted without informing the FBI or with restricted briefings to top U.S. officials, like President Kennedy and Attorney General Robert Kennedy.  Specifically, Page 457-458: 'Top United States officials, including President Kennedy, were briefed concerning this operation. Then Attorney General Robert Kennedy after being briefed stated the operation was not to be called to the attention of the FBI unless FBI first initiated inquiry.'",
  "security_level": "Secret",
  "summary": "An FBI memorandum from W. G. Cregar to W. R. Wannall, dated June 20, 1975, discusses a CIA \"Secret\" document detailing questionable activities involving both the CIA and FBI, which are under review by the Senate Select Committee (SSC). It outlines briefings given to Intelligence Division personnel by Major Perry Miles regarding the document's contents, including specific instances of CIA activities that are subjects of current SSC inquiries.",
  "summary_one_paragraph": "On June 20, 1975, W. G. Cregar sent a memorandum to W. R. Wannall at the FBI to inform him that the Senate Select Committee (SSC) had been granted access to a CIA \"Secret\" document prepared in May 1973 detailing questionable activities involving both the CIA and FBI. Major Perry Miles briefed Intelligence Division personnel, including Cregar and Wannall, on the document's contents, which included information on the incarceration of a Soviet defector, CIA financial support to the FBI through the KORSAJ Program, arrangements to circumvent Federal statutes when buying audio equipment, and electronic penetration operations against foreign establishments like the Chilean Embassy. The memo highlights specific pages of the CIA document and emphasizes the need for the FBI to obtain a copy to accurately respond to SSC inquiries.",
  "tags": [
    "FBI",
    "CIA",
    "Senate Select Committee",
    "SSC",
    "KORSAJ Program",
    "Electronic Surveillance",
    "Chilean Embassy",
    "Soviet Defector",
    "Yuri Nosenko",
    "James R. Schlesinger",
    "JFK Assassination Records Act",
    "Intelligence Activities"
  ],
  "title": "SENSTUDY HAS NO OBJECTION TO 75 DECLASSIFICATION AND/OR, RELEASE IN DIA FORMATION",
  "conspiracy": "The memo references controversial CIA activities and the potential for the information to impact investigations related to the JFK assassination. Specifically, the memo details counterintelligence operations against foreign establishments in the United States where top US officials, including President Kennedy, were briefed.",
  "date": "1975-06-20",
  "locations_mentioned": [
    "Washington, D.C.",
    "New York City",
    "Chile"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "W. R. Wannall",
    "W. G. Cregar",
    "Perry Miles",
    "John Clarke",
    "Leon F. Schwartz",
    "John P. Thomas",
    "Seymor F. Phillips",
    "Fred J. Cassidy",
    "Thomas J. McNiff",
    "James R. Schlesinger",
    "Colby",
    "James A. Wilderotter",
    "General Allen",
    "Benson Buffham",
    "Yuri Nosenko",
    "Elmer W. Larson, Jr.",
    "K. William O'Connor",
    "President Kennedy",
    "Robert Kennedy",
    "McCone",
    "Belmont",
    "Sam Papich"
  ],
  "recipient": "W. R. Wannall",
  "sender": "W. G. Cregar"
}