{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "The memorandum discusses the authority of Congress to release classified data and refers to specific statutes related to national defense and foreign policy. Disclosing the legal analysis and opinions on this topic, especially the extent to which Congress is constitutionally immunized from consequences of releasing classified information, could undermine the CIA's ability to protect sensitive information and manage its relationship with Congress. Quoting directly: \"Despite this apparent lack of authority to release classified data and the existence of the above-mentioned statutes, Congress is constitutionally immunized, at least in part, against any consequences flowing from release and disclosure of classified information.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This document consists of a series of memoranda from April-May 1975, discussing the authority of Congress, particularly the Senate Select Committee chaired by Senator Frank Church, to declassify and release classified information, along with a legal memorandum prepared by the CIA's General Counsel on the subject.",
  "summary_one_paragraph": "This collection of memoranda from April and May 1975 centers on the legal and procedural aspects of Congressional authority to release classified information, spurred by Senator Frank Church's assertion of the Senate Select Committee's right to make public any received documents. The documents include a legal memorandum from the CIA's General Counsel, John S. Warner, analyzing Congress's authority to declassify data, with copies furnished to Antonin Scalia and James A. Wilderotter. The memos also summarize the rules and procedures of the Senate Select Committee, covering topics like subpoenas, testimony, and handling of sensitive material, aimed at informing relevant parties within the CIA and legal counsel on the parameters within which Congress could operate regarding classified information.",
  "tags": [
    "CIA",
    "Congress",
    "Declassification",
    "Classified Data",
    "Senate Select Committee",
    "Frank Church",
    "Legal Analysis",
    "Speech or Debate Clause",
    "SENSTUDY 75"
  ],
  "title": "SENSTUDY 75: Authority of Congress to Release Classified Data",
  "date": "1975-04-24",
  "locations_mentioned": [
    "Washington D.C."
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "W. R. Wannall",
    "W. O. Cregar",
    "J. B. Adams",
    "J. A. Mintz",
    "J. B. Hotis",
    "Edmund Cohen",
    "Antonin Scalia",
    "James A. Wilderotter",
    "Frank Church",
    "John S. Warner",
    "Harriett D. Mowitt",
    "Clarke"
  ],
  "recipient": "Mr. W. R. Wannall",
  "sender": "Mr. W. O. Cregar"
}