{
  "classification": "FBI",
  "document_type": "Report",
  "security": "This document details an FBI investigation into Angelo Bruno's racketeering activities, including his associates, criminal activities, and legitimate enterprises. Releasing information about informants (T-1, T-2, T-3, T-4, PH 251-C, PH 269-C, PH 518-C, PH 489-C, PH 535-C, PH 523-C) and their knowledge of Bruno's activities could compromise their safety and the FBI's intelligence-gathering capabilities.",
  "security_level": "UNCLASSIFIED",
  "summary": "FBI report on Angelo Bruno's anti-racketeering activities, including illegal activities, associates, and business ventures in Philadelphia, Miami, and New Jersey. It details his involvement in numbers rackets, loan sharking, Cuban gambling interests, and attempts to secure a trash removal contract in Philadelphia.",
  "summary_one_paragraph": "This FBI report, dated November 24, 1959, details an investigation into Angelo Bruno's anti-racketeering activities, focusing on his operations in Philadelphia, Miami, and New Jersey. The report outlines Bruno's involvement in numbers rackets, loan sharking, and his past interests in Cuban gambling casinos, as well as his attempts to secure a contract for trash removal in Philadelphia via connections with city council members. It includes information gathered from informants, credit checks, and surveillance, documenting Bruno's associates, criminal activities, and travel habits.",
  "tags": [
    "FBI",
    "Angelo Bruno",
    "Anti-Racketeering",
    "Organized Crime",
    "Gambling",
    "Trash Removal Contract",
    "Informants"
  ],
  "title": "ANGELO BRUNO",
  "date": "1959-11-24",
  "locations_mentioned": [
    "Philadelphia, PA",
    "Miami, FL",
    "Mt. Holly, NJ",
    "Trenton, NJ",
    "Cuba",
    "Havana, Cuba",
    "Dominican Republic",
    "Salem County, NJ"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "J. Robert Pearce",
    "Angelo Bruno",
    "Ben Gallup",
    "Eloise Mangone",
    "Joseph Mangone",
    "Philip Testa",
    "Carl Pappy Ippolito",
    "J. Annaloro",
    "Tom Clooney",
    "Paul D'Ortona",
    "Sam Rose",
    "Domenick Pollina",
    "Harry E. Greenwald",
    "Riess Ewen",
    "Thomas Dickson",
    "John Pollina",
    "Charles Acton",
    "A. W. W. Howell",
    "Emil Dalint",
    "John J. Burgin",
    "John Zemhampski",
    "Joseph Hersch",
    "Glen Asmussen",
    "Wallace Shanley"
  ],
  "recipient": "Director, FBI",
  "sender": "Pearce, J. Robert"
}