{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "This report is classified 'Secret', inasmuch as information received from CIA, San Juan, was so classified.",
  "security_level": "Secret",
  "summary": "An FBI memorandum from the Miami SAC to the Director, FBI, regarding Pedro Luis Diaz Lanz, Renaldo Blanco Hernandez, and Alberto Eusebio Mojena, classified as 'Secret' due to information received from the CIA in San Juan. It encloses a report from SA Robert James Dwyer and a Letterhead Memorandum, with all information provided to the United States Customs Office, Miami, as instructed.",
  "summary_one_paragraph": "This FBI memorandum, dated October 2, 1958, from the SAC in Miami to the Director of the FBI, concerns Pedro Luis Diaz Lanz, Renaldo Blanco Hernandez, and Alberto Eusebio Mojena in relation to Cuba. The memo includes a report by SA Robert James Dwyer and a Letterhead Memorandum, and it notes that all information has been shared with the U.S. Customs Office in Miami per instructions. The classification is 'Secret' due to the source of some information being the CIA in San Juan, and the memo lists various sources of information, including informants and reports from different agencies and individuals.",
  "tags": [
    "FBI",
    "CIA",
    "Pedro Luis Diaz Lanz",
    "Renaldo Blanco Hernandez",
    "Alberto Eusebio Mojena",
    "Cuba",
    "Miami",
    "Customs Office",
    "Informants",
    "JFK Assassination Records Act"
  ],
  "title": "PEDRO LUIS DIAZ LANZ; RENALDO BLANCO HERNANDEZ; ALBERTO EUSEBIO MOJENA",
  "date": "1958-10-02",
  "locations_mentioned": [
    "Miami",
    "Cuba",
    "San Juan",
    "Havana",
    "Guantanamo Bay",
    "Pue Rico"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Pedro Luis Diaz Lanz",
    "Renaldo Blanco Hernandez",
    "Alberto Eusebio Mojena",
    "Robert James Dwyer",
    "David R. McClain",
    "FIGUERO",
    "HOWARD ALBAUGH",
    "George E. Davis",
    "Robert James Dwyer",
    "Ricardo Lorie",
    "Betty Stafford",
    "Leman L. Updegrave"
  ],
  "recipient": "Director, FBI",
  "sender": "SAC, MM"
}