{
  "classification": "Personnel",
  "document_type": "Memorandum",
  "security": "This document contains testimony about FBI investigations into Martin Luther King Jr. and the Southern Christian Leadership Conference (SCLC), including details about electronic surveillance and alleged Communist Party (CP) connections of King's associates. Releasing specific details about surveillance methods (e.g., telephone surveillance, surreptitious entries) and the focus on CP affiliations could expose past investigative techniques and potentially damage the FBI's reputation. The document also mentions COINTELPRO, a controversial FBI program. Specifically, the witness discusses amending his previous testimony based on information from another agent, revealing the collaborative nature of testimony preparation. Quoting: \"A. Only to the extent that subsequent to May the 12th I conferred with a former Agent, Charles Harding...he informed me that my answer was incorrect and mentioned the change in the King residence...When he informed me of this I immediately recalled the change...\"",
  "security_level": "CONFIDENTIAL",
  "summary": "A memorandum summarizing the testimony of retired FBI Special Agent Alan G. Sentinella before the Senate Select Committee on Intelligence Activities (SSC) regarding investigations into Martin Luther King Jr., the SCLC, and Stanley Levison.",
  "summary_one_paragraph": "This memorandum details the testimony of retired FBI Special Agent Alan G. Sentinella before the Senate Select Committee on Intelligence Activities (SSC) on May 21, 1975. Sentinella discussed his involvement in investigations of Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison, including the use of telephone surveillance and efforts to determine communist influence. He addressed questions about the continuation of surveillance after King's assassination, the basis for presumptions about Levison's CP connections, and the FBI's efforts to influence political campaigns. The testimony also covered the FBI's policy on surreptitious entries and Sentinella's recollection of the COINTELPRO program.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Intelligence Activities",
    "Martin Luther King Jr.",
    "Southern Christian Leadership Conference",
    "Stanley Levison",
    "COINTELPRO",
    "Electronic Surveillance",
    "Communist Party",
    "Alan G. Sentinella"
  ],
  "title": "Testimony of Retired FBI Special Agent Alan G. Sentinella before SSC Executive Session",
  "date": "1975-05-21",
  "persons_mentioned": [
    "Alan G. Sentinella",
    "Robert Morgan",
    "Lester B. Seidel",
    "Jack Smith",
    "John Bailey",
    "Paul Daly",
    "Martin Luther King Jr.",
    "Stanley Levison",
    "Charles Harding",
    "Richard Hamilton",
    "Hunter Pitts O'Dell (Jack O'Dell)",
    "Bayard Rustin",
    "Harry Wachtel",
    "Coretta King",
    "Al Miller (Alden Miller)",
    "Andrew Young",
    "William Sullivan",
    "Bob Nichols",
    "Arthur Murtagh",
    "Richard Davis",
    "Donald Burgess",
    "Randall McGough",
    "Timothy Dorsch",
    "Charles Haynes",
    "Brian O'Shea",
    "Henry Rouse",
    "J.B. Adams",
    "J.A. Mintz",
    "W.R. Wannall",
    "J.G. Deegan",
    "R.L. Shackelford",
    "W.O. Cregar",
    "S.F. Phillips",
    "James A. Wilderotter",
    "K. William O'Connor"
  ],
  "recipient": "J. B. Adams, J. A. Mintz, W. R. Wannall, J. G. Deegan, R. L. Shackelford, W. O. Cregar, S. F. Phillips",
  "sender": "SFP:ekw"
}