{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "Releasing details about FBI surveillance methods, like targeting individuals affiliated with the Communist Party or conducting electronic surveillance on civil rights leaders, could expose law enforcement tactics and compromise ongoing or future investigations. Disclosing names of FBI agents involved in these activities also presents a security risk. \"There was no such coverage per se only such as afforded by contacts made of King or members of the SCLC staff by Levison.\" Releasing that sentence is potentially damaging.",
  "security_level": "CONFIDENTIAL",
  "summary": "This memorandum summarizes Alan G. Sentinella's testimony before the Senate Select Committee (SSC) concerning FBI investigations into Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison, detailing surveillance activities and objectives.",
  "summary_one_paragraph": "On June 9, 1975, a memorandum was issued summarizing the testimony of retired FBI Special Agent Alan G. Sentinella before a Senate Select Committee (SSC) executive session on May 21, 1975. Sentinella's testimony, which was voluntarily furnished to the FBI, concerned his involvement in investigations related to Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison, focusing on the extent of telephone surveillance, the alleged Communist Party (CP) connections of Levison and others, and the FBI's objectives in investigating King and the SCLC. The memorandum outlines questions asked by SSC staff member Lester B. Seidel and Sentinella's responses, including details about discontinued surveillance on King's residence and the lack of evidence establishing King as a communist.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Alan G. Sentinella",
    "Martin Luther King Jr.",
    "SCLC",
    "Stanley Levison",
    "Surveillance",
    "Communist Party",
    "COINTELPRO"
  ],
  "title": "Testimony of Retired FBI Special Agent (SA) Before SSC Executive Session",
  "date": "1975-06-09",
  "locations_mentioned": [
    "Atlanta, Georgia",
    "Albany, Georgia",
    "South Georgia",
    "Birmingham"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "Alan G. Sentinella",
    "Robert Morgan",
    "Lester B. Seidel",
    "Jack Smith",
    "John Bailey",
    "Paul Daly",
    "Martin Luther King Jr.",
    "Stanley Levison",
    "Charles Harding",
    "Richard Hamilton",
    "Hunter Pitts O'Dell",
    "Bayard Rustin",
    "Harry Wachtel",
    "Coretta King",
    "Alden Miller",
    "William Sullivan",
    "Bob Nichols",
    "Andrew Young",
    "Donald Burgess",
    "Richard Davis",
    "Brian O'Shea",
    "Henry Rouse"
  ],
  "recipient": "J. B. Adams, J. A. Mintz, W. R. Wannall, J. G. Deegan, R. L. Shackelford, W. O. Cregar, S. F. Phillips"
}