{
  "classification": "Commission",
  "document_type": "Report",
  "security": "Releasing specific telephone numbers and associated individuals or businesses could potentially compromise ongoing investigations or reveal sensitive sources of information, especially given the references to 'highly confidential Bureau techniques' and 'highly confidential Bureau coverage'.",
  "security_level": "Unclassified",
  "summary": "This FBI report, dated December 3, 1962, details an investigation into Santo Trafficante, Jr., focusing on his possible involvement in racketeering and gambling activities. It outlines investigative leads, including telephone toll analysis and informant information, to determine Trafficante's connections and activities in Florida and elsewhere.",
  "summary_one_paragraph": "An FBI report from December 3, 1962, authored by SA Stephen J. Labadie, summarizes the Tampa office's investigation into Santo Trafficante, Jr.'s potential racketeering activities. The report details efforts to identify Trafficante's associates and uncover evidence related to gambling operations, particularly those involving slot machines aboard ships like the 'Orange Sun' and 'Wappan Von Hamburg.' Investigative leads include analyzing telephone toll calls from various locations connected to Trafficante and his associates, intensifying surveillance at Trafficante's residence, and maintaining contact with informants to gather information on his activities and connections, including potential subpoena before a Grand Jury in Orlando. The document specifies investigative actions for various FBI field offices, including Atlanta, Cincinnati, Jacksonville, Miami, New York, and Tampa, aimed at identifying telephone subscribers and establishing connections to Trafficante and his associates.",
  "tags": [
    "FBI",
    "Santo Trafficante Jr.",
    "Racketeering",
    "Gambling",
    "Telephone Records",
    "Informants",
    "Surveillance",
    "Grand Jury",
    "Organized Crime",
    "Wappan Von Hamburg",
    "Orange Sun"
  ],
  "title": "Santo Trafficante, Jr., Aka",
  "date": "1962-12-03",
  "origin_agency": "FBI",
  "sender": "LABADIE, STEPHEN J. , SA STEPHEN J. LABADIE, AR, IC HENRY E. MC INTURFF, IC E. CLEON GLAZE mgw, GEORGE CARNES, C HARLES CUCCIA, PCI, PETER GIAMPAPA, PCI, DOMINICK LA ROCA PCI, CESAR MARIO CAPAZ, PCI, ROLANDO RODRIGUEZ, PCI, CARL D. BROREIN, JR., PRESTON M COLLINS, WILLIAM KENNEY, EDWARD F. BOARDMAN, JOHN CASEBOLT, VICTOR S. GUFFRIS, PAT WHITAKER, STEFANO ANTHONY RANDAZZO, HARLAN BLACKBURN, RITA GARCIA, ELIANA ELLANA DE MARCOS, SIEBERT, JOSEPH GARCIA, ROSE M, JOE A. GARCIA, SARA ANN TRAFFICANTE, JAMES C. LONGO, FRANK CONIGLIO, FRANCIS CACCIATORE, RUBY STRAUSS, JOSEPH ANTHONY INDELICATO, SIDNEY HOROWITZ, LARRY DE JOSEPH, HARRY I MC INTURFF dh, SPECIAL AGENT IN CHARGE APPROVED, TP T-1, TP T-2, TP T-7, TP T-9, TP T-10, SOUTHERN BELL TELEPHONE AND TELEGRAPH COMPANY MR WILLIAM KENNEY"
}