{
  "classification": "Senate Select Committee (SSC) Investigation",
  "document_type": "Memorandum and Teletype",
  "security": "The documents contain sensitive information regarding FBI sources and methods, including the identity of a former informant, Douglas Durham, and details about his contact with the Office of Senator Frank Church. The routing slip also highlights the SSC's interest in specific FBI communications and personnel, which could expose ongoing investigations and compromise sources. As stated: \"If used in a future report, conceal all sources, paraphrase contents.\"",
  "security_level": "Unclassified (with one Secret enclosure)",
  "summary": "This collection of FBI documents from April and May 1975 pertains to the Senate Select Committee (SSC) investigation into intelligence activities, including FBI policies, procedures, and personnel, as well as the Bureau's monitoring of potential witnesses and interactions with the committee.",
  "summary_one_paragraph": "These FBI documents, dated from April to May 1975, relate to the Senate Select Committee's investigation into intelligence activities. The documents include memoranda detailing the FBI's cooperation with the SSC, such as providing lists of personnel and access to FBI manuals, and monitoring potential witnesses, such as Douglas Durham, a former informant for the FBI, and William P. George, a former FBI agent. The documents also include a routing slip directing SACs to be aware of SSC interest in Bureau communications and personnel.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Intelligence Activities",
    "Douglas Durham",
    "Frank Church",
    "William P. George",
    "Hoover Memoranda",
    "SENSTUDY 75"
  ],
  "title": "Material for Senate Select Committee (SSC) Investigating Intelligence Activities",
  "date": "1975-04-30",
  "locations_mentioned": [
    "Washington, D.C.",
    "Omaha",
    "Alexandria, VA",
    "McLean, VA",
    "St. Anne, Guadalupe",
    "Chevy Chase, Maryland",
    "Hyde Park, NY"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "S. F. Phillips",
    "William Miller",
    "Douglas Durham",
    "Keith E. Uhl",
    "Frank Church",
    "W. R. Wannall",
    "W. O. Cregar",
    "James Wilderotter",
    "Alonzo L. Lacey",
    "J. A. Mintz",
    "A. B. Fulton",
    "Donald B. Schewe",
    "Franklin D. Roosevelt",
    "Cordell Hull",
    "John Edgar Hoover",
    "Tamm",
    "William P. George",
    "Harold P. Leinbaugh",
    "Donald G. Hanning",
    "John J. Quinn",
    "Armand Cammarota",
    "Callahan",
    "J. B. Adams",
    "Kelley"
  ],
  "recipient": "SACs (Special Agents in Charge)",
  "sender": "S. F. Phillips, W. R. Wannall, J. B. Adams"
}