{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "This document details FBI investigation into David Yaras, including his association with individuals involved in bombings and illegal activities. It also contains information about CIA informant Luis Posada Carriles and his contacts related to explosives and anti-Castro activities. Revealing these details could compromise ongoing investigations, expose sources, and damage relationships with other agencies. For example: \"Will continue to follow and report on the activities of YARAS...Information below relates to contacts with LUIS POSADA CARRILES in regard to his knowledge of the activi-ties of captioned individual. At the time of original contact with CARRILES, he was an employee of CIA.\"",
  "security_level": "Secret",
  "summary": "FBI report on David Yaras, investigating his involvement in various criminal activities, including bombings in Miami, and his connections to figures like Frank Rosenthal and Luis Posada Carriles, a former CIA employee.",
  "summary_one_paragraph": "This secret FBI report from November 21, 1967, details the investigation into David Yaras and his alleged criminal activities, including bombing incidents in the Miami area. The report outlines FBI efforts to identify Yaras's associates and probe his involvement in possible extortion schemes, with investigative leads directed towards Chicago and Los Angeles. It also covers contacts with Luis Posada Carriles, formerly employed by the CIA, regarding Yaras's activities and his relationship with Frank Rosenthal, including discussions of explosives and potential connections to Cuban gambling operations. The report indicates a complex web of relationships among individuals involved in organized crime, anti-Castro activities, and potential threats to national security.",
  "tags": [
    "FBI",
    "David Yaras",
    "Luis Posada Carriles",
    "Frank Rosenthal",
    "Bombings",
    "Miami",
    "CIA",
    "Extortion",
    "Cuban Activities",
    "Organized Crime"
  ],
  "title": "",
  "date": "1967-11-21",
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Dave Yaras",
    "David Yaras",
    "Ralph R. Hill, Jr.",
    "Leonard Patrick",
    "Herman Sales",
    "Frank \"Lefty\" Rosenthal",
    "Luis Posada Carriles",
    "Diego Borges",
    "Herminio Diaz",
    "Ramon Escarda",
    "Frank Tamayo",
    "Norman Rothman",
    "Domingo Chemendia",
    "Oscar Echemendia",
    "Olga Chaviano",
    "Alberto Larrain/Maestre",
    "Lucio Cabrera",
    "Luis Marti",
    "Evaristo Carcia Vidal",
    "Meyer Lansky"
  ],
  "recipient": "HQ",
  "sender": "MM"
}