{
  "classification": "Administrative",
  "document_type": "Memorandum and Letter",
  "security": "The attached list of retrievable programs, projects, surveys and procedures employed in connection with domestic intelligence operations of the FBI which may be of interest to you. There were a number of other programs, projects, surveys and procedures employed in connection with foreign counterintelligence operations of the FBI which are not included. In the event you desire information concerning these latter items, which include extremely sensitive matters, we would be pleased to discuss them with SSC Staff Members at FBI Headquarters.",
  "security_level": "UNCLASSIFIED",
  "summary": "This file contains a 1952 letter from the State Law Department to the FBI regarding an inquiry about a Gurney and the Industrial Employment Review Board, as well as a 1975 memo from the FBI to the Senate Select Committee (SSC) providing a list of retrievable domestic intelligence programs and offering to discuss sensitive foreign counterintelligence operations.",
  "summary_one_paragraph": "The file includes correspondence beginning with a July 16, 1952, letter from the State Law Department of Baltimore to the FBI, inquiring about a 'Gurney' and the Industrial Employment Review Board. It is followed by a July 25, 1975, memorandum from the FBI to the United States Senate Select Committee to Study Governmental Operations with Respect to Intelligence Activities (SSC), offering a list of retrievable domestic intelligence programs, projects, surveys, and procedures and proposing to discuss sensitive foreign counterintelligence operations at FBI Headquarters.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Domestic Intelligence",
    "Counterintelligence",
    "Programs",
    "Projects",
    "Surveys",
    "Procedures",
    "Industrial Employment Review Board"
  ],
  "title": "Further Documents Pertaining to the FBI and Department of Justice Policies and Procedures",
  "date": "1952-07-16",
  "origin_agency": "Federal Bureau of Investigation (FBI), State Law Department of Baltimore",
  "recipient": "Federal Bureau of Investigation, United States Senate Select Committee",
  "sender": "O. J. W. Cockett (Special Assistant Attorney General), T. E. Burns Jr. (FBI)"
}