{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "Releasing details about the surveillance of Martin Luther King Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison could expose sensitive investigative techniques, informants, and operational details used by the FBI during the 1960s. Discussing the alleged CP connections of individuals associated with King may also be deemed controversial. Sharing the extent to which the FBI investigated King’s associates or suggesting that the FBI was unresponsive to civil rights complications could damage its reputation.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a memorandum summarizing the testimony of retired FBI Special Agent Alan G. Sentinella before the Senate Select Committee (SSC) on May 21, 1975, regarding investigations into Martin Luther King, Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison.",
  "summary_one_paragraph": "The memorandum details the testimony of Alan G. Sentinella, a retired FBI agent, before the Senate Select Committee on May 21, 1975, concerning investigations of Martin Luther King, Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison. Sentinella's testimony covers topics such as telephone surveillance practices, alleged communist connections of King's associates, the objectives of the investigations, and his recollections of the Bureau's efforts, including the alleged lack of responsiveness to civil rights complications in the South. The memorandum also includes questions and answers from the session, reflecting Sentinella's recollections and interactions with the committee staff.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Martin Luther King Jr.",
    "SCLC",
    "Stanley Levison",
    "Telephone Surveillance",
    "COINTELPRO",
    "Communist Influence",
    "Alan G. Sentinella"
  ],
  "title": "Testimony of Retired FBI Special Agent Alan G. Sentinella Before SSC Executive Session",
  "date": "1975-05-21",
  "persons_mentioned": [
    "Alan G. Sentinella",
    "Robert Morgan",
    "Lester B. Seidel",
    "Jack Smith",
    "John Bailey",
    "Paul Daly",
    "Martin Luther King, Jr.",
    "Stanley Levison",
    "Charles Harding",
    "Richard Hamilton",
    "Hunter Pitts O'Dell",
    "Bayard Rustin",
    "Harry Wachtel",
    "Coretta King",
    "Al Miller",
    "William Sullivan",
    "Bob Nichols",
    "Andrew Young",
    "Donald Burgess",
    "Richard Davis",
    "Brian O'Shea",
    "Henry Rouse",
    "Arthur Murtagh",
    "Alden Miller",
    "Randall McGough",
    "Timothy Dorsch",
    "Charles Haynes",
    "J. Edgar Hoover"
  ],
  "recipient": "J. B. Adams, J. A. Mintz, W. R. Wannall, J. G. Deegan, R. L. Shackelford, W. O. Cregar, S. F. Phillips, The Attorney General, Director, FBI, James A. Wilderotter",
  "sender": "SFP:ekw"
}