{
  "classification": "Cuba",
  "document_type": "Paper, Textual Document (INC MEMO)",
  "security": "This document discusses CIA relationships with individuals involved in the bombing of a Cubana airliner and outlines specific questions to the CIA regarding those relationships. Releasing details about these relationships and the information sought by the DOS could reveal intelligence sources and methods, as well as compromise ongoing investigations. For instance, the document asks, \"Has CIA had any relationship with Posada's investigative agency or any other business he may have had?\" and \"What was the nature of the contacts CIA had with Posada after he was terminated?\"",
  "security_level": "Secret/Sensitive",
  "summary": "A memo from Harold H. Saunders (DOS) to The Secretary regarding Fidel Castro's allegations of CIA involvement in the Cubana airliner bombing, including questions for the CIA about its relationship with Luis Posada Carriles and others involved.",
  "summary_one_paragraph": "This document, dated October 18, 1976, is a memo from Harold H. Saunders at the Department of State to the Secretary addressing Fidel Castro's allegations concerning CIA involvement in the bombing of a Cubana airliner. The memo includes a series of questions directed to the CIA seeking clarification on its relationships with individuals such as Luis Posada Carriles and Orlando Bosch, who are suspected of involvement in the bombing. It also delves into the nature of CIA contacts with Posada, visa matters, and any additional relevant information the CIA might possess regarding the sabotage and individuals named in the draft memorandum.",
  "tags": [
    "JFK Assassination Records Act",
    "FBI",
    "DOS",
    "Castro",
    "Fidel",
    "CIA",
    "Cubana Airliner Bombing",
    "Luis Posada Carriles",
    "Orlando Bosch",
    "CORU",
    "Venezuela",
    "Terrorism"
  ],
  "title": "Castro, Fidel, Speech, Allegations, CIA Involvement, Cubana Airliner, Bombing",
  "date": "1976-10-18",
  "locations_mentioned": [
    "Cuba",
    "Barbados",
    "Venezuela",
    "Trinidad",
    "Caracas",
    "Panama",
    "Havana",
    "Jamaica",
    "Miami",
    "Santo Domingo",
    "Mexico"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Fidel Castro",
    "Harold H. Saunders",
    "Luis Posada Carriles",
    "Orlando Bosch",
    "Hernan Ricardo Lozano",
    "Freddy Lugo",
    "Frank Castro",
    "Orlando Garcia",
    "Ricardo Morales Navarrete",
    "Felix Martinez Suarez",
    "Roberto Carballo"
  ],
  "sender": "SAUNDERS, HAROLD H."
}