{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "Revealing specific investigative tactics, such as electronic surveillance, and the internal policies regarding their authorization could compromise current law enforcement and intelligence gathering methods. Discussing the focus on determining communist influence within civil rights organizations and political campaigns could also be perceived as politically motivated and damage the reputation of the Bureau. Quoting directly: 'Continuance was not authorized by the AG,' and 'To determine possible communist influence of King and SCLC.'",
  "security_level": "CONFIDENTIAL",
  "summary": "This document is a memorandum summarizing the testimony of retired FBI Special Agent Alan G. Sentinella before the Senate Select Committee (SSC) regarding investigations into Martin Luther King, Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison, focusing on electronic surveillance and potential communist influence.",
  "summary_one_paragraph": "This memorandum, dated May 21, 1975, recounts the testimony of retired FBI Special Agent Alan G. Sentinella before the Senate Select Committee concerning FBI investigations of Martin Luther King, Jr., the SCLC, and Stanley Levison. Sentinella's testimony covers topics such as the authorization and continuation of telephone surveillance on King and SCLC, the FBI's characterization of Levison's communist connections, and efforts to determine communist influence within these organizations. The memo also details the circumstances surrounding Sentinella's testimony, including the presence of committee members and counsel, and his assertion of rights and privileges as a witness.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Alan G. Sentinella",
    "Martin Luther King Jr.",
    "SCLC",
    "Stanley Levison",
    "Electronic Surveillance",
    "Communist Influence",
    "COINTELPRO"
  ],
  "title": "Testimony of Retired FBI Special Agent Alan G. Sentinella Before SSC Executive Session",
  "date": "1975-05-21",
  "locations_mentioned": [
    "Atlanta, Georgia",
    "Albany, Georgia",
    "South Georgia",
    "Valdosta, Georgia",
    "Birmingham"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "Alan G. Sentinella",
    "Robert Morgan",
    "Lester B. Seidel",
    "Jack Smith",
    "John Bailey",
    "Paul Daly",
    "Martin Luther King, Jr.",
    "Stanley Levison",
    "Charles Harding",
    "Richard Hamilton",
    "Hunter Pitts O'Dell (Jack O'Dell)",
    "Bayard Rustin",
    "Harry Wachtel",
    "Coretta King",
    "Al Miller",
    "Andrew Young",
    "William Sullivan",
    "Bob Nichols",
    "Henry Rouse",
    "Arthur Murtagh",
    "Richard Davis",
    "Donald Burgess",
    "Randall McGough",
    "Timothy Dorsch",
    "Charles Haynes",
    "Brian O'Shea",
    "J. Edgar Hoover"
  ],
  "recipient": "J. B. Adams, J. A. Mintz, W. R. Wannall, J. G. Deegan, R. L. Shackelford, W. O. Cregar, S. F. Phillips, Attorney General, Director, FBI",
  "sender": "S.F. Phillips"
}