{
  "classification": "Cuba",
  "document_type": "Textual Document",
  "security": "This document details covert activities aimed at destabilizing the Cuban government, including plans for sabotage, assassination attempts, and establishing contacts for financial support and coordination against Fidel Castro. The document references plans to furnish $20,000 to a 40-man group of followers in Camaguey with the aim of raiding La Cabaña prison. Revealing these details could expose ongoing or planned covert operations, endangering individuals involved and compromising intelligence sources. As directly quoted from the document, it speaks to plans that \"Don Fidel may not last until the New Year\" and to 'reorganize our rank and file, since the thing is soon,' signaling imminent subversive actions.",
  "security_level": "Secret",
  "summary": "This document, dated October 26, 1959, details the activities of anti-Castro groups in Cuba and Miami, including plans for sabotage, assassination attempts, and efforts to reorganize and fund counter-revolutionary movements.",
  "summary_one_paragraph": "A CIA document dated October 26, 1959, reveals the activities of anti-Castro groups, including the Cruzada Revolucionaria Anti Comunista, led by Reinaldo BLANCO Navarro. The document outlines plans for sabotage and assassination attempts in Cuba, particularly targeting La Cabaña prison. It describes communication networks between leaders in prison and followers in Miami, efforts to secure funding, and strategies for reorganizing counter-revolutionary groups. Manuel BLANCO Navarro in Miami sends messages to Orlando VELAZCO in Cuba, instructing him to contact Reinaldo BLANCO Navarro in prison and establish a courier system, while also seeking financial support from various individuals and contacts.",
  "tags": [
    "CIA",
    "Cuba",
    "Counter-Revolutionary Activities",
    "Anti-Castro",
    "Sabotage",
    "Assassination",
    "CRAC",
    "Manuel BLANCO Navarro",
    "Reinaldo BLANCO Navarro",
    "Fidel Castro",
    "La Cabaña prison"
  ],
  "title": "Report on Anti-Castro Activities",
  "date": "1959-10-26",
  "locations_mentioned": [
    "Cuba",
    "Miami",
    "Camaguey Province",
    "La Cabaña prison",
    "Pinar del Rio",
    "Los Palacios",
    "Matanzas",
    "Santa Clara",
    "Cardenas",
    "Habana",
    "Montclair, New Jersey",
    "New York"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Jose Rasco Bermuda",
    "Reinaldo BLANCO Navarro",
    "PRUNA Blanco",
    "Narciso NAVARRO",
    "Jesus CABRERA",
    "Manuel BLANCO Navarro",
    "Orlando VELAZCO",
    "Fidel Castro",
    "Carlos LOSADA",
    "Angel MARTINEZ",
    "Haydee",
    "William Morgan",
    "Eloy GUTIERREZ Menoyo",
    "Francisco RODRIGUEZ",
    "Jorge GUTIERREZ Izaguirre",
    "Francisco GONZALEZ",
    "Valentin ARENAS",
    "Jose Ignacio RASCO",
    "Agustín BATISTA Jr.",
    "Enrique LLACA",
    "BELTS BELT",
    "Alin SUERO Falla",
    "Jorge MACHADO",
    "Julio LOBO",
    "Alejandro VERGARA",
    "Elena Sore Martinez",
    "Carolina"
  ],
  "sender": "CIA"
}