{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "The document discusses FBI's interactions with the Senate Select Committee (SSC) investigating intelligence activities. Releasing details of these interactions, particularly the names of FBI personnel and the modifications to the SSC's requests, could expose internal FBI procedures and potentially compromise ongoing or future investigations. As the document states, the LHM refers to the SSC's request for a list of names and titles of certain FBI Intelligence Division personnel and the agreement reached to modify that request.",
  "security_level": "Unclassified",
  "summary": "This collection of documents relates to the Senate Select Committee's (SSC) investigation into intelligence activities, focusing on FBI personnel and information sharing agreements, as well as updates regarding Douglas Durham, an informant for the FBI within the American Indian Movement (AIM). It also includes a memorandum regarding the White House's review and approval of the Intelligence Division Position Paper on Jurisdiction.",
  "summary_one_paragraph": "This file contains several documents related to the Senate Select Committee (SSC) investigation into intelligence activities in 1975. Key items include a letterhead memorandum (LHM) detailing an agreement between the FBI and the SSC regarding the provision of FBI personnel information for review, updates on Douglas Durham (an FBI informant within AIM) potentially becoming a witness for the committee, and a memorandum indicating that the White House approved the Intelligence Division Position Paper on Jurisdiction for submission to the SSC after review by Associate Counsel James Wilderotter.",
  "tags": [
    "Senate Select Committee",
    "FBI",
    "Intelligence Activities",
    "Douglas Durham",
    "American Indian Movement",
    "AIM",
    "Jurisdiction",
    "Intelligence Division",
    "Senate Study 75",
    "Senstudy 75"
  ],
  "title": "Material for Senate Select Committee (SSC) Investigating Intelligence Activities",
  "date": "1975-04-30",
  "persons_mentioned": [
    "S. F. Phillips",
    "William Miller",
    "Douglas Durham",
    "Keith E. Uhl",
    "Frank Church",
    "W. R. Wannall",
    "W. O. Cregar",
    "J. A. Mintz",
    "A. L. Lacey",
    "A. B. Fulton",
    "James Wilderotter",
    "Alonzo L. Lacey",
    "Donald B. Schewe",
    "Cordell Hull",
    "Hoover",
    "Tamm"
  ],
  "recipient": "Senate Select Committee (SSC)",
  "sender": "S. F. Phillips"
}