{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "This document discusses FBI informants and sources and the agreement that the Department of Justice will notify the Senate Committee Chairman and Vice Chairman within 24 hours of any expected delay beyond 96 hours of the request.  Quote: \"It was generally agreed upon that not only the identity of informants be excised but also information which might disclose the identity of informants might also be properly excised.\"",
  "security_level": "TOP SECRET",
  "summary": "This collection of FBI memoranda from 1975 pertains to requests from the Senate Select Committee (SENSTUDY) to investigate intelligence activities, including FBI interactions with the CIA, access to documents, and interviews with agents, with specific concerns about mail opening activities, COINTELPRO, and potential compromises of FBI operations and sources.",
  "summary_one_paragraph": "This collection of FBI memoranda and related correspondence from July and August 1975, centers on the FBI's response to requests from the Senate Select Committee (SENSTUDY) investigating intelligence activities. It details discussions between FBI and Department of Justice representatives with the SSC regarding procedures for document requests, concerns about meeting deadlines due to FOIA requests and ongoing investigations, the handling of sensitive information (especially regarding informants and third-agency rules), and the provision of names and addresses of present and former FBI agents for interviews related to mail opening activities. The documents also assess potential compromises of FBI operations related to matters like the Chilean Embassy surveillance, alleged plots against Spiro Agnew, and the MHCHAOS program.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "SENSTUDY",
    "Intelligence Activities",
    "CIA",
    "Document Requests",
    "COINTELPRO",
    "Mail Opening",
    "Informants",
    "Chilean Embassy",
    "MHCHAOS",
    "Freedom of Information Act"
  ],
  "title": "SENSTUDY 75",
  "date": "1975-08-01",
  "persons_mentioned": [
    "J. B. Adams",
    "Loch Johnson",
    "Fred J. Cassidy",
    "Richard W. Held",
    "Lester B. Seidel",
    "John Mintz",
    "Michael E. Shaheen, Jr.",
    "John Elliff",
    "Mike Epstein",
    "Courtney Evans",
    "Belmont",
    "Director Hoover",
    "W. R. Wannall",
    "S. S. Mignosassm",
    "W. O. Cregar",
    "T. J. McNiff",
    "C. H. McCarthy",
    "Orlando Nunez-Toro",
    "Deborah Fitzgerald",
    "Henry A. Kissinger",
    "Daniel Ellsberg",
    "Spiro Agnew",
    "Elizabeth Boynton Millard",
    "James McCord",
    "William Rogers",
    "Philippe Thyraud De Vosjoli",
    "Edward F. Gamber",
    "Paul Wallach",
    "Paul B Daly",
    "John Thomas",
    "Mark Gitenstein",
    "Steven K. Blackhurst",
    "Seymor Phillips",
    "Elmer Larson",
    "Frank Church",
    "John G. Tower",
    "Philip A. Hart",
    "Walter F. Mondale",
    "Walter D. Huddleston",
    "Robert Morgan",
    "Gary Hart",
    "Howard H. Baker, Jr.",
    "Barry Goldwater",
    "Charles Mc C. Mathias, Jr.",
    "Richard S. Schweiker",
    "William G. Miller",
    "Frederick A. O. Schwarz, Jr.",
    "Curtis R. Smothers"
  ],
  "recipient": "Mr. J. B. Adams",
  "sender": "Legal Counsel"
}