{
  "classification": "Operations",
  "document_type": "Memorandum/Teletype",
  "security": "This document discusses sensitive mail interception programs (SAM SURVEY, SUN SURVEY, and Z COVERAGE) conducted by the FBI, including the opening and photographing of mail to and from Soviet agents and the Soviet Mission to the UN. Revealing these operations could compromise current intelligence methods and sources and could be construed as violating privacy laws and international agreements. Specifically, SA Kehoe stated '...WHEN LETTERS WERE OBSERVED THAT WERE BELIEVED TO MEET THE CRITERIA THEY WERE BROUGHT BACK TO THE NEW YORK OFFICE (NYO) WHERE THEY WERE OPENED AND PHOTOGRAPHED BY THE AGENT CONDUCTING THE Z COVERAGE.'",
  "security_level": "TOP SECRET",
  "summary": "These documents detail FBI activities, including mail interception programs targeted at Soviet agents and the Soviet Mission to the UN, as revealed in an interview with Special Agent James P. Kehoe by the Senate Select Committee.",
  "summary_one_paragraph": "The documents consist of memoranda and a teletype summarizing information provided by FBI Special Agent James P. Kehoe to the Senate Select Committee on August 12, 1975. Kehoe discussed three mail interception programs: SAM SURVEY, which targeted mail to European cities to identify Soviet illegal agents; SUN SURVEY, which screened mail addressed to the United Nations; and Z COVERAGE, which involved opening and photographing all mail to the Soviet Mission to the UN. The summaries detail the procedures, locations, and personnel involved in these operations, as well as the handling and dissemination of the intercepted information.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Intelligence Activities",
    "Mail Interception",
    "SAM SURVEY",
    "SUN SURVEY",
    "Z COVERAGE",
    "Soviet Agents",
    "UN",
    "Special Agent Kehoe",
    "Huston Report",
    "Donald E. Moore"
  ],
  "title": "Abstract of Information Provided to Senate Select Committee on Intelligence Activities Regarding FBI Mail Interception Programs",
  "date": "1975-08-07",
  "locations_mentioned": [
    "Europe",
    "Kennedy Airport",
    "New York City",
    "United Nations",
    "Grand Central Station"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "James P. Kehoe",
    "Donald E. Moore",
    "Claire (Anna) Chennault",
    "Spiro T. Agnew",
    "Charles E. Radford",
    "George Berley",
    "Tom Charles Huston",
    "Bill Sullivan",
    "William O. Cregar",
    "George Moore",
    "Fred Cassidy",
    "Helms",
    "Angleton",
    "Deke DeLoach",
    "Mitchell",
    "Tolson",
    "Leon F. Schwartz",
    "Admiral Gayler",
    "General Carter"
  ],
  "recipient": "Intelligence Community Staff, Senate Select Committee",
  "sender": "FBI"
}