{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "The memos relate to specific individuals investigated by the FBI and their inclusion on the NSA Watch List. Disclosing the names of individuals under investigation and the reasons for their inclusion on the Watch List could compromise ongoing investigations, reveal intelligence-gathering methods, and potentially harm the individuals named. Also, revealing relationships with agencies could have security implications.",
  "security_level": "SECRET",
  "summary": "These documents consist of internal communications between the FBI, the Department of Justice, and the Senate Select Committee on Intelligence Activities (SSC) regarding the review and sanitization of documents related to FBI mail opening operations and information requests concerning individuals on the National Security Agency (NSA) Watch List.",
  "summary_one_paragraph": "This collection of memoranda and related documents from January and October 1975 and January 1976, details communications between the FBI, the Department of Justice, and the Senate Select Committee on Intelligence Activities (SSC). The documents concern the review and sanitization of FBI documents for public release, specifically those related to mail opening operations and information provided to the SSC regarding individuals on the NSA Watch List. The exchanges include requests for information, delivery of documents, and discussions regarding the scope and classification of the materials, highlighting the FBI's cooperation with the SSC's inquiries into intelligence activities.",
  "tags": [
    "FBI",
    "Senate Select Committee on Intelligence Activities",
    "SSC",
    "NSA Watch List",
    "Mail Intercept Programs",
    "Declassification",
    "Intelligence Activities",
    "Hunter Project",
    "Z Coverage",
    "CHIPROP Survey",
    "SAM Survey",
    "GUS Survey",
    "CHICAN Survey",
    "JOE Survey",
    "CHICLET Survey",
    "Preventive Actions",
    "Information Handling",
    "Stokely Carmichael",
    "Kathie Boudin",
    "Howard Lamar Fuller",
    "Leonard Handelsman",
    "Naomi Esther Jaffe",
    "Saifeldine Ahmed Abdenabi Wadi-Ramahi"
  ],
  "title": "U. S. SENATE SELECT COMMITTEE ON INTELLIGENCE ACTIVITIES (SSC)",
  "date": "1976-01-19",
  "locations_mentioned": [
    "Washington, D.C.",
    "Minneapolis, Minnesota",
    "Cleveland, Ohio",
    "Guinea",
    "North Vietnam",
    "Cuba",
    "People's Republic of China",
    "Havana, Cuba",
    "South America"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "J. A. Mintz",
    "J. B. Hotis",
    "W. R. Wannall",
    "W. O. Cregar",
    "S. J. Miller",
    "Michael E. Shaheen, Jr.",
    "Paul Daly",
    "John T. Elliff",
    "Jack W. Fuller",
    "Jack Marsh",
    "Dave Lohman",
    "J. P. Thomas",
    "J. G. Deegan",
    "S. Klein",
    "Michael Epstein",
    "Mark Gitenstein",
    "J. P. Thomas",
    "K. A. Mendenhall",
    "J. T. Aldhizer",
    "P. E. Nugent",
    "Stokely Carmichael",
    "Kathie Boudin",
    "Howard Lamar Fuller",
    "Leonard Handelsman",
    "Naomi Esther Jaffe",
    "Saifeldine Ahmed Abdenabi Wadi-Ramahi",
    "Leonard Boudin",
    "Onusu Sadaukai"
  ],
  "recipient": "U. S. Senate Select Committee on Intelligence Activities (SSC)",
  "sender": "FBI"
}