{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "The documents detail internal FBI communications regarding cooperation with the Senate Select Committee (SSC) on Intelligence Activities, including discussions on informant confidentiality and potential legislative impact on domestic intelligence investigations. Releasing the specific details of these discussions and the identities of individuals involved as informants or handling agents could compromise ongoing investigations or expose intelligence-gathering methods. As the document states, there is a 'most serious breach of the confidentiality that must be afforded the material and information that this Bureau has furnished to the U. S. Senate Select Committee on Intelligence'.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document consists of several memoranda and teletypes primarily concerning the FBI's interactions with the Senate Select Committee (SSC) on Intelligence Activities in 1976, covering topics such as informant confidentiality breaches, review of draft reports, and discussions on domestic intelligence investigations.",
  "summary_one_paragraph": "This collection of documents, dated from February to December 1976, outlines the FBI's engagement with the Senate Select Committee on Intelligence Activities (SSC). The documents address various matters including the SSC's request for FBI personnel interviews (specifically regarding Martin Luther King Jr. and the Secret Army Organization), concerns over breaches of informant confidentiality (regarding George F. Dorsett and the KKK), the review process for draft reports related to FBI activities, and discussions concerning domestic intelligence investigations, particularly concerning subversive groups and the impact of the Privacy Act. It also notes internal communications within the FBI regarding these interactions and recommendations for handling them.",
  "tags": [
    "FBI",
    "Senate Select Committee",
    "Intelligence Activities",
    "Informant Confidentiality",
    "Domestic Intelligence",
    "Privacy Act",
    "George F. Dorsett",
    "Secret Army Organization",
    "Martin Luther King Jr."
  ],
  "title": "FBI Interactions with the Senate Select Committee on Intelligence Activities",
  "date": "1976-02-19",
  "locations_mentioned": [
    "Washington, D.C.",
    "Boston",
    "Salt Lake City",
    "Charlotte, North Carolina",
    "Greensboro, North Carolina"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "John A. Mintz",
    "Steven K. Blackhurst",
    "Paul Daly",
    "Frank Church",
    "John G. Tower",
    "Michael E. Shaheen, Jr.",
    "Sam Bouchard",
    "John T. Elliff",
    "Francis T. Leonard",
    "Martin Luther King, Jr.",
    "Stanley David Levison",
    "Michael Epstein",
    "Richard Strain",
    "Steven L. Christensen",
    "Howard Berry Godfrey",
    "Robert Morgan",
    "George F. Dorsett",
    "W. R. Wannall",
    "J. B. Adams",
    "W. O. Cregar",
    "Hunter Helgason",
    "Joseph G. Deegan",
    "Robert L. Shackelford",
    "John B. Hotis",
    "Mark Gitenstein"
  ],
  "recipient": "John A. Mintz, Assistant Director, Legal Counsel Division, FBI",
  "sender": "Steven K. Blackhurst, Assistant Special Counsel for Intelligence Coordination"
}