{
  "classification": "Commission",
  "document_type": "Testimony",
  "security": "Releasing details of the testimony, particularly the specific questions asked and answers given, could reveal investigative methods and areas of interest of the Senate Select Committee (SSC). The document reveals that the committee was interested in the telephone surveillance of Martin Luther King, Jr., Stanley Levison, and the SCLC, as well as potential CP connections of individuals associated with King. Specific surveillance methods and the extent of knowledge about these individuals are highlighted.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a recollection by Alan G. Sentinella of his testimony before the Senate Select Committee (SSC) on May 21, 1975, regarding investigations of Martin Luther King, Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison.",
  "summary_one_paragraph": "Alan G. Sentinella's recollection of his May 21, 1975, testimony before the Senate Select Committee (SSC) details his involvement in investigations related to Martin Luther King, Jr., the Southern Christian Leadership Conference (SCLC), and Stanley Levison; he recounts questions about telephone surveillance, particularly concerning continuations and authorizations related to King's residences, as well as discussions about potential Communist Party (CP) connections of individuals like Levison, Hunter Pitts O'Dell, Bayard Rustin, and Harry Wachtel, also addressing the types of investigations conducted and how information about CP affiliations was obtained and utilized within the Bureau.",
  "tags": [
    "Senate Select Committee",
    "Alan G. Sentinella",
    "Martin Luther King Jr.",
    "Southern Christian Leadership Conference",
    "Stanley Levison",
    "Telephone Surveillance",
    "Communist Party",
    "FBI",
    "Testimony"
  ],
  "title": "Recollection of Testimony before the Senate Select Committee",
  "date": "1975-05-21",
  "persons_mentioned": [
    "Alan G. Sentinella",
    "Robert Morgan",
    "Lester B. Seidel",
    "Jack Smith",
    "John Bailey",
    "Paul Daly",
    "Martin Luther King, Jr.",
    "Stanley Levison",
    "Charles Harding",
    "Richard Hamilton",
    "Hunter Pitts O'Dell",
    "Bayard Rustin",
    "Harry Wachtel",
    "Coretta King"
  ],
  "recipient": "Senate Select Committee",
  "sender": "Alan G. Sentinella"
}