{
  "classification": "Assassinations",
  "document_type": "Teletype/Letter",
  "security": "Several parts of these documents contain specific file numbers, informant details, and internal routing information (SL 1495-E, 170-1767, 134-19686, 62-117290-433). Sharing this information could compromise ongoing investigations and expose confidential sources. For example, the teletype from St. Louis discusses contacting a former informant and mentions 'conferences with HSCA and DOJ would be undertaken to work out details peoprotection, confidentiality, location and scope of interview'. Revealing this could alert individuals connected to the investigation.",
  "security_level": "CONFIDENTIAL/TOP SECRET",
  "summary": "These documents consist of teletypes and letters between the FBI, the House Select Committee on Assassinations (HSCA), and other agencies concerning investigations into the assassinations of Martin Luther King Jr. and John F. Kennedy, including requests for files, informant information, and agent details.",
  "summary_one_paragraph": "This collection of documents from 1978 includes teletypes and letters primarily exchanged between the FBI, the HSCA, and other entities like the Department of Justice and the U.S. Embassy in London. These communications focus on the HSCA's requests for FBI files related to Martin Luther King Jr., including main security files, COINTELPRO files, and information on the Memphis Sanitation Strike. The documents also concern FBI informant SL 1495-E and the process of arranging an interview with the HSCA, as well as requests from the HSCA for access to British police records related to James Earl Ray. The communications detail logistical arrangements, file preparation, and coordination with various units within the FBI and other government bodies.",
  "tags": [
    "FBI",
    "HSCA",
    "Martin Luther King Jr.",
    "James Earl Ray",
    "John F. Kennedy",
    "Assassination",
    "COINTELPRO",
    "Informant",
    "Files",
    "Investigation"
  ],
  "title": "House Select Committee on Assassinations (HSCA) Investigation Documents",
  "date": "1978-02-10",
  "locations_mentioned": [
    "St. Louis",
    "Chicago",
    "New Orleans",
    "London",
    "Memphis",
    "Savannah, Georgia",
    "Florissant, MO"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "G. Robert Blakey",
    "Martin Luther King Jr.",
    "James Earl Ray",
    "Jerry Ray",
    "J. B. Stoner",
    "Richard Geppert",
    "Stephen M. Callender",
    "Joseph T. Sylvester Jr.",
    "Joe C. Hester",
    "Burl F. Johnson",
    "Joseph H. Kearney Jr.",
    "Howell S. Lowe",
    "Griffin B. Bell",
    "Robert L. Keuch",
    "Danny O. Coulson",
    "Michael Eberhardt",
    "Louis Stokes",
    "James Haggerty"
  ],
  "recipient": "Director, FBI; St. Louis Field Office",
  "sender": "SAC, St. Louis; SAC, Chicago; New Orleans Field Office; AMEMBASSY LONDON; Director FBI"
}