{
  "classification": "JFK Assassination",
  "document_type": "Memorandum",
  "security": "This document contains references to potential covert operations involving foreign nationals and intelligence gathering activities, including the recruitment of criminal elements and the potential compromising of foreign officials. Disclosing these details could compromise ongoing intelligence operations, endanger individuals involved in these activities, and damage relationships with foreign governments. For example, the document mentions the recruitment of Corsicans from criminal elements and the potential use of a Yugoslavian air force major for intelligence collection through a 'framing' operation.",
  "security_level": "SECRET SENSITIVE",
  "summary": "This document consists of memoranda and notes regarding the McCone Papers, Project MONGOOSE, ZRRIFLE, and QJWIN, detailing meetings, discussions, and files reviewed for possible assassination attempts and contacts with the Warren Commission, as well as covert operations involving Cuba and other locations.",
  "summary_one_paragraph": "This collection of memoranda, primarily authored by Mason Cargill in April 1975, summarizes reviews of CIA materials including the McCone Papers from 1961-1964, Project MONGOOSE materials retained by the CIA, and files pertaining to PROJECT ZRRIFLE and QJWIN. The reviews focus on references to Cuba, assassination plots, and the Warren Commission. The documents also detail CIA activities such as discussions of Cuban operations, potential sabotage proposals, and covert actions against Haiti, as well as operations involving the recruitment of agents and the potential burglarization of premises outside the United States.",
  "tags": [
    "McCone Papers",
    "Project MONGOOSE",
    "ZRRIFLE",
    "QJWIN",
    "Warren Commission",
    "Cuba",
    "Assassination",
    "Covert Operations",
    "CIA Activities",
    "Haiti",
    "Sabotage"
  ],
  "title": "MC CONE PAPERS",
  "date": "1975-04-22",
  "locations_mentioned": [
    "Cuba",
    "Miami",
    "Italy",
    "Mexico City",
    "Colombia",
    "Venezuela",
    "Dakar",
    "Luxembourg",
    "Leopoldville",
    "Paris",
    "Brazzaville",
    "Trieste",
    "Rome",
    "Yugoslavia"
  ],
  "origin_agency": "HPSCI (House Permanent Select Committee on Intelligence)",
  "persons_mentioned": [
    "McCone",
    "Mason Cargill",
    "Attorney General Kennedy",
    "Lansdale",
    "Bundy",
    "Perrez",
    "Cardona",
    "JFK",
    "Reuther",
    "Rush",
    "McNamara",
    "Alexis Johnson",
    "General Taylor",
    "Lemnitzer",
    "Eisenhower",
    "Lundahl",
    "Castro",
    "Duvalier",
    "Helms",
    "Angleton",
    "Rusk",
    "Colonel Grogan",
    "Tom Ross",
    "Papich",
    "Robert F. Kennedy",
    "Sukarno",
    "Lyndon B. Johnson",
    "Justice Warren",
    "Senator Cooper",
    "Stern",
    "Rankin",
    "Willens",
    "Henry Luce",
    "Walter Jenkins",
    "Richard Fredericks",
    "Carl Rowan",
    "FitzGerald",
    "Joseph Selzer",
    "Chamberlain",
    "Robroy Ratliff",
    "Belin",
    "Tom Parrot",
    "General Carter",
    "Peter Jessup",
    "Allen Dulles",
    "Andre Mankel",
    "Jouvenoy",
    "Rabney",
    "Altman",
    "Sabatti",
    "Cuccagna",
    "Bernardini"
  ],
  "recipient": "File",
  "sender": "Mason Cargill"
}