{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "Disclosing details of an interview concerning allegations of E. Howard Hunt's involvement in the assassination of President Kennedy, including his whereabouts on the day of the assassination and his contacts (or lack thereof) with figures like Lee Harvey Oswald, could provide fodder for conspiracy theories and damage the reputation of individuals mentioned. This information, combined with Hunt's denials and the names of witnesses, could be used to harass or endanger those involved. Quoting: \"The interview concerned allegations that Mr. Hunt was involved in the assassination of President John Kennedy and other public figures. He is aware of the public statements made by Dick Gregory and Ralph Schoenman in early February 1975 relative to his being involved in the assassination of President Kennedy.\"",
  "security_level": "SECRET/SENSITIVE",
  "summary": "This memorandum summarizes a March 4, 1975 interview conducted by Robert Olsen with E. Howard Hunt and his daughter, Lisa Hunt, regarding allegations of Hunt's involvement in the assassination of President John F. Kennedy, during which Hunt denies any involvement and provides an alibi.",
  "summary_one_paragraph": "On March 6, 1975, Robert Olsen submitted a memorandum summarizing an interview with E. Howard Hunt and his daughter Lisa, conducted on March 4, 1975, concerning allegations that Hunt was involved in the assassination of President John Kennedy. Hunt denied any involvement, stating he was in Washington, D.C., at the time of the assassination and had no contact with Lee Harvey Oswald, Jack Ruby, or the Fair Play for Cuba Committee. He attributes allegations to errors in Tad Szulc's book and provides details about his activities in the CIA, particularly related to the Bay of Pigs invasion and domestic operations, along with a list of individuals who could corroborate his presence in Washington on November 22, 1963.",
  "tags": [
    "E. Howard Hunt",
    "John F. Kennedy Assassination",
    "Interview",
    "Denial",
    "Bay of Pigs",
    "CIA",
    "Rockefeller Commission",
    "Alibi"
  ],
  "title": "Interview of March 4, 1975, with E. Howard Hunt and his Daughter, Lisa Hunt",
  "date": "1975-03-06",
  "locations_mentioned": [
    "Washington, D.C.",
    "Miami, Florida",
    "Kensington, Maryland",
    "Mexico City",
    "Dallas, Texas",
    "New Orleans"
  ],
  "origin_agency": "HPSCI (House Permanent Select Committee on Intelligence)",
  "persons_mentioned": [
    "E. Howard Hunt",
    "Lisa Hunt",
    "John F. Kennedy",
    "Dick Gregory",
    "Ralph Schoenman",
    "Tad Szulc",
    "Lee Harvey Oswald",
    "Jack Ruby",
    "Fidel Castro",
    "Arthur Schlesinger",
    "Adlai Stevenson",
    "Robert Kennedy",
    "Allen Dulles",
    "Stanley Gaines",
    "Tracy Barnes",
    "Nelson A. Rockefeller",
    "Governor Wallace",
    "Congressman Hale Boggs",
    "Senator Stennis",
    "Mary Trayner",
    "Howard St. John Hunt",
    "Kevan Hunt"
  ],
  "recipient": "File",
  "sender": "Robert Olsen"
}