{
  "classification": "Personnel",
  "document_type": "PAPER, TEXTUAL DOCUMENT",
  "security": "Mention of CIA proprietaries and domestic operations could reveal sensitive information about the agency's structure and methods. Quoting directly: 'Jan 1962 asped to Domestic Oper. Rev. of DDP, handling proprietaries CIA HAS NO OBJECTION TO DECLASSIFICATION AND/OR RELEASE OF THIS DOCUMENT AS SANITIZED (1)(b)'.",
  "security_level": "U",
  "summary": "Handwritten notes from a 1975 interview with E. Howard Hunt covering topics such as his past CIA activities, travels, and whereabouts on the day of President Kennedy's assassination.",
  "summary_one_paragraph": "These are handwritten notes, dated March 4, 1975, documenting an interview with E. Howard Hunt. The notes cover various aspects of Hunt's life and career, including his time as Chief of Atelion in Mexico City in 1963, his involvement with Domestic Operations Review of the DDP, his handling of CIA proprietaries, and his travel history, including possible stopovers in Dallas in 1960. The notes also record Hunt's account of his activities on November 22, 1963, when he and his wife were driving on a golf course in Washington, D.C., and heard about the assassination on the car radio; Hunt's family members are mentioned as witnesses to his presence in Washington on that day.",
  "tags": [
    "E. Howard Hunt",
    "CIA",
    "JFK Assassination",
    "Interview Notes",
    "Mexico City",
    "Domestic Operations",
    "Travel Records"
  ],
  "title": "Handwritten Notes on E. Howard Hunt",
  "conspiracy": "The document contains information about E. Howard Hunt's whereabouts on the day of the JFK assassination, including witnesses who could confirm his location. This information is potentially relevant to understanding whether Hunt was involved in the assassination.",
  "date": "1975-03-04",
  "locations_mentioned": [
    "Mexico City",
    "Dallas",
    "Washington, D.C.",
    "Sumner, MR",
    "London",
    "Rome",
    "New York"
  ],
  "origin_agency": "HPSCI",
  "persons_mentioned": [
    "E. Howard Hunt",
    "Tad Szulc",
    "Gregory Schoen",
    "Stanley Saines",
    "Tracy Barnes",
    "Edward J. Hamilton",
    "Robert F. Kennedy",
    "Sisa Hunt",
    "Kevan Hunt",
    "Howard St. John Hunt",
    "Mary Trayner"
  ]
}