{
  "classification": "Cuba",
  "document_type": "Transcript of Deposition",
  "security": "This transcript reveals details about potential assassination attempts and intelligence operations, including names of individuals and locations involved. Disclosing these details could compromise individuals, reveal operational methods, and damage international relations. Quoting directly: 'I was asked to do an assassination...I was contacted by this agent...a friend of mine who was a CIA agent contacted me and asked me if I would do an assassination.'",
  "security_level": "TOP SECRET",
  "summary": "A transcript of Frank Sturgis' deposition discussing his involvement in potential assassination attempts on Fidel Castro and other Cuban officials, as well as his connections to the CIA and other intelligence activities.",
  "summary_one_paragraph": "This document is a transcript of Frank Sturgis' deposition taken on April 3, 1975, in Washington, D.C., regarding his alleged involvement in assassination attempts against Fidel Castro and other Cuban military officials. Sturgis describes his role in training military police, his recruitment attempts for the American Embassy, and his relationship with Colonel Nichols, potentially a CIA cover. He discusses buying guns in the U.S., breaking into Cuban Army headquarters, and a later proposition from a CIA agent to carry out an assassination, ultimately revealing a complex web of intelligence activities and operations in Cuba.",
  "tags": [
    "Frank Sturgis",
    "Fidel Castro",
    "Assassination",
    "CIA",
    "Cuba",
    "Colonel Nichols",
    "Robert B. Olsen",
    "James N. Roethe"
  ],
  "title": "Transcript of Deposition of Frank Sturgis",
  "conspiracy": "The document offers insight into the alleged assassination attempts against Fidel Castro and the potential involvement of U.S. agencies, including the CIA, in these operations. It raises questions about the motivations and extent of U.S. involvement in Cuban affairs during this period.",
  "date": "1975-04-03",
  "locations_mentioned": [
    "Cuba",
    "Miami",
    "Alexandria, Virginia",
    "Key West"
  ],
  "origin_agency": "HPSCI",
  "persons_mentioned": [
    "Frank Sturgis",
    "Fidel Castro",
    "Robert B. Olsen",
    "James N. Roethe",
    "Colonel Nichols",
    "Raoul Castro",
    "Che Guevara",
    "Commander Camelo Cienfugo",
    "Commander Almejera",
    "Ricardo Lorie",
    "Sergio Diaz Bruil"
  ]
}