{
  "classification": "Cuba",
  "document_type": "Paper, Textual Document",
  "security": "Revealing details about station chiefs, their roles, and alleged involvement in 'domestic intelligence' could expose ongoing or past operations and sources. Reference to Bill Johnson having a 'Vevey fighter plane' and Hunt leaving Miami before the Bay of Pigs, coupled with information about Carlos Prio being forced out of Cuba and Carlos Marcello's issues with Bobby Kennedy, might expose sensitive details of covert actions or relationships. Quoting: 'Barber's Station Chief in early 1961 was in Knowless, who was also in Havana Station...Barber, Martinsen & Sturges were moled in Comestic intell.'",
  "security_level": "UNCLASSIFIED",
  "summary": "Handwritten notes from a telephone call on April 29, 1975, involving Sturgis, discussing individuals like Barber, Knowless, Bill Johnson, Hunt, Carlos Prio, Carlos Marcello, Marita Lorenz, and their connections to the CIA, Cuba, and the Bay of Pigs.",
  "summary_one_paragraph": "These handwritten notes, dated April 29, 1975, recount a telephone call with Sturgis, addressing topics such as Barber's role as Station Chief in Havana, the involvement of Barber, Martinsen, and Sturges in domestic intelligence, Bill Johnson’s fighter plane, and Hunt's departure from Miami prior to the Bay of Pigs. Sturgis denied being a CIA agent but admitted involvement with Cuban exiles in Miami since 1945 and discussed Carlos Prio's exile from Cuba, Carlos Marcello’s issues with Bobby Kennedy, and Marita Lorenz's alleged encounter with Sturgis and Howard Hunt. The notes also mention that Sturgis denied Howard Hunt's involvement.",
  "tags": [
    "Sturgis",
    "CIA",
    "Cuba",
    "Bay of Pigs",
    "Carlos Prio",
    "Carlos Marcello",
    "Marita Lorenz",
    "Howard Hunt",
    "Telephone Call",
    "Barber",
    "Knowless",
    "Bill Johnson",
    "Domestic Intelligence"
  ],
  "title": "Handwritten Notes: Telephone Call with Sturgis on 4-29-75",
  "date": "1975-04-29",
  "persons_mentioned": [
    "Sturgis",
    "Barber",
    "Knowless",
    "Bill Johnson",
    "Hunt",
    "Carlos Prio",
    "Carlos Marcello",
    "Marita Lorenz",
    "Howard Hunt"
  ],
  "sender": "HPSCI"
}