{
  "classification": "Commission",
  "document_type": "Transcript",
  "security": "Releasing details of CIA activities, even those discussed before the Rockefeller Commission, could compromise sources and methods. Rusk mentions forged documents planted on African leaders to discredit the CIA: \"Fortunately, these forgeries were so crude that it was very easy to demonstrate that they were, in fact, forgeries.\" Revealing specific details could expose current or future operations involving counter-propaganda and influence.",
  "security_level": "TOP SECRET",
  "summary": "This document is a transcript from the President's Commission on CIA Activities, featuring testimony from Dean Rusk, Gordon Gray, Richard M. Bissell, Jr., Paul O'Neill, and Arnold E. Donohue, discussing the CIA's role, intelligence gathering, and executive oversight.",
  "summary_one_paragraph": "This is a notification regarding the status of document 135-10001-10297, an HPSCI record series containing a transcript of testimony given on April 21, 1975, to the President's Commission on CIA Activities by Dean Rusk, Gordon Gray, Richard Bissell, Paul O'Neill, and Arnold Donohue; the document details discussions about CIA activities and oversight. Portions of the document have been postponed from release under the John F. Kennedy Assassination Records Collection Act of 1992, with full release scheduled for 2025, and the National Security Council and Department of State reviewed and had no objections to the declassification and release of the document, subject to the CIA's determinations.",
  "tags": [
    "HPSCI",
    "Assassination Records Review Board",
    "President's Commission on CIA Activities",
    "Dean Rusk",
    "Gordon Gray",
    "Richard M. Bissell, Jr.",
    "Paul O'Neill",
    "Arnold E. Donohue",
    "CIA",
    "Intelligence",
    "Executive Oversight",
    "FOIA",
    "JFK Assassination Records Collection Act"
  ],
  "title": "Transcript: Vol. 17. President's Commission on CIA Activities",
  "date": "1975-04-21",
  "locations_mentioned": [
    "Washington, D.C.",
    "Old Executive Office Building",
    "China",
    "Burma",
    "India",
    "South Korea",
    "Cuba",
    "Soviet Union",
    "Czechoslovakia",
    "Africa"
  ],
  "origin_agency": "HPSCI",
  "persons_mentioned": [
    "Dean Rusk",
    "Gordon Gray",
    "Richard M. Bissell, Jr.",
    "Paul O'Neill",
    "Arnold E. Donohue",
    "John F. Kennedy",
    "Lyndon Johnson",
    "Nelson A. Rockefeller",
    "John T. Connor",
    "Joseph Lane Kirkland",
    "Lyman L. Lemnitzer",
    "Edwin N. Griswold",
    "Edward H. Shannon, Jr.",
    "David W. Belin",
    "Robert Wallison",
    "Marvin Gray",
    "Sol Corbin",
    "Ruth Johnson",
    "Robert Patterson",
    "Marshall",
    "Acheson",
    "Murphy",
    "Schlesinger",
    "David Bruce",
    "Alsop",
    "Dace",
    "Frankfurter",
    "John Foster Dulles",
    "MacArthur",
    "Rooney",
    "Russell",
    "Mike Sheehy",
    "David S. Van Tassel"
  ]
}