{
  "classification": "Commission",
  "document_type": "Letter and Memoranda",
  "security": "Disclosing the information that the CIA had informants that no one knew about, except the Central Intelligence Agency agent, and that the informant might have been an informant, could potentially jeopardize ongoing intelligence operations or compromise the identity of current or former informants. Specifically the communication with J. Edgar Hoover about possible FBI informants. Quoting from the document:  'the Central Intelligence Agency had informants that no one knew about, except the Central Intelligence Agency agent, and that the informant might have been an informant'.",
  "security_level": "Confidential",
  "summary": "This document consists of a letter from E.H. Knoche to David Belin transmitting materials related to Allen Dulles and the Warren Commission, along with related memoranda and diary entries. It includes Dulles's communications with Lee Rankin, J. Edgar Hoover, and others, discussing the investigation and related issues.",
  "summary_one_paragraph": "This collection of documents begins with a letter from E.H. Knoche to David Belin in May 1975, forwarding materials concerning Allen Dulles's involvement with the Warren Commission. The attachments include a memorandum reviewing Dulles's personal papers after his departure from the CIA, diary entries noting communications about the Warren Commission, and correspondence with individuals like Sherman Hoar. Also present are memoranda from Dulles to Lee Rankin covering topics such as Communist propaganda related to the assassination, the role of George de Mohrenschildt, and questions regarding Oswald's activities and handling of firearms, as well as Dulles's suggestions for additional avenues of inquiry for the Commission.",
  "tags": [
    "CIA",
    "Warren Commission",
    "Allen Dulles",
    "Lee Harvey Oswald",
    "J. Edgar Hoover",
    "Lee Rankin",
    "Assassination Investigation"
  ],
  "title": "Letter Sending Materials Relating to Allen Dulles and Warren Commission",
  "conspiracy": "The documents include Dulles's notes on possible holes or issues with the accepted narrative, such as, 'If he killed the President to make a name, gain notoriety, etc., why did he try to escape at all and then deny the shooting when caught?' and 'Where have we dealt with the evidence as to Oswald's ability to handle a rifle?' He also requests a follow-up on letters to the Militant possibly written by Oswald.",
  "date": "1975-05-08",
  "persons_mentioned": [
    "Allen Dulles",
    "David W. Belin",
    "E.H. Knoche",
    "Joseph Seltzer",
    "Mr. Helms",
    "Lee Rankin",
    "Sherman Hoar",
    "John Warner",
    "Jose Colon",
    "Ray Cline",
    "James Angleton",
    "Rocca",
    "Congressman Ford",
    "George de Mohrenschildt",
    "Robert C. McManus",
    "R.P. Dutt",
    "Robert Storey",
    "J. Edgar Hoover",
    "Jack McCloy",
    "Marina Oswald",
    "Isaac Don Levine"
  ],
  "recipient": "David W. Belin",
  "sender": "E.H. Knoche"
}