{
  "classification": "Commission",
  "document_type": "Transcript: Memorandum of Deposition",
  "security": "Revealing details of an internal deposition may expose witnesses and staff, leading to potential legal repercussions. Quoting directly: 'OLSEN: Mr. Sturgis has asked that we go off the record and we have had a conversation off the record, during the course of which Mr. Navarro was invited to leave the room and he is now absent from the room.'",
  "security_level": "TOP SECRET",
  "summary": "This document is a transcript of a deposition taken on April 4, 1975, by Commission staff Robert B. Olsen and James N. Roethe, featuring testimony from witnesses Frank Sturgis and Wilfredo Navarro, concerning potential CIA involvement in assassination plots.",
  "summary_one_paragraph": "On April 4, 1975, Robert B. Olsen and James N. Roethe of the President's Commission on CIA Activities conducted a deposition with Frank Sturgis and Wilfredo Navarro, focusing on Sturgis's claims of being approached by Bernard Barker in 1961 about participating in an assassination. The deposition includes discussions about Sturgis's connections with the CIA, potential plots to assassinate Fidel Castro, and Sturgis's whereabouts during the assassination of President Kennedy, with Sturgis denying any involvement and offering to take a polygraph test.",
  "tags": [
    "HPSCI",
    "Frank Sturgis",
    "Wilfredo Navarro",
    "Robert B. Olsen",
    "James N. Roethe",
    "Assassination",
    "CIA Activities",
    "President's Commission",
    "JFK Assassination",
    "Fidel Castro",
    "Bernard Barker",
    "E. Howard Hunt"
  ],
  "title": "Transcript: Memorandum of Deposition for the Record",
  "conspiracy": "The document explores potential connections between Frank Sturgis, Bernard Barker, E. Howard Hunt, and possible assassination plots, including discussions related to Fidel Castro and President Kennedy. Sturgis's testimony regarding the potential offer to participate in an assassination plot and his associations with individuals possibly linked to the CIA may fuel conspiracy theories.",
  "date": "1975-04-04",
  "persons_mentioned": [
    "Frank Sturgis",
    "Wilfredo Navarro",
    "Robert B. Olsen",
    "James N. Roethe",
    "Bernard L. Barker",
    "Sam Jenis",
    "Eduardo",
    "E. Howard Hunt",
    "Fidel Castro",
    "Raul Castro",
    "Che Guevara",
    "Colonel Nichols",
    "Lee Harvey Oswald",
    "Jack Ruby",
    "Clay Shaw",
    "David Ferry",
    "Martin Luther King",
    "Robert Kennedy"
  ],
  "recipient": "HPSCI",
  "sender": "Rock"
}