{
  "classification": "Warren Commission",
  "document_type": "Memorandum",
  "security": "This document contains information affecting the national security of the United States within the meaning of the espionage laws U. S. Code Title 18, Sections 793, 794 and 798. The law prohibits its transmission or the revelation of its contents in ony manner to an unauthorized person, as well as its use in any manner prejudicial to the solely or interest of the United States or for the benclit of any foreign government to the detriment of the United States. It is to be seen only by personnel especially indoctrinated and authorized to receive in. formation in the designated control channels. Its security must be maintained in accordance with regulations pertorming to the BYEMAN and Communications Intelligence Controls. No action is to he taken on any com. munications intelligence which may be contained herein, regardless of the advantage to be gained, il such action might have the effect of revooling the existence and nature of the source, unless such action is first approved by the appropriate authority.",
  "security_level": "TOP SECRET",
  "summary": "A memorandum from David Lowman at the NSA to the Principal Deputy Assistant Secretary of Defense (Intelligence) responding to queries from the Senate Select Committee concerning the Warren Commission, detailing NSA's limited involvement and findings related to the JFK assassination.",
  "summary_one_paragraph": "This Top Secret memorandum, dated January 26, 1976, from David Lowman at the NSA, addresses inquiries from the Senate Select Committee regarding the Warren Commission's investigation into the JFK assassination. The memo explains that NSA's involvement was limited to reviewing documents for cryptological significance at the request of Allan Dulles, retaining record copies of analyzed reports, and searching biographic files. The NSA found no relevant information, but it did discover that Cuban military forces went on alert immediately after the assassination. The document specifies that NSA provided no hard copy material to the Warren Commission and outlines the search efforts undertaken in response to the Senate Select Committee's questions.",
  "tags": [
    "NSA",
    "Warren Commission",
    "Senate Select Committee",
    "JFK Assassination",
    "Alton Quanbeck",
    "Louis Tordella",
    "David Lowman",
    "Cuban Alert",
    "Cryptanalysis"
  ],
  "title": "SSCSGO Queries",
  "date": "1976-01-26",
  "persons_mentioned": [
    "David Lowman",
    "Alton Quanbeck",
    "Jim Johnson",
    "Louis Tordella",
    "Allan Dulles",
    "Frank Foster"
  ],
  "recipient": "PDASOFD (INTEL)",
  "sender": "LOWMAN, DAVID"
}