{
  "classification": "JFK Assassination",
  "document_type": "Report",
  "security": "The document contains information regarding diplomatic activities and communications immediately following President Kennedy's death. Releasing details of these communications could potentially harm sensitive diplomatic relationships or reveal confidential interactions between foreign dignitaries and U.S. officials. For example, the document mentions Prince Bernhard's departure from Washington and his meeting with Mrs. Kennedy, as well as LUNS's conversations with RUSK and other foreign representatives.",
  "security_level": "TOP SECRET UMBRA",
  "summary": "A report from Washington, dated December 4, 1963, detailing diplomatic activities and reactions in the immediate aftermath of President Kennedy's death, including the movements and interactions of Prince Bernhard, Princess Beatrix, and Mr. Luns.",
  "summary_one_paragraph": "This TOP SECRET UMBRA report, sent from Washington on December 4, 1963, describes the diplomatic activities following President Kennedy's assassination, focusing on the reactions and movements of Dutch dignitaries. Prince Bernhard left Washington on Monday evening, meeting with Mrs. Kennedy before his departure and receiving special assistance from General LEMAY. Princess Beatrix attended a reception at the State Department, speaking with Mrs. Johnson, while Mr. Luns discussed potential shifts in American policy with RUSK. The report also notes the somber atmosphere in Washington and the appreciation for DE GAULLE's presence, while speculating on changes in the White House staff and policy direction under President Johnson.",
  "tags": [
    "Diplomatic Activity",
    "Netherlands",
    "JFK Assassination",
    "Prince Bernhard",
    "Princess Beatrix",
    "Mr. Luns",
    "Lyndon B. Johnson",
    "Dean Rusk"
  ],
  "title": "3/0/NED/T10-63: REPORT FROM WASHINGTON IN IMMEDIATE AFTERMATH OF PRESIDENT'S DEATH",
  "date": "1963-12-04",
  "locations_mentioned": [
    "Washington D.C.",
    "The Hague",
    "Netherlands",
    "Zolsterberg",
    "Paris",
    "New York",
    "Amsterdam",
    "Strassburg"
  ],
  "origin_agency": "NSA",
  "persons_mentioned": [
    "Prince Bernhard",
    "Mrs. Kennedy",
    "General Lemay",
    "Princess Beatrix",
    "Mrs. Johnson",
    "Queen Frederika",
    "Mr. Luns",
    "Rusk",
    "Johnson",
    "Kennedy",
    "Bundy",
    "Schlesinger",
    "Rostow",
    "Robert Kennedy",
    "De Gaulle",
    "Erhard",
    "Nasution",
    "Mikoyan",
    "Home"
  ],
  "recipient": "HCF [R]",
  "sender": "NSA"
}