{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "Revealing that the NSA transcribes messages from Havana to the Cuban Embassy could expose the agency’s collection capabilities and sources. The document also includes names of individuals who are allegedly involved in espionage activities against the Cuban government, which could endanger them. Quoting directly: \"I am transcribing below, for your information and for appropriate purposes, the text of the note delivered this morning, Saturday, to the Spainish Embassy in Cuba.\"",
  "security_level": "SECRET",
  "summary": "This document is a translated message from Havana to the Cuban Embassy regarding the declaration of Jaime Caldevilla, a Spanish counselor in Havana, as persona non grata due to alleged espionage and counterrevolutionary activities.",
  "summary_one_paragraph": "A translated message from Havana to the Cuban Embassy, dated May 28, 1966, details the Cuban government's declaration of Jaime Caldevilla y Garcia Villar, the Spanish Press Counselor in Havana, as persona non grata. The message accuses Caldevilla of abusing diplomatic immunity by engaging in espionage, ideological diversionism, and recruiting agents for the CIA. It outlines various activities, including seeking military, economic, and political information, attempting to recruit members of the Rebel Army, planning an attempt against Anastas Mikoyan, and facilitating the illegal removal of currency and jewels from Cuba.",
  "tags": [
    "NSA",
    "Jaime Caldevilla",
    "Cuban Embassy",
    "Persona Non Grata",
    "Espionage",
    "CIA",
    "Counterrevolutionary Activities",
    "Havana",
    "Cuba"
  ],
  "title": "Spanish Counselor in Havana Declared Persona Non Grata",
  "date": "1966-06-03",
  "locations_mentioned": [
    "Havana",
    "Cuba",
    "Madrid",
    "Spain",
    "United States",
    "Miami",
    "Playa Giron"
  ],
  "origin_agency": "NSA",
  "persons_mentioned": [
    "Jaime Caldevilla y Garcia Villar",
    "Carmen Jimenez Gomez",
    "Aldo Vera",
    "Mario Marrero",
    "Agustin Parrada",
    "Pedro Luis Boitell",
    "Anastas Mikoyan",
    "Jose Luis Rodriguez",
    "Israel Zamora Perez",
    "Raul Castro Ruz",
    "Alfredo Serra Echevarria",
    "Blanca Martinez del Hoyo",
    "Jorge Medina Bringuier",
    "Luis Fernandez Rocha",
    "Genaro Fernandez Folgueiras",
    "Luis Antonio Collazo Dennisn",
    "Ramon Grau Alsin",
    "Aldo Abreu Bacallao",
    "Alejandro Vergara",
    "Fidel Castro Ruz",
    "Manuel Artime",
    "Alvaro Gonzalez Gordon",
    "Maria Teresa Velasco Sarra"
  ],
  "recipient": "CALZADILLA, Cuban Embassy",
  "sender": "ROA"
}