{
  "classification": "JFK Assassination",
  "document_type": "Information Bulletin",
  "security": "Disclosing the assessments of foreign leaders and political dynamics post-JFK assassination could strain international relations and reveal intelligence-gathering capabilities. For instance, the document states, \"According to French and German press circles, DE GAULLE during his meeting with ERHARD placed emphasis on the establishment of a friendly atmosphere...ERHARD believed that USA-USSR dialogue was useful.\"",
  "security_level": "TOP SECRET UMBRA",
  "summary": "This NSA document, a Polish MFA Information Bulletin from November 26, 1963, summarizes global reactions and political assessments following John F. Kennedy's assassination, including insights from Washington, New York, Berlin, Lagos, Rio, Paris, Baghdad, Damascus, and Havana.",
  "summary_one_paragraph": "Dated December 2, 1963, this TOP SECRET UMBRA document is a Polish Ministry of Foreign Affairs Information Bulletin compiling global reactions and political analyses after President John F. Kennedy’s assassination. The bulletin includes observations from Warsaw, detailing initial Washington reactions, expectations for President Johnson’s policies towards the Soviet Union, and assessments of figures like Rusk, Mikoyan, and De Gaulle; New York's reporting covers the struggle over the political implications of the assassination; Berlin's analysis references the Bundeswehr alert and FRG propaganda; and reports from Lagos, Rio, Paris, Baghdad, Damascus, and Havana offer perspectives on racial issues, Latin American policy shifts, diplomatic talks, government formations, and international movements.",
  "tags": [
    "NSA",
    "JFK Assassination",
    "MFA Information Bulletin",
    "Global Reactions",
    "Political Assessments",
    "De Gaulle",
    "Johnson",
    "Mikoyan",
    "USSR",
    "Poland",
    "TOP SECRET UMBRA"
  ],
  "title": "3/0/W/T2038-63 MFA INFORMATION BULLETIN NR. 51, 26 November 1963",
  "date": "1963-12-02",
  "locations_mentioned": [
    "Washington",
    "New York",
    "Berlin",
    "Lagos",
    "Rio",
    "Paris",
    "Baghdad",
    "Damascus",
    "Havana",
    "Warsaw",
    "United States",
    "Soviet Union",
    "Iraq",
    "Syria",
    "Venezuela",
    "Prague"
  ],
  "origin_agency": "NSA",
  "persons_mentioned": [
    "John Kennedy",
    "Lyndon Johnson",
    "Rusk",
    "Mikoyan",
    "Khrushchev",
    "De Gaulle",
    "Erhard",
    "Arikiv",
    "Arif",
    "Nasser",
    "Hafez",
    "Droznak",
    "Lewandowski"
  ],
  "sender": "NSA"
}