{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "This document is classified TOP SECRET UMBRA and TOP SECRET DINAR, with NO FOREIGN DISSEMINATION and REPRODUCTION PROHIBITED. It contains sensitive compartmented information. Sharing this document could reveal highly classified sources and methods related to intelligence gathering on Cuba and Polish diplomatic communications.",
  "security_level": "TOP SECRET",
  "summary": "A November 22, 1963, NSA report details Cuba's internal problems with rebels, based on Polish diplomatic communications, highlighting increased smuggling of arms, underground activities, and Cuban government military operations.",
  "summary_one_paragraph": "This TOP SECRET UMBRA report, dated November 22, 1963, originates from the NSA and discusses Cuba's internal challenges with rebel activities based on information relayed through Polish diplomatic channels. Specifically, a message from Warsaw to the Polish Mission to the UN in New York, citing a report from CUIRUS in Havana, details Fidel Castro's concerns about U.S. aggression, increased arms smuggling to the Cuban capitol, underground harassment activities supported from the outside, and large-scale military operations in the Escambray and Matanza areas. The report also notes the anticipation of increased traffic in men and arms by Cuban counterrevolutionaries and the belief that the approaching U.S. Presidential elections would strengthen reactionary forces.",
  "tags": [
    "NSA",
    "JFK Assassination",
    "Cuba",
    "Anti-Castro Activities",
    "Fidel Castro",
    "Polish Diplomacy",
    "TOP SECRET UMBRA",
    "TOP SECRET DINAR",
    "Declassification"
  ],
  "title": "3/0/W/T1919-63: REPORT ON CUBA'S INTERNAL PROBLEMS WITH REBELS",
  "date": "1963-11-22",
  "locations_mentioned": [
    "Cuba",
    "Havana",
    "United States",
    "Central America",
    "Escambray",
    "Matanza",
    "Warsaw",
    "New York"
  ],
  "origin_agency": "NSA",
  "persons_mentioned": [
    "Fidel Castro",
    "CUIRUS",
    "MS MATCHRZAK"
  ],
  "recipient": "Polish Mission to the UN",
  "sender": "NSA"
}