{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "This document discusses successful interception of Cuban communications and mentions specific intelligence categories (TRIG and DENT, US/UK EYES ONLY series). Releasing details about these intelligence categories and interception capabilities could reveal sensitive sources and methods. As stated: 'The source products from which we extracted the attached informa- tion were published in the Category III TRIG and DENT, US/UK EYES ONLY series. We believe we have done sufficient sanitization so that, when the association with NSA is removed, the text could be releasable as national TOP SECRET, Sensitive.'",
  "security_level": "TOP SECRET",
  "summary": "An NSA memorandum, dated April 5, 1978, details the successful interception of Cuban communications between 1962 and 1964, providing insights into Cuban agent activities in the Western Hemisphere and their reactions to the assassination of President Kennedy.",
  "summary_one_paragraph": "This memorandum from the NSA, addressed to the Director and dated April 5, 1978, summarizes the interception of Cuban agent communications from April 17, 1962, until May 31, 1964, for the House Assassinations Committee. The intercepted communications revealed Cuban agent activities, including intelligence gathering, propaganda efforts, and logistics, primarily targeting Cuban exiles and U.S. military activities. The document also notes the Cuban government's reaction to President Kennedy's assassination, specifically the alert status of Cuban military elements and a press release denying any Cuban involvement.",
  "tags": [
    "NSA",
    "Cuban Communications",
    "House Assassinations Committee",
    "COMINT",
    "Cuban Agents",
    "JFK Assassination",
    "DGI",
    "ALPHA 66"
  ],
  "title": "Select Committee on Assassinations Query",
  "conspiracy": "The document includes details of the Cuban government's reaction to President Kennedy's assassination, including their alert status and a press release denying Cuban involvement, potentially indicating sensitivity or concern about being implicated in the assassination.",
  "date": "1978-04-05",
  "locations_mentioned": [
    "North America",
    "Central America",
    "South America",
    "Africa",
    "Asia",
    "Cuba",
    "Florida",
    "Puerto Rico",
    "Ecuador",
    "New York",
    "Miami",
    "Costa Rica",
    "Guatemala",
    "Colombia",
    "La Paz",
    "Mexico",
    "Chile",
    "Ottawa",
    "Lima",
    "Dominican Republic",
    "Havana",
    "Panama",
    "Dallas",
    "Mexico City"
  ],
  "origin_agency": "NSA",
  "persons_mentioned": [
    "ANTONIO VECIANA",
    "GERONIMO ESTEVEZ",
    "JUAN ANGEL SILEN ACEVEDO",
    "LEE HARVEY OSWALD",
    "President Kennedy"
  ],
  "recipient": "DIRNSA",
  "sender": "NSA, CHIEF G (R. E. RICH)"
}