{
  "classification": "JFK Assassination",
  "document_type": "Report",
  "security": "This document is classified TOP SECRET UMBRA/DINAR and marked for US/UK/Australian Eyes Only. Releasing the document could reveal sensitive intelligence sources and methods, as well as compromise relationships with allied intelligence agencies. The document contains highly classified information pertaining to signals intelligence and communications security, potentially exposing vulnerabilities in US and allied communication networks. The reference to 'TRIG (Limited) Distribution' indicates access is severely restricted, implying that uncontrolled dissemination could cause significant harm. Citing, “US/UK/AUSTRALIAN EYES ONLY,” and “TO BE GIVEN TRIG (LIMITED) DISTRIBUTION”",
  "security_level": "TOP SECRET",
  "summary": "A report details a Viet Cong propaganda plan to represent President Kennedy's assassination as a repudiation of the U.S. role in Vietnam, claiming his decision to send more troops led to his assassination.",
  "summary_one_paragraph": "This TOP SECRET UMBRA/DINAR report, dated December 5, 1963, outlines a Viet Cong propaganda strategy to exploit President Kennedy's assassination. According to the report, the Viet Cong planned to disseminate the message that Kennedy's assassination was a direct consequence of his decision to escalate U.S. military involvement in Vietnam by deploying over 4,000 additional troops, bringing the total to over 16,000. The propaganda aimed to portray Kennedy's death as a statement against the perceived unjustified American intervention, bolstering the Viet Cong's confidence in their eventual victory. The report indicates that U.S. authorities were developing a plan to counteract this propaganda effort.",
  "tags": [
    "JFK Assassination",
    "Viet Cong",
    "Propaganda",
    "Vietnam War",
    "NSA",
    "TOP SECRET",
    "UMBRA",
    "DINAR"
  ],
  "title": "Report of Viet Cong Propaganda Plan to Represent President Kennedy's Assassination as Repudiation of U.S. Role in Viet Nam",
  "conspiracy": "The document offers insight into how the Viet Cong used the assassination for propaganda purposes but does not offer specific details about the assassination itself.",
  "date": "1963-12-05",
  "locations_mentioned": [
    "Vietnam"
  ],
  "origin_agency": "NSA",
  "persons_mentioned": [
    "John Kennedy"
  ],
  "recipient": "HCF"
}