{
  "classification": "Cuba",
  "document_type": "Message",
  "security": "Disclosing instructions from Havana to Cuban missions could reveal communication protocols and potentially compromise diplomatic security. It instructs: 'If the Government decrees a period of mourning, comply with the existing protocol standards. Inform the consulates.' Revealing this could expose diplomatic coordination strategies.",
  "security_level": "SECRET",
  "summary": "A message from Havana to Cuban missions regarding instructions on mourning the death of President Kennedy, instructing compliance with existing protocol standards if the government decrees a mourning period and to inform the consulates.",
  "summary_one_paragraph": "On November 23, 1963, a secret message was sent from Havana to various Cuban missions, including embassies and consulates in locations such as Accra, Algiers, and Berlin, providing instructions on how to respond to President Kennedy's death. The message, identified as 2X/O/GUD/T2420-63 and originating from ROA, advises the Cuban missions to comply with existing protocol standards if a period of mourning is decreed by the government and to inform all consulates accordingly. This directive was distributed to a wide array of Cuban diplomatic offices, ranging from those in Eastern Europe to those in Asia and Africa.",
  "tags": [
    "Assassination",
    "John Kennedy",
    "Cuban Instructions",
    "Mourning",
    "Protocol",
    "Diplomacy",
    "NSA",
    "HCF"
  ],
  "title": "2X/O/GUD/T2420-63 CUBAN INSTRUCTIONS ON MOURNING DEATH OF PRESIDENT KE [R]",
  "date": "1963-11-24",
  "locations_mentioned": [
    "Havana",
    "Accra",
    "Algiers",
    "Bamako",
    "Beirut",
    "Belgrade",
    "Berlin",
    "Bern",
    "Brussels",
    "Bucharest",
    "Budapest",
    "Cairo",
    "Colombo",
    "Copenhagen",
    "Djakarta",
    "Geneva",
    "The Hague",
    "Hanoi",
    "Helsinki",
    "Karachi",
    "London",
    "Moscow",
    "New Delhi",
    "Oslo",
    "Paris",
    "Peking",
    "Pyongyang",
    "Rabat",
    "Rome",
    "Sofia",
    "Tel Aviv",
    "Tokyo",
    "Ulan Bator",
    "Vatican City",
    "Vienna"
  ],
  "origin_agency": "NSA",
  "persons_mentioned": [
    "John Kennedy"
  ],
  "recipient": "HCF",
  "sender": "NSA"
}