{
  "classification": "Mexico",
  "document_type": "Report",
  "security": "This document reveals sensitive diplomatic communications regarding Mexican investigations into the Kennedy assassination and the Cuban government's reaction. Specifically, it mentions a \"brutal search\" conducted by Mexican authorities and the Cuban government's \"extremely violent terms\" in response. Releasing this information could strain diplomatic relations between Mexico, Cuba, and Brazil, particularly given the context of the sensitive investigation.",
  "security_level": "TOP SECRET",
  "summary": "A report details the Mexican government's response to the Cuban government's protest over the detention of a Mexican woman employed at the Cuban Embassy in Mexico City, following investigations into the Kennedy assassination and a search of her home.",
  "summary_one_paragraph": "This TOP SECRET report, dated December 14, 1963, originates from the NSA and is distributed to HCF. It describes the Mexican government's reaction to a protest from the Cuban government concerning the detention of a Mexican woman working at the Cuban Embassy in Mexico City. This detention and subsequent house search occurred following the Kennedy assassination, as Mexican authorities investigated the assassin's visit to both the Cuban and Soviet embassies to request visas. The Cuban government protested the \"brutal search\" in \"extremely violent terms,\" alleging it was ordered by the official candidate for the Mexican presidency, who is opposed by leftists.",
  "tags": [
    "NSA",
    "JFK Assassination",
    "Mexico",
    "Cuba",
    "Brazil",
    "Diplomatic Activity",
    "Mexican Authorities",
    "Brutal Search",
    "Sensitive Compartmented Information",
    "TOP SECRET UMBRA",
    "TOP SECRET DINAR"
  ],
  "title": "3/0/Z-BLD/T133-63: MEXICAN AUTHORITIES CONDUCT BRUTAL SEARCH AFTER",
  "date": "1963-12-14",
  "locations_mentioned": [
    "Mexico City",
    "Havana",
    "Dallas",
    "Cuba",
    "Soviet Union",
    "Rio de Janeiro",
    "Brazil"
  ],
  "origin_agency": "NSA",
  "persons_mentioned": [
    "KENNEDY",
    "PIOCORREA"
  ],
  "recipient": "HCF",
  "sender": "NSA"
}