{
  "classification": "Administrative",
  "document_type": "Record of Events",
  "security": "The document details real-time communications and operational status within the NSA SIGINT Command Center, including specific reporting actions, personnel coordination, and responses to intelligence inquiries from other agencies (CIA, DIA, STATE). Sharing this log could reveal the NSA's internal communication protocols, operational tempo, and inter-agency coordination mechanisms, which could be exploited by adversaries to degrade the effectiveness of U.S. intelligence operations. For example, the entries regarding SHAMROCK reveal sensitive information.",
  "security_level": "T",
  "summary": "The document is a log of events at the NSA SIGINT Command Center on November 23, 1963, detailing communications, intelligence reports, and coordination with other agencies following the assassination of John F. Kennedy.",
  "summary_one_paragraph": "This NSA SIGINT Command Center record of events from November 23, 1963, documents the activities and communications managed by duty officers Gould, Larson and Smead. It includes notifications to and from various agencies such as the CIA, DIA, and State Department regarding the assassination's SIGINT reflections, funeral arrangements for President Kennedy, and potential international events like a coup in South Korea. The log also tracks internal NSA operations, including message releases, system status updates (e.g., CANTAT line restoration, GOLD TREE mission status), and personnel coordination for handling intelligence matters and ensuring operational readiness during the national mourning period.",
  "tags": [
    "NSA",
    "SIGINT",
    "Command Center",
    "John F. Kennedy",
    "Assassination",
    "DIA",
    "CIA",
    "State Department",
    "South Korea",
    "Coup",
    "SHAMROCK",
    "Funeral Arrangements"
  ],
  "title": "NSA SIGINT COMMAND CENTER - RECORD OF EVENTS",
  "date": "1963-11-23",
  "locations_mentioned": [
    "Moscow",
    "Leopoldville",
    "US South Command",
    "Havana",
    "Brazil",
    "Washington",
    "South Korea"
  ],
  "origin_agency": "NSA",
  "persons_mentioned": [
    "John Kennedy",
    "V. T. Larson",
    "LCDR McGrath",
    "Mueller",
    "Colonel Walker",
    "General Blake",
    "Mr Stewart",
    "LtCol Odonovich",
    "Dr Shinn",
    "Ray Henderson",
    "Cox",
    "Mr Embry",
    "General Blaake",
    "Lt Dancy",
    "Col McCabe",
    "Col Holbert",
    "Mr Rowlet",
    "Farley",
    "Brennan",
    "Zaslow",
    "Col Swears",
    "JENKS",
    "Col. Duvall",
    "Major Melson",
    "Deputy Priminister Mickoyon",
    "Mr Ayres",
    "Edwards",
    "Brown",
    "Bradley",
    "John Stockton",
    "Al Content",
    "Mr Sloss",
    "Mr. Keller",
    "Beard"
  ],
  "recipient": "N/A",
  "sender": "NSA SIGINT Command Center"
}