{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "This document contains detailed allegations by the Cuban government regarding the activities of a Spanish diplomat, Jaime Caldevilla, accusing him of espionage, recruitment of agents for the CIA, and involvement in plots against Cuban leaders. Revealing these allegations, especially the names of individuals supposedly working with Caldevilla, could compromise intelligence sources and methods, endanger individuals, and strain diplomatic relations. For example, \"The main activites of Counselor JAIME CALDEVILLA are directed toward the search, by illicit means, for information of a military, economic and political nature, the fulfillment of tasks of ideological diversionism and the recruitment of agents and counterrevolutionaries for the Central Intelligence Agency...\"",
  "security_level": "SECRET",
  "summary": "This document is a report detailing the Cuban government's accusations against Jaime Caldevilla, a Spanish Press Counselor in Havana, for alleged espionage, recruitment for the CIA, and plots against Cuban leaders, leading to his declaration as persona non grata.",
  "summary_one_paragraph": "A report dated May 28, 1966, outlines the Cuban government's accusations against Jaime Caldevilla y Garcia Villar, a Spanish Press Counselor in Havana, for engaging in activities against the integrity and stability of the Cuban state. The detailed note, delivered to the Spanish Embassy, accuses Caldevilla of seeking military, economic, and political information illicitly, recruiting agents for the CIA, and involvement in plots against Cuban leaders, including a plan to harm Soviet Deputy Chairman Anastas Mikoyan. Allegedly, Caldevilla also used his secretary, Carmen Jimenez Gomez, to infiltrate student organizations and gather information. The Cuban government requests Caldevilla's immediate departure as persona non grata due to these actions, which constitute a grave abuse of diplomatic immunity.",
  "tags": [
    "NSA",
    "Jaime Caldevilla",
    "Spanish Counselor",
    "Havana",
    "Cuba",
    "Espionage",
    "CIA",
    "Persona Non Grata",
    "Counterrevolutionaries",
    "Diplomatic Abuse"
  ],
  "title": "2X/0/CUD/T1663-66 SPANISH COUNSELOR IN HAVANA DECLARED PERSONA NON-GR [R]",
  "date": "1966-05-28",
  "locations_mentioned": [
    "Havana",
    "Cuba",
    "Madrid",
    "Spain",
    "United States Naval Base at Guantanamo",
    "Miami"
  ],
  "origin_agency": "NSA",
  "persons_mentioned": [
    "Jaime Caldevilla y Garcia Villar",
    "Jose Luis Rodriguez",
    "Carmen Jimenez Gomez",
    "Aldo Vera",
    "Mario Marrero",
    "Agustin Parrada",
    "Pedro Luis Boitell",
    "Anastas Mikoyan",
    "Israel Zamora Perez",
    "Raul Castro Ruz",
    "Alfredo Serra Echevarria",
    "Blanca Martinez Del Hoyo",
    "Jorge Medina Bringuier",
    "Luis Fernandez Rocha",
    "Genaro Fernandez Folgueiras",
    "Luis Antonio Collazo Dennisn",
    "Ramon Grau Als In",
    "Aldo Abreu Bacallao",
    "Alejandro Vergara",
    "Fidel Castro Ruz",
    "Manuel Artime",
    "Alvaro Gonzalez Gordon",
    "Maria Teresa Velasco Sarra"
  ],
  "recipient": "HCO",
  "sender": "NSA"
}