{
  "classification": "Cuba",
  "document_type": "Transcript",
  "security": "The testimony discusses covert operations against Cuba, including potential assassinations of Cuban leaders. Directly quoting: \"If there had been any operation with the assassination of Fidel Castro, or other high Cuban government leaders as its objective, would such an operation have been referred to either the three-man group or later the Special Group.\"",
  "security_level": "TOP SECRET",
  "summary": "A transcript of a Senate Select Committee hearing on intelligence activities, specifically focusing on CIA operations against Cuba in the early 1960s. The testimony includes discussion about the JMWAVE station, Operation Mongoose, and potential assassination attempts on Fidel Castro.",
  "summary_one_paragraph": "This document is a transcript from a Senate Select Committee hearing held on August 19, 1975, concerning governmental operations related to intelligence activities. The hearing includes testimony from a witness identified as \"Halley\" (under an alias), questioned by Mr. Baron, regarding his involvement with the CIA's JMWAVE station in Miami and the Agency's operations against Cuba from 1962 to 1965. The discussion covers Halley’s role as Chief of Station at JMWAVE, the command structure involving a three-man group led by Robert Kennedy and later the Special Group, and the approval process for various operations, including potential assassination attempts on Fidel Castro. The hearing explores the relationship between different entities involved in anti-Cuban activities, such as Task Force W and Project MONGOOSE, and aims to understand the extent of CIA involvement in sensitive operations.",
  "tags": [
    "SSCIA",
    "JMWAVE",
    "CIA",
    "Operation Mongoose",
    "Fidel Castro",
    "Hearings",
    "Transcript",
    "Assassination",
    "Cuba",
    "Halley",
    "Task Force W",
    "Special Group"
  ],
  "title": "Hearing held before Senate Select Committee to Study Governmental Operations with Respect to Intelligence Activities",
  "conspiracy": "The document discusses potential assassination attempts on Fidel Castro, specifically whether such operations would have been referred to the three-man group or the Special Group for approval.",
  "date": "1975-08-19",
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Halley",
    "Fidel Castro",
    "Robert Kennedy",
    "General Lansdale",
    "Richard Helms",
    "William Harvey",
    "Al Cox",
    "John McCone",
    "Mr. FitzGerald",
    "Mr. Screber",
    "Mr. Hart",
    "Mr. McNamara",
    "Mr. Rusk",
    "Mr. Baron"
  ],
  "recipient": "Senate Select Committee to Study Governmental Operations with Respect to Intelligence Activities",
  "sender": "Halley (Witness, alias name for CIA operative)"
}