{
  "classification": "Cuba",
  "document_type": "Index Cards",
  "security": "This document reveals details of CIA operations to assassinate Fidel Castro, including specific individuals involved, methods considered, and the timeline of events. Disclosing this information could expose covert activities, compromise current intelligence operations, and damage relationships with foreign governments. Direct quotes: “...was believed to _have_access_to_Castro_and_a_poison_pill_was_developed_that_he_was_to_insert into Castro's food.” and “It is likely that at the very moment President Kennedy was shot, a CIA officer was meeting with a Cuban agent in Paris and giving him an assassination device for use against CASTRO.”",
  "security_level": "TOP SECRET",
  "summary": "This document consists of index cards summarizing CIA activities related to the assassination of Fidel Castro, including Operation Mongoose and interactions with Cuban exiles. The cards reference specific individuals, dates, and methods considered.",
  "summary_one_paragraph": "This collection of index cards summarizes CIA's involvement in plots to assassinate Fidel Castro, particularly during the early 1960s. It includes information on Operation Mongoose, detailing meetings attended by figures like Walt Elder and Bruce Cheever, and outlines discussions about sabotage and potential aerosol attacks. The cards also reference collaboration with the Mafia and Cuban exiles, attempts to use Castro’s sister, and the provision of assassination devices to Cuban agents.",
  "tags": [
    "Castro",
    "Wiretap",
    "Operation Mongoose",
    "Assassination",
    "Cuba",
    "CIA",
    "SSCIA",
    "Phase I",
    "Phase II",
    "Syndicate"
  ],
  "title": "Index Cards",
  "conspiracy": "This document indicates that the CIA was actively plotting to assassinate Fidel Castro at the same time that Lee Harvey Oswald assassinated JFK, using the same personnel and tactics with the same groups (Cuban exiles and the mafia). This suggests that the CIA may have been involved in the JFK assassination, or that the same people were involved in both.",
  "date": "1975-06-01",
  "locations_mentioned": [
    "Cuba",
    "New York City",
    "San Francisco",
    "Paris"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Castro",
    "Greg Bautzer",
    "O'Connell",
    "Maheu",
    "Edwards",
    "Allen Dulles",
    "C. P. Cabell",
    "Richard Bissell",
    "Sheffield-Edwards",
    "James O'Connell",
    "J. D. Esterline",
    "Cornelius Roosevelt",
    "Ray Treichler",
    "Edward Gunn",
    "William Harvey",
    "Sidney Gottlieb",
    "Robert Bannerman",
    "J. C. King",
    "Trafficante",
    "Rosselli",
    "Giancana",
    "Richard Helms",
    "Bruce Cheever",
    "Ted Shackley",
    "Varona",
    "Walt Elder",
    "RFK (Robert F. Kennedy)",
    "General Lansdale",
    "McGeorge Bundy",
    "Henry Bortner",
    "Lyman",
    "Kilpatrick",
    "Desmond Fitzgerald",
    "Nestor Sanchez",
    "AMLASH",
    "TEPEDINO",
    "MOCONE",
    "PRESIDENT KENNEDY",
    "BYRON CAMERON",
    "Raul Castro",
    "Ernesto Che Guevera"
  ]
}