{
  "classification": "Cuba",
  "document_type": "Index Cards",
  "security": "Disclosing details about Operation MONGOOSE, especially the direct involvement of high-ranking officials like RFK and McCone, could damage the CIA's reputation and reveal sensitive information about covert operations.",
  "security_level": "TOP SECRET",
  "summary": "This document contains index cards referencing Operation MONGOOSE and related activities, including discussions by the Special Group Augmented regarding reconnaissance of Cuba and potential actions against Castro.",
  "summary_one_paragraph": "This document consists of index cards from June/July 1975, summarizing various meetings, memoranda, and reports related to Operation MONGOOSE and activities concerning Cuba. The cards reference discussions within the Special Group Augmented regarding reconnaissance options, potential actions against Castro, and CIA coordination with other government entities. Key individuals mentioned include Lansdale, Taylor, Johnson, McCone, RFK, and others, highlighting the high-level involvement in these covert operations.",
  "tags": [
    "Operation MONGOOSE",
    "Castro",
    "SSCIA",
    "Special Group Augmented",
    "JMWAVE",
    "FFIAB",
    "USIB",
    "CIA Inspector General"
  ],
  "title": "Index Cards",
  "conspiracy": "The document alludes to a potential Mafia plot to assassinate Castro, indicating a $150,000 asking price with José Mario Pepin Bosch offering $50,000. It mentions that the CIA rejected contributing to this plot but reported its existence.",
  "date": "1975-06-00",
  "locations_mentioned": [
    "Cuba"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Lansdale",
    "Taylor",
    "Johnson",
    "Gilpatric",
    "McCone",
    "RFK",
    "Lemnitzer",
    "Roig",
    "Rusk",
    "Kohler",
    "Hurwitch",
    "King, J. C.",
    "Harvey",
    "Bissell",
    "Halpern",
    "Edwards",
    "Bundy",
    "Opapich",
    "Jessup",
    "Steakley",
    "Vance",
    "Hughes",
    "Bosch, Jose",
    "Wilson",
    "Parrot",
    "Charyks",
    "Scoville",
    "Leigh, James S.",
    "Carter"
  ]
}