{
  "classification": "JFK Assassination",
  "document_type": "Transcript",
  "security": "This document reveals details of CIA operations involving manipulation of foreign leaders through compromising methods, including the use of prostitutes and the creation of a fabricated film. Mr. Maheu states, '...I was provided with pictures reflecting the quarters...photographs of the female agent...I was asked...to produce a set resembling the headquarters...a woman who looked like the female agent...and taker some pictures.' Sharing these details could expose unethical or illegal activities conducted by the CIA, severely damaging its reputation and compromising its operational methods.",
  "security_level": "TOP SECRET",
  "summary": "This is the testimony of Robert Maheu before the SSCIA on July 30, 1975, concerning his involvement in various CIA projects, including wiretapping Aristotle Onassis, a plan to influence a foreign leader through a female agent, and a staged film to discredit the same leader.",
  "summary_one_paragraph": "Robert Maheu's SSCIA testimony on July 30, 1975, details his work for the CIA, including a wiretap operation targeting Aristotle Onassis and an initiative to affect the policies of a foreign leader, referred to as 'Leader A.' Maheu describes a plan to send Florence Horn to meet this leader, followed by an operation to provide the leader with vetted female companions during a visit to the United States, ensuring they posed no security risk. Further, he recounts producing a fabricated film, using look-alikes and a set resembling a location in Russia, to discredit the leader after it was believed a Russian agent had influenced his views. Maheu's testimony also touches on seeking advice from Howard Hughes regarding the film production and coordinating with the State Department.",
  "tags": [
    "SSCIA",
    "Robert Maheu",
    "Sam Giancana",
    "Johnny Roselli",
    "Mafia Connection",
    "Wiretaps",
    "Aristotle Onassis",
    "Florence Horn",
    "Leader A",
    "CIA Projects",
    "Howard Hughes",
    "Scott McCloud",
    "Larry Crosby",
    "Pornographic Film",
    "Blackmail"
  ],
  "title": "Testimony of Robert Maheu",
  "date": "1975-07-30",
  "persons_mentioned": [
    "Robert Maheu",
    "Morton R. Galane",
    "Sam Giancana",
    "Johnny Roselli",
    "Aristotle Onassis",
    "Florence Horn",
    "Scott McCloud",
    "Larry Crosby",
    "Howard Hughes",
    "Carl Twitchell",
    "Charles Kays",
    "Senator Huddleston",
    "Senator Schweiker",
    "Thomas Evans",
    "Frank",
    "Leone",
    "O'Connell",
    "Colonel Edwards"
  ],
  "recipient": "SSCIA",
  "sender": "SSCIA"
}