{
  "classification": "Commission",
  "document_type": "Transcript",
  "security": "This document contains discussions regarding intelligence activities, resource allocations, and budgetary matters. Specific details about authorized projects, personnel numbers, and reprogramming of funds are mentioned. Releasing this information could compromise intelligence operations, reveal sensitive budgetary details, and expose internal decision-making processes related to intelligence activities. Quoting directly: 'That one page of this document is probably the most classified single compilation' and discussions about potentially misleading the Agency regarding document content.",
  "security_level": "TOP SECRET",
  "summary": "This document is a transcript of a hearing held before the Senate Select Committee to Study Governmental Operations with Respect to Intelligence Activities on March 9, 1976. The committee discusses the DCI's responsibilities, resource allocation, and coordination of intelligence activities, including budgetary matters and potential limitations on fund reprogramming.",
  "summary_one_paragraph": "On March 9, 1976, the Senate Select Committee to Study Governmental Operations with Respect to Intelligence Activities convened a hearing to discuss various aspects of intelligence operations. The committee, chaired by Senator Walter D. Huddleston, reviewed the DCI's responsibilities for resource allocation, coordination of intelligence activities, and budgetary oversight. Discussions included concerns about the level of detail in budget figures, the DCI's authority to reprogram funds, and the balance between tactical military intelligence and other intelligence activities. The committee debated the necessity of statutory limitations on the DCI's power to reprogram funds, aiming to provide Congress with better oversight while maintaining operational flexibility.",
  "tags": [
    "SSCIA",
    "SSCSGO",
    "Methodology",
    "Committee Business",
    "Intelligence Activities",
    "Resource Allocation",
    "DCI",
    "Budget",
    "Fund Reprogramming",
    "Tactical Military Intelligence",
    "Senate Select Committee",
    "Church Committee"
  ],
  "title": "Senate Select Committee to Study Governmental Operations with Respect to Intelligence Activities Hearing Transcript",
  "date": "1976-03-09",
  "persons_mentioned": [
    "Walter D. Huddleston",
    "Hart of Colorado",
    "Mathias",
    "William Miller",
    "Joseph Digenova",
    "Charles Kirbow",
    "Ellict Maxwell",
    "Elizabeth Culbreth",
    "Jan Orloff",
    "William Bader",
    "Lynn Davis",
    "Al Quanbeck",
    "Charles Lombard",
    "Rick Inderfurth",
    "Bob Kelley",
    "Greg Treverton",
    "Jim Johnston",
    "Britt Snider",
    "Aaron",
    "Beth Bloomfield",
    "Boldin",
    "Bush",
    "Colby"
  ],
  "recipient": "N/A",
  "sender": "SSCIA"
}