{
  "classification": "Security",
  "document_type": "Testimony",
  "security": "This document reveals specific methods and programs used by the CIA's Office of Security that, if disclosed, could compromise current security operations. This includes details on covert recording systems, physical surveillance techniques, and the use of informants within and outside the agency. Disclosing the types of individuals recruited as informants (e.g., plumbers, telephone maintenance men) or the existence of proprietary companies used for investigations (Anderson Security Associates) could expose current assets and methods, making it easier for adversaries to penetrate or circumvent CIA security measures. Additionally, detailing the coordination with local police departments and the nature of assistance provided to them could damage relationships with law enforcement agencies and invite legal challenges. Examples: 'Taping Systems in Certain CIA Offices,' 'Covert Informers Employed by the Agency,' 'Training of State and Local Police and Other Assistance.'",
  "security_level": "TOP SECRET",
  "summary": "This document contains Howard J. Osborn's testimony regarding activities of the CIA's Office of Security, including electronic surveillance, physical surveillance, Watergate contacts, covert informers, mail intercepts, and cooperation with local police.",
  "summary_one_paragraph": "Howard J. Osborn's testimony, dated February 17, 1975, details activities of the CIA's Office of Security, covering topics such as taping systems in CIA offices, covert use of listening devices approved by the DCI, physical surveillance of individuals (including journalists), CIA's Watergate contacts, and the use of covert informers. It also includes information on mail intercept programs, cooperation with local police departments through the provision of training and equipment, and instances of break-ins without warrants involving employees suspected of disclosing classified information. Osborn also discusses counter-audio sweeps conducted for other government agencies and congressional committees.",
  "tags": [
    "CIA",
    "Office of Security",
    "Howard J. Osborn",
    "Electronic Surveillance",
    "Physical Surveillance",
    "Watergate",
    "Covert Informers",
    "Mail Intercepts",
    "Local Police",
    "Counter-Audio Sweeps"
  ],
  "title": "Testimony of Osborn, Howard J.",
  "date": "1975-02-17",
  "locations_mentioned": [
    "United States",
    "Europe",
    "New York",
    "San Francisco",
    "Fairfax County, Virginia",
    "New York City",
    "Chicago",
    "Maryland",
    "Virginia",
    "Detroit",
    "Miami",
    "Washington, D.C.",
    "Ann Arbor, Michigan",
    "California",
    "Vienna, Austria",
    "Japan"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Howard J. Osborn",
    "Victor Marchetti",
    "Admiral Rufus Taylor",
    "Attorney General Katzenbach",
    "Jack Anderson",
    "Les Whitten",
    "Michael Gettner",
    "Thelma King",
    "Colonel Durrer",
    "Mr. Helms",
    "James McCord",
    "Paul Gaynor",
    "Richard Helms",
    "Mr. Houston",
    "Lee Pennington",
    "Ermal Geiss",
    "Arnold Parham",
    "Steve Kuhn",
    "Hollis Whitaker",
    "Charles Wylie",
    "Lou Vasaly",
    "Sidney Steinbridge",
    "E. Howard Hunt",
    "General Cushman",
    "Mr. Young",
    "Daniel Ellsberg",
    "Fidel Castro",
    "Thomas Karamessines",
    "Ralph True",
    "Nelson A. Rockefeller",
    "David W. Belin",
    "John T. Connor",
    "C. Douglas Dillon",
    "Erwin N. Griswold",
    "Lane Kirkland",
    "Lyman L. Lemnitzer",
    "Ronald Reagan",
    "Edgar F. Shannon, Jr.",
    "Robert Olsen",
    "Jack Debelius",
    "Rob Bannerman",
    "Mr. Colby",
    "Frank Bartamo",
    "William Sullivan",
    "J. Edgar Hoover",
    "Mr. Ober",
    "Brownman"
  ]
}