{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "The memos discuss covert actions, sabotage, and assassination plots against Cuban and Haitian leaders, revealing specific operational details and coordination among U.S. government agencies. Discussing covert actions and assassination plots reveals plans to violate international laws and norms. Details regarding specific sabotage targets, methods, and operational approvals could enable adversaries to counteract or replicate such actions. For example, the memo discusses \"Sabotage Program, Cuba\" dealing with external sabotage directed at four major segments of the Cuban economy: (1) electric power; (2) petroleum refineries and storage facilities; (3) railroad and highway transportation; and (4) production and manufacturing.",
  "security_level": "S",
  "summary": "A collection of memoranda and minutes related to covert actions and discussions primarily concerning Cuba and the Dominican Republic, including potential assassination plots and sabotage operations, as discussed by the Special Group and other high-level authorities within the U.S. government.",
  "summary_one_paragraph": "This document consists of memoranda and minutes from Special Group meetings between 1960 and 1964, detailing covert operations and policies related to Cuba and the Dominican Republic. The documents discuss topics such as sabotage of sugar mills in Cuba, plans for covert action, potential assassination plots against Fidel Castro and other Cuban leaders, and actions against the Trujillo regime in the Dominican Republic. The discussions also cover actions against Cuban subversion in Latin America, harassment of free world shipping to Cuba, and various sabotage proposals, as well as political action plans for Haiti including the potential removal of Duvalier. These documents reveal the U.S. government's strategic planning and covert actions during this period.",
  "tags": [
    "SSCI",
    "CIA",
    "Trujillo Assassination",
    "Cuba",
    "Special Group",
    "Covert Operations",
    "Sabotage",
    "Assassination Plots",
    "NSAM 311"
  ],
  "title": "Memorandum Regarding Trujillo Assassination: Missing Documents and List of Documents Referred to in Special Group Minutes",
  "conspiracy": "The document includes a memorandum discussing alleged peace talks with Castro in October and November 1963, during which assassination devices were being prepared and offered to AMLASH. This juxtaposition suggests a potential conflict between diplomatic efforts and covert operations.",
  "date": "1975-07-02",
  "locations_mentioned": [
    "Cuba",
    "Dominican Republic",
    "Haiti",
    "Washington, D.C.",
    "Bahamas"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Greg Treverton",
    "F.A.O. Schwarz, Jr.",
    "Farland",
    "Rubottom",
    "Dearborn",
    "J.D. Esterline",
    "J.C. King",
    "Castro",
    "William Attwood",
    "Jean Daniel",
    "Kennedy",
    "Arthur Schlesinger",
    "Curtis Smothers",
    "William Miller",
    "Gray",
    "Dulles",
    "Mobutu",
    "Merchant",
    "Fidel",
    "Raul",
    "Che Guevara",
    "Bissell",
    "Lumumba",
    "Bundy",
    "Cabal",
    "Parrott",
    "Lansdale",
    "Cottrell",
    "McCone",
    "Helms",
    "McGeorge Bundy",
    "Duvalier",
    "Fitzgerald"
  ],
  "recipient": "F.A.O. Schwarz, Jr.",
  "sender": "Greg Treverton"
}