{
  "classification": "Assassination",
  "document_type": "Report",
  "security": "This document discusses a highly sensitive CIA project, ZR/RIFLE, which involved developing an assassination capability. It includes details about the recruitment and use of agents for potential assassination purposes, as well as the level of knowledge and authorization within the White House and CIA leadership. Disclosing these details could compromise sensitive intelligence operations, reveal classified techniques, and damage the reputation of the CIA and the U.S. government. Specifically, the document states: 'Executive action is a CIA euphemism, defined by the testimony before the Committee as a project for research into developing means for overthrowing foreign political leaders, including a capability to perform assassinations'.",
  "security_level": "TOP SECRET",
  "summary": "This document is a draft report from the SSCIA (Church Committee) dated September 8, 1975, concerning the CIA's \"executive action\" capability, particularly Project ZR/RIFLE, which included research into assassination of foreign leaders.",
  "summary_one_paragraph": "This draft report, dated September 8, 1975, from the SSCIA (Church Committee), examines the CIA's \"executive action\" project, focusing on Project ZR/RIFLE, initiated in 1961 under Richard Bissell. The report details how William Harvey was instructed to establish an assassination capability, with discussions involving McGeorge Bundy and later Richard Helms. The project involved assessing assassination requirements, spotting potential agents like QJ/WIN, and researching techniques, though it was claimed no actual assassination targets were selected. The report also explores the extent of White House authorization, with conflicting testimonies from Bissell, Harvey, Bundy, and Rostow, and it questions whether the project was connected to actual assassination plots, such as those against Castro.",
  "tags": [
    "SSCSGO",
    "Report",
    "SSCIA",
    "Church Committee",
    "Executive Action",
    "ZR/RIFLE",
    "Assassination",
    "Richard Bissell",
    "William Harvey",
    "McGeorge Bundy",
    "Richard Helms",
    "QJ/WIN"
  ],
  "title": "DRAFT REPORT",
  "date": "1975-09-08",
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Richard Bissell",
    "William Harvey",
    "McGeorge Bundy",
    "Richard Helms",
    "QJ/WIN",
    "Walt Rostow",
    "Sidney Gottlieb",
    "Arnold Silver",
    "John Roselli",
    "Fidel Castro",
    "Lumumba",
    "Trujillo",
    "Allen Dulles",
    "John McCone",
    "Andrew Goodpaster",
    "Gordon Gray"
  ],
  "recipient": "Unknown",
  "sender": "SSCIA"
}