{
  "classification": "Operations",
  "document_type": "Index Cards",
  "security": "This document reveals the CIA's involvement in assassination plots against Fidel Castro and Patrice Lumumba. Specific methods, such as using potent pills and lethal cigars, are detailed. Additionally, the document discloses internal discussions about 'Executive Action' and the recruitment of agents for such purposes. Sharing this information could expose sensitive operational methods, compromise relationships with foreign governments, and damage the CIA's reputation.  Quoting directly: '...if he could be furnished with some type of potent pill...'; '...a box of Cuban cigars to be treated with a lethal material...'; '...Harvey testified that he did not know whether the DCI was advised that he had been asked to create a capability for Executive Action...'",
  "security_level": "TOP SECRET",
  "summary": "This document consists of index cards summarizing CIA activities related to assassination plots against Fidel Castro and Patrice Lumumba, as well as discussions about 'Executive Action'. It includes details on methods, individuals involved, and relevant dates.",
  "summary_one_paragraph": "This document contains index cards from June/July 1975, summarizing various CIA operations and discussions related to assassination plots. Key details include a plot to poison Castro using pills developed by Dr. Raymond Treichler and delivered via Juan Orta, and another involving lethal cigars prepared by Dr. Edward Gunn. The records also reference Operation Mongoose, discussions about Executive Action, and William Harvey's involvement in recruiting agents for potential assassination operations, as well as his role in the Congo operation targeting Patrice Lumumba.",
  "tags": [
    "JFK Assassination",
    "SSCIA",
    "Castro",
    "Operation Mongoose",
    "Assassination Plots",
    "Executive Action",
    "William Harvey",
    "Edward Gunn",
    "Raymond Treichler",
    "Lumumba"
  ],
  "title": "Index Cards",
  "conspiracy": "This document reveals details about CIA plots to assassinate Fidel Castro, including the use of poisoned pills and cigars. It also discusses the CIA's 'Executive Action' program and potential targeting of Patrice Lumumba, adding to the body of evidence suggesting the CIA engaged in covert operations that could be construed as assassinations.",
  "date": "1975-06-00",
  "locations_mentioned": [
    "Cuba",
    "Congo",
    "Berlin"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Fidel Castro",
    "Juan Orta",
    "Raymond Treichler",
    "Cornelius Roosevelt",
    "Edward Gunn",
    "Robert A. Maheu",
    "Allen Dulles",
    "C. P. Cabell",
    "Richard Bissell",
    "Sheffield Edwards",
    "James O'Connell",
    "J. D. Esterline",
    "Rasy Pericich",
    "Robert Bannerman",
    "J. C. King",
    "Samuel Halpern",
    "Sanchez",
    "Amlash",
    "Helms",
    "William Harvey",
    "Desmond Fitzgerald",
    "Bruce Cheever",
    "Gen Lansdale",
    "McCone",
    "Justin O'Donnell",
    "Patrice Lumumba",
    "Arnold Silver",
    "Taylor",
    "Johnson",
    "Gilpatrick",
    "RFK",
    "Lemnitzer",
    "Harris Craig",
    "Arnold Stever",
    "QJWIN"
  ],
  "recipient": "Unknown",
  "sender": "SSCIA"
}