{
  "classification": "Cuba",
  "document_type": "Transcript/Report of Proceedings with Exhibits",
  "security": "This document contains discussions of potential assassination attempts and covert deliveries of weapons, revealing sensitive operational methods. The discussion about monitoring phone conversations and the agency's internal review process touches on areas that could damage the CIA's reputation. 'I have heard and I am sure you must have heard of the delivery of a sniper's rifle to the Embassy in Havanna, which may have been intended for some sort of assassination attempt.'",
  "security_level": "TOP SECRET",
  "summary": "This document is a transcript of a SSCIA meeting in June 1975 that includes testimony from Lawrence Houston, a former CIA employee, regarding CIA operations, particularly concerning Fidel Castro and internal agency practices.",
  "summary_one_paragraph": "The document is a transcript from a Senate Select Committee on Intelligence Activities (SSCIA) meeting held on June 2, 1975, featuring testimony from Lawrence Houston, who was with the CIA from 1947 to 1973. Houston discusses various topics, including instances where he advised against certain CIA actions, such as placing officers in Republican and Democratic campaign parties for experience and monitoring long-distance telephone conversations. He also mentions a vague recollection of a sniper's rifle being delivered to the U.S. Embassy in Havana, possibly intended for an assassination attempt on Castro.",
  "tags": [
    "SSCIA",
    "Lawrence Houston",
    "CIA",
    "Fidel Castro",
    "Assassination Attempts",
    "Covert Operations",
    "Internal Security",
    "Executive Session"
  ],
  "title": "Transcript/Report of Proceedings with Exhibits",
  "conspiracy": "The document includes a reference to the delivery of a sniper's rifle to the U.S. Embassy in Havana, which 'may have been intended for some sort of assassination attempt' on Fidel Castro.",
  "date": "1975-06-02",
  "locations_mentioned": [
    "Havana, Cuba",
    "Virginia",
    "Canada",
    "New York",
    "Dominican Republic",
    "Berlin",
    "Rome"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Lawrence Houston",
    "Fidel Castro",
    "Malcolm Wilkie",
    "Senator Mondale",
    "Robert Kennedy",
    "Kirbow",
    "Helms",
    "Harvey",
    "Wides",
    "Noll"
  ],
  "sender": "SSCIA"
}