{
  "classification": "JFK Assassination",
  "document_type": "Transcript",
  "security": "This document reveals discussions about potentially assassinating Patrice Lumumba, including the confirmation that such an action was considered at high levels within the CIA. It includes specific references to cables sent to the Chief of Station to explore access to Lumumba for this purpose: 'It would have been the eventuality that we might wish to get rid of Mr. Lumumba personally.' Revealing such direct involvement in considering assassination could damage international relations and expose covert operations.",
  "security_level": "TOP SECRET",
  "summary": "This is a transcript of a SSCIA hearing on September 9, 1975, featuring the testimony of Bronson Tweedy, former Chief of the African Division, regarding the CIA's involvement in the Congo, specifically the potential assassination of Patrice Lumumba.",
  "summary_one_paragraph": "On September 9, 1975, Bronson Tweedy testified before the SSCIA regarding the CIA's activities in the Congo, focusing on discussions about assassinating Patrice Lumumba. Tweedy detailed conversations with Richard Bissell, where the possibility of eliminating Lumumba was raised, and the subsequent dispatch of cables to the Chief of Station, Larry Hedgman, to assess the feasibility of such an operation. He clarified that while planning occurred, no concrete action plans were developed or implemented, and the matter never progressed beyond a contingency planning phase.",
  "tags": [
    "SSCIA",
    "Bronson Tweedy",
    "Patrice Lumumba",
    "Assassination",
    "Congo",
    "CIA",
    "Richard Bissell",
    "Larry Hedgman",
    "Covert Action",
    "Hearings"
  ],
  "title": "SSCIA Hearing Transcript: Bronson Tweedy Testimony on CIA Activities in the Congo and Potential Assassination of Patrice Lumumba",
  "conspiracy": "This document reveals serious contemplation of assassinating a foreign leader. While no direct orders were given, the document states, 'Dick would have said we probably better be thinking about whether it might ever be necessary or desirable to get rid of Lumumba, in which case we presumably should be in position to assess whether we could do it or not successfully.'",
  "date": "1975-09-09",
  "locations_mentioned": [
    "Congo",
    "Washington, D.C.",
    "Switzerland",
    "Vienna, Austria",
    "London",
    "South Africa",
    "Stanleyville",
    "Katanga"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Bronson Tweedy",
    "Patrice Lumumba",
    "Richard Bissell",
    "Larry Hedgman",
    "Walter F. Mondale",
    "Rhett Dawson",
    "Frederick Baron",
    "Mennen Williams",
    "Wayne Fredericks",
    "Jim Penfield",
    "Joe Satterswate",
    "Livingstone Merchant",
    "Dean Rusk",
    "Christian Herter",
    "Douglas Dillon",
    "Dwight D. Eisenhower",
    "Carl Kazen",
    "Gordon Gray",
    "Andrew Goodpaster",
    "John McCone",
    "McBundy",
    "Moise Tshombe",
    "Mobutu Sese Seko",
    "Allen Dulles"
  ],
  "recipient": "Senate Select Committee to Study Governmental Operations With Respect to Intelligence Activities",
  "sender": "Bronson Tweedy"
}