{
  "classification": "JFK Assassination",
  "document_type": "Report",
  "security": "Disclosing details about Project ZRRIFLE, including its purpose of procuring code and cipher materials and the involvement of specific agents like QJWIN, could compromise intelligence operations and reveal sensitive methods used by the CIA. The document outlines security protocols, such as limiting knowledge of the project within the CIA (Kubark only) and avoiding contact with other government agencies or foreign officials. Exposing these details could harm ongoing intelligence efforts and damage relationships with foreign entities.",
  "security_level": "TOP SECRET",
  "summary": "This document from the SSCIA presents notes and summaries related to the testimony of William Harvey concerning Operation Mongoose, ZRRIFLE, and potential executive actions, including references to assassination plots and contacts with the criminal syndicate.",
  "summary_one_paragraph": "This report summarizes a meeting held on June 25, 1975, by the Senate Select Committee on Intelligence Activities (SSCIA) featuring testimony from William Harvey. It includes a chronological overview of Harvey's career within the CIA, references to Operation Mongoose, and details about Project ZRRIFLE, an initiative focused on developing an executive action capability. The document touches on potential assassination plots, the use of poison pills, contacts with the criminal syndicate, and security protocols emphasizing strict control and limited dissemination of information within the CIA.",
  "tags": [
    "William Harvey",
    "Operation Mongoose",
    "ZRRIFLE",
    "Assassination",
    "Church Committee",
    "SSCIA",
    "Executive Action",
    "Cuba"
  ],
  "title": "",
  "conspiracy": "The document alludes to assassination plots against Fidel Castro involving the use of criminal syndicates and poison pills, indicating potential CIA involvement in actions beyond sanctioned operations.",
  "date": "1975-06-25",
  "persons_mentioned": [
    "William Harvey",
    "Allen Dulles",
    "Fidel Castro",
    "Robert F. Kennedy",
    "Sheffield Edwards",
    "James O'Connell",
    "Sidney Gottlieb",
    "John Roselli",
    "Santo Trafficante",
    "Tony Varona",
    "Ted Shackley",
    "Robert McNamara",
    "Lansdale",
    "Frank Hand",
    "Edward Gunn",
    "Sam Papich",
    "J. Edgar Hoover",
    "McCone",
    "Arnold Silver",
    "Lumumba"
  ],
  "sender": "SSCIA"
}