{
  "classification": "Cuba",
  "document_type": "Transcript",
  "security": "Revealing specific details about covert operations, such as AMLASH's plan to initiate a coup in Cuba and the CIA's involvement, could compromise intelligence sources, methods, and ongoing activities. Quoting directly: 'The operation was never conceived, certainly, carried out during the period I was associated with it, but was never conceived as an assassination plot. It was conceived as a coup in order to organize a military group within Cuba to overthrow Castro.' This reveals the CIA's intent to influence or overthrow foreign governments.",
  "security_level": "TOP SECRET",
  "summary": "A transcript of a hearing before the Senate Select Committee to Study Governmental Operations with Respect to Intelligence Activities on February 11, 1976, focuses on the AMLASH operation, a CIA effort to organize a military coup against Fidel Castro.",
  "summary_one_paragraph": "This top-secret transcript from a February 11, 1976, Senate Select Committee hearing details the AMLASH operation, during which the CIA sought to organize a military coup against Fidel Castro in Cuba. The testimony of an AMLASH case officer, whose identity is protected, reveals that the operation aimed to instigate a coup by organizing a military group within Cuba, though the agency tried to de-emphasize assassination, which was central to AMLASH's plans. Discussions covered the case officer's interactions with AMLASH, AMLASH's concerns regarding the CIA’s resolve, and his request to meet with someone high in the U.S. government, such as Robert Kennedy, to gain assurance of the operation's importance.",
  "tags": [
    "SSCIA",
    "AMLASH",
    "CIA",
    "Castro",
    "Cuba",
    "Coup",
    "Robert Kennedy",
    "Assassination Plot",
    "SAS",
    "Special Affairs Staff",
    "Jim Wave"
  ],
  "title": "Hearing on AMLASH Operation",
  "date": "1976-02-11",
  "persons_mentioned": [
    "Fidel Castro",
    "Robert Kennedy",
    "Richard S. Schweiker",
    "Paul Wallach",
    "Ed Greissing",
    "Jim Johnston",
    "Dan Dwyer",
    "Frederick Baron",
    "J. C. King",
    "AMLASH",
    "Jim Wave",
    "John McCone"
  ],
  "sender": "SSCSGO (Senate Select Committee to Study Governmental Operations with Respect to Intelligence Activities )"
}