{
  "classification": "JFK Assassination",
  "document_type": "Report",
  "security": "The report details an interview with a former CIA Chief of Station (COS) regarding the Lumumba assassination plan, including information about lethal biological agents and direct presidential authorization. Exposing these details could reveal sensitive operational methods, potential illegal activities, and compromise the identities and safety of individuals involved. Quoting directly, 'Gottlieb informed him that lethal biological agents had been developed for the assassination of Lumumba' and 'The Director has instructions from President Eisenhower.'",
  "security_level": "Declassified",
  "summary": "This document is a report summarizing an interview conducted by the SSCIA with a former CIA Chief of Station (COS) regarding the CIA's involvement in the Lumumba assassination plan in the Congo during 1960-1961, including the alleged authorization from President Eisenhower and the use of lethal biological agents.",
  "summary_one_paragraph": "This report summarizes an August 20, 1975, interview with a former CIA Chief of Station (COS) in the Congo, conducted by the SSCIA, regarding the planned assassination of Patrice Lumumba. The COS testified that he received instructions and lethal biological agents from Sidney Gottlieb, claiming authorization came directly from President Eisenhower. The COS stated he received confirmation of the mission via coded cables from Headquarters, but never executed the assassination, disposing of the virus later. The report also includes interviews with C. Douglas Dillon and James Douglas, exploring their knowledge of discussions regarding Lumumba's potential assassination during high-level meetings.",
  "tags": [
    "SSCIA",
    "Church Committee",
    "Lumumba Assassination",
    "CIA",
    "Fidel Castro",
    "Biological Agents",
    "Eisenhower",
    "Gottlieb",
    "Congo"
  ],
  "title": "Report on Lumumba Assassination Plan and Related Events in the Congo",
  "date": "1975-00-00",
  "locations_mentioned": [
    "Congo",
    "Washington D.C.",
    "Carroll Arms Hotel",
    "Rome",
    "Thysville",
    "Katanga",
    "Zaire"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Fidel Castro",
    "Patrice Lumumba",
    "Richard Bissell",
    "Bronson Tweedy",
    "Sidney Gottlieb",
    "President Eisenhower",
    "Justin O'Donnell",
    "Mobutu",
    "Casavubu",
    "Thomas Karamessines",
    "Schlesinger",
    "Allen Dulles",
    "Colby",
    "Richard Helms",
    "Arnold Silver",
    "William Harvey",
    "C. Douglas Dillon",
    "Robert Murphy",
    "James Douglas",
    "Thomas Gates",
    "Gordon Gray",
    "Jack Hasey",
    "David Whipple",
    "Clare H. Timberlake",
    "Robert Johnson"
  ],
  "recipient": "Files",
  "sender": "Frederick Baron"
}