{
  "classification": "Cuba",
  "document_type": "Index Cards",
  "security": "This document contains information regarding Operation Mongoose and potential assassination attempts on Castro. Sharing details about these operations, even in sanitized form, could reveal covert activities, compromise sources and methods, and damage the CIA's reputation. For example, the document mentions that \"the term 'assassinate' was used in the discussion of A.M. LASH's future role in Cuba and it visibly upset A.M. LASH, who preferred the term 'eliminate.'\"",
  "security_level": "TOP SECRET",
  "summary": "Index cards summarizing documents related to Operation Mongoose and other activities related to Cuba, including potential assassination plots against Fidel Castro and efforts to gather intelligence on the Cuban regime.",
  "summary_one_paragraph": "This document consists of index cards summarizing various documents related to Operation Mongoose and other activities concerning Cuba. It includes references to meetings of the Special Group and Special Group Augmented, discussions about potential assassination attempts on Fidel Castro, intelligence gathering efforts, and political actions. Key individuals mentioned include McCone, Harvey, Helms, Lansdale, RFK, and others involved in the planning and execution of these operations. The cards also reference specific incidents such as attempts to contaminate purchased equipment and sabotage shipments from Canada, along with efforts to recruit Castro's sister as an intelligence asset.",
  "tags": [
    "Operation Mongoose",
    "Castro",
    "SSCIA",
    "Special Group",
    "Assassination Plot",
    "Cuba",
    "Intelligence Gathering"
  ],
  "title": "Index Cards",
  "conspiracy": "The document references plots to assassinate Castro, potentially providing details relevant to understanding the scope and nature of such activities.",
  "date": "1975-06-00",
  "locations_mentioned": [
    "Cuba",
    "Havana",
    "Mexico",
    "Dominican Republic",
    "Costa Rica",
    "United States",
    "Panama Canal Zone",
    "Saipan"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Castro",
    "McCone",
    "Harvey",
    "Helms",
    "Lansdale",
    "RFK",
    "Bissell",
    "Dulles",
    "Taylor",
    "Gilpatric",
    "Bundy",
    "Johnson",
    "Merchant",
    "Gray",
    "Mann",
    "Douglas",
    "Lash",
    "Wainwright",
    "Pepin Bosch",
    "Lopez Mateos"
  ],
  "recipient": "[R]",
  "sender": "[R]"
}