{
  "classification": "Cuba",
  "document_type": "Index Cards",
  "security": "This document contains details about Operation MONGOOSE, including specific activities such as contaminating POL supplies, infiltration tactics, and intelligence collection methods. Disclosing these details could reveal sensitive operational capabilities and intelligence sources. For example, the document notes: \"CIA has initiated action to contaminate POL supplies for Cuba...\" and \"Many of the agents infiltrated into Cuba will be trained for paramilitary skills as well as intelligence collection,...However, CIA has noted that, once the agents are inside Cuba, they cannot be controlled effectively from outside Cuba, although every effort will be made to attempt such control.",
  "security_level": "TOP SECRET",
  "summary": "These index cards summarize various aspects of Operation MONGOOSE, including budget allocations, planning, intelligence gathering, and actions taken against Cuba, as documented in meeting minutes and memoranda from 1959 to 1963.",
  "summary_one_paragraph": "This document consists of index cards summarizing Operation MONGOOSE, a covert operation against Cuba. The cards reference Special Group meetings and memoranda from November 1959 to April 1963, detailing budget summaries, intelligence plans, infiltration tactics, and sabotage efforts. Key figures like Bissell, Dulles, Lansdale, McCone, and RFK are mentioned, along with specific actions such as contaminating POL supplies, dispatching intelligence agents, and efforts to create a popular movement against Castro. The cards also note the challenges faced, such as lack of policy approval for utilizing Department of Defense personnel and difficulties in controlling agents inside Cuba.",
  "tags": [
    "Operation MONGOOSE",
    "SSCIA",
    "Special Group",
    "Covert Operations",
    "Cuba",
    "Intelligence",
    "Sabotage",
    "Infiltration"
  ],
  "title": "[R] Index Cards",
  "date": "1975-06-00",
  "locations_mentioned": [
    "Cuba",
    "United States",
    "Belgium",
    "South America"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Bissell",
    "Dulles",
    "Gray",
    "Merchant",
    "Helms",
    "President Kennedy",
    "McCone",
    "Lansdale",
    "Taylor",
    "Johnson",
    "Gilpatrick",
    "RFK",
    "Lemnitzer",
    "Roig",
    "Rusk",
    "Kohler",
    "Hurwitch",
    "Harvey",
    "Castro",
    "Craig",
    "Harris",
    "Cline",
    "Parrott",
    "Murphy",
    "Irwin",
    "Gates"
  ],
  "recipient": "[R]",
  "sender": "SSCIA [R]"
}