{
  "classification": "Commission",
  "document_type": "Transcript",
  "security": "Disclosure of the negotiated agreements and operational details between the CIA and Israeli intelligence could jeopardize current intelligence-sharing partnerships and compromise sensitive information. The transcript reveals specific operational understandings, such as the CIA's commitment not to work against Arab interests and their collaborative focus on Soviet intelligence. Quoting directly, the document states: 'they were informed that we would not work with them against the Arabs, that we would work with them on Soviet intelligence and Soviet bloc Intelligence and communism, where it existed.' This level of detail could be exploited by adversaries to undermine trust and cooperation with allied intelligence services.",
  "security_level": "TOP SECRET",
  "summary": "This document is a transcript of James Angleton's testimony before the Senate Select Committee to Study Governmental Operations With Respect to Intelligence Activities on June 19, 1975, covering his involvement with the CIA, Israeli intelligence, and counterintelligence operations.",
  "summary_one_paragraph": "On June 19, 1975, James Angleton testified before the Senate Select Committee, detailing his career from OSS to his role as Chief of Counterintelligence at the CIA until December 1974. He discussed his early experiences in counterintelligence during WWII, the breaking of German codes, and the establishment and maintenance of relationships with Israeli intelligence, including the agreement negotiated with Teddy Kollek in 1951. Angleton outlined the terms of the agreement, noting that the CIA would not work against Arab interests but would collaborate on Soviet intelligence and communism, and highlighted the significance of this relationship in the context of both security and political concerns.",
  "tags": [
    "Angleton, James",
    "USSR",
    "CIA",
    "FBI",
    "Nosenko, Yuri",
    "CIA, Relationship with WC",
    "Oswald, Lee, Russian Period",
    "SSCIA",
    "Hearings",
    "Counterintelligence",
    "Israeli Intelligence",
    "Senate Select Committee",
    "OSS",
    "Teddy Kollek"
  ],
  "title": "Report of Proceedings: Hearing held before Senate Select Committee to Study Governmental Operations With Respect to Intelligence Activities",
  "date": "1975-06-19",
  "persons_mentioned": [
    "Angleton, James",
    "Nosenko, Yuri",
    "Oswald, Lee",
    "Tower, John G.",
    "Baker",
    "Mathias",
    "Miller, William",
    "Schwarz, Frederick A. O., Jr.",
    "Kirbow, Charles",
    "Aaron, David",
    "Murphy, James R.",
    "Donovan, General",
    "Oaks, Jonnie",
    "Wells, Ben",
    "Hillenkoetter, Admiral",
    "Smith, General Walter Bedell",
    "Dulles, Allen",
    "Kollek, Teddy",
    "Montini"
  ],
  "sender": "SSCSGO (Senate Select Committee to Study Governmental Operations.)"
}