{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "This document details alleged CIA involvement in assassination attempts on foreign leaders and clandestine operations, including attempts to sabotage the Panama Canal and deals with American mobsters. Disclosing such information could compromise current intelligence operations, damage international relations, and reveal controversial or illegal activities.",
  "security_level": "Declassified",
  "summary": "A report from the SSCIA (Church Committee) covers topics such as anti-Castro activities, organized crime, the CIA, and the assassination of John F. Kennedy, featuring an article about Marie Lorenz, an alleged American Mata Hari who spied on Fidel Castro.",
  "summary_one_paragraph": "This declassified report from the SSCIA, dated 1975, encompasses 690 pages and includes a New York Daily News article detailing Marie Lorenz's alleged espionage activities against Fidel Castro. Lorenz reportedly stole secret papers from Castro's suite and worked with Frank Sturgis (later involved in Watergate) to spy on Castro. The report references alleged CIA involvement in assassination attempts on foreign leaders like Castro, Duvalier, and Trujillo, sabotage attempts against the Panama Canal, secret deals with the Mafia, and armed raids on Cuba.",
  "tags": [
    "Anti-Castro Activities",
    "Organized Crime",
    "CIA",
    "Assassination",
    "Kennedy",
    "John",
    "Marie Lorenz",
    "Fidel Castro",
    "Frank Sturgis",
    "Church Committee"
  ],
  "title": "Miscellaneous Records of the Church Committee",
  "date": "1975-00-00",
  "persons_mentioned": [
    "John F. Kennedy",
    "Fidel Castro",
    "Marie Lorenz",
    "Frank Sturgis",
    "Papa Doc Duvalier",
    "Rafael Trujillo"
  ],
  "sender": "SSCIA (Church Committee, Paul Meskil NY Daily News reporter ) - (Report originator, not clearly identified in provided text.)-from newspaper accounts, the report's originator is not named only reference is reporter Paul Meskil of the NY Daily News. Marie Lorenz is the individual who the report centers on.. The Church Committee of the SSCIA is identified on document's id form). Therefore, because Marie Lorenz is not the document creator, the SSCIA's Church Committee is listed as author/sender of the report )"
}