{
  "classification": "Vietnam",
  "document_type": "Telegram Information Report",
  "security": "Revealing information about the conflict among provincial authorities, especially the influence of Ngo Dinh Can, could damage relations with South Vietnam and expose sensitive political dynamics within the country. The reference to American policy of providing economic aid, training, and arms to mountain tribesmen and the concerns about indiscriminate killings could be used to criticize U.S. involvement and policies in the region.",
  "security_level": "CONFIDENTIAL",
  "summary": "This telegram reports opposition in Khanh Hoa Province to arming mountain tribesmen and to the Strategic Hamlet Program due to fears of indiscriminate killings and excessive demands on the population, along with conflict among provincial authorities.",
  "summary_one_paragraph": "A CIA telegram, dated September 13, 1962, details opposition within Khanh Hoa Province, South Vietnam, to U.S. policies of arming mountain tribesmen and the Strategic Hamlet Program. Local authorities feared tribesmen would indiscriminately kill innocent Vietnamese, and the populace resented the excessive demands for labor, material, and money associated with the program. The report also highlights conflicts among provincial officials, noting that the province chief, Major Le Tap, is less influential than the deputy province chief for security, Ba, and Truong Dinh Cac, the deputy province chief for economic matters assigned by Ngo Dinh Can, who controls economic activities in the province.",
  "tags": [
    "CIA",
    "Vietnam",
    "Khanh Hoa Province",
    "Opposition",
    "Mountain Tribesmen",
    "Strategic Hamlet Program",
    "Provincial Conflict",
    "Ngo Dinh Can",
    "Economic Aid"
  ],
  "title": "Opposition in Khanh Hoa Province",
  "date": "1962-09-13",
  "locations_mentioned": [
    "South Vietnam",
    "Khanh Hoa Province"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Bui Bo",
    "Le Tap",
    "Ba (FNU)",
    "Ton That Dinh",
    "Truong Dinh Cac",
    "Ngo Dinh Can",
    "Ngo Dinh Diem",
    "Yang (FNU)"
  ],
  "recipient": "STATE/INR, DIA, ARMY/ACSI, NAVY, AIR, JCS, SECDEF, NSA, NIC, AID, USIA, OCI, ONE, OCR, ORR",
  "sender": "CIA"
}