{
  "classification": "Soviet",
  "document_type": "Telegram",
  "security": "Disclosing the specific comments and reactions of diplomats from the Soviet Bloc and Yugoslavia following the Kennedy assassination, along with the identities of the individuals providing this information (Greek political observer), could compromise intelligence-gathering operations and sources. The report itself states: 'This material contains information affecting the National Defense of the United States within the meaning of the Espionage Laws...the transmission or revelation of which in any manner to an unauthorized person is prohibited by law.'",
  "security_level": "SECRET",
  "summary": "A CIA information telegram reports on comments from Yugoslav and Soviet Bloc diplomats regarding the probable effect of President Kennedy's assassination on East-West relations, gathered from a Greek political observer in Athens.",
  "summary_one_paragraph": "This CIA information telegram, dated December 6, 1963, relays comments from Yugoslav and Soviet Bloc diplomats in Athens regarding the impact of President Kennedy's assassination on East-West relations. Sourced from a Greek political observer, the report indicates that while some diplomats expressed hope for continued friendly contacts and a belief that US policy wouldn't drastically change, there was also concern that improved relations would be delayed, and anxiety over the strength of radical right-wing elements in the United States.",
  "tags": [
    "CIA",
    "Kennedy Assassination",
    "Soviet Bloc",
    "Yugoslavia",
    "East-West Relations",
    "Diplomats",
    "Athens",
    "Greece"
  ],
  "title": "CIA Information Telegram",
  "date": "1963-12-00",
  "locations_mentioned": [
    "Soviet Bloc",
    "Yugoslavia",
    "Greece",
    "Athens"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Peko Dapcevic",
    "Vaklav Svestka",
    "Vitaliy Novikov",
    "Mircea Balanescu",
    "John F. Kennedy",
    "Lyndon B. Johnson"
  ]
}