{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "This document discusses covert operations, relationships with exile groups, and financial support of publications, revealing sensitive information about the Agency's activities. It also notes that certain information contained therein involved the use of pseudonyms, which could compromise individuals if exposed. Sharing the details of these covert activities and relationships could damage the CIA's reputation and compromise ongoing operations. \"Mr. Dulles stated that he wanted to raise in a general way at this meeting the problem of the Agency's relations with the exile groups, the payment to dependents of the strike force and the publications which the Agency has been supporting.\"",
  "security_level": "Secret",
  "summary": "A memorandum summarizing the minutes of a Special Group meeting on June 6, 1961, covering topics such as the Congo, political action projects, release procedures for Francis Gary Powers, and covert operations in Vietnam and Korea.",
  "summary_one_paragraph": "This memorandum details discussions from a Special Group meeting held on June 6, 1961, attended by officials including Messrs. Bowles, Gilpatric, Bundy, Dungan, and Dulles. Key topics included the approval of the Congo plan (contingent on State Department provisions), a review of covert political action projects in friendly countries, and deferral of discussion on Francis Gary Powers' release. The group also approved a SIPOLYY flight and a covert annex for Vietnam, while further review was requested for a covert annex in Korea, and the TACKLE mission. Finally, discussions also included the Agency's relations with Cuban exile groups and the financial support of publications.",
  "tags": [
    "Special Group",
    "Congo",
    "Political Action",
    "Francis Gary Powers",
    "Vietnam",
    "Korea",
    "TACKLE",
    "Nicaragua",
    "Cuba",
    "Covert Operations",
    "Exile Groups",
    "NSC",
    "FOIA"
  ],
  "title": "Memorandum for the Record",
  "date": "1961-06-08",
  "locations_mentioned": [
    "Congo",
    "Vietnam",
    "Korea",
    "Puerto Cabezas",
    "Cuba"
  ],
  "origin_agency": "WH",
  "persons_mentioned": [
    "Bowles",
    "Gilpatric",
    "Bundy",
    "Ralph Dungan",
    "Dulles",
    "Gizenga",
    "Francis Gary Powers",
    "Somoza",
    "Morales-Carrion",
    "Thomas P. Schreyer"
  ],
  "recipient": "The Record"
}