{
  "classification": "Operations",
  "document_type": "Telegram Information Report",
  "security": "Revealing discussions of a potential coup and the decision to withhold information from the U.S. could damage diplomatic relations and reveal intelligence gathering methods. Quoting directly: 'THE PLANS WERE NOT GOING TO BE COMMUNICATED TO THE AMERICANS BECAUSE THE UNITED STATES, A BASICALLY LAW-ABIDING NATION, IS OPPOSED TO UNLAWFUL ACTS. SINCE A COUP D'ETAT IS CONSIDERED BY AMERICAN OFFICIALS TO BE AN UNLAWFUL PROCESS, THE US IS FORCED TO DISCOURAGE SUCH ACTIONS, AND THEREFORE, THE AMERICANS WILL NOT BE NOTIFIED OF ANY FUTURE ACTIVITY...'",
  "security_level": "CONFIDENTIAL",
  "summary": "A CIA telegram reports Colonel Ton That Xung's view that a coup d'état might occur in South Vietnam and that the plans would be withheld from the U.S. because of America's opposition to unlawful acts.",
  "summary_one_paragraph": "This confidential CIA telegram, dated June 15, 1962, relays information from an American observer regarding Colonel Ton That Xung, Commander of the Ranger Command in South Vietnam. Xung indicated during a luncheon that the people of South Vietnam were dissatisfied with the current situation and planning a coup d'état. The report specifies that the coup plans would be kept secret from American officials because the United States, viewed as a law-abiding nation, is inherently opposed to unlawful actions such as coups. The information was acquired in Saigon on June 3, 1962.",
  "tags": [
    "CIA",
    "South Vietnam",
    "Coup d'état",
    "Ton That Xung",
    "Political Instability",
    "NOFORN",
    "National Security"
  ],
  "title": "Views...Possible Coup D'Etat",
  "date": "1962-06-15",
  "locations_mentioned": [
    "South Vietnam",
    "Saigon",
    "Pleiku Province"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Ton That Xung",
    "Ton That Chu",
    "Dungan",
    "Gildner",
    "Konythen",
    "Petersen",
    "Schlesinger",
    "Belk",
    "Komer",
    "Raskin"
  ],
  "recipient": "State, Army, Navy, Air, USMACV, MAAG, AID, CINCPAC, ARPAC, PACFLT, PACAF"
}