{
  "classification": "Cuba",
  "document_type": "Paper, Textual",
  "security": "This document outlines covert operations to destabilize the Dominican Republic, including arming dissident groups and potentially violating international labor agreements. Exposing these plans could damage U.S. foreign relations and reveal operational methods. Quoting the text: \"On 24 January 1961 the Special Group authorized the Agency to provide dissident exiled Dominican groups with limited arms and equipment...\" and \"WHD feels that perhaps this announced policy should now be reviewed in the light of more recent developments and an attempt be made, through covert channels if necessary, to build up an international shipping boycott against the GODR.\"",
  "security_level": "SECRET",
  "summary": "A briefing paper from Richard Bissell to McGeorge Bundy, dated February 17, 1961, details the worsening U.S./Dominican relations and outlines covert operational plans, including providing arms to dissident groups and considering an international shipping boycott against the Dominican Republic.",
  "summary_one_paragraph": "This secret briefing paper from Richard Bissell to McGeorge Bundy on February 17, 1961, addresses the deteriorating U.S./Dominican relations following the break in diplomatic relations in August 1960. It summarizes operational activities authorized by the Special Group, which include providing limited arms and equipment to exiled Dominican groups like the VRD and FCR, with the goal of introducing them into the Dominican Republic. The paper also discusses the possibility of developing a boycott capability against the Dominican Republic, and reviews initial talks with FCR and VRD leaders, concluding with recommendations for the immediate use of sea capabilities to cache arms near the Dominican coast due to the country's rapidly approaching economic paralysis.",
  "tags": [
    "CIA",
    "Dominican Republic",
    "Covert Operations",
    "Arms Supply",
    "Boycott",
    "VRD",
    "FCR",
    "Trujillo",
    "Bissell",
    "Bundy"
  ],
  "title": "Briefing Paper/Dominican Republic",
  "date": "1961-02-17",
  "locations_mentioned": [
    "Dominican Republic",
    "United States",
    "Venezuela",
    "Ciudad Trujillo",
    "Puerto Rico",
    "San Juan"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Bissell",
    "Bundy, McGeorge",
    "Trujillo",
    "Eisenhower",
    "Kennedy",
    "Dearborn",
    "James A. McNamara",
    "Betancourt",
    "Figueres",
    "Ornes",
    "Fernando Muniz Silva",
    "George Meany",
    "Ramfis"
  ],
  "recipient": "Bundy, McGeorge",
  "sender": "Bissell"
}