{
  "classification": "Commission",
  "document_type": "List",
  "security": "Disclosing the specific titles of CIA histories, particularly those related to covert actions and operations in various countries, could reveal sensitive intelligence methods and sources. The document lists titles such as 'Covert Support to Indonesian Revolutionary Government' and 'Overthrow of Premier Mossadeq of Iran,' which, if detailed, could expose operational tactics and compromise current or future covert activities. Additionally, referencing ongoing or past associations with foreign entities or individuals could jeopardize relationships and create diplomatic tensions.",
  "security_level": "Top Secret",
  "summary": "This document is a CIA list that categorizes certain historical items by whether they were requested by the Church Committee, excluding items of internal, organizational, or administrative nature; it focuses on activities or operations within the Senate Select Committee's area of interest.",
  "summary_one_paragraph": "Dated March 1975, this CIA document breaks down historical items related to specific covert or clandestine actions during the Eisenhower, Nixon, Kennedy, and Johnson administrations, differentiating between those requested by the Church Committee and those not requested. The list excludes histories of a purely internal, organizational, or administrative nature, focusing instead on activities or operations within the Senate Select Committee's stated area of interest and generally attributed to one particular Presidential Administration. The document also identifies several miscellaneous 'histories' that, considering the Senate Select Committee's charter, were notable omissions.",
  "tags": [
    "CIA",
    "Church Committee",
    "Document Request",
    "Anti-Castro Activities",
    "CIA Histories",
    "Covert Operations",
    "Clandestine Actions",
    "Eisenhower Administration",
    "Nixon Administration",
    "Kennedy Administration",
    "Johnson Administration"
  ],
  "title": "CIA \"HISTORIES\": BREAKDOWN OF CERTAIN ITEMS REQUESTED...",
  "date": "1975-03-00",
  "origin_agency": "CIA",
  "recipient": "Church Committee"
}