{
  "classification": "Cuba",
  "document_type": "Deposition",
  "security": "Discusses covert CIA activities, potential assassination plots, and the operations of the Miami Station, which could compromise ongoing operations and damage the CIA's reputation. Specifically, the mention of discussions about assassination attempts against Fidel Castro is highly sensitive.  Quoting from the document: \"Well, let me answer it this way. I wouldn't say attempts. I know there was discussion. 'Attempts' is too strong a word.\"",
  "security_level": "Secret",
  "summary": "This document is a deposition of William C. Sturbitts, a CIA employee, taken on April 16, 1975, by the Rockefeller Commission, discussing his involvement in Cuban operations, anti-Castro activities, and his knowledge of discussions regarding potential assassination attempts against Fidel Castro.",
  "summary_one_paragraph": "The deposition of William C. Sturbitts, a CIA Special Assistant for Latin America, was taken on April 16, 1975, as part of the Rockefeller Commission's investigation into CIA activities. Sturbitts details his nine-year involvement in Cuban operations from 1964 to 1973, working under Desmond Fitzgerald and Task Force W, and his knowledge of the Miami Station's activities. He explains the evolution of the Cuban operations group, its relationship to the Deputy Director, Plans, and mentions discussions, though not \"attempts,\" regarding possible assassination plots against Fidel Castro. Sturbitts also clarifies the timeline of Cuban operations and the eventual transfer of control to the Washington area.",
  "tags": [
    "Anti-Castro Activities",
    "CIA",
    "Clandestine Operations",
    "Cuban Exiles",
    "Desmond Fitzgerald",
    "Frank Sturgis",
    "E. Howard Hunt",
    "Robert F. Kennedy",
    "Organized Crime",
    "Johnny Roselli",
    "William Sturbitts",
    "Sam Giancana",
    "Rockefeller Commission",
    "Miami Station",
    "Task Force W",
    "Fidel Castro",
    "Assassination Plots"
  ],
  "title": "Deposition of (A CIA Employee)",
  "date": "1975-04-16",
  "locations_mentioned": [
    "Langley, Virginia",
    "Washington, D.C.",
    "Miami",
    "Europe",
    "Cuba",
    "Coral Gables",
    "Rome",
    "Indianapolis, Indiana"
  ],
  "origin_agency": "Rockefeller Commission",
  "persons_mentioned": [
    "William C. Sturbitts",
    "Desmond Fitzgerald",
    "Frank Sturgis",
    "E. Howard Hunt",
    "Robert F. Kennedy",
    "Johnny Roselli",
    "Sam Giancana",
    "Ted Shackley",
    "Paul Henze",
    "Jake Esterline",
    "Bill Harvey",
    "Fidel Castro",
    "George Manfredi",
    "Robert B. Olsen",
    "Helms",
    "Karamessines",
    "Sternfield"
  ]
}