{
  "classification": "Oswald",
  "document_type": "Summary/Interview",
  "security": "Revealing that the CIA contacted Uslov and debriefed him regarding his knowledge of Russian life, KGB, etc. could expose intelligence-gathering methods and sources. Quoting directly: “The CIA contacted. Uslov via telephone approximately two months later. A meeting was arranged and he was debriefed as to his knowledge of Russian life, KGB, etc.” Publicizing this interaction could compromise future interactions with similar sources or methods.",
  "security_level": "Unclassified",
  "summary": "The document is a summary of an interview with Sergy Alexandrovech Uslov, conducted on August 22, 1978, regarding information he had concerning Lee Harvey Oswald during Oswald's time in the Soviet Union.",
  "summary_one_paragraph": "On August 22, 1978, Clifford A. Fenton, Jr. interviewed Sergy Alexandrovech Uslov at his residence in Brooklyn, New York, concerning Uslov's knowledge of Lee Harvey Oswald. Uslov, who emigrated from the USSR in 1977, claimed that he learned from Pavez A. Golovachev in Minsk that Oswald spoke of making money by killing the President and becoming a hero in America. Uslov detailed his departure from Russia, his subsequent contact with the CIA, and his manuscript about Oswald based on information from Golovachev; he requested anonymity and expressed a willingness to provide his original Russian manuscript to the HSCA.",
  "tags": [
    "HSCA",
    "Sergy Alexandrovech Uslov",
    "Lee Harvey Oswald",
    "Pavez A. Golovachev",
    "Interview",
    "Russian Period",
    "KGB"
  ],
  "title": "Interview with Sergy Alexandrovech Uslov regarding Lee Harvey Oswald",
  "conspiracy": "Uslov recounts that Oswald, while in the USSR, allegedly stated he could make \"good money...by killing the President\" and become a hero, suggesting a possible motive or mindset related to the assassination. Quoting directly from Uslov's account: \"Oswald replied, 'Don't worry. There are many ways to make good money.' Oswald stated that he could get 'good money, for example, by killing the President in a good way.\"",
  "date": "1978-08-22",
  "locations_mentioned": [
    "Brooklyn, New York",
    "Minsk, USSR",
    "Russia",
    "Austria",
    "Italy",
    "Moscow"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Sergy Alexandrovech Uslov",
    "Lee Harvey Oswald",
    "Araism Uslov",
    "Clifford A. Fenton, Jr.",
    "Pavez A. Golovachev",
    "V. Egor",
    "Marina Oswald"
  ],
  "sender": "Clifford A. Fenton, Jr."
}