{
  "classification": "Personnel",
  "document_type": "Final Determination Notification & Payroll Authorization Forms",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document contains the Assassination Records Review Board's final determination to postpone in part the release of HSCA staff payroll records, specifically redacting Social Security numbers to protect personal privacy; it also includes payroll authorization forms for Marlin Risinger III from 1976-1978.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a final determination notification on December 8, 1995, regarding the postponement of some information within the HSCA's staff payroll records (Record Number 180-10070-10145), citing the need to redact Social Security numbers to prevent an unwarranted invasion of personal privacy, with the next review scheduled for 2017; the notification accompanies multiple payroll authorization forms for Marlin Risinger III, documenting his employment with the Select Committee on Assassinations from December 1976 to July 1978, including changes in his position from Document Clerk to Researcher and adjustments to his annual salary.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Payroll Records",
    "Marlin Risinger III",
    "Social Security Numbers",
    "Privacy",
    "Postponement",
    "Payroll Authorization Forms"
  ],
  "title": "Assassination Records Review Board Final Determination Notification and HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "persons_mentioned": [
    "Marlin Risinger III",
    "Thomas N. Downing",
    "Henry B. Gonzalez",
    "Louis Stokes",
    "Richard A. Sprague",
    "Thomas Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board"
}