{
  "classification": "Personnel",
  "document_type": "Final Determination Notification & Payroll Forms",
  "security": "The redaction of Social Security Numbers (SSNs) is to prevent an unwarranted invasion of personal privacy. The document states, \"The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "Unclassified",
  "summary": "This document consists of a Final Determination Notification from the Assassination Records Review Board regarding the release status of HSCA staff payroll records, specifically concerning Wendy Collins, and includes payroll authorization and health benefits registration forms. Social Security numbers are postponed from release to protect personal privacy.",
  "summary_one_paragraph": "This collection of documents includes a Final Determination Notification from the Assassination Records Review Board, which addresses the partial postponement of HSCA staff payroll records, citing the need to protect Social Security numbers (SSNs) from public disclosure to prevent an unwarranted invasion of personal privacy. It also includes various payroll forms related to Wendy S. Collins, an employee of the House Select Committee on Assassinations (HSCA), documenting her appointment, salary, and health benefits elections; the forms, dating from 1977-1978, illustrate administrative processes within the committee and reflect decisions regarding employee assignments and benefits.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Wendy Collins",
    "Social Security Number",
    "Privacy",
    "ARBB",
    "Final Determination",
    "Postponement"
  ],
  "title": "Final Determination Notification & HSCA Staff Payroll Records for Wendy S. Collins",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C.",
    "Pittsford, Vermont"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Louis Stokes",
    "Wendy S. Collins",
    "Frank Thompson, Jr.",
    "Richardson Preyer",
    "Walter E. Fauntroy",
    "Yvonne Brathwaite Burke",
    "Christopher J. Dodd",
    "Harold E. Ford",
    "Floyd J. Fithian",
    "Robert W. Edgar",
    "Samuel L. Devine",
    "Stewart B. McKinney",
    "Charles Thone",
    "Harold S. Sawyer"
  ],
  "recipient": "Frank Thompson, Jr.",
  "sender": "Louis Stokes"
}