{
  "classification": "Personnel",
  "document_type": "Final Determination Notification/Payroll Authorization Form/Memorandum",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (Initially Restricted)",
  "summary": "This document is a collection of forms related to the employment of Howard Louis Shapiro by the House Select Committee on Assassinations (HSCA), including payroll authorization forms, a memorandum regarding his appointment, and a certificate of non-relationship to members of Congress. Social Security numbers are redacted due to privacy concerns.",
  "summary_one_paragraph": "This document includes a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically those related to Howard Louis Shapiro. It details the postponement of the release of Shapiro's Social Security number to protect his personal privacy. The document also contains Shapiro's payroll authorization forms indicating his appointment as a Research Attorney for the John F. Kennedy Task Force within the HSCA, a memorandum confirming his employment and salary, and a certificate stating he has no prohibited relationships with current members of Congress.",
  "tags": [
    "HSCA",
    "Howard Louis Shapiro",
    "Payroll Records",
    "Social Security Number",
    "Privacy",
    "JFK Task Force",
    "Employment Records"
  ],
  "title": "HSCA Staff Payroll Records Regarding Howard Louis Shapiro",
  "date": "1978-03-21",
  "persons_mentioned": [
    "Howard Louis Shapiro",
    "Louis Stokes",
    "Thomas Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews"
  ],
  "recipient": "Thomas Howarth, Elizabeth Berning",
  "sender": "I. Charles Mathews, Louis Stokes (Authorizing Official). Shapiro, Howard"
}