{
  "classification": "Administrative",
  "document_type": "Final Determination Notification and Payroll Documents",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (originally restricted)",
  "summary": "This document is a notification from the Assassination Records Review Board regarding the postponed release of Social Security numbers in HSCA staff payroll records. It details the reasons for postponement and the decision to redact the information due to privacy concerns.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, regarding document 180-10068-10341, which pertains to the HSCA's staff payroll records. While there is significant historical interest in the document, the Board decided to postpone the release of Social Security numbers (SSNs) contained within it. This decision was based on the determination that public disclosure of the SSNs could reasonably be expected to constitute an unwarranted invasion of personal privacy, an invasion that outweighs the public interest. The SSNs are replaced with the substitute language 'SSN', and a next review was scheduled for 2017.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "FOIA",
    "Redaction"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Caryl M. Emanuel",
    "Louis Stokes",
    "Thomas Howarth",
    "Becky Martin",
    "Steve Fallis",
    "Tom Lambeth",
    "Jim Wolf",
    "Tiny Hutton",
    "Richardson Preyer",
    "Walter E. Fauntroy",
    "Yvonne Brathwaite Burke",
    "Christopher J. Dodd",
    "Samuel L. Devine",
    "Harold E. Ford",
    "Floyd J. Fithian",
    "Robert W. Edgar",
    "Stewart B. McKinney",
    "Charles Thone",
    "Harold S. Sawyer"
  ],
  "recipient": "District Unemployment Compensation Board",
  "sender": "Thomas Howarth, Deputy Staff Director and Budget Officer"
}