{
  "classification": "Administrative",
  "document_type": "Final Determination Notification/Memorandum/Printed Form",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified",
  "summary": "This document is a notification regarding the status of a HSCA staff payroll record, indicating postponements of information (Social Security numbers) due to privacy concerns. It includes memos related to Lillian Johnson's administrative leave and payroll certifications, along with Lillian Johnson's resume and employment-related forms.",
  "summary_one_paragraph": "This collection of documents pertains to the House Select Committee on Assassinations (HSCA) and includes a final determination notification regarding postponed information (Social Security numbers) due to privacy concerns, memoranda concerning Lillian Johnson's administrative leave and payroll information, payroll authorization forms, resume routing forms, Lillian Johnson's resume detailing her work history and skills, letters of appreciation for her work on the 1977 Presidential Inauguration, and personnel qualifications statements. The documents provide insight into the administrative and personnel aspects of the HSCA and the background of one of its employees.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Lillian Johnson",
    "Personnel",
    "Administration",
    "FOIA"
  ],
  "title": "Assassination Records Review Board Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C.",
    "Landover, Maryland"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Lillian Johnson",
    "Thomas Howarth",
    "I. Charles Mathews",
    "Louis Stokes",
    "Jimmy Carter",
    "Frank Wilson"
  ],
  "recipient": "Thomas Howarth, All Staff",
  "sender": "I. Charles Mathews"
}