{
  "classification": "Administrative",
  "document_type": "Final Determination Notification/Payroll Records",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (Initially Postponed in Part)",
  "summary": "This document is a notification from the Assassination Records Review Board regarding the postponed release of certain information within HSCA staff payroll records, specifically Social Security numbers, due to privacy concerns.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, regarding document 180-10068-10346 from the HSCA staff payroll records. The document details the postponement of releasing Social Security numbers, citing that their public disclosure would constitute an unwarranted invasion of personal privacy outweighing public interest. The document also notes the significant historical interest and absence of evidence that release would cause harm to the United States or any individual.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Postponement",
    "John F. Kennedy Assassination Records Collection Act"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "persons_mentioned": [
    "John J. Farmer, Jr.",
    "Tom Howarth",
    "Louis Stokes",
    "Donovan L. Gay",
    "Kevin Walsh",
    "Edwin Lopez",
    "Richardson Preyer",
    "Samuel L. Devine",
    "Walter E. Fauntroy",
    "Stewart B. McKinney",
    "Yvonne Brathwaite Burke",
    "Charles Thone",
    "Harold S. Sawyer",
    "Harold E. Ford",
    "Floyd J. Fithian",
    "Robert W. Edgar"
  ],
  "recipient": "Tom Howarth",
  "sender": "Donovan L. Gay, Tom Lambeth, Deputy Director"
}