{
  "classification": "Personnel",
  "document_type": "Interview Notes",
  "security": "This document contains information about CIA personnel, their positions, and operational details, including foreign resources (FR), cover arrangements, and relationships with other agencies like MI. Revealing this information could expose past and present CIA operatives, compromise ongoing operations, and damage relationships with foreign intelligence services. Specifically, the document mentions '[R was under fair force] [cover]' and discusses the movement of personnel and offices, which are details that could potentially be exploited.",
  "security_level": "UNCLASSIFIED",
  "summary": "Interview notes from 1978 regarding Jack Randall's CIA career, covering assignments in FE division, Indonesia, and Domestic Operations Directorate (DDO), including information on cover, foreign resources, and coordination with MI. The notes also touch on allegations of CIA involvement in assassinations and discuss personnel like Wilcott.",
  "summary_one_paragraph": "These are interview notes, dated March 24, 1978, possibly related to the JFK assassination records review, focusing on Jack Randall's career within the CIA. The notes detail Randall’s assignments starting in 1951 within the FE division, his station cover in Jakarta, his role as desk chief in Indonesia, and his later position as a staff officer. The interview covers his involvement in domestic operations, operating as a C.O. in the DDO in the U.S., and his role as a FOIA officer for the DDO. Other topics include the size and structure of the station, relationships with foreign resources (FR), coordination with military intelligence (MI), cover arrangements, and discussion of allegations of CIA involvement in assassinations and personnel like Wilcott.",
  "tags": [
    "Jack Randall",
    "CIA",
    "FE Division",
    "Indonesia",
    "Domestic Operations Directorate",
    "DDO",
    "FOIA",
    "Military Intelligence",
    "MI",
    "Assassination Allegations",
    "Personnel",
    "Prandall Interview"
  ],
  "title": "Prandall interview",
  "date": "1978-03-24",
  "locations_mentioned": [
    "Jakarta",
    "Indonesia",
    "Botgo",
    "U.S."
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Jack Randall",
    "Pate Wheeler",
    "Maraes Felekman Jin",
    "Wilcott",
    "Carlos Moreo",
    "CHO"
  ]
}