{
  "classification": "Commission",
  "document_type": "Outside Contact Report",
  "security": "Disclosing information about witnesses who recanted their testimony could be viewed as an attempt to discredit the official narrative surrounding the JFK assassination, potentially damaging the HSCA's reputation. The report contains personal information, such as addresses and phone numbers, which should not be disclosed.",
  "security_level": "Unclassified",
  "summary": "This HSCA outside contact report details a conversation with William Foster, a Federal Probation Officer who supervised Abraham Bolden, a former Secret Service agent. Foster provided information regarding Bolden's parole, his claims about the Secret Service knowing about the assassination beforehand, and the fact that a witness in Bolden's case recanted their testimony.",
  "summary_one_paragraph": "On November 25, 1977, the HSCA conducted an outside contact report with William Foster, a Federal Probation Officer from the Northern District of Illinois, regarding Abraham Bolden, a former Secret Service agent. Foster revealed that Bolden's case was unique because the prosecutor, Richard T. Sykes, only provided the indictment, withholding the typical \"version\" of facts about the crime. Foster noted that Bolden violated parole by telling the media the Secret Service had prior knowledge of the JFK assassination, published in the April 12, 1970 Chicago Sun-Times; however, Bolden's parole was not revoked. Foster also mentioned that a witness recanted their testimony against Bolden, yet Bolden's conviction was not overturned. Foster then supplied Bolden's past employer and the names and addresses of Bolden's family members, but the validity of this information after 1972 is not confirmed.",
  "tags": [
    "HSCA",
    "Abraham Bolden",
    "William Foster",
    "Secret Service",
    "Parole Violation",
    "Recanted Testimony",
    "Outside Contact Report"
  ],
  "title": "Outside Contact Report",
  "persons_mentioned": [
    "Abraham Bolden",
    "William Foster",
    "Richard T. Sykes",
    "Barbara Bolden",
    "Alvia Bolden",
    "Abraham Bolden, Jr.",
    "Darren Bolden",
    "Daniel Bolden, Sr.",
    "Ophelia Bolden",
    "Daniel Bolden, Jr.",
    "Benjamin Bolden",
    "Cecelia Griffin",
    "Eara Dixon",
    "Faye Bolden"
  ],
  "sender": "HSCA Staff (Belford N. Lawson III Form #5)"
}