{
  "classification": "Administrative",
  "document_type": "Final Determination Notification and Payroll Forms",
  "security": "This document contains personal information, specifically social security numbers, which are redacted to prevent unwarranted invasion of personal privacy. Releasing these numbers could expose individuals to identity theft or other forms of personal harm. As stated: 'The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.'",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a notification from the Assassination Records Review Board regarding the postponed release of certain information, specifically Social Security numbers, from HSCA staff payroll records, along with payroll authorization forms and related correspondence for Billie Gay Larson.",
  "summary_one_paragraph": "This document consists of a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically addressing the postponement of releasing Social Security numbers to protect personal privacy. It includes payroll authorization forms, an employment information form, and related correspondence pertaining to Billie Gay Larson's employment with the Select Committee on Assassinations, her subsequent move to the Office of the Speaker of the House, and related administrative details such as salary adjustments and certifications. The Review Board decided to postpone the release of Social Security numbers until 2017 due to privacy concerns, substituting them with 'SSN' in the publicly available text.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Assassination Records Review Board",
    "Billie Gay Larson",
    "Employment Information",
    "Personnel Records",
    "FOIA"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Billie Gay Larson",
    "Louis Stokes",
    "Richard A. Sprague",
    "Henry B. Gonzalez",
    "Thomas N. Downing",
    "Nancy L. Larson",
    "Tom Edwards",
    "Harold Kramer",
    "Sanford Stoddard",
    "Byron L. Fisher",
    "David Hinds",
    "Robert L. Hartesty"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board"
}