{
  "classification": "Administrative",
  "document_type": "Printed Form",
  "security": "The document is redacted to protect social security numbers, as the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy. “The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.”",
  "security_level": "Unclassified",
  "summary": "This document is a collection of payroll authorization forms and a memorandum regarding payroll certification for the House Select Committee on Assassinations (HSCA), specifically concerning employee Oliver J. Champion. It includes details of his employment history, salary adjustments, and a form related to potential conflicts of interest concerning relatives employed by Congress.",
  "summary_one_paragraph": "This collection of documents pertains to the payroll administration of Oliver J. Champion, an employee of the House Select Committee on Assassinations (HSCA), during 1977 and 1978. It includes several payroll authorization forms detailing his appointments, salary adjustments, and effective dates, as well as a payroll certification memorandum regarding the disclosure of familial relationships with members of Congress, signed by Champion on August 18, 1977. The documents, authorized by Louis Stokes, Chairman, are part of the HSCA staff payroll records and were reviewed by the Assassination Records Review Board, with Social Security numbers redacted to protect personal privacy.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Payroll Authorization",
    "Oliver J. Champion",
    "Louis Stokes",
    "Social Security Number Redaction",
    "Personnel Records",
    "Assassination Records Review Board"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1977-08-18",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Oliver J. Champion",
    "Louis Stokes"
  ]
}