{
  "classification": "Personnel",
  "document_type": "Printed Form",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "U",
  "summary": "This document contains records pertaining to Claire L. Brown's employment with the House Select Committee on Assassinations (HSCA), including her personal leave record, resume, resignation letter, and payroll authorization forms, with Social Security Numbers redacted.",
  "summary_one_paragraph": "This collection of documents relates to Claire L. Brown's employment with the HSCA, including a personal leave record from 1977, a resume outlining her education, professional experience, and skills, a resignation letter effective September 20, 1977, multiple payroll authorization forms detailing her salary and position changes from January to September 1977, a District Unemployment Compensation Board claim form, and a memo regarding payroll certification and relationships to members of Congress, with SSNs redacted and replaced with 'SSN'.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Claire L. Brown",
    "Personal Leave",
    "Resume",
    "Resignation",
    "Payroll Authorization",
    "Employment Records",
    "SSN Redaction"
  ],
  "title": "HSCA Staff Payroll Records Regarding Claire L. Brown",
  "date": "1976-12-29",
  "locations_mentioned": [
    "Washington, D.C.",
    "Alexandria, Virginia",
    "Atlanta, Georgia",
    "Columbus, Ohio",
    "Boston, Mass.",
    "Clinton, Maryland"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Claire L. Brown",
    "Louis Stokes",
    "Herman Talmadge",
    "Gus Yatron",
    "Richard A. Sprague",
    "Henry B. Gonzalez",
    "G. Robert Blakey",
    "Donovan L. Gay",
    "Rebecca W. Martin"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "HSCA, Budget Officer"
}