{
  "classification": "Administrative",
  "document_type": "Final Determination Notification",
  "security": "The document contains personal information, specifically Carolyn Amato's Social Security number, which is protected from public disclosure due to privacy concerns. Releasing this information could \"constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "Unclassified",
  "summary": "A notification from the Assassination Records Review Board regarding the status of HSCA staff payroll records, specifically concerning Carolyn Hansen Amato; it details the postponement of releasing Social Security number information to protect personal privacy.",
  "summary_one_paragraph": "This document is a Final Determination Notification from the Assassination Records Review Board, dated December 8, 1995, concerning HSCA staff payroll records (Record Number 180-10068-10300). It indicates that the release of Carolyn Hansen Amato's Social Security number has been postponed due to privacy concerns, with the next review scheduled for 2017. The decision was based on the significant historical interest in the document and the lack of evidence that its release would harm the U.S. or any individual, but the Social Security number is redacted to prevent an unwarranted invasion of personal privacy.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Carolyn Hansen Amato",
    "Social Security Number",
    "Privacy",
    "Postponement",
    "FOIA"
  ],
  "title": "Final Determination Notification",
  "date": "1995-12-08",
  "persons_mentioned": [
    "Carolyn Hansen Amato",
    "Thomas N. Downing",
    "Dawson Mathis",
    "Bob Jones",
    "Carroll Hubbard",
    "John W. Davis",
    "John Marshall",
    "Leland M. Biggs",
    "Paul A. A. St. Amour",
    "Richard Keshin",
    "Robert Morgan"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board"
}