{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified",
  "summary": "This document contains the Assassination Records Review Board's final determination regarding the postponement of certain information within HSCA staff payroll records, specifically Social Security numbers, to protect personal privacy. It also includes payroll authorization forms, a resume, and related correspondence for Antoinette M. Roberts, an employee of the Select Committee on Assassinations.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a final determination notification on December 8, 1995, regarding the postponement of Social Security numbers within HSCA staff payroll records (Record Number 180-10070-10146) to prevent an unwarranted invasion of personal privacy. The document includes payroll authorization forms, a memorandum regarding payroll certification, a resume, and a cover letter for Antoinette M. Roberts, who worked for the Select Committee on Assassinations, detailing her employment history, qualifications, and various roles from December 1976 to July 1977.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Antoinette M. Roberts",
    "Social Security Numbers",
    "Privacy",
    "Assassination Records Review Board",
    "Louis Stokes",
    "Select Committee on Assassinations",
    "Personnel Records"
  ],
  "title": "Assassination Records Review Board Final Determination Notification and HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C.",
    "Bethesda, MD",
    "Vienna, Austria",
    "Fountainbleau, France",
    "Hamilton, Bermuda",
    "Norwalk, Conn",
    "Barbados, West Indies",
    "San Francisco, Calif",
    "Grand Rapids, Michigan"
  ],
  "origin_agency": "HSCA (House Select Committee on Assassinations)",
  "persons_mentioned": [
    "Antoinette M. Roberts",
    "Louis Stokes",
    "Richard A. Sprague",
    "Henry B. Gonzalez",
    "Thomas N. Sounim",
    "Walter W. Roberts",
    "Lyndon B. Johnson"
  ],
  "recipient": "All Staff Employees",
  "sender": "Budget Officer"
}