{
  "classification": "Personnel",
  "document_type": "Final Determination Notification & Payroll Records",
  "security": "The redaction of Social Security numbers is to prevent an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest. Quoting directly: 'The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.'",
  "security_level": "UNCLASSIFIED",
  "summary": "This document contains a Final Determination Notification from the Assassination Records Review Board regarding the postponement of certain information, specifically Social Security numbers, within HSCA staff payroll records, as well as the payroll records themselves showing employment details for Nancy S. Jenkins.",
  "summary_one_paragraph": "This document consists of a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically concerning the postponement of Social Security numbers to protect personal privacy, along with payroll authorization forms, a resume, and a letter of recommendation for Nancy S. Jenkins, who worked for Congressman Thomas N. Downing and later for the Select Committee on Assassinations, detailing her employment history, skills, and character references.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Nancy S. Jenkins",
    "Thomas N. Downing",
    "Employment Records",
    "Personnel Records"
  ],
  "title": "HSCA Staff Payroll Records - Nancy S. Jenkins",
  "date": "1976-12-27",
  "locations_mentioned": [
    "Washington, D.C.",
    "Springfield, Virginia"
  ],
  "origin_agency": "HSCA (House Select Committee on Assassinations)",
  "persons_mentioned": [
    "Nancy S. Jenkins",
    "Thomas N. Downing",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Richard A. Sprague",
    "E.M. (Tiny) Hutton",
    "Norman L. Dobyns",
    "Ralph J. Maglione, Jr."
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board"
}