{
  "classification": "Administrative",
  "document_type": "Printed Form, Memorandum",
  "security": "The redaction and postponement of Social Security numbers are based on the potential for unwarranted invasion of personal privacy. The document states, \"The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and, that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "Unclassified",
  "summary": "This document is a collection of records related to the employment of Clarence J. Day at the House Select Committee on Assassinations (HSCA), including payroll authorizations, leave records, and internal memos regarding his hiring and salary. Social Security numbers are postponed from release due to privacy concerns.",
  "summary_one_paragraph": "This collection of documents pertains to Clarence J. Day's employment with the House Select Committee on Assassinations (HSCA) during 1977 and 1978. It includes a Final Determination Notification from the Assassination Records Review Board, payroll authorization forms detailing his appointment and salary, a personal leave record, and internal memoranda from HSCA staff (Tom Lambeth and Kenneth D. Klein) recommending his hiring as an investigator for the JFK Task Force. The documents also reference payroll certification requirements and relationships to members of Congress, with Social Security numbers redacted due to privacy concerns, which were postponed until 2017.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Clarence J. Day",
    "Administration",
    "Social Security Number",
    "Privacy",
    "JFK Assassination Records Collection Act"
  ],
  "title": "Staff Payroll Records related to Clarence J. Day",
  "date": "1977-06-27",
  "locations_mentioned": [
    "Washington, D.C."
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Clarence J. Day",
    "Louis Stokes",
    "Tom Lambeth",
    "Kenneth D. Klein",
    "Robert K. Tanenbaum"
  ],
  "recipient": "Clerk of the House of Representatives, All Staff",
  "sender": "HSCA Staff"
}