{
  "classification": "Cuba",
  "document_type": "Summary",
  "security": "The document details an interview with Charles Steele, Jr., regarding his association with Lee Harvey Oswald (LHO) and distribution of pro-Cuba leaflets. Revealing Steele’s testimony—specifically his admission of accepting money from LHO to distribute leaflets and his description of a second individual involved—could potentially impact ongoing or future investigations related to Oswald’s activities. Additionally, the document contains personal information about Steele, including his address, date of birth, and Social Security number, which should be protected.",
  "security_level": "Unclassified",
  "summary": "An HSCA interview summary with Charles Steele, Jr., who admits to passing out pro-Cuba leaflets with Lee Harvey Oswald after being offered $5.00, but refuses to answer further questions about his prior knowledge of Oswald.",
  "summary_one_paragraph": "On April 13, 1978, William Brown of the House Select Committee on Assassinations (HSCA) interviewed Charles Steele, Jr., in New Orleans, LA, regarding his association with Lee Harvey Oswald (LHO). Steele admitted he passed out pro-Cuba leaflets with LHO on Canal Street after being offered $5.00 to do so. After reading the leaflets, he stopped, collected his money, and left. Steele described another individual involved as a white male, age 20, with light brown hair, medium height and build, and brown eyes. He refused to answer questions about knowing LHO prior to this event or if he saw him again. Steele identified Clay Shaw and LHO in photographs and requested a copy of his Warren Commission testimony.",
  "tags": [
    "HSCA",
    "Charles Steele Jr.",
    "Lee Harvey Oswald",
    "Pro-Cuba Leaflets",
    "Canal Street",
    "Clay Shaw",
    "Warren Commission",
    "Political Activities",
    "Subversive Activities"
  ],
  "title": "INVESTIGATION INTERVIEW SCHEDULE",
  "date": "1978-04-13",
  "locations_mentioned": [
    "New Orleans, LA",
    "Canal Street"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Charles Steele, Jr.",
    "Lee Harvey Oswald",
    "Clay Shaw",
    "William Brown"
  ],
  "sender": "Charles Steele, Jr."
}