{
  "classification": "Administrative",
  "document_type": "Final Determination Notification/Printed Forms/Letters/Resume/Memorandum",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (initially restricted)",
  "summary": "This document is a collection of administrative records, including a Final Determination Notification from the Assassination Records Review Board regarding the postponement of information (Social Security numbers) within HSCA staff payroll records, along with associated payroll authorization forms, letters, and a resume related to Giulia M. Barrow's employment with the HSCA.",
  "summary_one_paragraph": "This collection of documents pertains to the administrative and payroll records of Giulia M. Barrow during her time with the House Select Committee on Assassinations (HSCA). It includes a Final Determination Notification explaining the postponement of Social Security numbers due to privacy concerns, several payroll authorization forms detailing Barrow's salary adjustments and termination, letters acknowledging her resignation from Louis Stokes and Alvin B. Lewis Jr., a staff memorandum regarding payroll certification, and Barrow's resume outlining her prior work experience on Capitol Hill and elsewhere. The documents collectively provide insight into the administrative processes and personnel management within the HSCA during the late 1970s.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Giulia M. Barrow",
    "Social Security Numbers",
    "Privacy",
    "Payroll Authorization",
    "Resignation",
    "Employment History",
    "Louis Stokes",
    "Alvin B. Lewis Jr."
  ],
  "title": "HSCA Staff Payroll Records Regarding Giulia M. Barrow",
  "date": "1977-01-01",
  "locations_mentioned": [
    "Washington, D.C.",
    "Houston, Texas"
  ],
  "origin_agency": "HSCA (House Select Committee on Assassinations)",
  "persons_mentioned": [
    "Giulia M. Barrow",
    "Louis Stokes",
    "Alvin B. Lewis Jr.",
    "Joan Thornell",
    "Richard A. Sprague",
    "Henry B. Gonzalez",
    "Thomas N. Downing",
    "Harry Anderson",
    "Richard F. Vander Veen",
    "Tom Quimby",
    "Bill Wilson",
    "John Moser",
    "Toby Madison"
  ],
  "recipient": "Clerk of the House of Representatives/All Staff Employees",
  "sender": "Various (Louis Stokes, Alvin B. Lewis Jr., Giulia Mainieri Barrow, Budget Officer, Edith, Rick)"
}