{
  "classification": "Personnel",
  "document_type": "Final Determination Notification & Payroll Authorization Form",
  "security": "The redaction of Social Security numbers (SSN) is to prevent an unwarranted invasion of personal privacy, where that invasion would be so substantial that it outweighs the public interest. Specifically, the document states, \"The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest\"",
  "security_level": "Unclassified",
  "summary": "This document from the Assassination Records Review Board details the postponed release of certain information, specifically Social Security numbers, from the HSCA staff payroll records. It includes a payroll authorization form for Ronald Adrine, noting his appointment as Staff Counsel with a salary of $27,000.00 per annum.",
  "summary_one_paragraph": "This Assassination Records Review Board notification concerns HSCA staff payroll records, specifically addressing the partial postponement of document release due to privacy concerns related to Social Security numbers. The document includes a payroll authorization form for Ronald Adrine's appointment as Staff Counsel within the Select Committee, effective June 5, 1978, at an annual salary of $27,000.00. It also contains a certificate of non-relationship to any current member of Congress, signed by Ronald Adrine on May 25, 1978.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Ronald Adrine",
    "Social Security Number",
    "Privacy",
    "Payroll Authorization"
  ],
  "title": "Final Determination Notification regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Ronald Adrine",
    "Thomas Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews",
    "Louis Stokes"
  ]
}