{
  "classification": "Cuba",
  "document_type": "File",
  "security": "These documents contain personal information about individuals and the sources and methods used to collect intelligence on anti-Castro activities.  Revealing this information could compromise intelligence operations and harm individuals.  For example, the document mentions that one individual was considered \"a man of no scruples, a homosexual & not to be trusted.\" and another was reported to be responsible for the imprisonment of someone. This information could lead to harm or discrimination against these individuals. Citing as an example, “JM. WAVE receiver 9. derogatory info on nobregas from reliable Sourcee Su August, Leslie nobregas, Captain....... of Susan Aun, sictructed to get rid of his brother, Jorge, due o many reports of his homosexual tendencies.”",
  "security_level": "SECRET",
  "summary": "This document contains files and memos on various individuals and groups involved in anti-Castro activities, including Orlando Bosch, Ricardo Morales, Joaquin Godoy, Jorge Nobregas, Dunney Perez Alamo, Francisco Rodriguez Tamayo, Juan Manuel Salvat Roque, Jose Ignacio Rasco, and Amador Odio. It includes information on their activities, relationships with the CIA and other organizations, and FBI investigations.",
  "summary_one_paragraph": "This document is a collection of files, memos, and reports related to various individuals and groups involved in anti-Castro activities during the 1960s and 1970s. It includes information on individuals such as Orlando Bosch, Ricardo Morales, Joaquin Godoy, Jorge Nobregas, Dunney Perez Alamo, Francisco Rodriguez Tamayo, Juan Manuel Salvat Roque, Jose Ignacio Rasco, and Amador Odio. The files contain details on their involvement with the CIA, their roles within anti-Castro organizations like the Democratic Revolutionary Front (FRD) and Directorio Revolucionario Estudiantil (DRE), and investigations conducted by the FBI. The documents also touch on alleged theft, internal conflicts within these groups, and operational approvals and cancellations by the CIA.",
  "tags": [
    "Anti-Castro",
    "CIA",
    "FBI",
    "Cuba",
    "FRD",
    "DRE",
    "Orlando Bosch",
    "Ricardo Morales",
    "Joaquin Godoy",
    "Jorge Nobregas",
    "Dunney Perez Alamo",
    "Francisco Rodriguez Tamayo",
    "Juan Manuel Salvat Roque",
    "Jose Ignacio Rasco",
    "Amador Odio"
  ],
  "title": "Files on Anti-Castro Activists",
  "date": "1978-08-07",
  "locations_mentioned": [
    "Miami",
    "Havana",
    "Cuba",
    "New Orleans",
    "Venezuela",
    "Paris",
    "France"
  ],
  "persons_mentioned": [
    "Orlando Bosch",
    "Ricardo Morales",
    "Joaquin Godoy",
    "Jorge Nobregas",
    "Dunney Perez Alamo",
    "Francisco Rodriguez Tamayo",
    "Juan Manuel Salvat Roque",
    "Jose Ignacio Rasco",
    "Amador Odio",
    "Fidel Castro",
    "Lee Harvey Oswald",
    "David Ferrie",
    "Guy Banister",
    "Carlos Prio Socarras"
  ],
  "recipient": "Chief, WHD; Chief of Base/JMWAVE; Offices in Charge, INS",
  "sender": "COB/SMWAVE; Deputy Director for Plans"
}