{
  "classification": "Personnel",
  "document_type": "Final Determination Notification & Payroll Authorization Forms & Memorandum",
  "security": "The redaction of Social Security numbers is justified because 'the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.' This reveals the agency's concern for protecting personal information.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document contains the Assassination Records Review Board's final determination to postpone in part the release of HSCA staff payroll records, specifically Social Security numbers, due to privacy concerns; it also includes payroll authorization forms and a memo related to Francis J. Kelly's employment with the Select Committee on Assassinations.",
  "summary_one_paragraph": "This document consists of a Final Determination Notification from the Assassination Records Review Board regarding the partial postponement of HSCA staff payroll records (specifically, the redaction of Social Security numbers to protect personal privacy), payroll authorization forms detailing Francis J. Kelly's employment and salary adjustments within the Select Committee on Assassinations during 1977, and a memorandum concerning payroll certification requirements for HSCA staff, including relationship disclosures to members of Congress. The Review Board based its decision on historical interest and absence of harm, and the documents provide insight into administrative processes and personnel management within the HSCA.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Francis J. Kelly",
    "Select Committee on Assassinations",
    "Personnel Records",
    "Assassination Records Review Board"
  ],
  "title": "Final Determination Notification: HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C.",
    "Annandale, VA"
  ],
  "origin_agency": "Assassination Records Review Board (regarding HSCA records)",
  "persons_mentioned": [
    "Francis J. Kelly",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas N. Downing",
    "Richard A. Sprague"
  ],
  "recipient": "All Staff Employees (for the memorandum)",
  "sender": "Budget Officer (for the memorandum)"
}