{
  "classification": "Personnel",
  "document_type": "Printed Form",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a collection of payroll authorization forms and related memoranda for Thomas Wayne Sacco, who served as a Research Attorney for the Martin Luther King Task Force/HSCA, detailing his appointment, salary, and termination.",
  "summary_one_paragraph": "This collection of documents pertains to the payroll administration of Thomas Wayne Sacco during his time with the House Select Committee on Assassinations (HSCA) Martin Luther King Task Force. It includes two payroll authorization forms detailing his appointment on March 27, 1978, with a gross annual salary of $18,000, and his termination on December 31, 1978. Additionally, it features a memorandum from I. Charles Mathews, Special Counsel, to budget officers advising them of Sacco's appointment and salary, along with a memorandum to all staff regarding payroll certification requirements related to familial relationships with Members of Congress. Social Security numbers are redacted throughout the document due to privacy concerns.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Thomas Wayne Sacco",
    "Payroll Authorization",
    "Martin Luther King Task Force",
    "Personnel Records",
    "Louis Stokes"
  ],
  "title": "Payroll Records for Thomas Wayne Sacco",
  "date": "1978-03-27",
  "persons_mentioned": [
    "Thomas Wayne Sacco",
    "Louis Stokes",
    "Thomas Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews"
  ],
  "recipient": "Clerk of the House of Representatives, Thomas Howarth, Elizabeth Berning, All Staff",
  "sender": "I. Charles Mathews, Special Counsel, Louis Stokes (Authorizing Official)"
}