{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Authorization Forms",
  "security": "This document contains Personally Identifiable Information (PII) in the form of Social Security numbers, which are redacted to prevent an unwarranted invasion of personal privacy. Releasing such information could lead to identity theft or other forms of personal harm. As stated in the document, 'The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.'",
  "security_level": "UNCLASSIFIED",
  "summary": "This document includes a Final Determination Notification from the Assassination Records Review Board regarding the postponement of certain information, specifically Social Security numbers, from HSCA staff payroll records, along with payroll authorization forms for Paul T. Golden. The Review Board postponed the release of Social Security numbers to prevent an unwarranted invasion of personal privacy.",
  "summary_one_paragraph": "The document consists of a Final Determination Notification from the Assassination Records Review Board, dated December 8, 1995, regarding HSCA staff payroll records (Record Number 180-10068-10359), and related payroll authorization forms. The Review Board decided to postpone the release of Social Security numbers (SSNs) contained within these records, citing the need to prevent an unwarranted invasion of personal privacy, and designated 'SSN' as substitute language. Included are payroll authorization forms for Paul T. Golden, hired as a Xerox/Messenger for the HSCA, detailing his appointment on August 7, 1978, at an annual salary of $11,500.00, and his termination effective December 31, 1978, all authorized by Louis Stokes, Chairman.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Personal Privacy",
    "Paul T. Golden",
    "Louis Stokes",
    "Payroll Authorization",
    "Personnel Records"
  ],
  "title": "Final Determination Notification and Payroll Records Regarding Paul T. Golden",
  "date": "1995-12-08",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Paul T. Golden",
    "Louis Stokes",
    "Thomas Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews"
  ]
}