{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Authorization Forms",
  "security": "The document contains an individual's Social Security number, the public disclosure of which could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (U)",
  "summary": "This document is a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically concerning the postponement of Social Security numbers. It also includes payroll authorization forms for Clifford A. Fenton, Jr., detailing his employment with the Select Committee on Assassinations.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, concerning HSCA staff payroll records. The document details the postponement of Social Security numbers due to privacy concerns, with a next review date set for 2017. Included are multiple payroll authorization forms for Clifford A. Fenton, Jr., documenting his employment history, salary adjustments, and position changes within the Select Committee on Assassinations from 1976 to 1978, signed by authorizing officials such as Thomas N. Downing, Henry B. Gonzalez, and Louis Stokes.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Clifford A. Fenton, Jr.",
    "Payroll Authorization",
    "Select Committee on Assassinations"
  ],
  "title": "Final Determination Notification and Payroll Records for Clifford A. Fenton, Jr.",
  "date": "1995-12-08",
  "persons_mentioned": [
    "Clifford A. Fenton, Jr.",
    "Louis Stokes",
    "Thomas N. Downing",
    "Henry B. Gonzalez",
    "Richard A. Sprague"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board and Authorizing Officials (Downing, Gonzalez, Stokes)"
}