{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Authorization Forms",
  "security": "The redaction of Social Security Numbers (SSNs) is for personal privacy and is cited as an unwarranted invasion of personal privacy. Releasing the SSNs could cause harm to the individual and is therefore redacted.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document contains the Assassination Records Review Board's final determination to postpone in part the release of HSCA staff payroll records, specifically redacting Social Security numbers to protect personal privacy. It includes payroll authorization forms for Phoebe Curtis Orr from 1976-1978, detailing her employment with the Select Committee on Assassinations and related salary information.",
  "summary_one_paragraph": "The document includes a Final Determination Notification from the Assassination Records Review Board regarding the postponement of releasing certain information from the HSCA staff payroll records, citing the need to protect Social Security numbers. It contains multiple payroll authorization forms related to Phoebe Curtis Orr's employment with the Select Committee on Assassinations from December 1976 through December 1978. These forms detail Orr’s various positions, salaries, and employing office assignments approved by authorizing officials like Thomas N. Downing, Henry B. Gonzalez, and Louis Stokes. A memorandum regarding payroll certification and employee relationships to members of Congress is also included.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Phoebe Curtis Orr",
    "Select Committee on Assassinations",
    "Payroll Authorization",
    "Personnel Records",
    "FOIA",
    "Privacy"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C."
  ],
  "origin_agency": "Assassination Records Review Board",
  "persons_mentioned": [
    "Phoebe Curtis Orr",
    "Louis Stokes",
    "Thomas N. Downing",
    "Henry B. Gonzalez",
    "Richard A. Sprague"
  ],
  "recipient": "All Staff Employees (HSCA)"
}