{
  "classification": "Personnel",
  "document_type": "Printed Form",
  "security": "The redaction of social security numbers is to protect personal privacy as \"the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "U",
  "summary": "This document is a collection of personnel and payroll records related to Rebecca Wheeler Martin, who served as Chief Clerk for the House Select Committee on Assassinations (HSCA); it includes payroll authorization forms, a personal leave record, and a summary of her employment history and qualifications.",
  "summary_one_paragraph": "This collection of documents pertains to Rebecca Wheeler Martin, who held the position of Chief Clerk for the U.S. House of Representatives Select Committee on Assassinations (HSCA). Included are payroll authorization forms detailing her salary adjustments from January to September 1977, signed by authorizing officials Louis Stokes and Henry B. Gonzalez, a personal leave record from 1977, and a summary of Martin's employment history and qualifications, listing her previous roles in various House committees and banks in Boise, Idaho, alongside her educational background; social security numbers are redacted to protect personal privacy, and the document was scheduled for review in 2017.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Rebecca Martin",
    "Personnel Records",
    "Payroll Authorization",
    "Leave Record",
    "Employment History"
  ],
  "title": "Staff Payroll Records",
  "date": "1976-11-08",
  "locations_mentioned": [
    "Washington, D.C.",
    "Alexandria, VA",
    "Boise, Idaho",
    "Hardtner, Kansas"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Rebecca Wheeler Martin",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Richard A. Sprague",
    "John Byron Martin",
    "Thomas N. Downing"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "HSCA"
}