{
  "classification": "Administrative",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest...",
  "security_level": "Unclassified (Initially Restricted)",
  "summary": "This document is a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records. It details the reasons for postponing the release of certain information, specifically Social Security numbers, due to privacy concerns.",
  "summary_one_paragraph": "This document encompasses a Final Determination Notification concerning House Select Committee on Assassinations (HSCA) staff payroll records, specifically addressing postponements of information release. The Review Board decided to postpone the release of Social Security numbers within the records, citing that public disclosure would constitute an unwarranted invasion of personal privacy outweighing public interest. Included in this document is correspondence regarding back pay for Terry W. Lazin, payroll authorization forms, and a memo regarding payroll certification and employee relationships with members of Congress, as well as a resume for Terry W. Lazin.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Privacy",
    "Social Security Numbers",
    "Terry W. Lazin",
    "Louis Stokes",
    "Payroll",
    "Back Pay",
    "HSCA Administration"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Terry W. Lazin",
    "Louis Stokes",
    "Bob Lehner",
    "Tom Howarth",
    "Henry B. Gonzalez",
    "Thomas R. Downing",
    "Richard A. Sprague",
    "Paul R. Anapol",
    "Marvin Wolfgang",
    "Leo Weinstein"
  ],
  "recipient": "All Staff Employees"
}