{
  "classification": "Personnel",
  "document_type": "Final Determination Notification/Printed Form/Memorandum",
  "security": "The document contains an employee's social security number. The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (U)",
  "summary": "This document includes a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, payroll authorization forms for William Brown, and internal memos related to his employment and payroll certification.",
  "summary_one_paragraph": "This collection of documents pertains to the employment of William Brown as a Staff Investigator for the House Select Committee on Assassinations (HSCA) in 1977-1978. It encompasses an Assassination Records Review Board notification detailing the postponement of Social Security numbers within the records, payroll authorization forms documenting Brown's appointment and salary, a recommendation memo for his hiring citing his experience in the New York City Police Department, and a memo regarding payroll certification requirements related to Congressional relationships.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "William Brown",
    "Payroll Authorization",
    "Personal Leave Record",
    "Social Security Number",
    "Privacy",
    "Louis Stokes",
    "G. Robert Blakey",
    "Cliff Fenton",
    "Kenneth D. Klein"
  ],
  "title": "Assassination Records Review Board Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1977-08-15",
  "locations_mentioned": [
    "Washington, D.C.",
    "New York City"
  ],
  "origin_agency": "HSCA (House Select Committee on Assassinations)",
  "persons_mentioned": [
    "William Brown",
    "Louis Stokes",
    "G. Robert Blakey",
    "Cliff Fenton",
    "Kenneth D. Klein"
  ],
  "recipient": "Professor G. Robert Blakey, All Staff"
}