{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Forms",
  "security": "The document contains personal information, specifically Social Security numbers, which are redacted because \"the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "Unclassified (originally)",
  "summary": "This document is a notification from the Assassination Records Review Board regarding the postponed release of certain information, specifically Social Security numbers, from HSCA staff payroll records, along with payroll authorization forms for Jacqueline Hess detailing her employment history with the Select Committee on Assassinations.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a final determination notification on December 8, 1995, regarding document 180-10060-10440 from the HSCA staff payroll records. The Board postponed the release of Social Security numbers due to privacy concerns, replacing them with \"SSN.\" The document includes payroll authorization forms for Jacqueline Hess, detailing her various positions, salary adjustments, and effective dates of employment with the Select Committee on Assassinations from January 1977 to December 1978. These forms are signed by authorizing officials such as Louis Stokes and Henry B. Gonzalez.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Jacqueline Hess",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Payroll Authorization",
    "Select Committee on Assassinations"
  ],
  "title": "Assassination Records Review Board Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Jacqueline Hess",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas Howarth",
    "G. Robert Blakey",
    "Akers",
    "Blackmer",
    "Gay",
    "McPherson",
    "Orr, Patricia",
    "Richard A. Sprague",
    "Thomas N. Downing"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board"
}