{
  "classification": "Assassination",
  "document_type": "Transcript",
  "security": "Disclosing Nosenko's testimony could reveal the HSCA's investigative methods and lines of questioning, potentially compromising future investigations. For example, repeated questioning about Oswald's defection indicates the HSCA’s suspicion of the KGB's involvement with Lee Harvey Oswald.",
  "security_level": "Top Secret",
  "summary": "This document is a transcript of Yuri Nosenko's testimony before the House Select Committee on Assassinations (HSCA) on June 20, 1978, regarding Lee Harvey Oswald's time in the Soviet Union and the KGB's alleged lack of interest in him.",
  "summary_one_paragraph": "This is a transcript of Yuri Nosenko's testimony before the HSCA, where he discusses Lee Harvey Oswald's defection to the Soviet Union in 1959. During the session, Nosenko maintains that the KGB found Oswald uninteresting and did not attempt to recruit him or gather information from him, even though Oswald had military experience and access to a U-2 airbase. Mr. Klein challenges Nosenko's claims by pointing out that, in 1959, very few Americans defected to the Soviet Union, and that the KGB was actively recruiting. During the testimony, documentary evidence is presented to Nosenko regarding Oswald's stay in the Soviet Union, including his hospitalization after a suicide attempt, but Nosenko remains consistent with his previous testimony.",
  "tags": [
    "HSCA",
    "Nosenko",
    "Yuri Nosenko",
    "Lee Harvey Oswald",
    "Oswald",
    "KGB",
    "Defection",
    "Soviet Union",
    "Testimony",
    "Interview",
    "Methodology",
    "Files",
    "Russian Period",
    "Mexico City"
  ],
  "title": "Testimony of Yuri Ivanovich Nosenko",
  "date": "1978-06-20",
  "locations_mentioned": [
    "Soviet Union",
    "Minsk",
    "Moscow",
    "Utah",
    "United States"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Yuri Ivanovich Nosenko",
    "Lee Harvey Oswald",
    "Louis Stokes",
    "Preyer",
    "Burke",
    "Fithian",
    "Devine",
    "Sawyer",
    "G. R. Blakey",
    "G. Cornwell",
    "M. Goldsmith",
    "R. Morrison",
    "E. Berning",
    "M. Jackson",
    "J. Smith",
    "K. Klein",
    "S. Brady",
    "Matveev",
    "Webster",
    "Epstein",
    "Priscilla Johnson McMillan",
    "Bruce Solie",
    "Marina Oswald"
  ],
  "recipient": "N/A",
  "sender": "Nosenko, Yuri"
}