{
  "classification": "Mexico",
  "document_type": "Summary",
  "security": "Information was gathered from taps on Cuban and Russian embassies. Sharing the fact that the CIA was monitoring embassies in Mexico city would be a security risk.",
  "security_level": "Unclassified",
  "summary": "This is a summary of an interview conducted by HSCA staff with Arnold Arehart, a former CIA technician in Mexico City, regarding his work monitoring and taping telephone conversations at a base outside the U.S. Embassy. Arehart provided details about the operation, including the monitoring of Cuban and Soviet lines, the handling of tapes and transcripts, and his contacts with Anne Goodpasture and Win Scott.",
  "summary_one_paragraph": "On June 2, 1978, HSCA staff interviewed Arnold Arehart, a former CIA technician, about his work in Mexico City starting in 1960. Arehart described working at a base outside the U.S. Embassy where he maintained equipment that monitored and taped 30 telephones as part of a CIA/Mexican liaison operation. He detailed the process of summarizing and transcribing conversations, particularly from Cuban and Soviet taps, and the routine delivery of these materials to Anne Goodpasture. Arehart mentioned the retention and reuse of tapes, his interactions with Win Scott, and a post-assassination request to check files for conversations by or about Lee Harvey Oswald, recalling a possible short conversation being located but lacking specifics.",
  "tags": [
    "HSCA",
    "CIA",
    "Mexico City",
    "Wiretapping",
    "Embassy Surveillance",
    "Cuban Taps",
    "Soviet Taps",
    "Anne Goodpasture",
    "Win Scott",
    "Arnold Arehart",
    "Lee Harvey Oswald",
    "Transcripts",
    "Tapes"
  ],
  "title": "Interview with Arnold Arehart Regarding Mexico City CIA Operations",
  "date": "1978-06-02",
  "locations_mentioned": [
    "Mexico City",
    "American Embassy, Mexico",
    "Cuba",
    "Soviet Union"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Lee Harvey Oswald",
    "Arnold Arehart",
    "Gary Cornwell",
    "Dan Hardway",
    "Edwin Lopez",
    "Harold Leap",
    "Phillip Agee",
    "Anne Goodpasture",
    "Win Scott",
    "Boris Tarasoff",
    "Rudy"
  ],
  "recipient": "HSCA Staff",
  "sender": "HSCA"
}