{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified",
  "summary": "This document includes an Assassination Records Review Board notification regarding the postponed release of Social Security numbers from HSCA staff payroll records, along with related payroll authorization forms and correspondence concerning Louis Parisi's employment with the Select Committee on Assassinations.",
  "summary_one_paragraph": "This collection of documents pertains to the employment and payroll details of Louis Parisi, a staff investigator for the House Select Committee on Assassinations (HSCA). It includes a Final Determination Notification from the Assassination Records Review Board, which postpones the release of Social Security numbers to protect personal privacy, and payroll authorization forms detailing Parisi's appointment, salary, and termination with the committee. Further correspondence clarifies that Parisi's salary and benefits were managed through a cooperative arrangement with the New Jersey State Police to safeguard his pension benefits, involving reimbursements and expense allowances.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Louis Parisi",
    "Social Security Numbers",
    "Personnel Records",
    "Assassination Records Review Board",
    "Select Committee on Assassinations",
    "Payroll Authorization"
  ],
  "title": "Final Determination Notification and Staff Payroll Records Regarding Louis Parisi",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C.",
    "New Jersey",
    "Trenton, N.J."
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Louis Parisi",
    "Louis Stokes",
    "Thomas Howarth",
    "Frank Thompson, Jr.",
    "G. Robert Blakey",
    "Edward M. Evans",
    "Raymond J. Brennan",
    "Ida Jane Ross"
  ],
  "recipient": "Major Raymond J. Brennan, Frank Thompson, Jr., Thomas Howarth, All Staff",
  "sender": "Assassination Records Review Board, Louis Stokes, G. Robert Blakey, Edward M. Evans"
}