{
  "classification": "Mexico",
  "document_type": "Letter",
  "security": "Because information referring to some of the people listed above may be of a sensitive or classified nature, this letter may require appropriate classification.",
  "security_level": "COMMITTEE SENSITIVE",
  "summary": "This letter from G. Robert Blakey to Scott Breckinridge at the CIA requests assistance in arranging interviews in Mexico with several individuals, including June Cobb Sharp, Henry P. Lopez, and others, for the House Select Committee on Assassinations (HSCA). The letter notes the sensitive nature of the information pertaining to these individuals and suggests appropriate classification.",
  "summary_one_paragraph": "Addressed to Scott Breckinridge at the CIA from G. Robert Blakey of the House Select Committee on Assassinations (HSCA), this letter dated July 19, 1978, follows up on a conversation between Chairman Stokes and Admiral Turner regarding interviews to be conducted in Mexico. Blakey requests CIA assistance in arranging interviews with individuals such as June Cobb Sharp (described as a Castro mistress), Henry P. Lopez, Gen. Jose Jesus Clark Flores, Manuel Calvillo, and others, providing their names and, in some cases, brief descriptions. Acknowledging that information related to these individuals could be sensitive, Blakey suggests the letter may require classification and offers to provide additional identifying data orally if needed.",
  "tags": [
    "HSCA",
    "CIA",
    "Interviews",
    "Mexico",
    "Assassinations",
    "June Cobb Sharp",
    "Henry P. Lopez",
    "Castro",
    "Committee Sensitive"
  ],
  "title": "Request for CIA Assistance with Interviews in Mexico",
  "date": "1978-07-19",
  "locations_mentioned": [
    "Mexico",
    "Washington, D.C."
  ],
  "origin_agency": "U.S. House of Representatives",
  "persons_mentioned": [
    "Scott Breckinridge",
    "G. Robert Blakey",
    "Chairman Stokes",
    "Admiral Turner",
    "June Cobb Sharp",
    "Henry P. Lopez",
    "Jose Jesus Clark Flores",
    "Manuel Calvillo",
    "Al Witrich",
    "Luis Alberu Suoto",
    "Consuelo Esperon",
    "Noe Palomares",
    "Ramon Joseph Alvarez Durant"
  ],
  "recipient": "Scott Breckinridge",
  "sender": "G. Robert Blakey"
}