{
  "classification": "Administrative",
  "document_type": "Report",
  "security": "This document lists the salaries and employment status of individuals working for the Select Committee on Assassinations. Releasing specific salary and termination details could potentially expose personal information about these individuals, which might be considered a breach of privacy. As stated in the document, it also certifies that employees have no relationship to a current member of Congress, which could be sensitive information.",
  "security_level": "Unclassified",
  "summary": "This is a U.S. House of Representatives report detailing the payroll for the Select Committee on Assassinations for the period of February 1-28, 1979, listing employees, their positions, salaries, and employment status.",
  "summary_one_paragraph": "The report, dated March 7, 1979, outlines the payroll for the House Select Committee on Assassinations, covering February 1-28, 1979. It includes a listing of employees, their Social Security numbers, job titles, annual gross salaries, and the amount earned during the specified period. Remarks indicate whether employees were terminated or actively employed during this time. The report also provides a payroll summary, categorizing expenditures and confirming that listed employees performed their assigned duties and had no prohibited relationships with members of Congress, as certified by G. Robert Blakey.",
  "tags": [
    "Select Committee on Assassinations",
    "Payroll",
    "Salaries",
    "Employment",
    "House of Representatives",
    "Administrative Report"
  ],
  "title": "Certification Report",
  "date": "1979-03-07",
  "origin_agency": "U.S. House of Representatives",
  "persons_mentioned": [
    "Ronald Adrine",
    "Elizabeth L Berning",
    "Richard N Billings",
    "G Robert Blakey",
    "Gary T Cornwell",
    "Jane Lind Downey",
    "Caryl M Eman El",
    "Michael Ewing",
    "Elizabeth C Feeley",
    "T Mark Flanagan",
    "Michael Goldsmith",
    "Louis H Hindle",
    "Thomas Howarth",
    "Kenneth D Klein",
    "Beth Anne Lichtenfels",
    "Robin D Lindley",
    "Dawne C Miller",
    "Anne B Misita",
    "Phoebe Curtis Orr",
    "Lance W Svendsen",
    "Helen Whitney Watriss",
    "Anne Paul Wilander",
    "James Lerer Wolf"
  ],
  "recipient": "House Administration Committee",
  "sender": "G. Robert Blakey"
}