{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "The document contains Sari Mordana's Social Security number, which is redacted.  The Review Board's decision was premised on several factors including: (a) the significant historical interest in the document in question; (b) the absence of evidence that the release of the information would cause harm to the United States or to any individual.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a notification from the Assassination Records Review Board regarding the postponed release of Sari Mordana's Social Security number from HSCA staff payroll records, citing privacy concerns, alongside payroll authorization forms, leave records, and correspondence related to her employment.",
  "summary_one_paragraph": "This document comprises a Final Determination Notification from the Assassination Records Review Board, which addresses the postponed release of Sari Mordana's Social Security number due to privacy concerns, in addition to payroll records from the HSCA; it includes payroll authorization forms, personal leave records, memoranda regarding her resignation, and correspondence concerning her job application with the HSCA, including a letter of recommendation from the ACLU and a recommendation from a Columbia Law School professor, documenting Mordana's employment history and qualifications.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Sari Mordana",
    "Social Security Number",
    "Personnel Records",
    "Assassination Records Review Board",
    "Employment History"
  ],
  "title": "HSCA Staff Payroll Records Regarding Sari Mordana",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C.",
    "New York, N.Y.",
    "Philadelphia, Pa.",
    "Vienna"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Sari Mordana",
    "Tom Howarth",
    "G. Robert Blakey",
    "Steve Fallis",
    "Claire Brown",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Richard A. Sprague",
    "Ziporah Mordana",
    "Debora Horowitz",
    "Ramsey Clark",
    "Melvin L. Wulf",
    "Edward J. Ennis"
  ],
  "recipient": "All Staff Employees"
}