{
  "classification": "Administrative",
  "document_type": "Final Determination Notification / Printed Form / Letter / Payroll Authorization Form / Resume",
  "security": "This document contains personal information, specifically Social Security numbers, the public disclosure of which could reasonably be expected to constitute an unwarranted invasion of personal privacy.",
  "security_level": "Unclassified",
  "summary": "This document contains the Assassination Records Review Board's final determination to postpone the release of Social Security numbers within HSCA staff payroll records, citing unwarranted invasion of personal privacy. It also includes Joseph Kiel's employment documentation and resume for his time with the Select Committee on Assassinations.",
  "summary_one_paragraph": "This document comprises the Assassination Records Review Board's decision to postpone the release of HSCA staff payroll records due to privacy concerns regarding Social Security numbers, substituting them with 'SSN'. Additionally, it features Joseph Kiel's correspondence requesting the withdrawal of retirement contributions from his time as an attorney with the Select Committee on Assassinations in 1976, along with payroll authorization forms detailing his appointment and termination, and his resume outlining his education, professional qualifications, and experience as an attorney, including his work with the Department of Justice and the Board of Education for Baltimore County.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Joseph Kiel",
    "Social Security Numbers",
    "Privacy",
    "Employment",
    "Resume",
    "Retirement Contributions"
  ],
  "title": "HSCA Staff Payroll Records Regarding Joseph Kiel",
  "date": "1995-12-08",
  "persons_mentioned": [
    "Joseph Kiel",
    "Richard Sprague",
    "Robert Ozer",
    "Thomas N. Downing"
  ],
  "recipient": "Select Committee on Assassinations",
  "sender": "Joseph Kiel, Chartered"
}