{
  "classification": "Administrative",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified",
  "summary": "This document consists of a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically addressing postponements related to Social Security numbers, along with payroll authorization forms for Jane E. Godfrey and a memo regarding payroll certification.",
  "summary_one_paragraph": "This document includes a Final Determination Notification from the Assassination Records Review Board concerning HSCA staff payroll records, noting that postponements are due to the presence of Social Security numbers which are redacted to protect personal privacy. It also contains multiple payroll authorization forms for Jane E. Godfrey from 1976 to 1978, detailing her employment with the Select Committee on Assassinations, her positions, salary adjustments, and authorizing signatures from Louis Stokes, Henry B. Gonzalez, and Thomas N. Downing. Additionally, there's a memorandum from the Budget Officer to all staff employees regarding payroll certification requirements, including the reporting of familial relationships to members of Congress.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Jane E. Godfrey",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas N. Downing",
    "Payroll Certification",
    "Budget Officer"
  ],
  "title": "Assassination Records Review Board Final Determination Notification and HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "persons_mentioned": [
    "Jane E. Godfrey",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas N. Downing",
    "Richard A. Sprague"
  ],
  "recipient": "All Staff Employees",
  "sender": "Budget Officer"
}