{
  "classification": "Administrative",
  "document_type": "Final Determination Notification/Payroll Authorization Form/Memorandum",
  "security": "The redaction of Social Security numbers is justified to prevent unwarranted invasion of personal privacy, as public disclosure could lead to identity theft or other misuse of personal information. The Board's action is premised on the absence of evidence that the release of the information would cause harm to the United States or to any individual, but the release of SSNs is still considered a privacy risk.",
  "security_level": "Unclassified",
  "summary": "This document includes a Final Determination Notification from the Assassination Records Review Board regarding the postponement of Social Security numbers within HSCA payroll records, along with payroll authorization forms and a memo related to James McDonald's employment. The Review Board postponed the release of Social Security numbers to protect personal privacy, with a next review date set for 2017.",
  "summary_one_paragraph": "The document contains a Final Determination Notification from the Assassination Records Review Board, dated December 8, 1995, concerning HSCA's payroll record, specifically Social Security numbers, which were postponed due to privacy concerns. It includes payroll authorization forms and a memorandum detailing the employment of James McDonald, including his appointment, salary adjustments, and position as Senior Staff Counsel with the John F. Kennedy Task Force. The documents reflect actions taken within the HSCA related to personnel administration and payroll management, reviewed under the John F. Kennedy Assassination Records Collection Act of 1992, with redactions noted as 'SSN' substitute language.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Payroll Records",
    "Social Security Numbers",
    "James McDonald",
    "Personnel",
    "Privacy",
    "Redaction",
    "FOIA"
  ],
  "title": "Final Determination Notification Regarding HSCA Payroll Records and James McDonald's Employment",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C."
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "James McDonald",
    "Louis Stokes",
    "Tom Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews"
  ],
  "recipient": "Clerk of the House of Representatives, Tom Howarth, Elizabeth Berning",
  "sender": "I. Charles Mathews, Louis Stokes"
}