{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Forms",
  "security": "The document redacts Rebecca A. Rife's Social Security Number, citing that “the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.”",
  "security_level": "UNCLASSIFIED",
  "summary": "This document contains the Assassination Records Review Board's final determination to postpone in part the release of HSCA staff payroll records, specifically redacting Social Security numbers to protect personal privacy. It also includes Rebecca A. Rife's employment information, payroll authorizations, and work history with the HSCA.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a final determination in December 1995 regarding HSCA staff payroll records, deciding to postpone the release of Social Security numbers within the document series 180-10070-10144 to protect personal privacy. The document, reviewed on October 24, 1995, includes a notification form and supporting documentation such as payroll authorization forms and employment information for Rebecca A. Rife, detailing her positions and salary adjustments within the Select Committee on Assassinations. Rife’s employment history, skills, and educational background, as well as certifications regarding relationships with members of Congress, are also contained within the document, compiled from March 6, 1978.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Social Security Number",
    "Privacy",
    "Rebecca A. Rife",
    "Employment Information",
    "Assassination Records Review Board",
    "Louis Stokes"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C.",
    "Alexandria, VA",
    "Waynesboro, Pennsylvania",
    "Pittsburgh, Pennsylvania",
    "Harrisburg, Pennsylvania"
  ],
  "origin_agency": "HSCA (House Select Committee on Assassinations)",
  "persons_mentioned": [
    "Rebecca A. Rife",
    "Louis Stokes",
    "Thomas Howarth",
    "I. Charles Mathews"
  ],
  "recipient": "Thomas Howarth, Budget Officer"
}