{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Authorization Forms",
  "security": "The document contains personally identifiable information (PII) in the form of Social Security numbers, which are redacted according to the Review Board's decision. \"The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This document consists of a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically concerning Eileen G. Dinneen, along with supporting payroll authorization forms. Social Security numbers within the document are postponed from release to protect personal privacy.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, regarding the release status of House Select Committee on Assassinations (HSCA) staff payroll records (Record Number 180-10068-10334), determining that the Social Security numbers contained therein would be postponed to protect personal privacy, with the substitute language 'SSN' to be used in their place. The notification accompanies a series of payroll authorization forms and memoranda detailing the employment history and salary adjustments of Eileen G. Dinneen (later Copeland) within the HSCA from May 1977 through December 1978, reflecting changes in her position, salary, and name due to maternity leave and subsequent return to work at varying percentages of full-time status, approved by Chairman Louis Stokes.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Eileen Dinneen",
    "Eileen Copeland",
    "Social Security Numbers",
    "Privacy",
    "Louis Stokes",
    "Payroll Authorization Forms",
    "Review Board Determination",
    "JFK Assassination Records Collection Act"
  ],
  "title": "HSCA Staff Payroll Records: Eileen G. Dinneen/Copeland - Payroll Authorizations and Review Board Determination",
  "date": "1995-12-08",
  "persons_mentioned": [
    "Eileen G. Dinneen",
    "Eileen Copeland",
    "Louis Stokes",
    "Frank Thompson, Jr.",
    "Tom Howarth",
    "Donovan L. Gay",
    "Tom Lambeth",
    "Robert K. Tanenbaum",
    "Ken Klein",
    "Cliff Fenton"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Louis Stokes (Chairman, Select Committee on Assassinations)"
}