{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "The document contains Social Security numbers, which are redacted to prevent an unwarranted invasion of personal privacy. As stated in the document: \"The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "Unclassified",
  "summary": "This document is a notification from the Assassination Records Review Board regarding the postponement of certain information, specifically Social Security numbers, within HSCA staff payroll records. The postponement is based on privacy concerns, and the document includes payroll authorization forms and related memoranda.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, regarding document 180-10068-10336 from the HSCA staff payroll records. This document outlines the decision to postpone the release of Social Security numbers due to privacy concerns, deeming their disclosure an unwarranted invasion of personal privacy that outweighs public interest. The document includes payroll authorization forms for Jane L. Downey, working under Rep. Harold S. Sawyer and later for the Assassinations Committee under Louis Stokes, detailing her appointments, salary adjustments, and position titles from 1977 to 1979, along with memoranda related to her employment with the John F. Kennedy Task Force.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Jane L. Downey",
    "Payroll Authorization",
    "Harold S. Sawyer",
    "Louis Stokes"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C."
  ],
  "origin_agency": "Assassination Records Review Board",
  "persons_mentioned": [
    "Jane L. Downey",
    "Harold S. Sawyer",
    "Louis Stokes",
    "Thomas Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews"
  ],
  "recipient": "All Staff",
  "sender": "Assassination Records Review Board"
}