{
  "classification": "Personnel",
  "document_type": "Questionnaire",
  "security": "The release of Robert Scheer's refusal to answer questions on the Armed Forces Security Questionnaire and the Statement of Personal History does not appear to directly compromise national security. Scheer's decision to invoke his Fifth Amendment rights and his refusal to answer certain questions related to organizational affiliations and loyalty are already documented. The details of his limited employment history and foreign travel are unlikely to reveal sensitive information. However, if Scheer had provided detailed answers, those answers could potentially reveal sensitive associations. Quote directly from the document: 'I refuse to answer these questions because they violate my rights granted to me under the First, Fifth, and Fourteenth Amendments to the US Constitution.'",
  "security_level": "UNCLASSIFIED",
  "summary": "This document includes Robert Scheer's refusal to complete an Armed Forces Security Questionnaire and a Statement of Personal History, citing constitutional rights, along with his limited personal and employment details.",
  "summary_one_paragraph": "This document comprises an Armed Forces Security Questionnaire (DD Form 98) and Statement of Personal History (DD Form 2174) involving Robert Scheer, born in 1936. Scheer refused to complete significant portions of both forms, citing violations of his rights under the First, Fifth, and Fourteenth Amendments to the U.S. Constitution. The provided details include Scheer's birth information, limited employment history, educational background, and foreign travel, notably to Cuba, Vietnam, and the Soviet Union. The document also contains certifications noting Scheer's refusal, signed by 1/LT Myron K. Hayashida.",
  "tags": [
    "Robert Scheer",
    "Armed Forces Security Questionnaire",
    "Statement of Personal History",
    "Fifth Amendment",
    "First Amendment",
    "Fourteenth Amendment",
    "Military Service",
    "Refusal to Answer",
    "Vietnam",
    "Cuba",
    "Soviet Union"
  ],
  "title": "Statement of Personal History",
  "date": "1966-10-05",
  "locations_mentioned": [
    "Bronx, New York",
    "Berkeley, California",
    "San Francisco, California",
    "Oakland, California",
    "Cuba",
    "England",
    "France",
    "Poland",
    "Hungary",
    "Soviet Union",
    "Czechoslovakia",
    "Vietnam",
    "Combodia",
    "Indonesia",
    "Thailand",
    "Japan"
  ],
  "origin_agency": "INSCOM/CSF",
  "persons_mentioned": [
    "Robert Scheer",
    "Myron K. Hayashida",
    "Fred Scheer",
    "Ida Kuren",
    "Anne Weills",
    "Robert Avakian",
    "David Weion",
    "Sol Stern",
    "Robert Truehaft",
    "Malcolm Bernstein",
    "L. Ferlinghetti",
    "W. Hinckle"
  ],
  "recipient": "USA",
  "sender": "USA"
}