{
  "classification": "Personnel",
  "document_type": "Agent Report",
  "security": "Disclosing personal details such as SSAN, DOB, addresses, and employment history could violate privacy and potentially expose individuals to harm. Additionally, revealing military information like security clearance status and foreign travel history could be exploited. For instance, the document states: 'SSAN: 550-66-6254', 'Present Address: Cheruskerstr 49, Duesseldorf, W. Germany', and 'Background investigation requested by the ACofS, G2, Fort Gordon, Georgia, on 4 October 1965, UP AR 614-280 for retention of Simons in Military Service'.",
  "security_level": "UNCLASSIFIED",
  "summary": "Agent report detailing a field file check on Peter Karl Simons, a Specialist 4 in the US Army, including personal information, military service history, and potential desertion concerns.",
  "summary_one_paragraph": "This agent report, dated October 5, 1967, summarizes the findings of a field 201 file check on Peter Karl Simons, a Specialist 4 in the US Army. The report includes Simons' personal details such as his date and place of birth (Cottbus, Germany, May 5, 1943), citizenship status, family information including addresses in Germany and England, physical description, civilian education and employment history, aptitude test scores, military education, and service record. It also notes a request for a background investigation and lists Simons' foreign travel history and a buddy assignment plan with Michael C. Morgan, highlighting a possible sensitive desertion case.",
  "tags": [
    "Agent Report",
    "Desertion",
    "Personnel File",
    "Peter Karl Simons",
    "Military Intelligence",
    "INSCOM",
    "Field 201 File"
  ],
  "title": "AGENT REPORT",
  "date": "1967-10-05",
  "locations_mentioned": [
    "Cottbus, Germany",
    "Saarland, Germany",
    "Essen, Germany",
    "Duesseldorf, W. Germany",
    "Weston-Super-Mare, Somerset, England",
    "Dierdorf, W. Germany",
    "Los Angeles, California",
    "Culver City, California",
    "New York, New York",
    "Great Britain",
    "Italy",
    "France",
    "Denmark",
    "Austria",
    "Belgium",
    "Switzerland",
    "Mexico",
    "Holland",
    "Luxemburg",
    "Spain",
    "USAREUR Germany",
    "FT POLK LA",
    "Ft Gordon, GA",
    "Ft Hood, Tex",
    "Frankfurt-lain, Germany"
  ],
  "origin_agency": "INSCOM/CSF",
  "persons_mentioned": [
    "Vladimir Slovoda",
    "Peter Karl Simons",
    "Karl-Heinz Simons",
    "Agnes Fries",
    "Richard Westlake",
    "Mr. Grosskopf",
    "Mr. Rautenberg",
    "Mr. Kilmer",
    "Mr. Caranea",
    "William F. Mockler",
    "Michael C. Morgan"
  ],
  "sender": "[RESTRICTED]"
}