{
  "classification": "Personnel",
  "document_type": "Disposition Form",
  "security": "Recommending Robert Scheer be rejected for service due to membership and leadership in radical leftist groups, some of which are associated with or supported by communist parties. Citing: \"Following credible derogatory information is furnished as a basis for this recommendation... SUBJECT was an active member and leader of the Vietnam Day Committee (VDC).\" Exposing these reasons could reveal intelligence collection methods and sources regarding political affiliations and activities, and lead to claims of political persecution.",
  "security_level": "UNCLASSIFIED",
  "summary": "A recommendation to reject Robert Scheer for service due to his involvement with various leftist organizations, including the Vietnam Day Committee, Communist Party, Socialist Workers Party, and others.",
  "summary_one_paragraph": "This document, dated May 23, 1967, is a recommendation from Dmitri J. Tadich to TJAG, advising against Robert Scheer's acceptance into service based on his affiliation with and leadership roles in several leftist groups. These include the Vietnam Day Committee (VDC), which was infiltrated by Communists and Marxists, and groups supported by the Communist Party, Socialist Workers Party, and Progressive Labor Party. The recommendation is based on Scheer's association with the United Committee Against the War and his prior involvement as an instructor at the San Francisco New School, which criticized existing policies and structures. Scheer's refusal to complete required security questionnaires is also cited as a contributing factor.",
  "tags": [
    "Robert Scheer",
    "Vietnam Day Committee",
    "Communist Party",
    "Socialist Workers Party",
    "Progressive Labor Party",
    "W.E.B. DuBois Clubs of America",
    "Personnel Security",
    "USAPSG",
    "AR 604-10"
  ],
  "title": "[ RESTRICTED ]",
  "date": "1967-05-23",
  "persons_mentioned": [
    "Robert Scheer",
    "Dmitri J. Tadich",
    "M.C. Sneeringer"
  ],
  "recipient": "TJAG",
  "sender": "ACSI (Assistant Chief of Staff for Intelligence)"
}