{
  "classification": "Personnel",
  "document_type": "Exhibit, Sworn Statement",
  "security": "Disclosing Trinkala's statement and the Army's investigation could reveal the scope and methods of internal security procedures. Exposing details about Richard Nagell’s involvement could compromise ongoing or future investigations related to national security.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a sworn statement from Victor Lee Trinkala, taken on February 19, 1970, by the 108th MI Group regarding his discharge from the Army and his connections to Richard Nagell. Trinkala discusses his conscientious objector status, his discharge circumstances, and his limited contact with Nagell who he believes helped him get discharged.",
  "summary_one_paragraph": "In a sworn statement taken on February 19, 1970, by the 108th MI Group, Victor Lee Trinkala detailed the circumstances surrounding his discharge from the Army and his connections to Richard Nagell. Trinkala, who identifies as a conscientious objector, explains that he was discharged on December 3, 1969, after only five months of service, and that a friend of a friend, Richard Nagell, may have assisted in securing his discharge. The interview covers Trinkala's attitudes toward military service, his contacts with dissident groups (which he denies), and his allegiance to the United States, concluding with his affirmation that he would defend the country against invasion but opposes fighting in Viet Nam due to his moral objections.",
  "tags": [
    "Richard Nagell",
    "Victor Lee Trinkala",
    "Conscientious Objector",
    "Army Discharge",
    "108th MI Group",
    "INSCOM",
    "Sworn Statement",
    "JFK Assassination Records Collection Act"
  ],
  "title": "Exhibit: Victor Lee Trinkala Sworn Statement",
  "date": "1970-02-25",
  "origin_agency": "INSCOM/CSF, 108th MI Group",
  "persons_mentioned": [
    "Richard C. Nagell",
    "Victor L. Trinkala",
    "Tony Muneer",
    "Timothy T. McPherson"
  ],
  "recipient": "N/A",
  "sender": "108th MI Group"
}