{
  "classification": "JFK Assassination",
  "document_type": "Report",
  "security": "This document details FBI surveillance and intelligence gathering on individuals and groups associated with the Vietnam Day Committee, including their political affiliations (Communist Party, Socialist Workers Party) and activities (anti-war leaflet distribution, demonstrations). Releasing this information could expose sources (SF T-1, SF T-2, etc.) and methods used by the FBI to monitor and infiltrate these groups, potentially compromising ongoing or future investigations and violating privacy.",
  "security_level": "UNCLASSIFIED",
  "summary": "This FBI report details the activities of the Vietnam Day Committee (VDC) and associated individuals, focusing on their involvement in distributing anti-war leaflets and their connections to various political organizations.",
  "summary_one_paragraph": "This FBI report, dated May 24, 1966, from the San Francisco office, outlines an investigation into the Vietnam Day Committee (VDC) and its activities, particularly the distribution of anti-war leaflets aimed at military personnel. The report identifies VDC members and their affiliations with organizations such as the Bay Area Progressive Labor Party, Youth For Jobs, and the Communist Party, along with details of their involvement in demonstrations and prior arrests. It includes information from various sources (SF T-1 through SF T-17) regarding meetings, discussions, and the planned distribution of leaflets at military installations and bus stations, as well as background information on key individuals like Jerry Rubin, Stephen Smale, and Windy Smith.",
  "tags": [
    "FBI",
    "Vietnam Day Committee",
    "Anti-War Movement",
    "Sedition",
    "Surveillance",
    "Communist Party",
    "Student Activism"
  ],
  "title": "[RESTRICTED]",
  "date": "1966-05-24",
  "locations_mentioned": [
    "San Francisco, California",
    "Berkeley, California",
    "Oakland, California",
    "Vietnam",
    "Cuba",
    "Fort Ord, California",
    "Point Mugu, California",
    "Monterey, California",
    "University of California, Berkeley",
    "Tampa University",
    "University of Michigan"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Robert Scheer",
    "Richard Clayton Ivey",
    "Steve Cherkoss",
    "David Friedman",
    "Fred Gibson",
    "Howard Harawitz",
    "Morris Hirsch",
    "Larry Loughlin",
    "Lawrence Robert Loughlin",
    "Marilyn Milligan",
    "Joanne Peyton",
    "Joanne Barker Ward",
    "Janet Pugh",
    "Jerry Rubin",
    "Valerie Silva",
    "Stephen Smale",
    "Windy Smith",
    "John Windrim Smith, Jr.",
    "Louise Stapleton",
    "Sydney Stapleton",
    "Jack Weinberg",
    "Steve Weissman",
    "Stephen Mark Weissman",
    "Jack Kurzweil",
    "Bob Kaufman",
    "Conn \"Ringo\" Hallinan",
    "Mike O'Hanlon"
  ],
  "recipient": "[RESTRICTED]",
  "sender": "Frank S. Perrone"
}