{
  "classification": "Personnel",
  "document_type": "Identification Form, Statement of Personal History",
  "security": "The document contains personal information about David Reed Fromer, including his address, date and place of birth, physical characteristics, education history, family members, employment history, and references. Releasing these details could violate Fromer's privacy and potentially expose him and his family to risk. Additionally, Fromer's statement about being a conscientious objector and his refusal to sign certain sections of the form due to legal advice could be considered sensitive information.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a statement of personal history for David Reed Fromer, completed in November 1966, including his biographical information, education, family details, employment history, and his status as a conscientious objector. He declined to answer questions regarding organizational memberships due to legal advice.",
  "summary_one_paragraph": "In November 1966, David Reed Fromer filled out a statement of personal history, providing details about his life, including his birth in Chicago in 1942, education from elementary school to university studies in California and Wisconsin, and employment history. The document also reveals that Fromer is a conscientious objector with a case pending in the courts and that he, on advice of counsel, refused to answer questions about membership in organizations. The form, witnessed by 1/LT Myron K. Hayashida, captures Fromer's background details.",
  "tags": [
    "David Reed Fromer",
    "Personal History",
    "Conscientious Objector",
    "INSCOM",
    "CSF",
    "Legal Advice",
    "Military Training Act"
  ],
  "title": "[RESTRICTED] Statement of Personal History",
  "date": "1966-11-26",
  "origin_agency": "INSCOM/CSF",
  "persons_mentioned": [
    "David Reed Fromer",
    "Myron K. Hayashida",
    "Irving Fromer",
    "Katherine Rhodes",
    "Jon Fromer",
    "Ann Spake",
    "Peter Franck",
    "Vincent Hallinan",
    "Malvina Reynolds",
    "Stephan Negoesco",
    "Madi Bacon",
    "Richard Correll",
    "Archie Brown"
  ],
  "recipient": "Unknown",
  "sender": "Myron K. Hayashida (USA)"
}