{
  "classification": "Cuba",
  "document_type": "Paper, Textual Document",
  "security": "The document details efforts to control travel to and from Cuba, movement of Cuban propaganda, and clandestine movement of guerrillas and arms. Sharing these details could compromise ongoing operations and reveal intelligence sources and methods. For example, it mentions 'CIA Stations throughout Latin America continued...to furnish to the local internal security organizations...information concerning travelers to and from Cuba,' which exposes a direct collaboration between the CIA and local security organizations.",
  "security_level": "Secret",
  "summary": "This document outlines the U.S. government's efforts, led by the CIA and Department of State, to control travel to and from Cuba, curb Cuban propaganda, and prevent the clandestine movement of guerrillas and arms in Latin America.",
  "summary_one_paragraph": "This document, created by the Army, likely in 1963, details U.S. government actions, primarily through the CIA and Department of State, aimed at isolating Cuba and countering its influence in Latin America. These actions included monitoring and restricting travel to Cuba, suppressing Cuban propaganda, surveilling potential guerrilla movements and arms shipments, and strengthening counter-insurgency capabilities in Latin American countries. Activities encompassed intelligence sharing with local security organizations, diplomatic pressure on various nations to limit Cuban access, and military support for regional surveillance and internal security efforts, with a notable focus on preventing Cuban subversion.",
  "tags": [
    "Control of Travel",
    "Cuban Propaganda",
    "Guerrilla Movement",
    "Arms Control",
    "Intelligence Exchange",
    "Cuban Subversion",
    "Counter-Insurgency",
    "CIA",
    "Department of State",
    "Latin America"
  ],
  "title": "CONTROL OF TRAVEL TO AND FROM CUBA",
  "date": "0000-00-00",
  "locations_mentioned": [
    "Cuba",
    "Brazil",
    "Argentina",
    "Havana",
    "Bolivia",
    "Chile",
    "Santiago",
    "Costa Rica",
    "Mexico City",
    "Vera Crus",
    "Conakry",
    "Guinea",
    "Moscow",
    "Rio de Janeiro",
    "Cayman Islands",
    "Curacao",
    "The Hague",
    "Montreal",
    "Georgetown",
    "British Guiana",
    "Mexico",
    "Canada",
    "Jamaica",
    "Netherlands",
    "New York",
    "Port of Spain",
    "Barbados",
    "Trinidad",
    "Ireland",
    "Ottawa",
    "La Paz",
    "Nicaragua",
    "Tegucigalpa",
    "Honduras",
    "Colombia",
    "Ecuador",
    "Panama Canal Zone",
    "Peru",
    "El Salvador"
  ],
  "origin_agency": "ARMY",
  "persons_mentioned": [
    "Castro",
    "Richard Phillips",
    "Mr. Adon Watson",
    "Lavalle"
  ]
}