{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "This report details actions taken to combat Castro-Communist subversion, including intelligence gathering, travel control, and propaganda control. Revealing these specific operations, such as monitoring Cuban flights, influencing foreign governments to restrict travel to Cuba, and disseminating counter-propaganda, could compromise ongoing efforts and expose intelligence sources and methods. For example, the report states: 'Developed highly useful information on frequency of Cuban \"chartered\" flights to Brazil, names and nationalities of passengers and crew...Transmitted this information to station chiefs in the Latin American countries...' and 'Instructed Embassy Conakry to try to persuade Guinean authorities to deny use of airport facilities by flights on Habana-Moscoŭ route.' Such disclosures could hinder future intelligence gathering and diplomatic efforts.",
  "security_level": "Secret",
  "summary": "This document is a draft report from September 1963 detailing actions taken by the U.S. government, including the CIA, Department of Defense, Department of State, and USIA, to combat Castro-Communist subversion in Latin America, covering activities such as controlling travel to and from Cuba, controlling propaganda, and strengthening counter-insurgency capabilities.",
  "summary_one_paragraph": "This is a draft report from the Chairman of the Subcommittee on Cuban Subversion to its members, dated September 30, 1963, outlining actions taken during July and August to counteract Castro-Communist subversion in the Western Hemisphere. The report summarizes efforts by various U.S. agencies, including the CIA, Department of Defense, Department of State, and USIA, to control travel to and from Cuba, manage Cuban propaganda, control guerrilla and arms movement, transfer funds, strengthen counter-insurgency capabilities, exchange intelligence, and monitor Cuban diplomatic and commercial missions. The report details specific actions, such as influencing foreign governments to restrict travel, surveilling suspicious vessels, and disseminating counter-propaganda, with an intelligence annex providing further details on these activities.",
  "tags": [
    "Cuban Subversion",
    "Castro",
    "Communism",
    "CIA",
    "Department of Defense",
    "Department of State",
    "USIA",
    "Counter-Insurgency",
    "Propaganda Control",
    "Travel Control",
    "Latin America",
    "JFK Assassination Records Act"
  ],
  "title": "Report for July-August on Actions Taken to Combat Castro-Communist Subversion",
  "date": "1963-09-30",
  "locations_mentioned": [
    "Cuba",
    "Brazil",
    "Argentina",
    "Bolivia",
    "Chile",
    "Costa Rica",
    "Mexico",
    "Guatemala",
    "Honduras",
    "Nicaragua",
    "El Salvador",
    "Colombia",
    "Venezuela",
    "Peru",
    "Ecuador",
    "British Guiana",
    "Cayman Islands",
    "Curacao",
    "Hague",
    "Canada",
    "Jamaica",
    "Netherlands",
    "Trinidad",
    "Barbados",
    "Soviet Union"
  ],
  "origin_agency": "ARMY",
  "persons_mentioned": [
    "Fidel Castro",
    "Che Guevara",
    "Raul Roa Kouri",
    "Francisco Julieo",
    "Hector Villalon",
    "John William Cooke",
    "Cheddi Jagan",
    "Mohammed Kassim",
    "Richard Phillips",
    "Aden Watson",
    "Fidel Castro",
    "Camilo Cienfuegos",
    "Mao Tse-tung"
  ],
  "recipient": "Member of the Subcommittee",
  "sender": "CHMN, SUBCMMT on CUBAN SUBVERSION"
}