{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "The report details specific actions taken by U.S. agencies to counter Cuban subversion in Latin America, including covert operations, intelligence gathering, and propaganda efforts. Disclosing these activities could compromise ongoing operations, reveal intelligence sources and methods, and damage relationships with foreign governments. Specific examples include: 'Through unilateral penetrations of the Cuban Embassy in Mexico City, the CIA station continues to acquire information on types of Cuban visas granted to travellers' and 'The station has made arrangements with local service to pigeonhole or 'lose' applications for good conduct certificates which are needed to secure passports.'",
  "security_level": "SECRET",
  "summary": "This document is a progress report on actions taken during April-June to counter Cuban subversion in Latin America, detailing activities by the Department of State, Department of Defense, CIA, and U.S. Information Agency.",
  "summary_one_paragraph": "This secret report, dated July 18, 1963, summarizes the progress made between April and June in curbing Cuban subversion in Latin America. It outlines the coordinated efforts of the Department of State in diplomatic and public awareness initiatives, the Department of Defense in military surveillance and training programs, the CIA in intelligence gathering and covert operations, and the U.S. Information Agency in disseminating anti-Cuban propaganda. The report details specific actions taken by each agency, including monitoring travel to and from Cuba, supporting local security services, and influencing public opinion.",
  "tags": [
    "Cuban Subversion",
    "Latin America",
    "CIA",
    "Department of State",
    "Department of Defense",
    "USIA",
    "Covert Operations",
    "Propaganda",
    "Travel Control",
    "Intelligence Gathering",
    "ICCCA",
    "Califano Papers",
    "FOIA"
  ],
  "title": "ICCCA: Report on Status of Implementation of Actions Designed to Counter Subversion",
  "date": "1963-07-18",
  "locations_mentioned": [
    "Latin America",
    "Cuba",
    "Managua",
    "Isthmian countries",
    "Central America",
    "Gran Cayman",
    "Costa Rica",
    "Mexico",
    "Brazil",
    "Santiago, Chile",
    "Tegucigalpa",
    "Honduras",
    "Benelux",
    "Italy",
    "Caribbean",
    "Argentina",
    "Bolivia",
    "Rio de Janeiro",
    "Chile",
    "Colombia",
    "Bogota",
    "Ecuador",
    "Guayaquil",
    "El Salvador",
    "Guatemala",
    "Jamaica",
    "Haiti",
    "Mexico City",
    "Panama",
    "Nicaragua",
    "Peru",
    "Puerto Maldonado",
    "Lima",
    "Uruguay",
    "Havana",
    "Venezuela",
    "Washington D.C."
  ],
  "origin_agency": "ARMY",
  "persons_mentioned": [
    "Joseph A. Califano, Jr.",
    "Earle G. Wheeler",
    "E. R. Zumwalt, Jr.",
    "J. D. Alger",
    "W. Wendt",
    "J. V. Carpenter, III",
    "H. M. Elwood",
    "Mr. Yarmolinsky",
    "Lt Col Haig",
    "Alessandri",
    "Juan Bosch",
    "Ydigoras",
    "Carlos Manuel Pellecer",
    "Castro",
    "Khrushchev"
  ],
  "recipient": "ICCCA",
  "sender": "Joseph A. Califano, Jr."
}