{
  "classification": "Cuba",
  "document_type": "Paper, Textual Document (Report)",
  "security": "This document discusses U.S. efforts to counter Cuban propaganda and subversive activities, detailing methods such as USIA programs and radio broadcasting to Latin America. Revealing these strategies could undermine their effectiveness. Quoting directly: 'This tab contains a recent summary of USIA programs on Cuba and a more detailed item on USIA radio broadcasting to Latin America.'",
  "security_level": "Secret",
  "summary": "A report from Joseph A. Califano, Jr. to General Krulak, dated February 14, 1963, assessing Cuba's subversive activities and capabilities in Latin America, including propaganda, funding, training, arms shipments, communications, and sabotage.",
  "summary_one_paragraph": "This document, a report transmitted from Joseph A. Califano, Jr. to General Krulak on February 14, 1963, analyzes Cuba's efforts to instigate subversion in Latin America. It covers various aspects of Cuban activities, including propaganda dissemination through Prensa Latina and Radio Havana, financial support to revolutionary groups, training of foreign nationals in guerrilla warfare, arms smuggling, electronic communications, and sabotage operations. The report also evaluates Castro's potential to exploit unstable situations in countries like Venezuela, Brazil, and Bolivia, and considers the impact of potential agreements between the US and USSR on Castro's subversive capabilities.",
  "tags": [
    "Cuban Subversion",
    "Propaganda",
    "Latin America",
    "Castro",
    "USIA",
    "Califano Papers",
    "FOIA"
  ],
  "title": "Cuba as a Base for Subversion",
  "date": "1963-02-14",
  "locations_mentioned": [
    "Cuba",
    "Latin America",
    "Venezuela",
    "Brazil",
    "Bolivia",
    "Mexico",
    "Panama",
    "Chile",
    "Argentina",
    "Nicaragua",
    "Haiti",
    "Dominican Republic",
    "Guatemala",
    "El Salvador",
    "Colombia",
    "Peru",
    "Chile",
    "British Guiana"
  ],
  "origin_agency": "Army",
  "persons_mentioned": [
    "Joseph A. Califano, Jr.",
    "General Krulak",
    "Fidel Castro",
    "Cesar Escalante",
    "Armando Hart",
    "Anibal Escalante",
    "Ramon Penate y Molina",
    "Ramon Calcines Gordillo",
    "Baldomoro Alvarez Rios",
    "Shen Chien",
    "Fernando Colino",
    "Herberto Jorrin Munoz",
    "Robert F. Williams",
    "Somoza",
    "Ydigoras",
    "San Tiago Dantas",
    "Goulart"
  ],
  "recipient": "General Krulak",
  "sender": "Joseph A. Califano, Jr."
}