{
  "classification": "Cuba",
  "document_type": "Agenda and Memorandum",
  "security": "This document reveals intelligence community discussions and recommendations related to Cuba, China, and Israel's nuclear capabilities, U-2 overflights, and internal operations. Quoting directly from the document: 'The DCI said that somewhat of a problem is presented in Israel. Although we are close to the Israeli government, it appears to be withholding information on the extent of its nuclear activities...Mr. McCone stated that he believes that the development of a nuclear weapon capability by Israel would have most serious effects on countries of the Middle East...'. Exposing this information could damage relationships with these nations and compromise intelligence operations.",
  "security_level": "TOP SECRET",
  "summary": "This document includes the agenda for a March 1963 meeting of the President's Foreign Intelligence Advisory Board, a memorandum summarizing the discussions during the meeting, and a memorandum detailing the CIA's comments on the Board's interim report regarding Cuba.",
  "summary_one_paragraph": "This collection of documents includes the agenda for the President's Foreign Intelligence Advisory Board meeting of March 8-9, 1963, which covered topics such as a status report on prior board recommendations, discussions with the Director of Central Intelligence (DCI) John McCone, intelligence briefing on Cuba, and preparation of a report to the President. It also contains a memorandum summarizing the meeting's discussions including concerns about nuclear capabilities in China and Israel, U-2 overflights, and the CIA's view on intelligence collection within the United States. Furthermore, a memorandum from January 1963 details the CIA's response to the Board's interim report on Cuba, specifically regarding clandestine intelligence collection operations.",
  "tags": [
    "PFIAB",
    "President's Foreign Intelligence Advisory Board",
    "Cuba",
    "Intelligence",
    "CIA",
    "John McCone",
    "Nuclear Capabilities",
    "U-2 Overflights",
    "Clandestine Operations"
  ],
  "title": "President's Foreign Intelligence Advisory Board Agenda for Meeting of March 8-9, 1963",
  "date": "1963-03-08",
  "locations_mentioned": [
    "Cuba",
    "Communist China",
    "Israel",
    "Moscow",
    "Washington, D.C.",
    "New York City",
    "London",
    "France",
    "Brazil",
    "Argentina"
  ],
  "origin_agency": "PFIAB",
  "persons_mentioned": [
    "John McCone",
    "Desmond Fitzgerald",
    "Killian",
    "Baker",
    "Clifford",
    "Doolittle",
    "Gray",
    "Land",
    "Langer",
    "Ash",
    "Coyne",
    "Pace",
    "Murphy",
    "Eisenhower",
    "Arthur Lundahl",
    "William Tidwell",
    "Castro",
    "McGeorge Bundy",
    "Donovan",
    "Gilpatric",
    "Kirkpatrick",
    "Mahon",
    "Allen Dulles",
    "Burke",
    "Taylor",
    "Macmillan"
  ],
  "recipient": "President of the United States"
}