{
  "classification": "Cuba",
  "document_type": "Agenda/Memorandum",
  "security": "This document contains discussions of sensitive intelligence programs like OXCART, TALENT, and BYEMAN, and reveals budgetary details of CIA and Department of Defense operations. Disclosing these details could compromise ongoing intelligence collection efforts and expose sensitive technologies and methods. For instance, discussion around the MONGOOSE project and its objectives could be seen as an admission of U.S. interference in Cuban affairs. The text reads: 'Those present were Messrs. Killian, Murphy, Gray, Doolittle, Baker, Clifford, and Pace, and Messrs. Coyne and Ash...the Board had in mind discussing Project OXCART with the President...The objective is to create dissensions in Cuba...MONGOOSE plans are developed under the coordination of General Lansdale...'",
  "security_level": "TOP SECRET",
  "summary": "The document is an agenda and memorandum summarizing the President's Foreign Intelligence Advisory Board (PFIAB) meetings on December 6 and 7, 1962, focusing on intelligence related to Cuba, discussions with CIA officials, and advanced intelligence collection capabilities.",
  "summary_one_paragraph": "This document comprises the agenda and a memorandum outlining the discussions held during the President's Foreign Intelligence Advisory Board meetings on December 6 and 7, 1962. The meetings, chaired by Dr. Killian, reviewed assembled data on the Soviet military buildup in Cuba, included discussions with the DCI's Cuban Review Committee at CIA Headquarters, and featured Dr. Harold Brown, Director of Defense Research and Engineering, addressing advanced intelligence collection capabilities; the Board also deliberated on Project OXCART and concerns over intelligence interpretations, film shortages, and the need for enhanced intelligence on Soviet radar capabilities in Cuba, highlighted by members like Mr. Clifford, and Dr. Langer; the meetings also addressed the MONGOOSE project.",
  "tags": [
    "PFIAB",
    "Cuba",
    "Soviet Buildup",
    "Intelligence",
    "McCone",
    "Wisner",
    "MONGOOSE",
    "OXCART",
    "NRO",
    "Doolittle",
    "Killian",
    "Clifford",
    "Gray",
    "Baker",
    "Lansdale",
    "CIA",
    "Department of Defense",
    "Cuban Panel"
  ],
  "title": "President's Foreign Intelligence Advisory Board Agenda for Meetings of December 6, 1962 of the Board's Cuban Panel",
  "date": "1962-12-06",
  "locations_mentioned": [
    "Cuba",
    "Langley, Virginia"
  ],
  "origin_agency": "PFIAB",
  "persons_mentioned": [
    "Dr. Killian",
    "Murphy",
    "Gray",
    "Doolittle",
    "Baker",
    "McCone",
    "Wisner",
    "Carroll",
    "Blake",
    "Carter",
    "Dr. Harold Brown",
    "Clifford",
    "Pace",
    "Ash",
    "Kirkpatrick",
    "Helms",
    "Dr. Charyk",
    "Capt Seller",
    "Scoville",
    "Cline",
    "MacMillan",
    "Secretary McNamara",
    "General Lansdale",
    "Dr. Langer"
  ],
  "recipient": "File",
  "sender": "PFIAB"
}