{
  "classification": "Operations",
  "document_type": "Memorandum",
  "security": "Discussion of covert actions in Cuba, Vietnam, Cambodia, Laos, Panama, Chile, Congo, Angola, Tibet, Zanzibar, and China, including details of CIA support for political candidates and operations. For example, \"CIA support of Chilean Christian Democrat candidate Frei included $750,000 in March; and on May 14, another $1.25 million was added following the urgings of major business elements in Chile and the U. S.\"",
  "security_level": "TOP SECRET",
  "summary": "Minutes from a PFIAB Covert Action Panel meeting on June 5, 1964, discussing the Special Group's covert actions globally, including CIA support in Chile, the situation in Vietnam, and operations related to Cuba.",
  "summary_one_paragraph": "On June 5, 1964, the PFIAB's Covert Action Panel convened to discuss the Special Group's covert operations with Secretary Peter Jessup, followed by discussions with CIA's Dick Helms and Cord Meyer, and State Department's Alexis Johnson. The meeting covered covert actions in various countries, including Cuba, Vietnam, Cambodia, Laos, Panama, Chile, Congo, Angola, Tibet, Zanzibar, and China, with a focus on CIA support for Chilean presidential candidate Frei, concerns about the political situation in South Vietnam, and the status of sabotage operations against Cuba; discussions also included the State Department's role in the Special Group, concerns about the security of the U.S. Embassy in Moscow, and the need for systematic reviews of covert action programs.",
  "tags": [
    "Covert Action",
    "PFIAB",
    "Special Group",
    "CIA",
    "Chile",
    "Vietnam",
    "Cuba",
    "NSC 5412/2 Group",
    "Soviet Union",
    "State Department",
    "Foreign Intelligence",
    "Espionage",
    "Audio Penetration",
    "Moscow Embassy"
  ],
  "title": "Covert Action Panel Meeting 6/5/64 (Discussion With Secretary, Special Group, ET AL.)",
  "date": "1964-06-05",
  "locations_mentioned": [
    "Cuba",
    "Vietnam",
    "Cambodia",
    "Laos",
    "Panama",
    "Chile",
    "Congo",
    "Angola",
    "Tibet",
    "Zanzibar",
    "China",
    "Moscow",
    "Turkey",
    "South Vietnam",
    "North Vietnam",
    "Laos",
    "Brazzaville",
    "Cyprus"
  ],
  "origin_agency": "PFIAB",
  "persons_mentioned": [
    "A.R. Ash",
    "Mr. Murphy",
    "Mr. Gray",
    "Mr. Langer",
    "General Doolittle",
    "J. Patrick Coyne",
    "Peter Jessup",
    "McGeorge Bundy",
    "Alexis Johnson",
    "Cyrus Vance",
    "McCone",
    "Dick Helms",
    "Cord Meyer",
    "Artime",
    "Manolo Ray",
    "Castro",
    "Allende",
    "Frei",
    "Edwards",
    "Rables",
    "Goulart",
    "Diem",
    "Mobutu",
    "General Lemnitzer",
    "Mr. Scott"
  ],
  "recipient": "The File",
  "sender": "A.R. Ash"
}