{
  "classification": "Administrative",
  "document_type": "Minutes of Meeting",
  "security": "The document outlines the responsibilities, activities, and concerns of the President's Foreign Intelligence Advisory Board (PFIAB), including sensitive intelligence collection programs and covert operations. Disclosing details about these operations and the Board's recommendations could compromise ongoing intelligence activities and reveal classified information about U.S. intelligence capabilities. For example, it discusses 'highly sensitive covert operations relating to political action, propaganda, economic warfare, sabotage... [conducted] in such a manner that, if uncovered, the U.S. Government can plausibly disclaim responsibility for them'.",
  "security_level": "TOP SECRET",
  "summary": "Minutes from the January 30, 1964 meeting of the President's Foreign Intelligence Advisory Board (PFIAB) cover discussions with the Acting Director of Central Intelligence and the Director of the National Reconnaissance Office, consideration of a report to the President, and a meeting with the President. The document also includes memoranda used by the Chairman for an oral briefing to President Johnson regarding the origin and mission of the PFIAB, including its review procedures, areas of major concern, and summaries of recommendations submitted.",
  "summary_one_paragraph": "This document comprises the minutes of the President's Foreign Intelligence Advisory Board (PFIAB) meeting on January 30, 1964, detailing discussions with Lt. General Marshall Carter (Acting Director of Central Intelligence) and Under Secretary Brockway McMillan (Director of the National Reconnaissance Office), along with an executive session and a meeting with President Johnson. It includes an agenda, a memorandum listing the Board personnel scheduled to meet with the President, and attachments outlining the Board's origin, mission, review procedures, and areas of major concern such as the cost and complexity of intelligence efforts, Sino-Soviet missile capabilities, and covert operations. Furthermore, it summarizes recommendations submitted to the President between May 1961 and November 1963, covering topics like the role of the DCI, CIA reorganization, and the National Reconnaissance Program.",
  "tags": [
    "PFIAB",
    "President's Foreign Intelligence Advisory Board",
    "Intelligence",
    "CIA",
    "National Reconnaissance Office",
    "Covert Operations",
    "National Security",
    "JFK Assassination Records",
    "FOIA",
    "TOP SECRET",
    "Johnson Administration"
  ],
  "title": "MINUTES OF MEETING OF JANUARY 30, 1964",
  "date": "1964-01-30",
  "locations_mentioned": [
    "Washington, D.C.",
    "Murray Hill, N.J.",
    "Redondo Beach, Calif.",
    "Cambridge, Mass.",
    "New York, N.Y.",
    "Langley"
  ],
  "origin_agency": "PFIAB",
  "persons_mentioned": [
    "Clark Clifford",
    "Walter Jenkins",
    "Kenneth O'Donnell",
    "Pierre Salinger",
    "J. Patrick Coyne",
    "Lyndon B. Johnson",
    "Marshall Carter",
    "Brockway McMillan",
    "William O. Baker",
    "James Doolittle",
    "Gordon Gray",
    "Edwin H. Land",
    "William L. Langer",
    "Robert D. Murphy",
    "Frank Pace, Jr.",
    "James Killian, Jr.",
    "Allen Dulles"
  ],
  "recipient": "President of the United States"
}