{
  "classification": "Administrative",
  "document_type": "Minutes",
  "security": "Disclosing the agenda and discussions of the President's Foreign Intelligence Advisory Board (PFIAB), including topics like national reconnaissance programs, audio penetrations of the U.S. Embassy in Moscow, intelligence on China, and military reconnaissance programs, could reveal sensitive intelligence priorities, collection methods, and vulnerabilities. Additionally, details on discussions with the Director of Central Intelligence and assessments of damage to cryptographic systems could compromise intelligence operations and security measures. The document also refers to IDEALIST/CORONA/OXCART, codeword programs, potentially revealing sensitive information about them. Quoting directly: 'the Board had raised an important point in urging that the penetration cables not be cut precipitously when discovered in the Embassy, but the Board's urging was ignored.'",
  "security_level": "TOP SECRET",
  "summary": "Minutes of the President's Foreign Intelligence Advisory Board (PFIAB) meeting on June 4, 1964, cover topics including national reconnaissance programs, audio penetrations of the U.S. Embassy in Moscow, intelligence on China, and military reconnaissance programs.",
  "summary_one_paragraph": "The minutes from the PFIAB meeting on June 4, 1964, detail discussions on a range of intelligence matters. The agenda included status reports on the National Reconnaissance Program, audio penetrations of the U.S. Embassy in Moscow, USIB actions related to these penetrations, and assessments of potential damage to cryptographic systems. The board also discussed current intelligence briefings on China, Southeast Asia, Cyprus, and Cuba, as well as military reconnaissance programs. Additional topics involved on-the-scene reviews of counter-audiosurveillance measures at the Moscow Embassy and discussions with the Director of Central Intelligence.",
  "tags": [
    "PFIAB",
    "National Reconnaissance Program",
    "Audio Penetration",
    "Moscow Embassy",
    "USIB",
    "Cryptographic Systems",
    "China",
    "Southeast Asia",
    "Cuba",
    "Military Reconnaissance",
    "Counter-audiosurveillance"
  ],
  "title": "Minutes of Board Meeting of June 4, 1964",
  "date": "1964-06-04",
  "locations_mentioned": [
    "Moscow",
    "South Vietnam",
    "Laos",
    "Cambodia",
    "North Vietnam",
    "Cyprus",
    "Cuba",
    "Southeast Asia",
    "India",
    "USSR",
    "China"
  ],
  "origin_agency": "PFIAB",
  "persons_mentioned": [
    "Clifford",
    "Pace",
    "Murphy",
    "Langer",
    "Gray",
    "J. Patrick Coyne",
    "A. R. Ash",
    "General Doolittle",
    "Baker",
    "Land",
    "McGeorge Bundy",
    "Secretary McNamara",
    "McCone",
    "Deputy Secretary Vance",
    "Jerome Wiesner",
    "Bannerman",
    "Tordella",
    "Gentile",
    "Ray Cline",
    "Ralph D. Steakley",
    "Kirkpatrick",
    "Fitzgerald",
    "Meyers",
    "Castro",
    "Angelton",
    "Kohler",
    "Khrushchev",
    "Coffey",
    "Penkovsky",
    "R. J. Smith"
  ]
}