{
  "classification": "Operations",
  "document_type": "Memorandum",
  "security": "The memo details specific covert operations, including financial support to foreign entities and sabotage efforts, which could compromise ongoing activities and sources if exposed. For example, it mentions \"CIA financial support ($435,000) to the strike under the cover of 'AFL-CIO contributions'\" and ongoing \"black\" operations against Cuba. Revealing such information could damage relationships with foreign governments and expose covert operatives.",
  "security_level": "TOP SECRET",
  "summary": "A memorandum summarizing a Board Panel meeting on covert action operations, detailing CIA activities in British Guiana, Haiti, Dominican Republic, Vietnam, Italy, Bolivia, Brazil, and Cuba.",
  "summary_one_paragraph": "This Top Secret memorandum, dated September 10, 1963, summarizes a Board Panel meeting on covert action operations led by the CIA. The meeting covered operations in British Guiana, where the CIA supported a strike against the Jagan regime with AFL-CIO cover; Haiti, where exile groups received token financial support; the Dominican Republic, marked by political instability under Juan Bosch; Vietnam, involving support for the war against the Viet Cong and infiltration operations in North Vietnam; Italy, where the Christian Democratic Party received financial backing; Bolivia, with a project to rationalize tin mines; Brazil, focused on covert action in the labor movement and student groups; and Cuba, involving covert actions to destabilize the Castro regime through intelligence collection, propaganda, economic denial, and sabotage.",
  "tags": [
    "covert action",
    "CIA",
    "British Guiana",
    "Haiti",
    "Dominican Republic",
    "Vietnam",
    "Italy",
    "Bolivia",
    "Brazil",
    "Cuba",
    "NSC",
    "PFIAB",
    "JFK Assassination Records Act"
  ],
  "title": "Board Panel on Covert Action Operations",
  "date": "1963-09-10",
  "locations_mentioned": [
    "British Guiana",
    "Haiti",
    "Dominican Republic",
    "Vietnam",
    "Italy",
    "Bolivia",
    "Brazil",
    "Cuba",
    "United States",
    "Miami",
    "Washington"
  ],
  "origin_agency": "NSC",
  "persons_mentioned": [
    "Robert Murphy",
    "Gordon Gray",
    "William Langer",
    "Coyne",
    "A.R. Ash",
    "Richard Helms",
    "Cord Meyer",
    "Desmond Fitzgerald",
    "Jagan",
    "George Meany",
    "Kennedy",
    "MacMillan",
    "Mrs. Jagan",
    "Juan Bosch",
    "Devalier",
    "Diem",
    "Madame Nhu",
    "Fanfani",
    "Khrushchev",
    "Paz Estancero",
    "Goulart",
    "Castro",
    "Bundy"
  ],
  "recipient": "The File",
  "sender": "A.R. Ash"
}