{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "The document details covert reconnaissance operations over Cuba, including U-2 flights and potential mining of Cuban waters. Disclosing these activities could compromise intelligence gathering methods and provoke international backlash. The document states: \"There was some discussion of the desirability of mining Cuban waters, using nonattributable mines appearing to be home-made and laid by small aircraft operated by Cubans.\"",
  "security_level": "TOP SECRET",
  "summary": "This document summarizes Special Group (Augmented) meetings and memoranda from 1962-1963 regarding reconnaissance and covert actions related to Cuba, including Operation MONGOOSE, U-2 flights, and discussions about potential sabotage and mining operations.",
  "summary_one_paragraph": "This TOP SECRET document, dated January 11, 1963, summarizes a review of the Special NSC 5412/2 Group's records concerning reconnaissance and covert operations related to Cuba. It includes minutes from various meetings in 1962 involving key figures like the Attorney General, Mr. Johnson, Mr. Gilpatric, Mr. McCone, General Lansdale, and others, detailing discussions on Operation MONGOOSE, intelligence gathering, potential sabotage activities, U-2 flights over Cuba, and the possibility of mining Cuban waters. The review also covers disagreements and decisions regarding the nature and execution of these covert actions, as well as efforts to balance operational needs with concerns about attribution and international repercussions.",
  "tags": [
    "Cuba",
    "Reconnaissance",
    "Covert Operations",
    "MONGOOSE",
    "Special Group",
    "NSC 5412/2",
    "U-2 Flights",
    "Sabotage",
    "Mining",
    "Intelligence",
    "JFK Assassination Records Act"
  ],
  "title": "CUBA (Review on 1/10/63 of Records of the Special NSC 5412/2 Group",
  "date": "1963-01-11",
  "locations_mentioned": [
    "Cuba",
    "Isle of Pines",
    "Guantanamo Bay"
  ],
  "origin_agency": "NSC",
  "persons_mentioned": [
    "A. Russell Ash",
    "Tom Parrott",
    "Attorney General",
    "Mr. Johnson",
    "Mr. Gilpatric",
    "Mr. McCone",
    "General Carter",
    "General Lemnitzer",
    "General Lansdale",
    "Dr. Cline",
    "General Taylor",
    "Mr. Wilson",
    "Dr. Scoville",
    "Colonel Steakley",
    "Mr. Bundy",
    "Dr. Charyk",
    "Colonel Ledford",
    "Mr. Helms",
    "Mr. Hilsman",
    "William Bundy",
    "Mr. Nitze"
  ],
  "recipient": "The File",
  "sender": "A. Russell Ash"
}