{
  "classification": "Administrative",
  "document_type": "Minutes",
  "security": "Disclosing specific agenda items such as \"Audio Surveillance Collection and Counter-measures Efforts of the Intelligence Community\" along with names of individuals involved (Mr. Tom Karamessines, Mr. Robert Bannerman, Mr. Howard Osborn, Mr. G. Marvin Gentile) could expose sensitive intelligence operations and compromise the individuals’ roles.",
  "security_level": "TOP SECRET",
  "summary": "Minutes from the President's Foreign Intelligence Advisory Board (PFIAB) meeting on August 6 and 7, 1964, covering topics such as SAC command post status, intelligence warning, Soviet Bloc threat, National Reconnaissance Program, foreign intelligence budgeting, audio surveillance, and the Defense Intelligence Agency.",
  "summary_one_paragraph": "The minutes detail the agenda and discussions during the PFIAB meeting on August 6-7, 1964, which included a visit to SAC Headquarters, intelligence briefings on Vietnam, considerations for the National Reconnaissance Program involving discussions between McGeorge Bundy, Secretary of Defense McNamara, and DCI McCone, foreign intelligence budgeting led by Kermit Gordon and Elmer Staats, and audio surveillance countermeasures efforts with briefings from Tom Karamessines, Robert Bannerman, Howard Osborn, and G. Marvin Gentile; the meeting also addressed the Defense Intelligence Agency with a report from Lt. General Joseph F. Carroll.",
  "tags": [
    "PFIAB",
    "Foreign Intelligence",
    "SAC",
    "Soviet Bloc Threat",
    "National Reconnaissance Program",
    "Audio Surveillance",
    "Defense Intelligence Agency",
    "Vietnam",
    "Cuba",
    "USIB",
    "Intelligence Community"
  ],
  "title": "MINUTES OF BOARD MEETING OF AUGUST 6 AND 7, 1964",
  "date": "1964-08-06",
  "locations_mentioned": [
    "Andrews AFB",
    "Offutt AFB",
    "Omaha, Nebraska",
    "Washington, D.C.",
    "South Vietnam",
    "North Vietnam",
    "Laos",
    "Cambodia",
    "Communist China",
    "Cyprus",
    "Congo",
    "Cuba",
    "Moscow"
  ],
  "origin_agency": "PFIAB",
  "persons_mentioned": [
    "General Thomas Power",
    "Ray Cline",
    "Brockway McMillan",
    "John Strand",
    "Kermit Gordon",
    "Elmer Staats",
    "Robert Amory",
    "Tom Karamessines",
    "Robert Bannerman",
    "Howard Osborn",
    "G. Marvin Gentile",
    "Joseph F. Carroll",
    "Clark M. Clifford",
    "Doolittle",
    "Langer",
    "Pace",
    "Gray",
    "Land",
    "Coyne",
    "Murphy",
    "Baker",
    "Ash",
    "McGeorge Bundy",
    "Secretary of Defense McNamara",
    "Mr. McCone",
    "Kirkpatrick",
    "Jerome B. Wiesner",
    "Musser"
  ]
}