{
  "classification": "Administrative",
  "document_type": "Paper, Textual Document",
  "security": "This document discusses ongoing clandestine collection and covert operations against Cuba, including the placement of agents and efforts to promote disaffection in the Cuban military, hamper the Cuban economy, and sabotage. It also mentions intelligence collection on Cuba and the involvement of foreign countries. Revealing these details could compromise ongoing operations and damage relationships with involved countries. Specifically, it states: 'Agents have been placed in Cuba for CIA by Argentina, France, Spain, Holland, Denmark, Norway and Britain.'",
  "security_level": "TOP SECRET",
  "summary": "Minutes from the June 25-26, 1963, meeting of the President's Foreign Intelligence Advisory Board (PFIAB) cover a range of intelligence activities, including updates on OXCART, CIA operations in non-covert action areas, State Department intelligence activities, signals intelligence (SIGINT), and discussions with the Director of Central Intelligence regarding Cuba, the Profumo case, and the Penkovskiy espionage case.",
  "summary_one_paragraph": "The document contains the agenda and minutes from the President's Foreign Intelligence Advisory Board meeting on June 25-26, 1963, during which the board members, including Chairman Clark Clifford, reviewed intelligence operations and panel reports. Discussions included updates on Project OXCART, CIA's clandestine activities against Cuba led by Mr. Fitzgerald, status reports on State Department and Defense intelligence, and budgetary control of intelligence activities. The board also discussed the Profumo case in Britain, the Penkovskiy espionage case in the USSR, and responses to Hanson Baldwin's article on intelligence leaks, with DCI McCone providing insights and updates on various intelligence matters and operations.",
  "tags": [
    "PFIAB",
    "Intelligence Advisory Board",
    "OXCART",
    "CIA",
    "State Department Intelligence",
    "SIGINT",
    "Cuba",
    "Profumo case",
    "Penkovskiy case",
    "Intelligence Leaks",
    "Covert Operations"
  ],
  "title": "MEETING OF THE PRESIDENT'S FOREIGN INTELLIGENCE ADVISORY BOARD ON JUNE 25-26, 1963",
  "date": "1963-06-25",
  "locations_mentioned": [
    "Cuba",
    "USSR",
    "Britain",
    "London",
    "Miami"
  ],
  "origin_agency": "PFIAB",
  "persons_mentioned": [
    "Clark Clifford",
    "Gray",
    "Langer",
    "Murphy",
    "Doolittle",
    "Land",
    "Pace",
    "Coyne",
    "Ash",
    "George C. Denney, Jr.",
    "Allan Evans",
    "Gary Pettibone",
    "Irving Lewis",
    "Brockway McMillan",
    "McCone",
    "Fitzgerald",
    "Killian",
    "Hanson Baldwin",
    "Ivanov",
    "Keeler",
    "MacMillan",
    "Philby",
    "Burgess",
    "MacLean",
    "Penkovskiy"
  ],
  "recipient": "The File",
  "sender": "PFIAB"
}