{
  "classification": "Administrative",
  "document_type": "Paper, Textual Document",
  "security": "The document reveals the PFIAB's concerns regarding CIA's covert actions and the potential risks associated with them, especially in relation to maintaining secrecy and avoiding public disclosure of sensitive operations. For instance, the document mentions the CIA's use of foundations and proprietary organizations as covers, and the associated dangers of disclosure. \"Dr. Killian felt that there is danger that the entire Foundation systems in the U. S. would be discredited if there were a disclosure of CIA'S connection with them.\"",
  "security_level": "TOP SECRET",
  "summary": "This document contains information pertaining to the President's Foreign Intelligence Advisory Board's (PFIAB) consideration of covert action matters, including briefings, discussions, and meetings related to CIA activities from 1961 to 1963.",
  "summary_one_paragraph": "This document is a collection of meeting minutes, briefings, and discussions of President Kennedy's Foreign Intelligence Advisory Board (PFIAB) related to covert actions from 1961 to 1963. It includes topics such as briefings by the DCI and CIA representatives on covert operations, concerns about CIA's use of proprietary organizations like Radio Free Europe, discussions on reorganizing the CIA, reviews of covert action programs in various countries, and the need for the Board to be fully informed about covert action operations.",
  "tags": [
    "PFIAB",
    "Covert Action",
    "CIA",
    "Kennedy",
    "Intelligence",
    "NSC 5412/2",
    "Paramilitary Activities",
    "Radio Free Europe",
    "Asia Foundation",
    "Board Meetings"
  ],
  "title": "CONSIDERATION OF COVERT ACTION MATTERS BY PRESIDENT. KENNEDY'S FOREIGN INTELLIGENCE ADVISORY BOARD",
  "date": "00/00/00",
  "locations_mentioned": [
    "Cuba",
    "Laos",
    "Vietnam",
    "Guatemala",
    "Chile",
    "Argentina",
    "Dominican Republic",
    "Brazil",
    "Venezuela",
    "Peru",
    "Japan",
    "Congo",
    "Kenya",
    "Italy",
    "France",
    "British Guiana",
    "Haiti",
    "Bolivia",
    "Singapore",
    "Middle East",
    "Cyprus",
    "Athens",
    "Ankara",
    "Indonesia"
  ],
  "origin_agency": "PFIAB",
  "persons_mentioned": [
    "President John F. Kennedy",
    "Allen Dulles",
    "General Taylor",
    "McGeorge Bundy",
    "Cord Meyer",
    "Robert Murphy",
    "Gordon Gray",
    "J. Patrick Coyne",
    "A. Russell Ash",
    "William Langer",
    "Thomas Hughes",
    "Alexis Johnson",
    "Richard Helms",
    "Desmond Fitzgerald",
    "Dr. Land",
    "Mr. Clifford",
    "Board Chairman Killian",
    "General Doolittle",
    "Ambassador Galbraith",
    "Roger Hilsman",
    "Bissell",
    "Lyman Kirkpatrick",
    "Amory",
    "Breitweiser",
    "John McCone",
    "General Carter"
  ]
}