{
  "classification": "Administrative",
  "document_type": "Minutes",
  "security": "The document discusses intelligence matters such as the National Reconnaissance Office (NRO) and signals intelligence (SIGINT) programs, including specific satellite capabilities (DORIAN and QUILL) and the monitoring of Soviet missile deployments. Revealing details about these programs could compromise national security and intelligence gathering capabilities.",
  "security_level": "TOP SECRET",
  "summary": "Minutes from the President's Foreign Intelligence Advisory Board (PFIAB) meeting on April 2-3, 1964, covering discussions on the National Reconnaissance Office (NRO), National Signals Intelligence (SIGINT) program, and a briefing on the world situation, including Soviet and Chinese activities.",
  "summary_one_paragraph": "These are the minutes of the President's Foreign Intelligence Advisory Board meeting held on April 2 and 3, 1964, where the board discussed topics such as the National Reconnaissance Office (NRO) activities, including a report from a panel led by Chairman Baker, Doolittle, and Land, and proposals for revisions in the NRO agreement. The meeting included discussions with General Bernard A. Schriever on NRO satellite reconnaissance, Dr. Albert D. Wheelon on CIA monitorship of the NRO, and Dr. Eugene G. Fubini on Defense Department monitorship. The board also received an intelligence briefing from Ray Cline of the CIA on the world situation, covering Soviet missile deployment, space probes, economic estimates, the Sino-Soviet conflict, and the situation in Vietnam, and addressed implementation of recommendations from the Dunlap case and other major recommendations.",
  "tags": [
    "PFIAB",
    "NRO",
    "SIGINT",
    "CIA",
    "Soviet Union",
    "China",
    "Vietnam",
    "Intelligence",
    "Reconnaissance",
    "DORIAN",
    "QUILL",
    "Dunlap Case"
  ],
  "title": "Minutes of Board Meeting of April 2 and 3, 1964",
  "date": "1964-04-02",
  "locations_mentioned": [
    "USSR",
    "China",
    "Vietnam",
    "Washington D.C."
  ],
  "origin_agency": "PFIAB",
  "persons_mentioned": [
    "Chairman Baker",
    "Doolittle",
    "Land",
    "Mr. McCone",
    "Dr. McMillan",
    "General Greer",
    "Kelly Johnson",
    "Eugene Keifer",
    "Eugene Fubini",
    "Carter",
    "Wheelon",
    "Bross",
    "Ledford",
    "General Bernard A. Schriever",
    "Albert D. Wheelon",
    "Eugene G. Fubini",
    "John A. McCone",
    "Cyrus Vance",
    "Ray Cline",
    "Bruce Clark",
    "Mr. Clifford",
    "Gray",
    "Langer",
    "Pace",
    "Murphy",
    "J. Patrick Coyne",
    "A. R. Ash",
    "Henry Thomas",
    "McGeorge Bundy",
    "General Khanh"
  ],
  "recipient": "N/A",
  "sender": "PFIAB"
}