{
  "entity_name": "Payroll Records",
  "entity_type": "tag",
  "document_count": 61,
  "summary": "The \"Payroll Records\" entity refers to documents containing payroll authorization forms, memoranda, and related correspondence pertaining to the staff of the House Select Committee on Assassinations (HSCA). These records detail employees' appointments, salary adjustments, leave records, and termination information. A recurring theme across these documents is the Assassination Records Review Board's (ARRB) final determination to postpone the release of Social Security numbers within these records to protect personal privacy. The documents often include payroll authorization forms, memoranda regarding employment and payroll certification, and in some cases, resumes and certificates of relationship to members of Congress. The date range of these documents primarily spans from 1976 to 1978, coinciding with the HSCA's active investigation period, with later documents from 1995 reflecting the ARRB's review and determination regarding the release of these records.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Assassination Records Review Board (ARRB)",
    "HSCA Staff",
    "Social Security Numbers",
    "Louis Stokes",
    "Henry B. Gonzalez"
  ],
  "significance": "Payroll records are significant in the JFK assassination context because they provide insight into the staffing and operations of the HSCA, the committee tasked with reinvestigating the assassination. These records offer details about who worked on the investigation, their roles, and their compensation. The ARRB's decisions regarding the release of these records, particularly the postponement of Social Security numbers, highlight the balance between transparency and personal privacy in the context of historical records related to the assassination.",
  "document_ids": [
    "180-10068-10319",
    "180-10068-10335",
    "180-10060-10494",
    "180-10068-10322",
    "180-10068-10334",
    "180-10060-10483",
    "180-10068-10363",
    "180-10070-10166",
    "180-10070-10146",
    "180-10068-10314",
    "180-10068-10343",
    "180-10068-10355",
    "180-10068-10309",
    "180-10070-10161",
    "180-10060-10484",
    "180-10068-10305",
    "180-10068-10344",
    "180-10060-10467",
    "180-10071-10001",
    "180-10071-10000",
    "180-10060-10470",
    "180-10068-10328",
    "180-10060-10489",
    "180-10068-10324",
    "180-10060-10493",
    "180-10070-10160",
    "180-10068-10308",
    "180-10060-10450",
    "180-10060-10490",
    "180-10068-10327",
    "180-10070-10159",
    "180-10060-10486",
    "180-10070-10163",
    "180-10060-10445",
    "180-10060-10453",
    "180-10070-10175",
    "180-10060-10473",
    "180-10070-10155",
    "180-10070-10143",
    "180-10060-10449",
    "180-10068-10311",
    "180-10068-10350",
    "180-10068-10307",
    "180-10068-10310",
    "180-10147-10266",
    "180-10070-10174",
    "180-10070-10162",
    "180-10060-10444",
    "180-10060-10491",
    "180-10068-10326",
    "180-10147-10261",
    "180-10060-10463",
    "180-10070-10145",
    "180-10060-10455",
    "180-10060-10442",
    "180-10068-10361",
    "180-10060-10481",
    "180-10060-10458",
    "180-10068-10357",
    "180-10060-10462",
    "180-10070-10144"
  ]
}