{
  "entity_name": "William Harvey",
  "entity_type": "tag",
  "document_count": 11,
  "summary": "William Harvey was a CIA officer significantly involved in covert operations against Cuba, particularly during the early 1960s. He drafted operational plans for these actions, including intelligence gathering, economic pressure, and potential support for internal resistance. Harvey's name appears in connection with Operation Mongoose and ZRRIFLE, projects involving potential assassination plots against foreign leaders like Fidel Castro and Patrice Lumumba. He testified before the SSCIA (Church Committee) regarding these activities, including his views on assassination as a tool. Documents also mention his contact with Clare Booth Luce and references to his files being of interest to the House Select Committee on Assassinations (HSCA). The documents suggest a pattern of Harvey's involvement in highly sensitive and controversial CIA operations during the Cold War.",
  "key_connections": [
    "Fidel Castro",
    "Patrice Lumumba",
    "Clare Booth Luce",
    "Operation Mongoose",
    "ZRRIFLE",
    "SSCIA (Church Committee)",
    "House Select Committee on Assassinations (HSCA)",
    "DCI (Director of Central Intelligence)",
    "Robert Maheu",
    "William Colby"
  ],
  "significance": "William Harvey's significance in the JFK assassination context stems from his involvement in CIA's covert operations, including potential assassination plots against Fidel Castro. The HSCA investigated these activities, and Harvey's role in them, to determine if they had any connection to the assassination of President Kennedy. His testimony and the documents related to his activities were scrutinized for any evidence linking the CIA's anti-Castro efforts to the events in Dallas.",
  "document_ids": [
    "104-10102-10224",
    "157-10014-10109",
    "180-10143-10362",
    "157-10011-10006",
    "157-10002-10105",
    "104-10059-10057",
    "104-10061-10320",
    "157-10011-10024",
    "157-10014-10137",
    "104-10061-10214",
    "104-10103-10079"
  ]
}