{
  "entity_name": "WNINTEL",
  "entity_type": "tag",
  "document_count": 44,
  "summary": "WNINTEL appears to be an intelligence dissemination control marking used by the CIA. The documents suggest that information classified as WNINTEL was relevant to various intelligence operations and investigations, including those related to the JFK assassination. The documents indicate that WNINTEL information was used in cables, messages, and reports concerning individuals, events, and locations connected to the assassination, such as Lee Harvey Oswald, George de Mohrenschildt, and activities in Minsk, Mexico City, and other locations. The documents also show that WNINTEL information was subject to review and potential declassification under the JFK Assassination Records Collection Act of 1992. The presence of WNINTEL in these documents suggests that the information was considered sensitive and required controlled handling within the intelligence community.",
  "key_connections": [
    "Lee Harvey Oswald",
    "JFK Assassination Records Review Board (ARRB)",
    "KGB/BKGB",
    "CIA Stations (Minsk, Mexico City, Paris, Buenos Aires, Tokyo, Bonn, Caracas, Guayaquil)",
    "SVRR (Russian Foreign Intelligence Service)",
    "George de Mohrenschildt",
    "MXWINDFALL/1",
    "JYVAPOROUS",
    "Former CIA employees",
    "Cuban exiles"
  ],
  "significance": "WNINTEL's significance in the JFK context lies in its role as a control marking for sensitive intelligence information related to the assassination. Its presence in documents concerning individuals, locations, and events connected to the assassination indicates that the information was considered relevant to understanding the circumstances surrounding the event. The need to review and potentially declassify WNINTEL information under the JFK Assassination Records Collection Act highlights its importance in the ongoing effort to uncover the truth about the assassination.",
  "document_ids": [
    "104-10326-10082",
    "104-10326-10094",
    "104-10164-10099",
    "104-10326-10057",
    "104-10326-10041",
    "104-10326-10016",
    "104-10326-10077",
    "104-10326-10037",
    "104-10326-10017",
    "104-10326-10040",
    "104-10326-10001",
    "104-10173-10171",
    "104-10169-10000",
    "104-10326-10083",
    "104-10412-10005",
    "104-10326-10092",
    "104-10326-10010",
    "104-10326-10093",
    "104-10326-10085",
    "104-10014-10065",
    "104-10326-10031",
    "104-10326-10049",
    "104-10326-10012",
    "104-10326-10045",
    "104-10326-10028",
    "104-10326-10087",
    "104-10326-10068",
    "104-10326-10013",
    "104-10326-10064",
    "104-10326-10033",
    "104-10014-10067",
    "104-10326-10014",
    "104-10326-10096",
    "104-10326-10079",
    "104-10326-10080",
    "104-10326-10075",
    "104-10326-10063",
    "104-10326-10062",
    "104-10418-10103",
    "104-10418-10230",
    "104-10326-10039",
    "104-10326-10097",
    "104-10326-10042",
    "104-10326-10015"
  ]
}