{
  "entity_name": "All Staff Employees",
  "entity_type": "recipient",
  "document_count": 13,
  "summary": "The \"All Staff Employees\" entity refers to the personnel employed by the House Select Committee on Assassinations (HSCA). The documents primarily concern the release status of HSCA staff payroll records, with a focus on the postponement of Social Security numbers to protect personal privacy. The Assassination Records Review Board (ARRB) issued multiple Final Determination Notifications regarding these records, citing privacy concerns as the reason for postponing the release of Social Security numbers. These documents include payroll authorization forms, resumes, leave records, and related correspondence for various staff members, such as Antoinette M. Roberts, Donald A. Purdy, Jr., Sari Mordana, Ann Furnald Taylor, Elizabeth Ann Wolf, Denise L. McCray, Kevin Sean Doyle, Stephen J. Fallis and Jane E. Godfrey. The records span from 1976 to 1978, with final determination notifications issued in 1995.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Assassination Records Review Board (ARRB)",
    "Antoinette M. Roberts",
    "Donald A. Purdy, Jr.",
    "Sari Mordana",
    "Ann Furnald Taylor",
    "Elizabeth Ann Wolf",
    "Denise L. McCray",
    "Kevin Sean Doyle",
    "Stephen J. Fallis",
    "Jane E. Godfrey"
  ],
  "significance": "The significance of HSCA staff employees in the JFK assassination context lies in their involvement in the investigation conducted by the HSCA. Their payroll records, personnel files, and related documents are considered assassination records, subject to review and potential release under the JFK Assassination Records Collection Act. The ARRB's decisions regarding the release of these records, particularly the postponement of Social Security numbers, reflect the balance between public interest and personal privacy.",
  "document_ids": [
    "180-10060-10499",
    "180-10070-10146",
    "180-10071-10001",
    "180-10071-10000",
    "180-10068-10312",
    "180-10068-10345",
    "180-10060-10486",
    "180-10070-10163",
    "180-10060-10465",
    "180-10070-10174",
    "180-10060-10480",
    "180-10068-10337",
    "180-10068-10357"
  ]
}