{
  "entity_name": "Clerk of the House of Representatives",
  "entity_type": "recipient",
  "document_count": 44,
  "summary": "The documents provided primarily relate to the House Select Committee on Assassinations (HSCA) staff payroll records. The Clerk of the House of Representatives, as a recipient, is not directly mentioned in the summaries. The documents focus on payroll authorizations, final determination notifications from the Assassination Records Review Board (ARRB) regarding the postponement of Social Security numbers, and other personnel records of HSCA staff. These records detail employment histories, salary adjustments, and termination information for various individuals who worked for the HSCA. The ARRB's notifications often cite privacy concerns as the reason for postponing the release of Social Security numbers. The documents span from 1976 to 1995, with the ARRB notifications occurring in 1995.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Assassination Records Review Board (ARRB)",
    "HSCA Staff",
    "Louis Stokes",
    "Henry B. Gonzalez"
  ],
  "significance": "The Clerk of the House of Representatives' significance in the JFK context, based on these documents, is primarily administrative. As the recipient of these payroll records, they were responsible for managing and maintaining the financial and personnel information related to the HSCA staff. The documents themselves are significant because they provide insight into the operations and staffing of the HSCA, the committee tasked with investigating the assassination of President Kennedy.",
  "document_ids": [
    "180-10068-10339",
    "180-10060-10441",
    "180-10068-10362",
    "180-10060-10482",
    "180-10060-10494",
    "180-10068-10322",
    "180-10068-10334",
    "180-10068-10363",
    "180-10060-10440",
    "180-10070-10150",
    "180-10060-10451",
    "180-10068-10325",
    "180-10060-10492",
    "180-10068-10352",
    "180-10068-10344",
    "180-10068-10313",
    "180-10060-10489",
    "180-10068-10349",
    "180-10068-10308",
    "180-10060-10450",
    "180-10070-10159",
    "180-10060-10473",
    "180-10070-10143",
    "180-10068-10306",
    "180-10068-10310",
    "180-10060-10472",
    "180-10070-10154",
    "180-10060-10452",
    "180-10060-10468",
    "180-10060-10491",
    "180-10068-10326",
    "180-10147-10261",
    "180-10060-10475",
    "180-10060-10463",
    "180-10070-10145",
    "180-10070-10169",
    "180-10068-10317",
    "180-10070-10173",
    "180-10060-10442",
    "180-10070-10164",
    "180-10068-10361",
    "180-10060-10458",
    "180-10068-10300",
    "180-10060-10462"
  ]
}