{
  "entity_name": "Robert Scheer",
  "entity_type": "tag",
  "document_count": 25,
  "summary": "Robert Scheer was a subject of FBI and U.S. Army investigations, primarily during the 1950s and 1960s. The investigations focused on his employment history, political affiliations, and potential security risks. Documents reveal scrutiny of his employment at various companies and organizations, including Laufer's River View Lodge, Repeat-O-Type Stencil Manufacturing Company, S. Klein Department Stores, and the City University of New York. His involvement with leftist political organizations such as the Fair Play For Cuba Committee, Students for a Democratic Society, Vietnam Day Committee, Communist Party, and Socialist Workers Party raised concerns. The Army considered him for induction but also assessed his security risk, ultimately recommending against granting him security clearance and even considering rejecting him for service. He was a candidate for US Congress in Berkeley, California in 1966. He refused to complete Armed Forces Security Questionnaires, citing constitutional rights. The investigations included local agency checks, interviews, and collection of personal information, including his social security number and date of birth.",
  "key_connections": [
    "Fair Play For Cuba Committee",
    "Students for a Democratic Society",
    "Vietnam Day Committee",
    "Communist Party",
    "Socialist Workers Party",
    "Laufer's River View Lodge",
    "Repeat-O-Type Stencil Manufacturing Company",
    "S. Klein Department Stores",
    "City University of New York",
    "Rampart Magazine"
  ],
  "significance": "Robert Scheer's significance in the JFK assassination context is primarily related to the extensive background investigations conducted on him by the FBI and U.S. Army due to his political affiliations and activities. While the documents do not directly link him to the assassination, his name appears in the JFK assassination records collection, suggesting that his background was reviewed as part of the broader investigation into individuals and groups of interest.",
  "document_ids": [
    "194-10006-10185",
    "194-10005-10105",
    "194-10002-10203_redacted",
    "194-10006-10188",
    "194-10006-10184",
    "194-10005-10030",
    "194-10002-10187",
    "194-10002-10216",
    "194-10006-10183",
    "194-10006-10195",
    "194-10006-10141",
    "194-10005-10066",
    "194-10006-10198",
    "194-10006-10197",
    "194-10006-10178",
    "194-10006-10181",
    "194-10005-10064",
    "194-10006-10180",
    "194-10006-10196",
    "194-10005-10140",
    "194-10006-10187",
    "194-10005-10063",
    "194-10001-10381",
    "194-10005-10042",
    "194-10006-10186"
  ]
}