{
  "entity_name": "FRD",
  "entity_type": "tag",
  "document_count": 12,
  "summary": "The Foreign Resources Division (FRD) of the CIA was involved in recruiting foreign intelligence sources within the U.S., with the full concurrence of the FBI. The FRD's activities are documented in the context of anti-Castro Cuban groups and individuals, including Julio Lanier Hevia, Manuel Ray y Rivero, and others, covering the period from 1960 to 1963. The documents also mention a large FRD plan involving Cuban exiles, including potential military actions and training camps in Mexico. The FRD's role is highlighted in the context of operational support, security concerns, and assessments of other anti-Castro groups and leaders. The documents suggest that the FRD was actively involved in planning and supporting anti-Castro activities, including potential military actions and propaganda efforts.",
  "key_connections": [
    "FBI",
    "Julio Lanier Hevia",
    "Manuel Ray y Rivero",
    "AMTIM",
    "Roberto de Varona",
    "Dr. MIRO Cardona",
    "Orlando Bosch",
    "Ricardo Morales",
    "Joaquin Godoy",
    "Jorge Nobregas",
    "Dunney Perez Alamo",
    "Francisco Rodriguez Tamayo",
    "Juan Manuel Salvat Roque",
    "Jose Ignacio Rasco",
    "Amador Odio",
    "AMBRUSH"
  ],
  "significance": "The FRD's significance in the JFK assassination context lies in its involvement with anti-Castro Cuban groups and individuals, some of whom may have had connections to the assassination. The documents suggest that the FRD was actively involved in planning and supporting anti-Castro activities, which could have created a network of individuals with motives to harm President Kennedy. The mention of a missing plan to assassinate Fidel Castro, while not directly linked to the JFK assassination, highlights the FRD's involvement in covert operations and the potential for such activities to have unintended consequences.",
  "document_ids": [
    "180-10145-10269",
    "104-10213-10314",
    "104-10161-10502",
    "180-10143-10456",
    "104-10179-10025",
    "104-10236-10075",
    "104-10146-10062",
    "104-10171-10106",
    "104-10227-10150",
    "180-10145-10308",
    "104-10308-10044",
    "180-10145-10295"
  ]
}