{
  "entity_name": "ARRB",
  "entity_type": "tag",
  "document_count": 42,
  "summary": "The Assassination Records Review Board (ARRB) was established to oversee the release of JFK assassination records under the JFK Assassination Records Collection Act of 1992. The ARRB worked to identify, declassify, and make available to the public records related to the assassination, balancing transparency with the need to protect sensitive intelligence sources and methods. The ARRB engaged with various government agencies, particularly the CIA, to review documents, negotiate redactions, and resolve disputes over the release of information. The documents reveal ongoing negotiations between the ARRB and the CIA regarding the release of sensitive information, including the identities of CIA employees and assets, covert operations, and liaison relationships with foreign intelligence services. The ARRB's work involved making formal determinations on the public disclosure of CIA records and addressing concerns about potential damage to national security and intelligence operations.",
  "key_connections": [
    "CIA",
    "JFK Assassination Records Collection Act of 1992",
    "Department of State",
    "HSCA",
    "Lee Harvey Oswald",
    "KGB/FSB/SVR",
    "Director of Central Intelligence George Tenet"
  ],
  "significance": "The ARRB played a crucial role in ensuring the release of JFK assassination records to the public, promoting transparency and accountability in the investigation of the assassination. Their interactions with the CIA highlight the challenges of balancing the public's right to know with the protection of national security interests. The ARRB's decisions and negotiations shaped the scope of information available to researchers and the public regarding the JFK assassination.",
  "document_ids": [
    "104-10331-10080",
    "104-10333-10008",
    "104-10326-10016",
    "104-10330-10070",
    "104-10333-10013",
    "104-10331-10166",
    "104-10332-10000",
    "104-10331-10127",
    "104-10326-10017",
    "104-10331-10202",
    "104-10328-10038",
    "104-10330-10010",
    "104-10331-10321",
    "104-10331-10209",
    "104-10333-10002",
    "104-10331-10177",
    "104-10332-10007",
    "104-10326-10010",
    "180-10071-10000",
    "104-10336-10034",
    "104-10331-10134",
    "104-10331-10118",
    "104-10326-10012",
    "104-10332-10009",
    "104-10330-10081",
    "104-10331-10154",
    "104-10331-10338",
    "104-10331-10178",
    "104-10332-10008",
    "104-10331-10139",
    "104-10336-10000",
    "104-10331-10226",
    "104-10333-10001",
    "104-10331-10318",
    "104-10332-10023",
    "104-10331-10132",
    "104-10333-10006",
    "104-10331-10149",
    "104-10332-10002",
    "104-10332-10022",
    "104-10331-10152",
    "104-10331-10353"
  ]
}