{
  "entity_name": "Senate Select Committee",
  "entity_type": "tag",
  "document_count": 25,
  "summary": "The Senate Select Committee, also known as the Church Committee, was a U.S. Senate committee established in 1975 to investigate intelligence activities conducted by the CIA, FBI, and other governmental organizations. The documents reflect the committee's wide-ranging inquiries into various aspects of intelligence operations, including covert actions, relationships with foreign intelligence agencies (like Israeli intelligence), domestic surveillance, and potential abuses of power. The committee sought access to classified documents and conducted hearings featuring testimony from key figures within the intelligence community, such as James Angleton and E. Howard Hunt. The documents also reveal concerns about the authority of Congress to declassify information and the sensitivity of sources and methods. The timeline of involvement spans from at least 1974 to 1977, with a concentration of activity in 1975 and 1976. A notable pattern is the FBI's careful management of information provided to the committee, balancing transparency with the protection of sensitive intelligence sources and ongoing operations.",
  "key_connections": [
    "CIA",
    "FBI",
    "James Angleton",
    "E. Howard Hunt",
    "Israeli Intelligence",
    "Frank Church",
    "Richard Goodwin",
    "Stanley Levison",
    "Martin Luther King Jr.",
    "Patrice Lumumba",
    "Fidel Castro",
    "Warren Commission",
    "Bronson Tweedy"
  ],
  "significance": "While the documents do not directly link the Senate Select Committee to the JFK assassination investigation, they reveal the committee's investigation into CIA plots against Fidel Castro, which is relevant to theories surrounding potential Cuban involvement in the assassination. Additionally, the committee's broader investigation into CIA activities and potential abuses of power could indirectly shed light on the agency's actions and knowledge related to the assassination.",
  "document_ids": [
    "104-10095-10263",
    "178-10003-10176",
    "124-10274-10001",
    "124-10276-10400",
    "124-10271-10299",
    "157-10014-10089",
    "124-10183-10277_multirif_redacted",
    "124-10273-10007_multirif",
    "104-10062-10073",
    "124-10274-10029_multirif_redacted",
    "104-10102-10043",
    "124-10271-10303",
    "124-10274-10011 (c06716583)",
    "157-10014-10121",
    "124-10185-10099_multirif",
    "157-10005-10228",
    "157-10014-10005",
    "180-10145-10446",
    "124-10238-10333_multirif",
    "124-10271-10011_multirif",
    "124-10274-10029",
    "157-10014-10081",
    "124-10238-10329_multirif",
    "104-10418-10103",
    "124-10273-10053"
  ]
}