{
  "entity_name": "Payroll Authorization",
  "entity_type": "tag",
  "document_count": 46,
  "summary": "Payroll Authorization forms are administrative documents used by the House Select Committee on Assassinations (HSCA) to authorize and record the payment of salaries to its staff. These forms typically include details such as the employee's name, position, salary, employment dates, and authorizing signatures. Many documents related to payroll authorization also include Final Determination Notifications from the Assassination Records Review Board (ARRB), which often concern the postponement of Social Security numbers from public release to protect personal privacy. The documents reveal a pattern of redacting Social Security numbers from payroll records to comply with privacy regulations while still providing access to other employment details. These records provide insight into the staffing and financial operations of the HSCA during its investigation into the JFK assassination and the assassination of Martin Luther King. The documents also reveal the ARRB's role in balancing historical transparency with individual privacy rights.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Assassination Records Review Board (ARRB)",
    "HSCA Staff",
    "Social Security Numbers",
    "Martin Luther King Task Force",
    "John F. Kennedy Task Force"
  ],
  "significance": "Payroll authorization forms are significant in the JFK assassination context because they provide a record of the individuals who worked for the HSCA, the committee responsible for reinvestigating the assassination. These records offer insights into the scope and nature of the HSCA's investigation, including the roles and responsibilities of various staff members. The ARRB's involvement in redacting Social Security numbers highlights the tension between the public's right to know and the protection of individual privacy in the context of historical records related to the assassination.",
  "document_ids": [
    "180-10068-10303",
    "180-10147-10259",
    "180-10068-10315",
    "180-10060-10436",
    "180-10060-10477",
    "180-10060-10498",
    "180-10070-10171",
    "180-10060-10441",
    "180-10068-10362",
    "180-10060-10482",
    "180-10060-10495",
    "180-10068-10363",
    "180-10068-10318",
    "180-10060-10440",
    "180-10068-10359",
    "180-10070-10150",
    "180-10147-10258",
    "180-10070-10161",
    "180-10060-10492",
    "180-10068-10344",
    "180-10068-10313",
    "180-10070-10157",
    "180-10147-10265",
    "180-10071-10001",
    "180-10147-10264",
    "180-10068-10312",
    "180-10068-10298",
    "180-10068-10349",
    "180-10070-10175",
    "180-10060-10473",
    "180-10068-10350",
    "180-10068-10307",
    "180-10068-10347",
    "180-10068-10310",
    "180-10070-10154",
    "180-10070-10158",
    "180-10060-10475",
    "180-10068-10317",
    "180-10060-10459",
    "180-10068-10321",
    "180-10060-10438",
    "180-10070-10173",
    "180-10068-10336",
    "180-10070-10148",
    "180-10060-10478",
    "180-10147-10260"
  ]
}