{
  "entity_name": "Administrative",
  "entity_type": "tag",
  "document_count": 24,
  "summary": "The 'Administrative' tag encompasses documents related to the internal operations, personnel management, and record-keeping practices of various organizations, primarily the CIA and the House Select Committee on Assassinations (HSCA). These documents include certification reports detailing employee salaries and positions, message routing and distribution lists, personnel action requests, and notifications of military cover backstops. They also cover the CIA's systems for tracking individuals of interest (the '201 system'), declassification processes, and responses to inquiries from the Assassination Records Review Board (ARRB). The documents span a period from the 1950s to the late 1990s, indicating ongoing administrative functions within these organizations. A notable pattern is the focus on maintaining secrecy and managing personnel information, particularly in the context of covert operations and investigations into the JFK assassination.",
  "key_connections": [
    "CIA",
    "House Select Committee on Assassinations (HSCA)",
    "Assassination Records Review Board (ARRB)",
    "Personnel",
    "Margo E. Jackson",
    "Arthur G. VAIVADA",
    "Joseph B. Smith",
    "Paul D. Langevin",
    "David Atlee Philips",
    "AN VIO L. NEVES"
  ],
  "significance": "In the JFK assassination context, the 'Administrative' tag highlights the internal workings of organizations involved in investigating the assassination and managing related records. These documents provide insights into how these organizations operated, managed information, and handled personnel matters, which can be relevant to understanding the context surrounding the assassination and subsequent investigations. The administrative processes and decisions documented may have influenced the availability and interpretation of information related to the assassination.",
  "document_ids": [
    "180-10125-10078",
    "104-10510-10090",
    "104-10418-10439",
    "104-10295-10168",
    "180-10125-10079",
    "104-10326-10040",
    "104-10330-10133",
    "104-10422-10055",
    "104-10105-10212",
    "104-10124-10037",
    "104-10120-10290",
    "104-10519-10182",
    "104-10512-10102",
    "180-10060-10449",
    "104-10226-10024",
    "104-10051-10170",
    "104-10112-10204",
    "104-10291-10001",
    "104-10177-10121",
    "104-10326-10034",
    "180-10125-10082",
    "104-10106-10215",
    "104-10163-10176",
    "104-10120-10274"
  ]
}