{
  "entity_name": "Select Committee on Assassinations",
  "entity_type": "tag",
  "document_count": 34,
  "summary": "The Select Committee on Assassinations (HSCA) was a U.S. House of Representatives committee established in 1976 to investigate the assassinations of President John F. Kennedy and Martin Luther King Jr. The documents primarily consist of payroll records and related administrative paperwork from 1977 to 1979. These records detail the committee's staffing, including employee names, positions, salaries, and employment dates. The Assassination Records Review Board (ARRB) is mentioned in relation to the postponed release of certain HSCA staff payroll information, specifically Social Security numbers, to protect personal privacy. The documents provide insight into the operational aspects of the committee, particularly its financial management and personnel administration during its investigation.",
  "key_connections": [
    "Assassination Records Review Board (ARRB)",
    "U.S. House of Representatives",
    "Louis Parisi",
    "Phoebe Curtis Orr",
    "Jacqueline Hess",
    "Antoinette M. Roberts",
    "Clifford A. Fenton, Jr.",
    "Ann Furnald Taylor",
    "Francis J. Kelly"
  ],
  "significance": "The Select Committee on Assassinations was responsible for reinvestigating the JFK assassination, aiming to provide a definitive conclusion regarding the events and potential conspiracies. While the documents provided focus on the administrative and payroll aspects of the committee's operations, they indirectly highlight the scale and scope of the investigation, as well as the number of personnel involved. The ARRB's involvement in reviewing and potentially redacting HSCA records underscores the ongoing efforts to balance transparency with personal privacy concerns related to the assassination investigations.",
  "document_ids": [
    "180-10060-10498",
    "180-10125-10078",
    "180-10125-10081",
    "180-10125-10107",
    "180-10060-10495",
    "180-10125-10106",
    "180-10060-10440",
    "180-10125-10096",
    "180-10125-10079",
    "180-10070-10146",
    "180-10125-10075",
    "180-10125-10091",
    "180-10125-10087",
    "180-10125-10101",
    "180-10068-10349",
    "180-10125-10090",
    "180-10125-10103",
    "180-10070-10163",
    "180-10125-10085",
    "180-10125-10093",
    "180-10125-10089",
    "180-10125-10088",
    "180-10125-10092",
    "180-10125-10084",
    "180-10125-10102",
    "180-10125-10076",
    "180-10125-10105",
    "180-10125-10083",
    "180-10125-10095",
    "180-10060-10455",
    "180-10125-10094",
    "180-10125-10082",
    "180-10125-10104",
    "180-10125-10098"
  ]
}