{
  "entity_name": "Employment History",
  "entity_type": "tag",
  "document_count": 23,
  "summary": "The documents tagged with \"Employment History\" primarily consist of personnel and payroll records, agent reports, and biographical profiles related to individuals connected to the House Select Committee on Assassinations (HSCA), the CIA, and other organizations. These records detail individuals' work history, positions held, salary information, performance reviews, and reasons for leaving employment. The documents also include investigations into individuals' backgrounds, including discrepancies in employment records. A notable pattern is the postponement of Social Security numbers from HSCA staff payroll records to protect personal privacy. The documents also reveal the employment history of individuals who may have been of interest to the CIA or FBI, including Robert Scheer and Manuel Marti. These records serve as a means of verifying individuals' backgrounds, assessing their suitability for positions of trust, and documenting their involvement with various organizations.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "CIA",
    "FBI",
    "Robert Scheer",
    "Manuel Marti",
    "Giulia M. Barrow",
    "Louis H. Hindle",
    "Mary Susan Grimes",
    "Sheila Jackson Lee",
    "William Vincent Broe",
    "Emilio Americo Rodriguez",
    "Rita L. Morton",
    "Sari Mordana",
    "Robert Tyler Shaw",
    "E. Howard Hunt, Jr.",
    "Lucien Conein",
    "Rebecca Wheeler Martin",
    "Denise L. McCray",
    "Cornish F. Hitchcock"
  ],
  "significance": "In the JFK assassination context, employment history is significant for verifying the backgrounds and affiliations of individuals involved in the investigation or those who may have had connections to relevant organizations. These records can help establish potential motives, identify conflicts of interest, and provide insights into the individuals' roles and responsibilities.",
  "document_ids": [
    "180-10068-10303",
    "180-10060-10441",
    "194-10004-10382",
    "104-10146-10198",
    "194-10005-10105",
    "180-10068-10363",
    "194-10002-10216",
    "180-10060-10467",
    "104-10061-10207",
    "104-10136-10324",
    "104-10129-10002",
    "180-10060-10490",
    "180-10060-10486",
    "104-10222-10040",
    "104-10194-10023",
    "194-10005-10064",
    "104-10222-10041",
    "180-10060-10475",
    "194-10005-10063",
    "194-10004-10379",
    "180-10060-10480",
    "194-10004-10380",
    "180-10060-10442"
  ]
}