{
  "entity_name": "Payroll",
  "entity_type": "tag",
  "document_count": 45,
  "summary": "The documents primarily concern payroll records and certifications for the U.S. House of Representatives Select Committee on Assassinations (HSCA) from 1977 to 1979. These records detail employee names, positions, social security numbers (often redacted), annual salaries, and gross pay for specific accounting periods. The documents include payroll certifications, certification reports, payroll authorization forms, and related memoranda. A notable pattern is the consistent reporting of employee compensation and positions within the HSCA, along with certifications ensuring no familial relations with members of Congress. Some documents also address the postponement of releasing certain payroll information, such as Social Security numbers, due to privacy concerns. Outside of the HSCA, one document mentions a contract renewal and payroll information request related to Frank A. Johnson in 1963, and another discusses placing a subject on the JMWAVE payroll in 1964.",
  "key_connections": [
    "U.S. House of Representatives Select Committee on Assassinations (HSCA)",
    "HSCA employees (e.g., Brenda L. Welburn, Ernestine G. Johnson, Stephen J. Fallis, Charles Michael Berk, Belford L. Lawson III, Gene R. Johnson, Joan Talbert Thornell, Judith R. Burford, Jan Richard Schlichtmann, Nancy P. Schultz, Helen Whitney Watriss)",
    "Frank A. Johnson",
    "JMWAVE"
  ],
  "significance": "In the JFK assassination context, payroll records are significant for documenting the staffing and financial operations of the HSCA, which was formed to investigate the assassination. These records provide insight into who was involved in the investigation, their roles, and their compensation. The records also highlight concerns around privacy and the handling of sensitive personal information within the context of a high-profile investigation. The JMWAVE payroll connection is related to covert operations during the Cold War era, and is not directly related to the JFK assassination.",
  "document_ids": [
    "180-10125-10097",
    "180-10125-10078",
    "180-10125-10081",
    "180-10125-10107",
    "104-10077-10067",
    "180-10125-10106",
    "180-10125-10080",
    "180-10125-10096",
    "180-10125-10079",
    "180-10070-10170",
    "180-10125-10075",
    "180-10060-10451",
    "180-10125-10091",
    "180-10125-10087",
    "180-10125-10101",
    "180-10068-10345",
    "180-10125-10100",
    "180-10125-10086",
    "180-10125-10090",
    "180-10125-10103",
    "180-10125-10085",
    "180-10125-10093",
    "180-10060-10465",
    "180-10125-10089",
    "180-10068-10306",
    "180-10125-10088",
    "180-10060-10464",
    "180-10060-10452",
    "180-10125-10092",
    "180-10125-10084",
    "180-10125-10102",
    "104-10247-10070",
    "180-10070-10153",
    "180-10070-10169",
    "180-10125-10076",
    "180-10125-10105",
    "180-10125-10083",
    "180-10125-10095",
    "180-10125-10094",
    "180-10070-10164",
    "180-10125-10104",
    "180-10068-10320",
    "180-10125-10077",
    "180-10125-10098",
    "180-10070-10152"
  ]
}