{
  "entity_name": "Nosenko",
  "entity_type": "tag",
  "document_count": 17,
  "summary": "Yuriy Ivanovich Nosenko was a KGB officer who defected to the United States. A significant portion of the documents relate to the CIA's investigation into Nosenko's bona fides, including interviews, polygraph tests, and analysis to determine if he was a genuine defector or a plant by the KGB. The documents also mention his potential interrogation regarding the Wallenberg case. Nosenko's testimony before the House Select Committee on Assassinations (HSCA) on June 20, 1978, specifically addressed Lee Harvey Oswald's time in the Soviet Union and the KGB's alleged lack of interest in him. The ARRB meetings also discussed the release of Nosenko NBR records. There are also documents that discuss the methodology used to verify and correct previous transcriptions of a 1962 tape involving Nosenko, specifically focusing on whether Nosenko stated he had been in the United States or used the alias Nikolayev there.",
  "key_connections": [
    "John McCone",
    "President Johnson",
    "President Mateos",
    "Tennent Bagley",
    "Chairman Stokes",
    "HSCA",
    "PDLADLE",
    "James Angleton",
    "Rockefeller Commission",
    "Lee Harvey Oswald",
    "KGB",
    "Sam Jaffe",
    "FBI"
  ],
  "significance": "Nosenko's significance in the JFK assassination context lies in his role as a KGB defector who potentially had information about Lee Harvey Oswald's time in the Soviet Union. His testimony and the CIA's investigation into his defection were considered relevant to understanding whether the KGB had any involvement with Oswald or the assassination. The debate over his bona fides and the information he provided were subjects of scrutiny by various committees and investigations related to the JFK assassination.",
  "document_ids": [
    "177-10001-10445",
    "104-10331-10202",
    "104-10322-10101",
    "104-10145-10436",
    "104-10331-10209",
    "104-10150-10004",
    "104-10227-10003",
    "104-10172-10257",
    "178-10004-10396",
    "178-10004-10115",
    "104-10145-10262",
    "104-10172-10255",
    "104-10331-10226",
    "104-10534-10173",
    "180-10131-10324",
    "104-10147-10202",
    "104-10106-10188"
  ]
}