{
  "entity_name": "House Select Committee on Assassinations",
  "entity_type": "tag",
  "document_count": 43,
  "summary": "The House Select Committee on Assassinations (HSCA) was a U.S. House of Representatives committee established in 1976 to investigate the assassinations of President John F. Kennedy and Martin Luther King Jr. The documents reveal the HSCA's interactions with various government agencies, particularly the CIA, focusing on obtaining information, conducting interviews, and reviewing documents related to the assassinations. The CIA provided guidelines for cooperation with the HSCA, emphasizing the protection of sources and operational security. The HSCA requested information on various individuals, entities, and CIA procedures, including the 201 file system and nonofficial cover officers. The documents also include payroll records and personnel information of HSCA staff, reflecting the committee's operational activities and administrative functions. The timeline of involvement spans from 1976 to 1978, with the committee actively seeking information and conducting investigations during this period. A notable pattern across the documents is the CIA's cautious approach to the HSCA's inquiries, balancing cooperation with the need to protect sensitive information and sources.",
  "key_connections": [
    "CIA",
    "FBI",
    "Senate Appropriations Committee",
    "Senate Foreign Relations Committee",
    "Office of Legislative Counsel",
    "President John F. Kennedy",
    "Martin Luther King Jr.",
    "James Earl Ray",
    "William K. Harvey",
    "Yuriy Ivanovich Nosenko",
    "E. Howard Hunt, Jr.",
    "Permindex Corporation"
  ],
  "significance": "The House Select Committee on Assassinations played a crucial role in reinvestigating the JFK assassination, seeking to uncover new evidence and assess previous investigations. Its interactions with the CIA and other agencies highlight the complexities of accessing classified information and the challenges of conducting a thorough investigation into a politically sensitive event. The HSCA's findings and conclusions have contributed to the ongoing debate and discussion surrounding the JFK assassination.",
  "document_ids": [
    "104-10140-10420",
    "180-10125-10097",
    "180-10060-10441",
    "104-10195-10002",
    "104-10145-10047",
    "180-10060-10483",
    "104-10165-10087",
    "180-10068-10363",
    "104-10067-10043",
    "104-10337-10001",
    "180-10125-10080",
    "104-10218-10008",
    "104-10193-10076",
    "104-10065-10069",
    "104-10291-10009",
    "180-10068-10309",
    "104-10193-10163",
    "180-10070-10161",
    "104-10067-10044",
    "180-10071-10001",
    "104-10213-10352",
    "104-10065-10075",
    "180-10070-10160",
    "104-10226-10117",
    "104-10067-10046",
    "104-10227-10000",
    "104-10146-10308",
    "180-10060-10445",
    "104-10221-10022",
    "104-10165-10077",
    "104-10065-10105",
    "104-10194-10023",
    "180-10140-10152",
    "180-10060-10464",
    "104-10151-10188",
    "104-10142-10279",
    "104-10061-10214",
    "104-10140-10101",
    "104-10079-10163",
    "180-10060-10442",
    "180-10070-10148",
    "104-10142-10055",
    "104-10147-10202"
  ]
}