{
  "entity_name": "Assassination Records Review Board",
  "entity_type": "sender",
  "document_count": 14,
  "summary": "The Assassination Records Review Board (ARRB) is a U.S. government entity responsible for reviewing and releasing documents related to the assassination of President John F. Kennedy. The ARRB's primary role, as evidenced by the documents, involved making final determinations regarding the release of sensitive information, particularly Social Security numbers, within the payroll records of the House Select Committee on Assassinations (HSCA). The ARRB frequently issued notifications postponing the release of this information to protect personal privacy. The documents indicate that the ARRB was active in the mid-1990s, specifically around December 1995, when many of these final determination notifications were issued. A notable pattern across the documents is the consistent postponement of Social Security number releases from HSCA staff payroll records.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Michael C. Eberhardt",
    "Jacqueline Hess",
    "Sheryl Lynn Bonifer",
    "Nancy S. Jenkins",
    "S. Jonathan Blackmer",
    "Elizabeth K. Selleck",
    "Billie Gay Larson",
    "Marlin Risinger III",
    "Carolyn Hansen Amato"
  ],
  "significance": "The Assassination Records Review Board played a crucial role in the JFK assassination context by overseeing the declassification and release of government documents related to the event. Their work ensured transparency and facilitated public access to information, although they also balanced this with privacy concerns by postponing the release of certain sensitive data. The ARRB's actions directly impacted the availability of information about the HSCA's investigation into the assassination.",
  "document_ids": [
    "180-10068-10339",
    "180-10060-10440",
    "180-10060-10447",
    "180-10068-10352",
    "180-10068-10313",
    "180-10060-10450",
    "180-10068-10310",
    "180-10060-10472",
    "180-10070-10154",
    "104-10333-10001",
    "180-10060-10463",
    "180-10070-10145",
    "180-10068-10336",
    "180-10068-10300"
  ]
}