{
  "entity_name": "Central Cover Staff",
  "entity_type": "tag",
  "document_count": 12,
  "summary": "The Central Cover Staff (CCS) was a CIA component responsible for establishing and maintaining cover for CIA agents and operations. This involved creating false identities, employment histories, and organizational affiliations to conceal the true nature of their work. The CCS played a role in providing cover for agents working with the Special Affairs Staff (SAS) and explored potential cover support from organizations like The Wackenhut Corporation. The CCS also managed foreign awards and decorations received by CIA personnel. A significant portion of the documents relate to requests from the House Select Committee on Assassinations (HSCA) for information on various individuals and entities, with the CCS providing details from their files regarding Agency affiliations, cover status, and other relevant information. The documents span from 1963 to 1978, indicating a long-term involvement in providing cover support for CIA activities.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Wackenhut Corporation",
    "Special Affairs Staff (SAS)",
    "Marie L. PRISBECH (Heda Massing)",
    "Ross Crozier",
    "George DeMohrenschildt",
    "Leo Cherne",
    "William Harvey",
    "International Rescue Committee",
    "Richard Helms",
    "James Angleton",
    "Raymond Rocca",
    "Thomas Lee Roberts",
    "Itkin",
    "Conestoga Group",
    "Office of the General Counsel",
    "State Department"
  ],
  "significance": "In the context of the JFK assassination, the Central Cover Staff's significance lies in its role in providing cover for individuals and organizations that may have been connected to the assassination or subsequent investigations. The HSCA's interest in CCS files suggests a concern that cover operations may have obscured relevant information or protected individuals involved in the assassination. The CCS files were reviewed for information on individuals and entities of interest to the HSCA, indicating a potential link between the CIA's cover operations and the assassination investigation.",
  "document_ids": [
    "104-10059-10026",
    "104-10061-10132",
    "104-10215-10004",
    "104-10061-10181",
    "104-10061-10292",
    "104-10130-10472",
    "104-10059-10057",
    "104-10061-10320",
    "104-10061-10265",
    "104-10121-10236",
    "104-10061-10214",
    "104-10107-10085"
  ]
}