{
  "entity_name": "Che Guevara",
  "entity_type": "person-mentioned",
  "document_count": 30,
  "summary": "Ernesto \"Che\" Guevara was a prominent figure in the Cuban Revolution and a key leader under Fidel Castro. The documents suggest that Guevara's significance lies primarily in the context of Cuban subversion and support for revolutionary movements in Latin America during the 1960s. He is mentioned in connection with Cuban efforts to train and support guerrillas, spread propaganda, and provide financial assistance to pro-Castro groups. While not directly implicated in the JFK assassination, his name appears in documents related to investigations into possible Cuban involvement, though the Latin America Division (LAD) report found no definitive proof. Guevara's disappearance is also mentioned as an event exploited by CIA-supported organizations for propaganda purposes. The documents highlight his role in the broader context of Cold War tensions and U.S. efforts to counter Cuban influence in the region.",
  "key_connections": [
    "Fidel Castro",
    "Eloy Gutierrez Menoyo",
    "Annie de Quendoz",
    "Roselio Montegro Quasp",
    "Cuban Intelligence Service",
    "Trujillo",
    "Lumumba"
  ],
  "significance": "While Che Guevara is not directly linked to the JFK assassination in these documents, his name arises in the context of investigations into potential Cuban involvement. The Latin America Division (LAD) report found no definitive proof of Cuban complicity. His significance is more strongly tied to his role in Cuban subversion efforts in Latin America, which were a major concern for the U.S. government during the Cold War.",
  "document_ids": [
    "124-90135-10074",
    "104-10177-10206",
    "104-10103-10112",
    "104-10247-10097",
    "104-10075-10365",
    "104-10072-10315",
    "198-10005-10018",
    "198-10009-10098",
    "198-10009-10099",
    "104-10247-10064",
    "104-10506-10028",
    "104-10308-10163",
    "104-10302-10021",
    "104-10225-10009",
    "177-10002-10012",
    "198-10008-10119",
    "198-10007-10021",
    "104-10338-10018",
    "157-10014-10100",
    "104-10102-10237",
    "104-10170-10121",
    "104-10302-10019",
    "104-10215-10128",
    "104-10234-10007",
    "157-10008-10238",
    "104-10183-10355",
    "119-10021-10413",
    "157-10005-10297",
    "104-10216-10398",
    "177-10001-10305"
  ]
}