{
  "entity_name": "Cuban Embassy",
  "entity_type": "tag",
  "document_count": 23,
  "summary": "The Cuban Embassy appears frequently in documents related to the JFK assassination, primarily in the context of Lee Harvey Oswald's activities in Mexico City and the CIA's surveillance operations. The documents suggest that Oswald visited both the Cuban and Soviet Embassies in Mexico City in September 1963, seeking visas. The CIA's Project LIENVOY involved monitoring the Cuban Embassy's communications, including telephone intercepts. There are also reports of Cuban officials' reactions to Kennedy's assassination and concerns about potential repercussions. The documents also mention possible contacts between Cuban Embassy officials and Guatemalan rebels, as well as interactions with individuals of interest to Cuban intelligence. The Cuban Embassy in London is mentioned in connection to intercepted conversations regarding the Kennedy assassination.",
  "key_connections": [
    "Lee Harvey Oswald",
    "CIA",
    "Soviet Embassy",
    "Mexico City",
    "Project LIENVOY",
    "KGB",
    "Fuerzas Armadas Rebeldes (FAR)",
    "Cuban intelligence officers",
    "Warren Commission"
  ],
  "significance": "The Cuban Embassy's significance in the JFK context lies in its potential connection to Lee Harvey Oswald's pre-assassination activities and the possibility of Cuban involvement or knowledge of the assassination plot. The surveillance of the embassy and Oswald's visits were of high interest to US intelligence agencies investigating the assassination. The documents suggest the US government was actively monitoring the Cuban Embassy and its personnel, seeking any information related to Oswald or potential Cuban involvement in the assassination.",
  "document_ids": [
    "124-10181-10009",
    "177-10001-10063",
    "180-10110-10100",
    "104-10413-10057",
    "180-10143-10113",
    "177-10001-10064",
    "104-10428-10012",
    "104-10187-10030",
    "104-10074-10413",
    "104-10102-10043",
    "104-10052-10130",
    "104-10103-10244",
    "180-10110-10484",
    "104-10181-10011",
    "104-10216-10238",
    "157-10004-10144",
    "104-10071-10257",
    "104-10413-10306",
    "104-10072-10228",
    "124-10280-10057",
    "104-10188-10012",
    "124-10279-10107",
    "124-10058-10420"
  ]
}