{
  "entity_name": "Garrison Investigation",
  "entity_type": "tag",
  "document_count": 7,
  "summary": "The Garrison Investigation refers to the inquiry led by New Orleans District Attorney Jim Garrison into the assassination of President John F. Kennedy. The investigation sought to uncover a conspiracy behind the assassination, exploring potential connections between various individuals and organizations. The CIA monitored and addressed claims related to the Garrison investigation, particularly those made by individuals like Gordon Novel, who claimed CIA affiliation. The investigation also prompted the Agency to examine potential links between individuals like William Wayne Dalzell and Emilio Santana Galindo, and organizations such as Schlumberger Well Surveying Corporation, to the assassination. The documents span from the 1960s to the 1970s, reflecting the period of the initial investigation and subsequent reviews of related files.",
  "key_connections": [
    "Jim Garrison",
    "John F. Kennedy Assassination",
    "Gordon Novel",
    "William Wayne Dalzell",
    "Emilio Santana Galindo",
    "Schlumberger Well Surveying Corporation",
    "CIA",
    "Julio Lanier Hevia",
    "Manuel Ray y Rivero",
    "John Garrett Underhill Jr.",
    "Samuel George Cummings",
    "INTERARMCO"
  ],
  "significance": "The Garrison Investigation is significant in the JFK assassination context as it represents a formal attempt to uncover a conspiracy beyond the official findings of the Warren Commission. It led to scrutiny of various individuals and organizations, some with alleged ties to the CIA, and fueled conspiracy theories surrounding the assassination. The CIA's monitoring and response to the investigation highlight the Agency's concern over potential exposure of its activities and personnel.",
  "document_ids": [
    "104-10170-10145",
    "180-10145-10269",
    "104-10012-10076",
    "104-10305-10000",
    "104-10170-10171",
    "104-10106-10716",
    "104-10170-10146"
  ]
}