{
  "entity_name": "HCO",
  "entity_type": "recipient",
  "document_count": 21,
  "summary": "Based on the provided documents, \"HCO\" appears to be a designator used by the National Security Agency (NSA) to mark documents that are sent to or received by the agency. The documents themselves primarily concern international reactions to President John F. Kennedy's assassination in November 1963. These reactions include official condolences from various governments (Bulgaria, Iran, Morocco, Norway, El Salvador), reports on public sentiment (Hungary, Tanganyika), security measures taken in response (Cuba, Soviet Union), and commentary from political figures and the press in various countries (France, Syria, Ghana, Finland). Some documents also relate to the arrangements for Kennedy's funeral, including the composition of delegations (Morocco, Ghana, Tunisia) and messages of appreciation from Mrs. Kennedy. One document mentions a Spanish Counselor accused of espionage by Cuba. Another document references a speech by a Burmese monk comparing the fate of Ne Win to Diem and Kennedy. The documents span from November 1963 to December 1966, with the bulk concentrated in the immediate aftermath of the assassination.",
  "key_connections": [
    "John F. Kennedy",
    "Lyndon B. Johnson",
    "NSA (National Security Agency)",
    "Bulgaria",
    "Iran",
    "Morocco",
    "Norway",
    "El Salvador",
    "Hungary",
    "Tanganyika (Tanzania)",
    "Cuba",
    "Soviet Union",
    "France",
    "Syria",
    "Ghana",
    "Finland",
    "Tunisia",
    "Kwame Nkrumah",
    "Ne Win",
    "Ngo Dinh Diem",
    "Lee Harvey Oswald",
    "Republic of Korea (ROK)",
    "John McCloy"
  ],
  "significance": "The significance of \"HCO\" lies in its role as a recipient designator for NSA documents related to the immediate international response to President Kennedy's assassination. The documents provide insights into the global impact of the event, the diverse reactions of foreign governments and populations, and the diplomatic activities that followed.",
  "document_ids": [
    "144-10001-10088",
    "144-10001-10314",
    "144-10001-10174",
    "144-10001-10169",
    "144-10001-10305",
    "144-10001-10368",
    "144-10001-10348",
    "144-10001-10060",
    "144-10001-10349",
    "144-10001-10308",
    "144-10001-10304",
    "144-10001-10307",
    "144-10001-10171",
    "144-10001-10167",
    "144-10001-10371",
    "144-10001-10351",
    "144-10001-10081",
    "144-10001-10347",
    "144-10001-10107",
    "144-10001-10399",
    "144-10001-10101"
  ]
}