{
  "entity_name": "Informant",
  "entity_type": "tag",
  "document_count": 24,
  "summary": "The documents reference 'Informant' as a source of information for various agencies, including the FBI and CIA, across a range of investigations and operations. Informants provided details on individuals, organizations, and events related to Cuban activities, drug trafficking, Soviet dissenters, and potential security threats. Their information was used to gather intelligence on anti-Castro groups like Alpha 66, Cuban officials, and individuals with alleged Communist ties, such as Martin Luther King Jr. Informants also played a role in providing information on individuals connected to the Fair Play for Cuba Committee and delegates to youth festivals in Berlin. The reliability and potential exposure of informants were concerns, as seen in the case of Sam Jaffe, a CBS reporter who acted as an FBI informant. The timeline of involvement varies depending on the specific informant and case, spanning from the late 1950s to the 1970s. A notable pattern is the use of informants to gather intelligence on individuals and groups perceived as threats to national security or involved in illegal activities.",
  "key_connections": [
    "FBI",
    "CIA",
    "Alpha 66",
    "Cuban officials",
    "Martin Luther King Jr.",
    "Fair Play for Cuba Committee",
    "Sam Jaffe",
    "Soviet dissenters",
    "COINTELPRO",
    "Senate Select Committee on Intelligence Activities (SSC)",
    "Petros Moutsos",
    "David Ferrie",
    "Stanley Levison"
  ],
  "significance": "In the JFK context, informants were used to gather intelligence on individuals and groups potentially involved in activities related to Cuba and anti-Castro movements, which were areas of concern following the Cuban Revolution and during the Cold War. The documents suggest that informants were a key source of information for the FBI and CIA in monitoring these groups and individuals, though the specific relevance to the JFK assassination is not always explicitly stated but implied through the monitoring of individuals and groups of interest.",
  "document_ids": [
    "104-10069-10077",
    "124-90135-10074",
    "104-10177-10206",
    "180-10076-10105",
    "104-10119-10367",
    "104-10177-10047",
    "124-10212-10160",
    "124-10271-10003_multirif",
    "104-10114-10160",
    "104-10178-10071",
    "104-10308-10163",
    "124-10238-10333_multirif",
    "104-10120-10301",
    "124-10271-10011_multirif",
    "124-10274-10044",
    "104-10221-10222",
    "124-90137-10230",
    "124-10300-10012",
    "124-10213-10310",
    "104-10048-10252",
    "124-10238-10329_multirif",
    "104-10188-10454",
    "124-90137-10067",
    "104-10106-10188"
  ]
}