{
  "entity_name": "Payroll",
  "entity_type": "tag",
  "document_count": 45,
  "summary": "The documents primarily relate to the payroll records and certifications of the U.S. House of Representatives Select Committee on Assassinations (HSCA). These records detail employee names, positions, social security numbers (often redacted), annual salaries, and gross pay for specific accounting periods, typically monthly. The documents span from 1977 to 1979, with some related records dating back to 1963 and 1964 concerning contracts and operational matters. A recurring theme is the certification that employees performed their assigned duties and that they had no familial relations with members of Congress. Some documents also address the postponement of the release of Social Security numbers from HSCA staff payroll records due to privacy concerns. The payroll records provide a detailed account of the staffing and financial administration of the HSCA during its investigation.",
  "key_connections": [
    "U.S. House of Representatives Select Committee on Assassinations (HSCA)",
    "HSCA Staff",
    "Brenda L. Welburn",
    "Ernestine G. Johnson",
    "Stephen J. Fallis",
    "Gene R. Johnson",
    "Nancy P. Schultz",
    "Helen Whitney Watriss",
    "Joan Talbert Thornell",
    "Judith R. Burford",
    "Jan Richard Schlichtmann",
    "Belford L. Lawson III",
    "Charles Michael Berk",
    "Frank A. Johnson"
  ],
  "significance": "In the context of the JFK assassination, payroll records are significant for documenting the staffing and financial resources allocated to the House Select Committee on Assassinations (HSCA). They provide insight into who was employed by the committee, their roles, and their compensation, which can be relevant for understanding the scope and nature of the investigation. The records also reveal administrative processes and concerns related to privacy and potential conflicts of interest (e.g., familial relations with members of Congress). While the payroll records themselves do not directly address the assassination, they are essential for understanding the operational context of the HSCA's investigation.",
  "document_ids": [
    "180-10125-10097",
    "180-10125-10078",
    "180-10125-10081",
    "180-10125-10107",
    "104-10077-10067",
    "180-10125-10106",
    "180-10125-10080",
    "180-10125-10096",
    "180-10125-10079",
    "180-10070-10170",
    "180-10125-10075",
    "180-10060-10451",
    "180-10125-10091",
    "180-10125-10087",
    "180-10125-10101",
    "180-10068-10345",
    "180-10125-10100",
    "180-10125-10086",
    "180-10125-10090",
    "180-10125-10103",
    "180-10125-10085",
    "180-10125-10093",
    "180-10060-10465",
    "180-10125-10089",
    "180-10068-10306",
    "180-10125-10088",
    "180-10060-10464",
    "180-10060-10452",
    "180-10125-10092",
    "180-10125-10084",
    "180-10125-10102",
    "104-10247-10070",
    "180-10070-10153",
    "180-10070-10169",
    "180-10125-10076",
    "180-10125-10105",
    "180-10125-10083",
    "180-10125-10095",
    "180-10125-10094",
    "180-10070-10164",
    "180-10125-10104",
    "180-10068-10320",
    "180-10125-10077",
    "180-10125-10098",
    "180-10070-10152"
  ]
}