{
  "entity_name": "Senate Select Committee",
  "entity_type": "tag",
  "document_count": 25,
  "summary": "The Senate Select Committee, also known as the Church Committee, was a U.S. Senate committee established in 1975 to investigate intelligence activities conducted by governmental agencies, including the CIA and FBI. The documents reveal the committee's wide-ranging inquiries into various topics, such as covert operations, relationships with external organizations, assassinations, and intelligence collection capabilities. The committee requested documents and testimonies from various agencies and individuals, including the FBI, CIA, and former officials like James Angleton and E. Howard Hunt. The documents also highlight concerns about the release of classified information and the sensitivity of sources. The committee's work led to significant reforms in the intelligence community and increased congressional oversight.",
  "key_connections": [
    "CIA",
    "FBI",
    "Frank Church",
    "James Angleton",
    "E. Howard Hunt",
    "Richard Helms",
    "USIB",
    "National Security Council",
    "Lyndon B. Johnson Library",
    "Martin Luther King Jr.",
    "Stanley Levison",
    "Fidel Castro",
    "Warren Commission"
  ],
  "significance": "While the documents primarily focus on the Senate Select Committee's broader investigation of intelligence activities, some documents touch on topics relevant to the JFK assassination context. For example, the committee investigated CIA plots against Fidel Castro, which is relevant to theories about Cuban involvement in the assassination. Additionally, the committee examined the CIA's relationship with organized crime, which has been linked to potential assassination plots. The committee also scrutinized the CIA's handling of information related to assassination attempts, including potential omissions to the Warren Commission. The timeline of the committee's involvement is primarily in the mid-1970s, as it investigated past intelligence activities.",
  "document_ids": [
    "104-10095-10263",
    "178-10003-10176",
    "124-10274-10001",
    "124-10276-10400",
    "124-10271-10299",
    "157-10014-10089",
    "124-10183-10277_multirif_redacted",
    "124-10273-10007_multirif",
    "104-10062-10073",
    "124-10274-10029_multirif_redacted",
    "104-10102-10043",
    "124-10271-10303",
    "124-10274-10011 (c06716583)",
    "157-10014-10121",
    "124-10185-10099_multirif",
    "157-10005-10228",
    "157-10014-10005",
    "180-10145-10446",
    "124-10238-10333_multirif",
    "124-10271-10011_multirif",
    "124-10274-10029",
    "157-10014-10081",
    "124-10238-10329_multirif",
    "104-10418-10103",
    "124-10273-10053"
  ]
}