{
  "entity_name": "Senate Select Committee on Intelligence",
  "entity_type": "tag",
  "document_count": 13,
  "summary": "The Senate Select Committee on Intelligence (SSCI) is a committee of the United States Senate charged with oversight of the United States Intelligence Community. The documents indicate the SSCI's involvement in reviewing CIA files, including those related to the Lee Harvey Oswald case and the assassination of President Kennedy. The committee sought access to Office of Security files, prompting internal discussions within the CIA regarding the protection of sensitive sources and methods. The Office of Legislative Counsel served as a liaison between the CIA and the SSCI, managing information requests, arranging meetings, and addressing security concerns. The timeline of involvement spans from 1975 to 1990, with a concentration of activity in the late 1970s. A notable pattern is the CIA's concern over balancing transparency with the need to protect classified information and intelligence sources during interactions with the SSCI.",
  "key_connections": [
    "Office of Legislative Counsel",
    "House Select Committee on Assassinations",
    "CIA",
    "FBI",
    "Lee Harvey Oswald",
    "George de Mohrenschildt",
    "Paul Wallach",
    "Cuban Diplomats",
    "Soviet Diplomats"
  ],
  "significance": "In the JFK assassination context, the Senate Select Committee on Intelligence played a role in investigating potential intelligence failures or connections related to the assassination. Their inquiries into the Lee Harvey Oswald case and related files reflect an effort to understand the CIA's knowledge and actions prior to the assassination, while also raising concerns about protecting sensitive intelligence sources and methods.",
  "document_ids": [
    "104-10145-10047",
    "104-10066-10031",
    "104-10126-10253",
    "104-10146-10308",
    "104-10147-10301",
    "104-10422-10057",
    "104-10142-10317",
    "104-10096-10048",
    "104-10142-10279",
    "124-10185-10214",
    "104-10140-10101",
    "104-10310-10118",
    "104-10147-10202"
  ]
}