{
  "entity_name": "Social Security Number",
  "entity_type": "tag",
  "document_count": 43,
  "summary": "Social Security Numbers (SSNs) appear in the context of House Select Committee on Assassinations (HSCA) staff payroll records. These records, which include payroll authorization forms, leave records, and related correspondence, contain SSNs as part of employee identification and administrative tracking. A recurring pattern across the documents is the redaction or postponement of the release of SSNs by the Assassination Records Review Board (ARRB) to protect the personal privacy of HSCA staff members. The ARRB's Final Determination Notifications frequently accompany these payroll records, explaining the reasons for withholding SSNs from public release. The documents span from the late 1970s, during the HSCA's active investigation, to the mid-1990s when the ARRB reviewed and processed these records for release.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Assassination Records Review Board (ARRB)",
    "HSCA Staff Members",
    "Payroll Records",
    "Final Determination Notifications"
  ],
  "significance": "In the context of the JFK assassination records, Social Security Numbers themselves do not have direct significance to the assassination events. However, their presence in HSCA staff payroll records highlights the administrative and personnel aspects of the investigation. The redaction of SSNs underscores the balance between historical transparency and the protection of personal privacy in the release of government documents related to the assassination investigation. The ARRB's decisions regarding SSNs reflect broader considerations about privacy rights in the context of declassifying sensitive historical records.",
  "document_ids": [
    "180-10060-10441",
    "180-10068-10335",
    "180-10068-10322",
    "180-10060-10483",
    "180-10068-10363",
    "180-10068-10318",
    "180-10060-10460",
    "180-10068-10355",
    "180-10068-10309",
    "180-10070-10161",
    "180-10068-10305",
    "180-10068-10313",
    "180-10070-10157",
    "180-10060-10471",
    "180-10147-10265",
    "180-10060-10470",
    "180-10060-10489",
    "180-10068-10324",
    "180-10060-10493",
    "180-10068-10298",
    "180-10068-10332",
    "180-10070-10160",
    "180-10060-10490",
    "180-10070-10159",
    "180-10060-10486",
    "180-10070-10155",
    "180-10070-10143",
    "180-10060-10449",
    "180-10068-10350",
    "180-10068-10306",
    "180-10068-10326",
    "180-10147-10261",
    "180-10070-10153",
    "180-10060-10459",
    "180-10068-10337",
    "180-10070-10173",
    "180-10060-10454",
    "180-10068-10361",
    "180-10060-10439",
    "180-10060-10458",
    "180-10068-10300",
    "180-10060-10462",
    "180-10070-10144"
  ]
}