{
  "entity_name": "Condolences",
  "entity_type": "tag",
  "document_count": 19,
  "summary": "The documents reflect a global outpouring of condolences following the assassination of President John F. Kennedy in November 1963. These messages of sympathy and regret came from various sources, including heads of state, government officials, diplomatic representatives, and even religious organizations from countries around the world such as Thailand, South Vietnam, Cambodia, South Korea, Morocco, Norway, Poland, Syria, Bulgaria, Ghana, El Salvador, and Zaire. The condolences were directed towards President Lyndon B. Johnson, Mrs. Jacqueline Kennedy, Secretary of State Dean Rusk, and the American people. The messages often highlighted the shock and sorrow felt by the senders and their respective populations, with some emphasizing Kennedy's contributions to peace and the Alliance for Progress. The documents also detail actions taken in response to the assassination, such as flying flags at half-mast, sending delegations to the funeral, and issuing public statements of mourning.",
  "key_connections": [
    "President John F. Kennedy",
    "President Lyndon B. Johnson",
    "Mrs. Jacqueline Kennedy",
    "Secretary of State Dean Rusk",
    "Government of Thailand",
    "Government of South Vietnam",
    "Government of Cambodia",
    "Government of South Korea",
    "Government of Morocco",
    "Government of Norway",
    "Government of Poland",
    "Government of Syria",
    "Government of Bulgaria",
    "Government of Ghana",
    "Government of El Salvador",
    "Government of Zaire"
  ],
  "significance": "The global expression of condolences underscores the significant impact of President Kennedy's assassination on the international community. These messages highlight the widespread respect and admiration for Kennedy, as well as the shared sense of loss felt across nations, regardless of their political alignment or relationship with the United States. The documents serve as a testament to Kennedy's influence on global affairs and the profound shock caused by his untimely death.",
  "document_ids": [
    "144-10001-10088",
    "144-10001-10354",
    "144-10001-10342",
    "144-10001-10378",
    "144-10001-10343",
    "144-10001-10355",
    "144-10001-10318",
    "144-10001-10344",
    "144-10001-10348",
    "144-10001-10299",
    "144-10001-10332",
    "144-10001-10298",
    "144-10001-10349",
    "144-10001-10076",
    "144-10001-10308",
    "144-10001-10297",
    "144-10001-10399",
    "144-10001-10340",
    "144-10001-10320"
  ]
}