{
  "entity_name": "Employment",
  "entity_type": "tag",
  "document_count": 12,
  "summary": "The documents primarily relate to the employment records and payroll information of staff members who worked for the House Select Committee on Assassinations (HSCA). These records include payroll authorization forms, memoranda, resumes, and certification reports detailing employees' salaries, positions, and periods of employment. The documents span from the mid-1970s to the late 1970s, reflecting the active period of the HSCA's investigation. Some documents also pertain to background checks and employment history of individuals connected to the JFK assassination, such as Lee Harvey Oswald's employment at William B. Rielly Coffee Co. and Robert Scheer's background investigation. A notable pattern is the focus on documenting the HSCA's staff and their compensation, providing insight into the committee's operations and personnel.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Joseph Kiel",
    "Patricia M. Orr",
    "Burton A. Chardak",
    "Richard Newcombe Billings",
    "Peter G. Beeson",
    "Robin David Lindley",
    "Thomas Howarth",
    "Lee Harvey Oswald",
    "William B. Rielly Coffee Co.",
    "Robert Scheer",
    "Emilio A. Rodriguez"
  ],
  "significance": "In the JFK assassination context, employment records and related documents provide insight into the staffing and operations of the HSCA, the committee tasked with reinvestigating the assassination. These records offer details about the individuals involved in the investigation, their roles, and the resources allocated to the committee's work. Additionally, documents related to the employment history of individuals like Lee Harvey Oswald can shed light on their activities and connections prior to the assassination.",
  "document_ids": [
    "180-10060-10457",
    "180-10060-10494",
    "180-10068-10322",
    "180-10125-10075",
    "180-10068-10309",
    "180-10068-10305",
    "180-10060-10471",
    "180-10086-10257",
    "180-10060-10445",
    "194-10006-10180",
    "180-10125-10077",
    "104-10180-10156"
  ]
}