{
  "entity_name": "Funeral",
  "entity_type": "tag",
  "document_count": 17,
  "summary": "The documents primarily focus on the international response to President John F. Kennedy's assassination and the arrangements for his funeral. Numerous countries expressed sorrow and decreed periods of mourning. Many nations sent high-level delegations, including heads of state, foreign ministers, and special envoys, to attend the funeral in Washington D.C. The documents detail travel arrangements, requests for security and guides, and the composition of various delegations. Some documents highlight the importance of sending high-prestige representatives to strengthen relations with the United States. There's also mention of the U.S. State Department's discouragement of foreign representatives attending the funeral, and inquiries about whether representatives would attend despite this. The documents span the period immediately following the assassination in November 1963 and into early December 1963, with one document dated much later in 1998, likely related to document identification or review.",
  "key_connections": [
    "John F. Kennedy",
    "Foreign Ministers",
    "Heads of State",
    "U.S. State Department",
    "International Delegations",
    "Chairman Pak Chong Hui",
    "President De Gaulle",
    "Mrs. Kennedy",
    "President Johnson"
  ],
  "significance": "The funeral serves as a focal point for understanding the global impact of Kennedy's assassination and the diplomatic responses of various nations. It highlights the widespread grief and the importance placed on maintaining or strengthening relationships with the United States during this period of transition. The attendance of numerous world leaders underscores Kennedy's influence on the international stage and the symbolic significance of the event.",
  "document_ids": [
    "144-10001-10071",
    "144-10001-10067",
    "144-10001-10303",
    "144-10001-10315",
    "144-10001-10313",
    "144-10001-10309",
    "144-10001-10348",
    "144-10001-10325",
    "144-10001-10324",
    "144-10001-10345",
    "144-10001-10307",
    "144-10001-10370",
    "144-10001-10331",
    "144-10001-10330",
    "144-10001-10347",
    "144-10001-10069",
    "144-10001-10357"
  ]
}