{
  "entity_name": "John Roselli",
  "entity_type": "tag",
  "document_count": 11,
  "summary": "John Roselli, also known as \"Handsome Johnny,\" was a prominent figure in organized crime. The documents reveal FBI investigations into his activities, whereabouts, and associations, particularly in Los Angeles and Las Vegas, during the early 1960s. These investigations covered a range of activities, including potential disruption of movie filming involving Hal Roach, Jr., and Carroll Case, allegedly at the behest of Frank Sinatra, as well as scrutiny of his bank accounts and phone calls, sometimes in connection with Judith E. Campbell and Sam Giancana. The FBI also tracked his movements, including possible trips to San Diego and Santa Barbara, and monitored his conversations at places like the Friar's Club. Later documents mention his involvement in CIA plots against Fidel Castro. The documents also include reports from the American Embassy in Rome regarding unsuccessful attempts to find birth records for Roselli and his family in Italy, and investigations into the disappearance and death of Eugene Michael Carrafa, which mention Roselli.",
  "key_connections": [
    "Judith E. Campbell",
    "Sam Giancana",
    "Frank Sinatra",
    "Hal Roach, Jr.",
    "Carroll Case",
    "Natalie V. Loughran",
    "Eugene Michael Carrafa",
    "Jay Knohl",
    "Det. Joseph Ronald Smisek",
    "Janice Mae Piccerelli",
    "CIA",
    "Fidel Castro"
  ],
  "significance": "John Roselli's significance in the JFK assassination context stems from his involvement with organized crime and the CIA's plots against Fidel Castro. The Senate Select Committee investigated the CIA's use of organized crime figures, including Roselli, in attempts to assassinate Castro. This connection raises questions about potential links between organized crime, the CIA, and the assassination of President Kennedy, although the documents provided do not directly implicate him in the assassination itself.",
  "document_ids": [
    "124-10223-10067",
    "124-10223-10088",
    "124-10223-10077",
    "180-10117-10032",
    "124-10223-10083",
    "124-10223-10164",
    "180-10145-10446",
    "124-10223-10086",
    "124-10223-10073",
    "124-10223-10121",
    "124-10223-10068"
  ]
}