{
  "entity_name": "Martin Luther King Jr.",
  "entity_type": "tag",
  "document_count": 17,
  "summary": "Martin Luther King Jr. was a prominent civil rights leader whose assassination in April 1968 is a subject of interest in the documents. The documents reflect investigations into his assassination, potential suspects like James Earl Ray and Eric Starvo Galt (aliases Harvey Lowmyer, John Willard), and the reactions of various groups, including communist media. The documents also reveal the monitoring of King's activities and alleged connections to individuals like Stanley Levison and potential communist ties. Furthermore, the House Select Committee on Assassinations (HSCA) investigated his assassination alongside that of President Kennedy, seeking information from various sources and agencies. The documents span from 1962 to 1978, covering the period before and after his death, indicating ongoing scrutiny and investigation into his activities and assassination.",
  "key_connections": [
    "James Earl Ray",
    "Eric Starvo Galt (Harvey Lowmyer, John Willard)",
    "Stanley Levison",
    "House Select Committee on Assassinations (HSCA)",
    "John F. Kennedy",
    "Hosea Williams",
    "World Peace Council (WPC)"
  ],
  "significance": "While not directly related to the JFK assassination, the documents highlight the HSCA's investigation into both the JFK and Martin Luther King Jr. assassinations, suggesting a parallel interest in understanding the circumstances surrounding both events. The documents also reveal the monitoring of King's activities and alleged connections, reflecting a broader interest in potential threats to national security during that era.",
  "document_ids": [
    "104-10173-10166",
    "104-10433-10209",
    "104-10066-10010",
    "104-10433-10212",
    "104-10071-10147",
    "104-10433-10167",
    "104-10305-10005",
    "124-10271-10033_multirif_redacted",
    "104-10065-10386",
    "104-10071-10148",
    "104-10178-10136",
    "124-10238-10333_multirif",
    "104-10322-10056",
    "104-10079-10016",
    "124-10238-10329_multirif",
    "104-10433-10050",
    "104-10071-10139"
  ]
}