{
  "entity_name": "Manolo_RAY_Rivero",
  "entity_type": "person-mentioned",
  "document_count": 27,
  "document_ids": [
    "104-10179-10121",
    "124-10300-10024",
    "104-10179-10025",
    "206-10001-10014",
    "104-10180-10062",
    "104-10103-10112",
    "124-10213-10483",
    "124-10279-10107",
    "124-10291-10236",
    "104-10179-10195",
    "104-10298-10184",
    "104-10306-10024",
    "104-10192-10266",
    "104-10179-10122",
    "104-10072-10289",
    "124-90135-10074",
    "104-10160-10207",
    "104-10179-10088",
    "104-10221-10310",
    "176-10036-10051",
    "104-10102-10237",
    "104-10237-10120",
    "157-10008-10150",
    "104-10306-10010",
    "180-10145-10269",
    "104-10102-10227",
    "104-10192-10284"
  ],
  "summary": "Manolo RAY Rivero, also known as Manuel Ray, was a significant figure in Cuban politics, transitioning from involvement in the Cuban Revolution to a leadership role within the anti-Castro exile community. Active from 1958 to 1977, he led the People's Revolutionary Movement (MRP) and advocated for internal resistance against Castro, supported by funds and trained exiles, rather than a U.S. invasion. His views on overthrowing Castro sometimes differed from those of other exile groups and potentially the U.S. government, leading to scrutiny of his activities. Documents suggest he may have replaced Miro Cardona with U.S. backing, a claim that sparked controversy. He was monitored by the CIA, and his activities and statements were reported through various channels.",
  "key_connections": [
    "Miro Cardona",
    "Fidel Castro",
    "Ernesto Guevara",
    "Operation Alpha 66",
    "Frente Interno de Unidad Revolucionaria (FIUR)",
    "AMRURO-1"
  ],
  "significance": "Medium - Manolo RAY Rivero appears in a substantial number of documents (27), indicating a notable presence within the JFK assassination document collection. His role as a leader in the anti-Castro movement and the CIA's monitoring of his activities suggest his significance in the context of US-Cuban relations during that period.",
  "merged_from_variants": [
    "Manolo Ray",
    "Manolo RAY Rivero",
    "Manuel Ray"
  ]
}