{
  "entity_name": "Ernesto_\"Che\"_Guevara",
  "entity_type": "person-mentioned",
  "document_count": 36,
  "document_ids": [
    "198-10009-10099",
    "135-10001-10253",
    "124-10284-10081",
    "124-10279-10258",
    "157-10014-10100",
    "104-10103-10112",
    "135-10001-10288",
    "104-10075-10365",
    "177-10001-10305",
    "104-10216-10398",
    "104-10234-10007",
    "104-10247-10064",
    "104-10225-10009",
    "157-10008-10238",
    "104-10170-10121",
    "104-10215-10128",
    "198-10005-10018",
    "177-10002-10012",
    "104-10338-10018",
    "104-10302-10021",
    "124-90135-10074",
    "104-10183-10355",
    "119-10021-10413",
    "104-10302-10019",
    "104-10506-10028",
    "104-10097-10360",
    "104-10308-10163",
    "104-10093-10109",
    "104-10072-10315",
    "104-10102-10237",
    "198-10007-10021",
    "157-10005-10297",
    "104-10247-10097",
    "198-10009-10098",
    "198-10008-10119",
    "104-10177-10206"
  ],
  "summary": "Ernesto \"Che\" Guevara was a central figure in the Cuban Revolution, serving as a key leader alongside Fidel Castro. The documents reference him primarily within the context of Cuban subversion in Latin America, Cuban-Soviet relations, and potential, though not directly implicated, Cuban involvement surrounding the John F. Kennedy assassination. His involvement includes Cuban support for revolutionary movements, guerrilla training, and political indoctrination. The CIA showed interest in individuals connected to Guevara, potentially as sources of information, including a Cuban industrial engineer, Jorge Antonio Abasolo Garcia, and a subject with access to Guevara and high-level planning sessions at the Ministry of Industries. Following Guevara's disappearance, AMSPELL, a CIA-supported organization, used the event for propaganda.",
  "key_connections": [
    "Fidel Castro",
    "Jorge Antonio Abasolo Garcia",
    "Ministry of Industries (Cuba)",
    "Cuban Intelligence Service",
    "AMSPELL"
  ],
  "significance": "High - Ernesto \"Che\" Guevara is a significant figure due to his prominent role in the Cuban Revolution and his connections to various activities of interest to the CIA, including potential Cuban involvement in the JFK assassination context, Cuban subversion, and Cuban-Soviet relations. The number of documents mentioning him (36) further underscores his importance within the source material.",
  "merged_from_variants": [
    "Che Guevara",
    "Ernesto \"Che\" Guevara"
  ]
}