{
  "entity_name": "Orlando_Bosch_Avila",
  "entity_type": "tag",
  "document_count": 18,
  "document_ids": [
    "104-10164-10099",
    "124-10206-10337",
    "180-10145-10302",
    "124-10213-10310",
    "104-10178-10002",
    "180-10145-10301",
    "104-10173-10171",
    "104-10192-10229",
    "104-10164-10097",
    "180-10144-10130",
    "180-10145-10308",
    "104-10164-10050",
    "124-10218-10058",
    "104-10164-10054",
    "124-10291-10040",
    "104-10164-10060",
    "104-10169-10006",
    "124-10221-10245"
  ],
  "summary": "Orlando Bosch Avila was a prominent anti-Castro Cuban exile leader deeply involved in activities against the Cuban government from the 1960s to the late 1970s. He led the Movimiento Insurreccional de Recuperación Revolucionaria (MIRR) and was associated with various anti-Cuba operations, including alleged bombings and assassination attempts. While having connections with the CIA at one point, his clearance was later cancelled. He was under the protection of Venezuelan President Carlos Andres Perez in 1976. Investigations into his activities include a telegram claiming responsibility for sabotage in Havana and alleged contact with the Novo brothers before the assassination of Orlando Letelier. Bosch also had connections with various exile groups, including Accion Cubana and Cuban Power, and used false Chilean identity documents.",
  "key_connections": [
    "Novo brothers",
    "Luis Clemente Posada Carriles",
    "MIRR",
    "Carlos Andres Perez",
    "Luis Posada Carriles",
    "Fidel Castro",
    "Cuban Power",
    "Accion Cubana",
    "Max Lesnick",
    "Ricardo Morales"
  ],
  "significance": "High. Orlando Bosch Avila is a significant figure due to his extensive involvement in anti-Castro activities, potential terrorist connections, and associations with various exile groups. The number of documents (18) and the nature of his alleged activities suggest a high level of interest from the investigating agencies.",
  "merged_from_variants": [
    "Orlando Bosch Avila",
    "Orlando Bosch"
  ]
}