{
  "entity_name": "John_A_Mintz",
  "entity_type": "person-mentioned",
  "document_count": 34,
  "document_ids": [
    "124-10186-10049_multirif",
    "124-10184-10237",
    "124-10186-10054_multirif",
    "124-10179-10217_multirif",
    "124-10273-10007_multirif",
    "124-10185-10100",
    "124-10238-10329_multirif",
    "124-10273-10086_multirif",
    "124-10271-10299",
    "124-10274-10001",
    "124-10273-10007",
    "124-10273-10006",
    "124-10264-10208_multirif",
    "124-10186-10051_multirif",
    "124-10183-10279_multirif_redacted",
    "124-10274-10011 (c06716583)",
    "124-10264-10210_multirif",
    "124-10271-10003_multirif",
    "124-10186-10048_multirif",
    "124-10238-10333_multirif",
    "124-10182-10231",
    "124-10271-10299_multirif",
    "124-10186-10055_multirif",
    "124-10274-10001_multirif",
    "124-10183-10277_multirif_redacted",
    "124-10186-10056_multirif",
    "124-10274-10070",
    "124-10186-10045_multirif",
    "124-10271-10013",
    "124-10271-10011_multirif",
    "124-10264-10206_multirif",
    "124-10264-10209_multirif",
    "124-10271-10003",
    "124-10273-10071_multirif"
  ],
  "summary": "John A. Mintz, also referred to as J. A. Mintz or simply Mintz, was involved with the FBI's interactions with the U.S. Senate Select Committee on Intelligence Activities (SSC) during its investigation into intelligence activities in the mid-1970s. He appears to have been an FBI official or employee involved in coordinating and providing materials to the SSC in response to their inquiries. Mintz participated in discussions and preparations for the FBI's responses to the SSC's inquiries, particularly concerning domestic intelligence operations, COINTELPRO, and matters related to Martin Luther King, Jr. His role included legal counsel, preparing for the Director's testimony, and addressing potential legislative actions related to FBI oversight and investigative authority. He was involved in the process of gathering, reviewing, and transmitting information to the SSC, including discussions about the authority of Congress to release classified data.",
  "key_connections": [
    "Senate Select Committee",
    "Senate Select Committee on Intelligence Activities",
    "Senate Select Committee on Intelligence Activities (SSC)",
    "FBI",
    "COINTELPRO",
    "Martin Luther King, Jr."
  ],
  "significance": "Medium. John A. Mintz appears to have been a key figure in the FBI's response to Congressional inquiries during a period of significant scrutiny. While the documents do not directly link him to the JFK assassination, his role in managing the FBI's interactions with the Senate Select Committee suggests he had access to sensitive information and played a role in shaping the FBI's public image and accountability.",
  "merged_from_variants": [
    "John A. Mintz",
    "J. A. Mintz",
    "Mintz"
  ]
}