{
  "entity_name": "HCO_R",
  "entity_type": "recipient",
  "document_count": 26,
  "document_ids": [
    "144-10001-10062",
    "144-10001-10307",
    "144-10001-10174",
    "144-10001-10063",
    "144-10001-10101",
    "144-10001-10348",
    "144-10001-10371",
    "144-10001-10169",
    "144-10001-10347",
    "144-10001-10167",
    "144-10001-10107",
    "144-10001-10081",
    "144-10001-10351",
    "144-10001-10069",
    "144-10001-10065",
    "144-10001-10349",
    "144-10001-10171",
    "144-10001-10304",
    "144-10001-10109",
    "144-10001-10314",
    "144-10001-10368",
    "144-10001-10060",
    "144-10001-10308",
    "144-10001-10088",
    "144-10001-10399",
    "144-10001-10305"
  ],
  "summary": "HCO_R (also referred to as HCO [R] or HCO) functioned as a recipient within the National Security Agency (NSA) for information related to the assassination of President John F. Kennedy. Specifically, HCO_R received reports, messages, and intercepted communications detailing foreign reactions to the assassination from countries worldwide, including Bulgaria, Iran, France, Syria, Burma, Morocco, Norway, Ghana, Tanganyika (Tanzania), Cuba, South Korea, Finland, Hungary, Tunisia, El Salvador, the Soviet Union, Egypt, and Austria. These reactions ranged from official condolences and expressions of grief to media coverage, security measures, and political commentary. HCO_R also received information regarding foreign representation at Kennedy's funeral and, in at least one instance, an intercepted message concerning financial support for a journalist reporting from Dallas after the event.",
  "key_connections": [
    "NSA (National Security Agency)",
    "President Kennedy",
    "John F. Kennedy",
    "Soviet Union",
    "France",
    "Iran",
    "Cuba",
    "South Korea",
    "Finland",
    "Hungary",
    "Tunisia",
    "El Salvador",
    "Bulgaria",
    "Ghana",
    "Syria"
  ],
  "significance": "High. HCO_R's role as a recipient of information concerning global reactions to President Kennedy's assassination, as evidenced by the large number of documents (26) and the breadth of countries represented in the reports, indicates a significant function in monitoring and processing intelligence related to this major historical event.",
  "merged_from_variants": [
    "HCO [R]",
    "HCO"
  ]
}