{
  "entity_name": "E_Howard_Hunt",
  "entity_type": "person-mentioned",
  "document_count": 35,
  "document_ids": [
    "104-10105-10120",
    "104-10332-10022",
    "178-10002-10091",
    "104-10173-10132",
    "135-10001-10237",
    "135-10001-10243",
    "104-10333-10006",
    "104-10105-10277",
    "104-10061-10115",
    "104-10079-10016",
    "135-10001-10245",
    "178-10004-10420",
    "104-10095-10161",
    "135-10001-10279",
    "135-10001-10288",
    "104-10330-10081",
    "104-10095-10202",
    "135-10001-10276",
    "104-10222-10041",
    "104-10105-10290 (C06932214)",
    "180-10143-10456",
    "104-10256-10283",
    "104-10096-10048",
    "104-10173-10130",
    "180-10113-10119",
    "104-10105-10293",
    "157-10011-10024",
    "157-10005-10228",
    "157-10011-10078",
    "157-10011-10121",
    "104-10103-10038",
    "104-10105-10271",
    "178-10002-10215",
    "180-10145-10269",
    "104-10194-10024"
  ],
  "summary": "E. Howard Hunt was a CIA officer whose activities are scrutinized in connection to the JFK assassination, Watergate, and Cuban affairs, including the Bay of Pigs. Investigations cover his assignments, particularly in Madrid, and his financial transactions, including a search for unaccounted payments. He is linked to individuals like Sturgis, Barber, and others involved with the CIA and Cuban matters. His alias birth certificate is mentioned in relation to the Bay of Pigs operation, and his memoirs were reviewed by the CIA for security concerns. Hunt denied allegations of involvement in the JFK assassination, providing an alibi. Documents also include a fitness report evaluating his performance in propaganda operations and project management, as well as inquiries into potential CIA involvement in assassinations during his testimony before the Senate Select Committee.",
  "key_connections": [
    "CIA",
    "Watergate",
    "Cuba",
    "Bay of Pigs",
    "Frank Sturgis",
    "Sturgis",
    "Carlos Marcello",
    "Marita Lorenz",
    "Barber",
    "Lee Harvey Oswald",
    "David Phillips"
  ],
  "significance": "High. E. Howard Hunt is a significant figure due to his involvement in multiple events of historical importance, including the JFK assassination investigations, Watergate, and CIA activities related to Cuba. The high document count (35) further underscores his importance within the source material.",
  "merged_from_variants": [
    "Hunt",
    "E. Howard Hunt",
    "Howard Hunt"
  ]
}