{
  "entity_name": "Secretary_McNamara",
  "entity_type": "person-mentioned",
  "document_count": 25,
  "document_ids": [
    "206-10001-10009",
    "178-10004-10056",
    "206-10001-10000",
    "157-10011-10009",
    "157-10002-10001",
    "104-10306-10016",
    "157-10014-10227",
    "157-10014-10117",
    "206-10001-10013",
    "135-10001-10246",
    "157-10005-10236",
    "104-10301-10000",
    "104-10301-10001",
    "176-10030-10085",
    "157-10008-10234",
    "104-10306-10018",
    "104-10310-10020",
    "104-10302-10024",
    "157-10014-10109",
    "176-10030-10168",
    "104-10302-10000",
    "104-10306-10011",
    "157-10008-10150",
    "124-10185-10099",
    "104-10303-10007"
  ],
  "summary": "Secretary McNamara appears in numerous documents related to US foreign policy and national security during the Kennedy and Johnson administrations. While not directly implicated in the JFK assassination within these documents, he was a key figure involved in high-level discussions and decisions concerning significant events such as the Cuban Missile Crisis, covert actions against Cuba (including Operation Mongoose), and the early stages of the Vietnam War. He received intelligence briefings and participated in strategic discussions related to Cuba, Vietnam, Pakistan, and Soviet relations, placing him within the sphere of influence of individuals and events relevant to the broader historical context surrounding the JFK assassination.",
  "key_connections": [
    "John F. Kennedy",
    "President Lyndon B. Johnson",
    "Cuba",
    "Vietnam War",
    "Fidel Castro",
    "CIA",
    "Soviet Union (related to Cuban Missile Crisis)",
    "Bay of Pigs invasion",
    "CIA's Western Hemisphere Division",
    "Edward Lansdale"
  ],
  "significance": "High - Secretary McNamara was a key figure in national security and foreign policy during the Kennedy and Johnson administrations, placing him in a position to be knowledgeable about events and decisions related to the JFK assassination, even if not directly involved.",
  "merged_from_variants": [
    "Robert S. McNamara",
    "McNamara",
    "Secretary McNamara",
    "Robert McNamara"
  ]
}