{
  "entity_name": "TOP_SECRET_DINAR",
  "entity_type": "tag",
  "document_count": 35,
  "document_ids": [
    "144-10001-10330",
    "144-10001-10062",
    "144-10001-10307",
    "144-10001-10118",
    "144-10001-10312",
    "144-10001-10306",
    "144-10001-10311",
    "104-10302-10022",
    "144-10001-10122",
    "144-10001-10313",
    "144-10001-10058",
    "144-10001-10320",
    "144-10001-10370",
    "144-10001-10068",
    "144-10001-10371",
    "144-10001-10105",
    "144-10001-10052",
    "144-10001-10359",
    "144-10001-10344",
    "144-10001-10331",
    "124-10299-10032",
    "144-10001-10081",
    "144-10001-10089",
    "144-10001-10361",
    "144-10001-10369",
    "144-10001-10086",
    "144-10001-10117",
    "144-10001-10304",
    "144-10001-10314",
    "144-10001-10060",
    "144-10001-10321",
    "144-10001-10399",
    "144-10001-10302",
    "144-10001-10376",
    "144-10001-10332"
  ],
  "summary": "The tag \"TOP_SECRET_DINAR\" categorizes 35 documents primarily concerning international reactions and intelligence reporting in the aftermath of President John F. Kennedy's assassination in November 1963. These documents, originating from sources like the NSA and CIA, include reports, cables, and daily summaries detailing foreign government condolences, internal situations in countries such as Cuba, diplomatic communications, and intelligence assessments. Specific topics covered range from instructions to diplomatic missions from various countries regarding responses to Kennedy's death, evaluations of President Lyndon B. Johnson by foreign officials, reports on Viet Cong propaganda, observations by Indonesian presidential bodyguard officials, mourning declarations, military alerts in Latin America, and potential visits by Chinese Premier Chou En-Lai to Africa.",
  "key_connections": [
    "President John F. Kennedy",
    "Cuban Government",
    "United Nations",
    "U.S. State Department",
    "Fidel Castro",
    "Polish Intelligence",
    "ROK (Republic of Korea) President"
  ],
  "significance": "High. The entity appears in a significant number of documents (35) and is directly related to sensitive intelligence and international reactions following President Kennedy's assassination, indicating its importance in categorizing and understanding the global impact of the event.",
  "merged_from_variants": [
    "TOP SECRET DINAR",
    "DINAR"
  ]
}