{
  "entity_name": "William_K_Harvey",
  "entity_type": "tag",
  "document_count": 24,
  "document_ids": [
    "124-90092-10002",
    "124-90092-10016",
    "104-10071-10139",
    "157-10011-10006",
    "124-90092-10001",
    "104-10061-10214",
    "104-10059-10057",
    "104-10178-10136",
    "157-10008-10246",
    "104-10193-10076",
    "104-10061-10320",
    "104-10103-10079",
    "157-10014-10109",
    "157-10011-10024",
    "157-10002-10087",
    "104-10106-10547",
    "157-10014-10137",
    "157-10005-10141",
    "157-10002-10105",
    "104-10102-10224",
    "180-10143-10362",
    "157-10008-10241",
    "157-10002-10106",
    "104-10072-10034"
  ],
  "summary": "William K. Harvey was a CIA officer heavily involved in covert operations, particularly against Cuba in the early 1960s. He drafted operational plans for intelligence gathering, economic pressure, and potential support for internal resistance, including Operation Mongoose and ZRRIFLE, which were investigated for potential assassination plots against foreign leaders like Fidel Castro and Patrice Lumumba. Harvey testified before the SSCIA (Church Committee) regarding these activities. He was also connected to the Berlin Base and later retired from the CIA. Documents also indicate that the CIA disseminated information about an alias, Harvey Lowmyer, who is connected to Eric Starvo Galt and John Willard, a suspect in the assassination of Martin Luther King, Jr.",
  "key_connections": [
    "CIA",
    "Operation Mongoose",
    "ZRRIFLE",
    "Fidel Castro",
    "Patrice Lumumba",
    "SSCIA (Church Committee)",
    "Martin Luther King, Jr.",
    "Eric Starvo Galt",
    "John Willard",
    "Helms",
    "Bissell",
    "McCone",
    "Task Force W",
    "Central Cover Staff (CCS)"
  ],
  "significance": "High - William K. Harvey appears to be a significant figure within the CIA, particularly concerning covert operations related to Cuba and potential assassination plots. His involvement in Operation Mongoose and ZRRIFLE, along with his connections to individuals implicated in the JFK and MLK assassinations, suggests a high level of importance within the context of these historical events and investigations.",
  "merged_from_variants": [
    "William K. Harvey",
    "Harvey Lowmyer",
    "William Harvey",
    "Harvey"
  ]
}