{
  "entity_name": "William_C_Sullivan",
  "entity_type": "person-mentioned",
  "document_count": 47,
  "document_ids": [
    "124-10223-10073",
    "124-10204-10209",
    "124-10273-10018_multirif",
    "206-10001-10000",
    "124-10274-10357_multirif",
    "124-10273-10008_multirif",
    "124-10203-10465",
    "104-10226-10001",
    "124-10274-10127",
    "104-10338-10005",
    "124-10223-10077",
    "124-10273-10006",
    "124-10276-10483_multirif",
    "180-10143-10072",
    "124-10274-10358_multirif",
    "124-10264-10208_multirif",
    "124-10326-10104",
    "124-10186-10041",
    "124-10223-10082",
    "124-10223-10074",
    "124-90137-10467",
    "124-10273-10016_multirif",
    "124-10203-10494",
    "124-10273-10022_multirif",
    "124-10264-10210_multirif",
    "124-10203-10485",
    "157-10011-10093",
    "124-10325-10318",
    "124-10223-10088",
    "124-10203-10497",
    "124-10326-10103",
    "104-10310-10020",
    "124-10203-10468",
    "124-10281-10028",
    "124-10276-10482_multirif",
    "144-10001-10363",
    "157-10011-10078",
    "124-10273-10104",
    "124-10203-10246",
    "124-10223-10087",
    "124-10271-10013",
    "124-10273-10014_multirif",
    "124-10264-10206_multirif",
    "124-10264-10209_multirif",
    "157-10002-10152",
    "124-10168-10040",
    "124-10223-10083"
  ],
  "summary": "William C. Sullivan appears to have been a high-ranking official within the FBI, involved in internal operations, CIA liaison activities, and domestic intelligence matters. He received memos and reports, suggesting a position of authority. Sullivan's responsibilities included receiving information related to CIA activities, recommendations on handling CIA-sourced information, and updates on FBI-CIA relations. He also received reports on various investigations, including those related to John Roselli, Gabriel Mannarino, and Santo Trafficante Jr., as well as intelligence on the Communist Party of Venezuela. Furthermore, Sullivan's name appears in the context of FBI responses to the U.S. Senate Select Committee on Intelligence Activities (SSC) inquiries, particularly concerning Martin Luther King, Jr., and the Southern Christian Leadership Conference (SCLC), indicating his involvement in the FBI's handling of sensitive information and its interactions with other government agencies regarding investigations and document releases.",
  "key_connections": [
    "FBI",
    "CIA",
    "U.S. Senate Select Committee on Intelligence Activities (SSC)",
    "Martin Luther King, Jr.",
    "Southern Christian Leadership Conference (SCLC)",
    "John Roselli",
    "Gabriel Mannarino",
    "Santo Trafficante, Jr."
  ],
  "significance": "Medium - William C. Sullivan is mentioned in a significant number of documents (47), suggesting a relevant role within the FBI during the period covered by the source material. His involvement in FBI operations, CIA liaison activities, and responses to Senate inquiries indicates a position of some importance, although the documents do not directly link him to the JFK assassination itself.",
  "merged_from_variants": [
    "Sullivan",
    "William C. Sullivan",
    "W. C. Sullivan",
    "Mr. Sullivan",
    "William Sullivan"
  ]
}