{
  "entity_name": "Non-Official Cover",
  "entity_type": "tag",
  "document_count": 6,
  "summary": "Non-Official Cover (NOC) refers to individuals operating for the CIA under a guise that does not overtly identify them as intelligence operatives. The documents highlight the CIA's efforts to establish and maintain NOC for agents in various locations, including Habana, Caracas, and Madrid. These covers were crucial for enabling agents to conduct intelligence activities without raising suspicion. The documents emphasize the importance of security and the need to protect the identities of NOCs and their associated operations. The process involved thorough background checks, establishing legitimate business fronts, and ensuring the agent's cover was not compromised. The documents also reveal the CIA's concern for the well-being and security of NOCs, including efforts to obtain U.S. citizenship for their spouses to enhance their cover.",
  "key_connections": [
    "William M. Kent",
    "House Select Committee on Assassinations (HSCA)",
    "Arthur G. VAIVADA",
    "Peter J. Di Gerveno",
    "Robert S. Hunkeler",
    "Thomas K. Strange",
    "Marvin Wehking"
  ],
  "significance": "In the context of the JFK assassination, the documents related to Non-Official Cover highlight the CIA's operational practices and the importance of maintaining secrecy. While these documents do not directly implicate NOCs in the assassination, they provide insight into the types of activities and personnel the CIA employed, which is relevant to understanding the agency's potential involvement or knowledge of events surrounding the assassination. The guidelines for cooperation with the HSCA, specifically mentioning NOCs, indicate the committee's interest in investigating the role of these individuals in relation to the assassination.",
  "document_ids": [
    "104-10303-10003",
    "104-10067-10043",
    "104-10295-10168",
    "104-10180-10210",
    "104-10161-10331",
    "104-10161-10330"
  ]
}