{
  "entity_name": "John Roselli",
  "entity_type": "person-mentioned",
  "document_count": 13,
  "summary": "John Roselli, also known as \"Handsome Johnny\", was a prominent figure in organized crime. The documents reveal FBI investigations into his activities, whereabouts, and associations, particularly during the early 1960s. These investigations include surveillance, inquiries into his financial affairs (including IRS interest in his tax returns), and monitoring of his interactions with individuals like Judith E. Campbell and Sam Giancana. The documents also suggest potential involvement in disrupting movie filming in Las Vegas at the behest of Frank Sinatra. Later documents from the 1970s connect Roselli to CIA plots against Fidel Castro, specifically through the SSCIA's investigation into \"executive action\" capabilities and Project ZR/RIFLE. The HSCA also investigated Roselli in connection to the JFK assassination.",
  "key_connections": [
    "Judith E. Campbell",
    "Sam Giancana",
    "Frank Sinatra",
    "William Harvey",
    "Operation Mongoose",
    "ZRRIFLE",
    "CIA",
    "Fidel Castro",
    "Natalie V. Loughran",
    "Hal Roach, Jr.",
    "Carroll Case"
  ],
  "significance": "John Roselli's significance in the JFK assassination context stems from his involvement with organized crime and his alleged participation in CIA plots to assassinate Fidel Castro. The HSCA investigated potential connections between these plots and the assassination of President Kennedy, exploring the possibility that individuals involved in the anti-Castro efforts may have turned against Kennedy. Roselli's connections to both the criminal underworld and covert CIA operations made him a person of interest in understanding the potential motives and actors involved in the assassination.",
  "document_ids": [
    "157-10014-10109",
    "124-10223-10067",
    "124-10223-10088",
    "124-10223-10077",
    "124-10223-10083",
    "124-10223-10164",
    "157-10014-10137",
    "180-10145-10446",
    "104-10079-10016",
    "124-10223-10086",
    "124-10223-10073",
    "124-10223-10121",
    "124-10223-10068"
  ]
}