{
  "entity_name": "Marina Oswald",
  "entity_type": "person-mentioned",
  "document_count": 17,
  "summary": "Marina Oswald is Lee Harvey Oswald's wife and plays a significant role in the JFK assassination context due to her relationship with Lee Harvey Oswald and her knowledge of his activities. Several documents mention her in connection with Lee Harvey Oswald's time in the Soviet Union, his activities in Mexico City, and the aftermath of the assassination. Documents include social security information, marriage and birth certificates, and other records related to her and Lee Harvey Oswald. Her potential knowledge of Lee Harvey Oswald's motives and actions made her a person of interest in the investigations following the assassination. The documents also reflect the efforts to gather information about her background and activities, both before and after the assassination.",
  "key_connections": [
    "Lee Harvey Oswald",
    "Warren Commission",
    "House Select Committee on Assassinations (HSCA)",
    "Soviet Union",
    "Cuba",
    "KGB",
    "Social Security Administration"
  ],
  "significance": "Marina Oswald's significance in the JFK assassination context stems from her close relationship with Lee Harvey Oswald. As his wife, she was a potential source of information about his motives, activities, and connections. Her knowledge was sought by various investigative bodies, including the Warren Commission and the HSCA. Her life and background were scrutinized to understand Lee Harvey Oswald's actions and any potential conspiracies related to the assassination.",
  "document_ids": [
    "180-10094-10459",
    "144-10001-10138",
    "180-10143-10227",
    "180-10110-10100",
    "135-10001-10276",
    "104-10535-10001",
    "135-10001-10283",
    "144-10001-10164",
    "180-10096-10399",
    "104-10301-10002",
    "180-10072-10186",
    "104-10305-10005",
    "180-10143-10062",
    "135-10001-10255",
    "104-10326-10013",
    "144-10001-10264",
    "180-10131-10324"
  ]
}