{
  "entity_name": "Robert A. Maheu",
  "entity_type": "person-mentioned",
  "document_count": 9,
  "summary": "Robert A. Maheu was a personnel relations executive and former FBI agent who was utilized by the CIA's Office of Security for sensitive assignments starting in the early 1950s. He had a history with the FBI and was involved in private business ventures, including Robert A. Maheu Associates. Maheu was recruited by the CIA in 1954 and participated in various covert operations, including those related to Fidel Castro, President Sukarno, and King Hussein. He was also involved in Jordanian public relations and was aware of U.S. government and CIA interest in him. His activities raised concerns within the Agency due to Senate Subcommittee interest. Maheu was investigated by International Intelligence, Inc. (INTERTEL) on behalf of the Hughes Tool Company. Telephone calls made from Robert A. Maheu and Associates in Los Angeles were investigated, revealing connections to former FBI Special Agents.",
  "key_connections": [
    "FBI",
    "CIA",
    "Fidel Castro",
    "King Hussein",
    "Hughes Tool Company",
    "John Rosselli",
    "International Intelligence, Inc. (INTERTEL)",
    "Robert D. Peloquin",
    "President Sukarno"
  ],
  "significance": "Robert A. Maheu's significance in the JFK assassination context stems from his involvement in CIA operations, including plots against Fidel Castro, which are often scrutinized for potential links to the assassination. His connections to individuals like John Rosselli, who was also implicated in assassination attempts, further contribute to his relevance in this context. The documents highlight Maheu's role as a key figure in sensitive and covert activities during the period leading up to the JFK assassination, making him a person of interest in investigations and analyses related to the event.",
  "document_ids": [
    "104-10122-10288",
    "104-10121-10341",
    "104-10121-10366",
    "124-10223-10173",
    "157-10011-10006",
    "104-10122-10344",
    "104-10122-10279",
    "104-10121-10342",
    "104-10122-10141"
  ]
}