{
  "entity_name": "Stanley Levison",
  "entity_type": "tag",
  "document_count": 12,
  "summary": "Stanley Levison was a key figure investigated by the FBI due to his close association with Martin Luther King Jr. and alleged ties to the Communist Party USA (CPUSA). The FBI's interest in Levison stemmed from concerns about potential communist influence within the Civil Rights Movement, particularly within the Southern Christian Leadership Conference (SCLC). Multiple documents summarize testimonies and investigations focusing on Levison's connections to King and the CPUSA, detailing FBI efforts to establish a factual basis for Levison's alleged secret CPUSA membership. The documents span from 1962 to 1975, with a concentration on testimonies given in 1975 before the Senate Select Committee (SSC) regarding investigations into King, the SCLC, and Levison. A notable pattern across the documents is the FBI's focus on electronic surveillance and the collection of information to ascertain the extent of Levison's communist affiliations and his influence on King.",
  "key_connections": [
    "Martin Luther King Jr.",
    "Southern Christian Leadership Conference (SCLC)",
    "Communist Party USA (CPUSA)",
    "FBI",
    "Senate Select Committee (SSC)"
  ],
  "significance": "In the context of the JFK assassination, Stanley Levison's significance is indirect but relevant. The intense scrutiny of Martin Luther King Jr. and his associates, including Levison, by the FBI during this period reflects the broader political climate and the government's concerns about potential subversive influences. While not directly implicated in the assassination, the investigations into Levison highlight the complex web of political affiliations and surveillance activities that characterized the era.",
  "document_ids": [
    "124-10276-10482_multirif",
    "124-10274-10358_multirif",
    "124-10273-10014_multirif",
    "124-10273-10016_multirif",
    "124-10273-10012_multirif",
    "124-10238-10333_multirif",
    "124-10274-10357_multirif",
    "124-10273-10022_multirif",
    "124-10273-10008_multirif",
    "124-10276-10483_multirif",
    "124-10238-10329_multirif",
    "124-10273-10018_multirif"
  ]
}