{
  "entity_name": "Social Security Number",
  "entity_type": "tag",
  "document_count": 43,
  "summary": "Social Security Numbers (SSNs) appear in the context of House Select Committee on Assassinations (HSCA) staff payroll records. The Assassination Records Review Board (ARRB) issued Final Determination Notifications regarding the release status of these records. A recurring pattern across the documents is the postponement of the release of SSNs due to privacy concerns. This postponement is consistently cited as a measure to protect the personal privacy of HSCA staff members. The documents often include payroll authorization forms, memoranda, and other employment-related records, with the SSNs redacted or postponed from release. The redaction or postponement is a key aspect, indicating a balance between historical transparency and individual privacy rights. The documents span from the late 1970s, during the HSCA's active period, to the mid-1990s when the ARRB was reviewing these records for release.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Assassination Records Review Board (ARRB)",
    "HSCA staff members",
    "Payroll records",
    "Final Determination Notifications",
    "Louis Stokes",
    "Henry B. Gonzalez"
  ],
  "significance": "In the JFK assassination context, Social Security Numbers themselves do not have direct significance to the assassination events. However, their presence in HSCA staff payroll records and the subsequent decisions regarding their release by the ARRB highlight the complexities of balancing historical transparency with individual privacy concerns in the declassification of assassination-related documents. The redaction of SSNs reflects a broader effort to protect personal information while still providing access to relevant historical records.",
  "document_ids": [
    "180-10060-10441",
    "180-10068-10335",
    "180-10068-10322",
    "180-10060-10483",
    "180-10068-10363",
    "180-10068-10318",
    "180-10060-10460",
    "180-10068-10355",
    "180-10068-10309",
    "180-10070-10161",
    "180-10068-10305",
    "180-10068-10313",
    "180-10070-10157",
    "180-10060-10471",
    "180-10147-10265",
    "180-10060-10470",
    "180-10060-10489",
    "180-10068-10324",
    "180-10060-10493",
    "180-10068-10298",
    "180-10068-10332",
    "180-10070-10160",
    "180-10060-10490",
    "180-10070-10159",
    "180-10060-10486",
    "180-10070-10155",
    "180-10070-10143",
    "180-10060-10449",
    "180-10068-10350",
    "180-10068-10306",
    "180-10068-10326",
    "180-10147-10261",
    "180-10070-10153",
    "180-10060-10459",
    "180-10068-10337",
    "180-10070-10173",
    "180-10060-10454",
    "180-10068-10361",
    "180-10060-10439",
    "180-10060-10458",
    "180-10068-10300",
    "180-10060-10462",
    "180-10070-10144"
  ]
}