{
  "entity_name": "House Select Committee on Assassinations",
  "entity_type": "tag",
  "document_count": 50,
  "summary": "The House Select Committee on Assassinations (HSCA) was a U.S. House of Representatives committee established in 1976 to investigate the assassinations of President John F. Kennedy and Martin Luther King Jr. The documents reveal the HSCA's extensive interactions with various government agencies, including the CIA, FBI, and NSA, as they sought information and conducted interviews related to their investigations. The committee's inquiries spanned a range of topics, from potential Cuban involvement in the JFK assassination to the activities of individuals and groups connected to the assassinations. The documents also highlight the CIA's concerns about protecting sensitive sources, operational security, and nonofficial cover officers during interactions with the HSCA. The timeline of involvement spans from at least 1976 to 1978, with some documents referencing earlier events relevant to the investigations. A notable pattern across the documents is the emphasis on managing the flow of information to the HSCA, balancing transparency with the need to safeguard classified intelligence and protect ongoing operations.",
  "key_connections": [
    "CIA",
    "FBI",
    "NSA",
    "John F. Kennedy",
    "Martin Luther King Jr.",
    "David F. Christensen",
    "James Earl Ray",
    "Nikolay Sergeyevich Leonov",
    "William K. Harvey",
    "Permindex Corporation",
    "Front National (National Front)",
    "Yuriy Ivanovich Nosenko"
  ],
  "significance": "The HSCA played a crucial role in the JFK assassination context by conducting a formal investigation into the circumstances surrounding President Kennedy's death. Their investigation involved gathering information from various sources, including government agencies and individuals with potential knowledge of the assassination. The HSCA's findings and conclusions contributed to the ongoing debate and scrutiny surrounding the JFK assassination, shaping public understanding and influencing subsequent investigations and analyses.",
  "document_ids": [
    "144-10001-10175",
    "104-10140-10420",
    "180-10125-10097",
    "180-10060-10441",
    "104-10195-10002",
    "124-10180-10217_multirif",
    "104-10145-10047",
    "180-10060-10483",
    "104-10165-10087",
    "180-10068-10363",
    "104-10067-10043",
    "104-10337-10001",
    "144-10001-10178",
    "180-10125-10080",
    "104-10218-10008",
    "104-10193-10076",
    "104-10065-10069",
    "104-10291-10009",
    "180-10068-10309",
    "104-10193-10163",
    "180-10070-10161",
    "104-10067-10044",
    "180-10071-10001",
    "104-10213-10352",
    "144-10001-10164",
    "104-10065-10075",
    "180-10070-10160",
    "104-10226-10117",
    "104-10067-10046",
    "104-10227-10000",
    "104-10146-10308",
    "180-10060-10445",
    "104-10221-10022",
    "104-10165-10077",
    "104-10065-10105",
    "104-10194-10023",
    "144-10001-10218",
    "180-10140-10152",
    "180-10060-10464",
    "104-10151-10188",
    "104-10142-10279",
    "104-10061-10214",
    "104-10140-10101",
    "104-10079-10163",
    "180-10060-10442",
    "144-10001-10253",
    "180-10070-10148",
    "144-10001-10249",
    "104-10142-10055",
    "104-10147-10202"
  ]
}