{
  "entity_name": "ARRB",
  "entity_type": "tag",
  "document_count": 44,
  "summary": "The Assassination Records Review Board (ARRB) was established to oversee the declassification and release of government records related to the John F. Kennedy assassination, operating primarily from 1994 to 1998. The ARRB's role was to ensure compliance with the JFK Assassination Records Collection Act of 1992, balancing the public interest in transparency with the need to protect sensitive national security information, intelligence sources, and methods. The ARRB engaged with various government agencies, particularly the CIA, NSA, and Department of State, to review records, negotiate redactions, and resolve disputes over the release of information. Key issues included protecting the identities of CIA employees and assets, cover mechanisms, ongoing intelligence operations, and sensitive foreign government relationships. The ARRB's interactions with the CIA involved numerous meetings, requests for information, and formal determinations regarding the release of specific records and information. The ARRB also sought assistance from the Department of State in approaching foreign governments, such as Russia, for access to relevant files.",
  "key_connections": [
    "CIA",
    "NSA",
    "Department of State",
    "John F. Kennedy",
    "Lee Harvey Oswald",
    "House Select Committee on Assassinations (HSCA)",
    "KGB/FSB/SVR",
    "Director of Central Intelligence George Tenet"
  ],
  "significance": "The ARRB played a crucial role in making available a significant amount of previously classified information related to the JFK assassination. It served as an independent body to challenge government secrecy and promote transparency, while also grappling with the complexities of protecting legitimate national security concerns. The ARRB's work has had a lasting impact on the historical record of the JFK assassination and continues to inform public understanding of the events surrounding it.",
  "document_ids": [
    "104-10331-10080",
    "104-10333-10008",
    "104-10326-10016",
    "104-10330-10070",
    "104-10333-10013",
    "104-10331-10166",
    "104-10332-10000",
    "104-10331-10127",
    "104-10326-10017",
    "104-10331-10202",
    "104-10328-10038",
    "104-10330-10010",
    "104-10331-10321",
    "104-10331-10209",
    "104-10333-10002",
    "144-10001-10153",
    "104-10331-10177",
    "104-10332-10007",
    "104-10326-10010",
    "180-10071-10000",
    "104-10336-10034",
    "104-10331-10134",
    "104-10331-10118",
    "104-10326-10012",
    "104-10332-10009",
    "104-10330-10081",
    "104-10331-10154",
    "104-10331-10338",
    "104-10331-10178",
    "104-10332-10008",
    "104-10331-10139",
    "104-10336-10000",
    "104-10331-10226",
    "104-10333-10001",
    "104-10331-10318",
    "104-10332-10023",
    "104-10331-10132",
    "144-10001-10287",
    "104-10333-10006",
    "104-10331-10149",
    "104-10332-10002",
    "104-10332-10022",
    "104-10331-10152",
    "104-10331-10353"
  ]
}