{
  "entity_name": "Informant",
  "entity_type": "tag",
  "document_count": 46,
  "summary": "The documents highlight the use of informants by various agencies, including the FBI and CIA, in gathering intelligence related to organized crime, anti-Castro activities, and potential threats. Informants provided information on individuals like Santo Trafficante Jr., John Rosselli, Carlos Marcello, and their associates, as well as details on Cuban exile groups and potential assassination plots against Fidel Castro. The information obtained from informants was used to investigate various activities, including gambling, drug trafficking, arms smuggling, and potential Communist ties. The documents also reveal concerns about protecting the identity of informants and the sensitivity of the information they provided. Some informants were used to gather intelligence in Cuba, while others provided information on individuals within the United States. The timeline spans from the late 1950s to the 1970s, indicating a sustained reliance on informants for intelligence gathering during this period.",
  "key_connections": [
    "Santo Trafficante Jr.",
    "John Rosselli",
    "Carlos Marcello",
    "Fidel Castro",
    "Cuban exile groups",
    "FBI",
    "CIA",
    "House Select Committee on Assassinations (HSCA)",
    "Senate Select Committee on Intelligence Activities (SSC)",
    "Martin Luther King Jr.",
    "Stanley Levison",
    "Alpha 66",
    "Sam Giancana"
  ],
  "significance": "In the JFK context, informants were crucial in providing intelligence related to individuals and groups potentially involved in organized crime and anti-Castro activities, which were areas of interest in the investigation of the assassination. The documents suggest that informants were used to gather information on individuals who may have had motives or connections relevant to the assassination, although the documents do not directly link any informant to the assassination itself. The use of informants highlights the intelligence-gathering efforts surrounding individuals and groups of interest during the period.",
  "document_ids": [
    "104-10069-10077",
    "124-90135-10074",
    "104-10177-10206",
    "124-10204-10146",
    "144-10001-10051",
    "124-10204-10147",
    "124-10223-10070",
    "180-10076-10105",
    "104-10119-10367",
    "104-10177-10047",
    "124-10204-10203",
    "124-10212-10160",
    "124-10180-10323_multirif",
    "124-10204-10212",
    "124-10271-10003_multirif",
    "124-10203-10468",
    "124-10223-10082",
    "124-10223-10304",
    "104-10114-10160",
    "104-10178-10071",
    "104-10308-10163",
    "124-10204-10213",
    "124-10180-10236_multirif",
    "124-10204-10154",
    "124-10204-10206",
    "124-10203-10466",
    "124-10238-10333_multirif",
    "104-10120-10301",
    "124-10203-10294",
    "124-10271-10011_multirif",
    "124-10204-10495",
    "124-10274-10044",
    "104-10221-10222",
    "124-90137-10230",
    "124-10203-10246",
    "124-10300-10012",
    "124-10213-10310",
    "104-10048-10252",
    "124-10238-10329_multirif",
    "104-10188-10454",
    "124-10180-10325_multirif",
    "124-10223-10064",
    "124-10203-10482",
    "124-90137-10067",
    "124-10203-10292",
    "104-10106-10188"
  ]
}