{
  "entity_name": "Social Security Numbers",
  "entity_type": "tag",
  "document_count": 62,
  "summary": "Social Security Numbers (SSNs) appear in the context of the JFK assassination records primarily within the payroll records of the House Select Committee on Assassinations (HSCA). The Assassination Records Review Board (ARRB) frequently issued Final Determination Notifications regarding the postponement of the release of SSNs from these payroll records to protect the personal privacy of HSCA staff. This postponement was based on the determination that releasing SSNs would constitute an unwarranted invasion of privacy, outweighing the public interest. The documents often include payroll authorization forms, memoranda, resumes, and correspondence related to HSCA staff employment, all of which were subject to review and redaction of SSNs. The ARRB set future review dates, often around 2017, for these postponed records. A notable pattern across the documents is the consistent effort to balance historical transparency with the privacy rights of individuals involved with the HSCA.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Assassination Records Review Board (ARRB)",
    "HSCA Staff Payroll Records",
    "Final Determination Notifications",
    "Payroll Authorization Forms",
    "Personal Privacy"
  ],
  "significance": "In the JFK assassination context, Social Security Numbers themselves do not directly relate to the events of the assassination. Their significance lies in the legal and ethical considerations surrounding the release of government records. The ARRB's decisions to postpone the release of SSNs highlight the tension between the public's right to access historical information and the need to protect the privacy of individuals who worked on the HSCA investigation. The repeated redaction of SSNs across numerous documents underscores the importance placed on privacy concerns within the broader context of declassifying assassination-related materials.",
  "document_ids": [
    "180-10068-10303",
    "180-10068-10315",
    "180-10060-10436",
    "180-10068-10339",
    "180-10060-10498",
    "180-10060-10457",
    "180-10070-10171",
    "180-10068-10319",
    "180-10060-10495",
    "180-10068-10334",
    "180-10070-10166",
    "180-10060-10440",
    "180-10068-10359",
    "180-10070-10150",
    "180-10060-10499",
    "180-10070-10146",
    "180-10068-10314",
    "180-10068-10343",
    "180-10060-10447",
    "180-10060-10484",
    "180-10068-10325",
    "180-10068-10352",
    "180-10060-10467",
    "180-10071-10001",
    "180-10147-10264",
    "180-10071-10000",
    "180-10068-10328",
    "180-10068-10312",
    "180-10068-10345",
    "180-10068-10349",
    "180-10068-10308",
    "180-10070-10176",
    "180-10060-10450",
    "180-10068-10327",
    "180-10070-10163",
    "180-10060-10453",
    "180-10070-10175",
    "180-10060-10465",
    "180-10068-10311",
    "180-10068-10346",
    "180-10068-10310",
    "180-10060-10464",
    "180-10060-10472",
    "180-10070-10154",
    "180-10147-10266",
    "180-10070-10174",
    "180-10070-10162",
    "180-10060-10444",
    "180-10060-10468",
    "180-10060-10463",
    "180-10070-10145",
    "180-10060-10480",
    "180-10060-10438",
    "180-10147-10257",
    "180-10125-10083",
    "180-10060-10455",
    "180-10070-10164",
    "180-10060-10481",
    "180-10068-10336",
    "180-10068-10357",
    "180-10068-10341",
    "180-10147-10260"
  ]
}