{
  "entity_name": "COINTELPRO",
  "entity_type": "tag",
  "document_count": 37,
  "summary": "COINTELPRO (Counter Intelligence Program) was a series of covert, and at times illegal, projects conducted by the United States Federal Bureau of Investigation (FBI) aimed at surveilling, infiltrating, discrediting, and disrupting domestic political organizations. The documents reveal that COINTELPRO was a subject of intense scrutiny by the Senate Select Committee (SSC) and the House Select Committee on Assassinations (HSCA) in the 1970s. These committees investigated the FBI's domestic intelligence activities, including COINTELPRO operations targeting various groups such as the Black Panther Party, the Ku Klux Klan, and other organizations deemed subversive. The investigations focused on the legality, ethics, and potential abuses of power associated with these programs. The FBI was tasked with providing information and documents to these committees, leading to internal discussions about how to respond to inquiries and what information to disclose. The documents also highlight concerns about potential compromises of FBI sources and methods due to the investigations.",
  "key_connections": [
    "FBI",
    "Senate Select Committee (SSC)",
    "House Select Committee on Assassinations (HSCA)",
    "Martin Luther King Jr.",
    "Southern Christian Leadership Conference (SCLC)",
    "Black Panther Party",
    "Ku Klux Klan",
    "Students for a Democratic Society (SDS)",
    "Stanley Levison",
    "Huston Plan"
  ],
  "significance": "While the documents primarily focus on COINTELPRO's activities in relation to Martin Luther King Jr. and other domestic groups, the HSCA's investigation into the JFK assassination also prompted inquiries into COINTELPRO. The significance lies in the potential for COINTELPRO's methods and targets to have influenced events surrounding the assassination, or for the program to have been used to suppress or manipulate information related to the assassination investigation. The documents suggest that the HSCA sought to understand the full scope of the FBI's activities and whether they played any role, directly or indirectly, in the JFK assassination or its aftermath.",
  "document_ids": [
    "124-10180-10324_multirif",
    "124-10180-10320_multirif",
    "124-10276-10482_multirif",
    "124-10186-10048_multirif",
    "124-10180-10217_multirif",
    "124-10179-10219_multirif",
    "124-10274-10358_multirif",
    "124-10180-10323_multirif",
    "124-10185-10195_multirif",
    "124-10271-10003_multirif",
    "124-10186-10045_multirif",
    "124-10186-10056_multirif",
    "124-10273-10105",
    "124-10273-10014_multirif",
    "124-10186-10051_multirif",
    "124-10264-10208_multirif",
    "124-10186-10055_multirif",
    "157-10002-10152",
    "124-10273-10016_multirif",
    "124-10188-10208",
    "124-10180-10236_multirif",
    "124-10186-10054_multirif",
    "124-10271-10033_multirif_redacted",
    "124-10264-10191",
    "124-10185-10193_multirif",
    "124-10184-10237",
    "124-10274-10357_multirif",
    "124-10271-10011_multirif",
    "124-10273-10022_multirif",
    "124-10273-10008_multirif",
    "124-10271-10299_multirif",
    "124-10179-10221",
    "124-10271-10003",
    "124-10276-10483_multirif",
    "124-10180-10325_multirif",
    "124-10273-10018_multirif",
    "124-10186-10049_multirif"
  ]
}