{
  "entity_name": "Cuban Embassy",
  "entity_type": "tag",
  "document_count": 27,
  "summary": "The Cuban Embassy appears in numerous documents related to the JFK assassination investigation, primarily concerning Lee Harvey Oswald's visits to the Cuban Embassy in Mexico City prior to the assassination. These visits, along with Oswald's contacts with the Soviet Embassy, raised suspicions and prompted CIA surveillance operations, including Project LIENVOY, which involved telephone intercepts of the Cuban Embassy. The documents also reveal Cuban officials' reactions to the assassination, including concerns about potential repercussions and blame being placed on Cuba. Furthermore, the Cuban Embassy was a target of intelligence gathering efforts, including audio surveillance operations and attempts to identify individuals associated with the embassy who may have had connections to Cuban intelligence or the KGB. The documents also mention potential contacts between Cuban Embassy officials and Guatemalan rebel groups, as well as incidents involving Cuban Embassy personnel and attacks on Cuban diplomatic properties.",
  "key_connections": [
    "Lee Harvey Oswald",
    "Soviet Embassy",
    "CIA",
    "KGB",
    "Fidel Castro",
    "Warren Commission",
    "HSCA",
    "Project LIENVOY",
    "Silvia Duran",
    "Yuri (KGB Officer)",
    "Marta FRAYDE",
    "Fuerzas Armadas Rebeldes (FAR)"
  ],
  "significance": "The Cuban Embassy's significance in the JFK assassination context lies in its connection to Lee Harvey Oswald's pre-assassination activities in Mexico City. Oswald's visits to the Cuban and Soviet Embassies fueled suspicions about his motives and potential involvement with foreign powers. The CIA's surveillance of the Cuban Embassy and its personnel aimed to uncover any connections between Oswald and Cuban intelligence, and to assess the Cuban government's potential role in the assassination. The documents also highlight the broader context of US-Cuban relations during the Cold War and the potential for Cuban involvement in the assassination, which was a subject of intense scrutiny during the investigation.",
  "document_ids": [
    "124-10181-10009",
    "177-10001-10063",
    "144-10001-10158",
    "180-10110-10100",
    "104-10413-10057",
    "124-90090-10038",
    "180-10143-10113",
    "177-10001-10064",
    "104-10428-10012",
    "104-10187-10030",
    "104-10074-10413",
    "104-10102-10043",
    "104-10052-10130",
    "104-10103-10244",
    "180-10110-10484",
    "104-10181-10011",
    "144-10001-10166",
    "104-10216-10238",
    "157-10004-10144",
    "104-10071-10257",
    "104-10413-10306",
    "104-10072-10228",
    "124-10280-10057",
    "144-10001-10213",
    "104-10188-10012",
    "124-10279-10107",
    "124-10058-10420"
  ]
}