{
  "entity_name": "Payroll Authorization",
  "entity_type": "tag",
  "document_count": 46,
  "summary": "Payroll Authorization forms are administrative documents used by the House Select Committee on Assassinations (HSCA) to authorize and record the payment of salaries to its staff members. These forms typically include details such as the employee's name, position, salary, employment dates, and authorizing signatures. The Assassination Records Review Board (ARRB) reviewed these payroll records and often postponed the release of Social Security numbers contained within them to protect personal privacy. The documents containing these forms provide insights into the staffing and financial operations of the HSCA, revealing the individuals who worked on the investigation into the JFK assassination and related matters, such as the Martin Luther King Task Force. The records also include related memoranda, certifications, and notifications regarding employment terms and conditions.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Assassination Records Review Board (ARRB)",
    "HSCA Staff",
    "Martin Luther King Task Force",
    "Social Security numbers",
    "Final Determination Notification"
  ],
  "significance": "Payroll Authorization forms themselves don't directly relate to the JFK assassination. However, they are significant in the context of the HSCA investigation as they document the individuals involved in the investigation, their roles, and their compensation. These records provide a glimpse into the inner workings of the committee and contribute to a broader understanding of the efforts to investigate the assassination.",
  "document_ids": [
    "180-10068-10303",
    "180-10147-10259",
    "180-10068-10315",
    "180-10060-10436",
    "180-10060-10477",
    "180-10060-10498",
    "180-10070-10171",
    "180-10060-10441",
    "180-10068-10362",
    "180-10060-10482",
    "180-10060-10495",
    "180-10068-10363",
    "180-10068-10318",
    "180-10060-10440",
    "180-10068-10359",
    "180-10070-10150",
    "180-10147-10258",
    "180-10070-10161",
    "180-10060-10492",
    "180-10068-10344",
    "180-10068-10313",
    "180-10070-10157",
    "180-10147-10265",
    "180-10071-10001",
    "180-10147-10264",
    "180-10068-10312",
    "180-10068-10298",
    "180-10068-10349",
    "180-10070-10175",
    "180-10060-10473",
    "180-10068-10350",
    "180-10068-10307",
    "180-10068-10347",
    "180-10068-10310",
    "180-10070-10154",
    "180-10070-10158",
    "180-10060-10475",
    "180-10068-10317",
    "180-10060-10459",
    "180-10068-10321",
    "180-10060-10438",
    "180-10070-10173",
    "180-10068-10336",
    "180-10070-10148",
    "180-10060-10478",
    "180-10147-10260"
  ]
}