{
  "entity_name": "Miami",
  "entity_type": "tag",
  "document_count": 55,
  "summary": "Miami, Florida, serves as a significant hub in the documented activities, primarily related to Cuban exiles, anti-Castro operations, and intelligence activities. The documents reveal Miami as a base for various anti-Castro groups, a location for CIA operations (JMWAVE), and a focal point for monitoring Cuban activities. It is also a place where Cuban exiles sought support, planned actions against the Castro regime, and engaged in various activities, some of which involved potential criminal behavior like narcotics trafficking. The city also appears as a location for potential recruitment of assets, cover operations, and liaison activities between the CIA and local law enforcement. The timeline spans from the late 1950s to the late 1970s, indicating a sustained period of intense activity related to Cuban affairs and intelligence operations.",
  "key_connections": [
    "Cuban exiles",
    "Anti-Castro groups",
    "CIA (JMWAVE)",
    "Luis Posada Carriles",
    "Frank Sturgis",
    "Rolando Masferrer",
    "Wackenhut Corporation",
    "Cuban Revolutionary Council",
    "Santo Trafficante Jr.",
    "FBI",
    "Cuban Intelligence (CUIS)"
  ],
  "significance": "While not directly linked to the JFK assassination in these documents, Miami's significance lies in its role as a center for anti-Castro activities and CIA operations targeting Cuba. The documents suggest that individuals and groups based in Miami were involved in various covert actions and intelligence gathering, which indirectly contributes to the broader context of tensions and conflicts surrounding Cuba during the Cold War era. Some individuals connected to Miami, such as Frank Sturgis and Luis Posada Carriles, have been subjects of speculation and investigation related to the assassination, though these documents do not explicitly connect Miami to the event.",
  "document_ids": [
    "104-10095-10202",
    "104-10177-10226",
    "104-10215-10005",
    "104-10130-10454",
    "104-10078-10020",
    "104-10510-10141",
    "104-10167-10366",
    "104-10178-10000",
    "194-10001-10496",
    "104-10230-10154",
    "104-10062-10062",
    "124-10212-10160",
    "124-10332-10047",
    "104-10169-10000",
    "104-10129-10264",
    "104-10183-10384",
    "104-10221-10020",
    "104-10178-10046",
    "124-90110-10071",
    "104-10049-10004",
    "104-10057-10096",
    "104-10225-10012",
    "124-10221-10231",
    "104-10169-10006",
    "104-10104-10094",
    "124-10226-10305",
    "104-10183-10366",
    "124-90073-10039",
    "104-10162-10120",
    "104-10221-10021",
    "104-10182-10007",
    "104-10178-10052",
    "124-10204-10206",
    "124-10203-10466",
    "104-10308-10044",
    "178-10002-10091",
    "104-10234-10088",
    "104-10215-10149",
    "135-10001-10238",
    "124-90090-10037",
    "104-10062-10046",
    "104-10135-10145",
    "104-10221-10222",
    "124-90110-10072",
    "104-10066-10107",
    "157-10005-10424",
    "104-10169-10003",
    "104-10167-10190",
    "124-10213-10310",
    "124-10300-10024",
    "104-10221-10032",
    "104-10166-10120",
    "104-10162-10108",
    "104-10167-10083",
    "124-10371-10015"
  ]
}