{
  "entity_name": "David Reed Fromer",
  "entity_type": "tag",
  "document_count": 21,
  "summary": "David Reed Fromer was a Selective Service registrant who was the subject of multiple agency checks and investigations by the FBI and the U.S. Army in the 1960s. These investigations included local agency checks in various California cities and FBI file checks in Chicago and San Francisco. Fromer's background was scrutinized, including his personal history, family details, education, employment, and his status as a conscientious objector. He declined to answer questions regarding organizational memberships, citing legal advice and later invoked his Fifth Amendment rights when refusing to complete security forms at an Armed Forces Entrance and Examination Station. The investigations also looked into his possible association with student organizations like SLATE and a childhood mention in the People's World newspaper. The purpose of these investigations appears to be related to determining his suitability for a security clearance, with requests to expedite the process due to delays at the Department of the Army. A JFK Assassination System Identification Form also exists for him, indicating his records were reviewed in that context, although the specific reason is not detailed in the provided summaries.",
  "key_connections": [
    "FBI",
    "U.S. Army",
    "SLATE",
    "People's World",
    "113th Intelligence Corps Group"
  ],
  "significance": "David Reed Fromer's significance in the JFK assassination context is not explicitly stated in the provided documents. However, the existence of a JFK Assassination System Identification Form suggests that his records were reviewed as part of the broader investigation into the assassination. The documents primarily focus on security clearance investigations related to his Selective Service registration and potential military service, rather than direct involvement in the assassination itself.",
  "document_ids": [
    "194-10004-10160",
    "194-10004-10156",
    "194-10004-10141",
    "194-10004-10161",
    "194-10004-10150",
    "194-10002-10094",
    "194-10004-10147",
    "194-10004-10151",
    "194-10004-10152",
    "194-10004-10129",
    "194-10004-10148",
    "194-10004-10149",
    "194-10004-10153",
    "194-10004-10162",
    "194-10004-10135",
    "194-10004-10154",
    "194-10004-10139",
    "194-10004-10138",
    "194-10004-10155",
    "194-10004-10143",
    "194-10004-10159"
  ]
}