{
  "entity_name": "Garrison Investigation",
  "entity_type": "tag",
  "document_count": 7,
  "summary": "The Garrison Investigation refers to the inquiry led by New Orleans District Attorney Jim Garrison into the assassination of President John F. Kennedy. The investigation sought to uncover a conspiracy involving individuals and organizations potentially linked to the CIA and anti-Castro Cuban groups. Documents reveal the CIA's awareness and monitoring of Garrison's activities, including efforts to counter the investigation's claims and address potential exposure of individuals with Agency connections. The investigation involved individuals such as Gordon Novel, William Wayne Dalzell, and Emilio Santana Galindo, whose backgrounds and potential ties to the CIA were scrutinized. The timeline of involvement spans from the early 1960s, with anti-Castro activities, to the late 1960s, when Garrison's investigation gained prominence, and continues into the 1970s with ongoing monitoring and responses to claims related to the investigation.",
  "key_connections": [
    "Jim Garrison",
    "CIA",
    "Anti-Castro Cuban Groups",
    "Gordon Novel",
    "William Wayne Dalzell",
    "Emilio Santana Galindo",
    "John F. Kennedy Assassination",
    "Schlumberger Well Surveying Corporation",
    "Julio Lanier Hevia",
    "Manuel Ray y Rivero"
  ],
  "significance": "The Garrison Investigation is significant in the JFK assassination context as it represents a prominent attempt to uncover a conspiracy beyond Lee Harvey Oswald. It raised questions about potential CIA involvement and connections to anti-Castro Cuban groups, contributing to various conspiracy theories surrounding the assassination. The CIA's response to the investigation, as documented in these records, highlights the Agency's concern over potential exposure and the need to manage public perception.",
  "document_ids": [
    "104-10170-10145",
    "180-10145-10269",
    "104-10012-10076",
    "104-10305-10000",
    "104-10170-10171",
    "104-10106-10716",
    "104-10170-10146"
  ]
}