{
  "entity_name": "Minsk",
  "entity_type": "tag",
  "document_count": 14,
  "summary": "Minsk, the capital of Belarus, is significant in the JFK assassination context primarily due to Lee Harvey Oswald's residence there from 1959 to 1962. CIA interest in Minsk revolves around accessing records related to Oswald's time in the city, particularly through the Belarusian KGB (BKGB). The documents reveal efforts by the CIA and the Assassination Records Review Board (ARRB) to obtain these records, often encountering challenges due to privacy concerns and past failed attempts. The Minsk station played a crucial role in liaising with the BKGB and facilitating meetings, although CIA participation in substantive discussions was restricted. Beyond Oswald, Minsk is also mentioned in the context of Soviet life, KGB operations, and potential intelligence sources, such as a former Soviet radio broadcasting engineer. The timeline of involvement spans from Oswald's residence in the late 1950s to the late 1990s, with ongoing efforts to access and analyze relevant records.",
  "key_connections": [
    "Lee Harvey Oswald",
    "BKGB (Belarusian KGB)",
    "Assassination Records Review Board (ARRB)",
    "CIA",
    "Soviet Union",
    "Norman Mailer"
  ],
  "significance": "Minsk's significance in the JFK context lies in its connection to Lee Harvey Oswald's life before the assassination. It is the location where Oswald lived and worked in the Soviet Union, making it a potential source of information about his motivations, activities, and contacts. Accessing records from Minsk, particularly those held by the BKGB, was considered crucial for a comprehensive understanding of Oswald's background and potential connections to the assassination.",
  "document_ids": [
    "104-10326-10077",
    "104-10326-10040",
    "180-10143-10227",
    "180-10143-10152",
    "104-10326-10012",
    "104-10326-10100",
    "104-10181-10154",
    "104-10326-10013",
    "104-10326-10075",
    "104-10326-10074",
    "180-10145-10381",
    "104-10326-10078",
    "104-10326-10042",
    "144-10001-10377"
  ]
}