{
  "entity_name": "Administration",
  "entity_type": "tag",
  "document_count": 15,
  "summary": "The documents primarily relate to the administrative functions of various governmental bodies, particularly the House Select Committee on Assassinations (HSCA) and the Department of Defense. The records include payroll authorizations, personnel records, expense statements, and requests for access, reflecting the day-to-day operations and management of these organizations. The HSCA documents cover staff hiring, salary adjustments, and administrative leave, while the Department of Defense documents concern Cuban affairs and potential retaliatory actions. The documents span from 1965 to 1995, with a concentration in the late 1970s during the HSCA's active investigation. A notable pattern is the redaction or postponement of Social Security numbers due to privacy concerns.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Department of Defense",
    "Cyrus Vance",
    "Charlotte Green",
    "Jeffrey Facter",
    "Robin David Lindley",
    "Clarence J. Day",
    "Johanna Lynn Smith",
    "Lillian Johnson",
    "James Lerer Wolf",
    "Charles Michael Berk",
    "Elizabeth C. Feeley",
    "Thomas N. Downing",
    "James K. Conzelman",
    "Leslie H. Wizelman",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "University of New Mexico School of Medicine",
    "Cuban Government"
  ],
  "significance": "In the context of the JFK assassination, the administrative records of the HSCA are significant as they provide insight into the committee's staffing, operations, and resource allocation during its investigation. These records offer a glimpse into the inner workings of the committee and the individuals involved in examining the assassination. The Department of Defense documents, while not directly related to the HSCA, touch on Cuban affairs, which have been a subject of speculation and conspiracy theories related to the assassination.",
  "document_ids": [
    "202-10002-10124",
    "180-10068-10362",
    "180-10096-10448",
    "104-10174-10068",
    "180-10068-10344",
    "180-10060-10471",
    "180-10068-10332",
    "180-10070-10159",
    "180-10060-10453",
    "180-10070-10175",
    "180-10068-10306",
    "180-10068-10347",
    "180-10073-10321",
    "180-10068-10326",
    "180-10070-10173"
  ]
}