{
  "entity_name": "Administrative",
  "entity_type": "tag",
  "document_count": 25,
  "summary": "The 'Administrative' tag encompasses a range of documents related to the internal operations, personnel management, and logistical functions within various organizations, primarily the CIA and the House Select Committee on Assassinations (HSCA). These documents include certification reports detailing employee salaries and positions, message routing lists, personnel action requests, and reports from honor awards boards. They also cover the establishment of military cover backstops, privacy act cases, and the management of classified files. The documents highlight the administrative processes involved in handling personnel, maintaining security, and managing information within these organizations. The timeline spans from the 1950s to the late 1990s, with a few documents referencing future dates due to routing or record-keeping practices. A notable pattern is the focus on internal procedures, personnel management, and the handling of classified information.",
  "key_connections": [
    "CIA",
    "House Select Committee on Assassinations (HSCA)",
    "Assassination Records Review Board (ARRB)",
    "Personnel",
    "Classified Information",
    "Military Cover",
    "U.S. Embassies",
    "Joint Operations Group"
  ],
  "significance": "In the JFK assassination context, the 'Administrative' tag is significant because it highlights the internal workings of organizations involved in investigations or potentially related to the assassination. These documents provide insights into how these organizations managed information, personnel, and security, which can be relevant to understanding their actions and potential involvement in events surrounding the assassination. The documents related to the HSCA, in particular, show the administrative processes involved in the investigation itself.",
  "document_ids": [
    "180-10125-10078",
    "104-10510-10090",
    "104-10418-10439",
    "104-10295-10168",
    "180-10125-10079",
    "104-10326-10040",
    "104-10330-10133",
    "104-10422-10055",
    "104-10105-10212",
    "104-10124-10037",
    "104-10120-10290",
    "104-10519-10182",
    "104-10512-10102",
    "180-10060-10449",
    "104-10226-10024",
    "104-10051-10170",
    "104-10112-10204",
    "104-10291-10001",
    "104-10177-10121",
    "124-10179-10221_multirif",
    "104-10326-10034",
    "180-10125-10082",
    "104-10106-10215",
    "104-10163-10176",
    "104-10120-10274"
  ]
}