{
  "entity_name": "UMBRA",
  "entity_type": "tag",
  "document_count": 19,
  "summary": "The tag UMBRA appears in 19 documents, primarily within the context of National Security Agency (NSA) communications and reports related to the aftermath of President John F. Kennedy's assassination in November 1963. These documents cover a range of international reactions, including expressions of condolence, security measures, and political analyses from various countries and organizations. The documents also include reports on foreign leaders' evaluations of President Lyndon B. Johnson, and observations on how other nations were responding to the assassination. The tag appears to be used to categorize intelligence reports and communications related to the event and its immediate consequences, reflecting the NSA's monitoring of global reactions and potential security implications.",
  "key_connections": [
    "NSA (National Security Agency)",
    "President John F. Kennedy",
    "President Lyndon B. Johnson",
    "International Reactions to JFK Assassination",
    "Cuban Diplomatic Missions",
    "Viet Cong",
    "Abdul Nasser (UAR)",
    "Iraqi Ambassador",
    "Guatemalan Foreign Ministry",
    "South Korea",
    "United Nations General Assembly",
    "Belgian Foreign Minister",
    "Indonesian Presidential Bodyguard",
    "Tanganyika (Tanzania)",
    "Austria",
    "Communist Nationals",
    "Latin America",
    "Chou En-Lai",
    "Prince Sihanouk"
  ],
  "significance": "In the JFK assassination context, UMBRA signifies a category of classified intelligence reports and communications, primarily from the NSA, documenting the global reactions, security concerns, and political analyses following President Kennedy's death. It highlights the NSA's role in monitoring international responses and potential threats in the wake of the assassination.",
  "document_ids": [
    "144-10001-10302",
    "144-10001-10359",
    "144-10001-10352",
    "144-10001-10313",
    "144-10001-10309",
    "144-10001-10332",
    "144-10001-10060",
    "144-10001-10369",
    "144-10001-10312",
    "144-10001-10304",
    "144-10001-10370",
    "144-10001-10062",
    "124-90074-10051",
    "144-10001-10330",
    "144-10001-10058",
    "144-10001-10306",
    "144-10001-10321",
    "144-10001-10086",
    "144-10001-10286"
  ]
}