{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Revealing the specific methods and proposals discussed, such as the long wave radio station in Key West, subsidizing Diario de las Americas, 'Operacion Grieta,' and the provision of funds through the Italian Embassy, could expose ongoing operations and compromise intelligence sources. Additionally, detailing the commando plan and requests for arms could jeopardize covert actions and international relations. Directly quoting: 'Groups conducting propaganda, etc. with Agency support should receive their support and be coordinated through the Council,' and 'U. S. help would be necessary in providing weapons, ammo, demolitions, equipment, and funds'.",
  "security_level": "SECRET",
  "summary": "A memorandum detailing a meeting with Dr. MIRO Cardona, discussing propaganda efforts, underground activities, a commando plan for action in Cuba, requests for arms to support anti-Castro insurgents, and MIRO's proposal for the Revolutionary Council to establish a government on Cuban soil.",
  "summary_one_paragraph": "This SECRET memorandum, dated October 10, 1961, summarizes a meeting with Dr. MIRO Cardona, focusing on anti-Castro activities and strategies. The discussions included coordinating propaganda efforts through the Council, providing funds to resistance groups in Cuba via reliable channels, and a commando plan involving 300 men to conduct sabotage and bolster morale, contingent on U.S. support for weapons, equipment, and funding. Dr. MIRO also requested arms for insurgents in the Escambray region and shared a report on arms received by the Castro regime. The meeting culminated with Dr. MIRO proposing that the Revolutionary Council establish a government on Cuban soil, seeking U.S. recognition and military intervention, while criticizing the judges and lawyers involved and outlining the composition of the Revolutionary Council.",
  "tags": [
    "CIA",
    "MIRO Cardona",
    "Cuba",
    "Anti-Castro",
    "Propaganda",
    "Commando Plan",
    "Revolutionary Council",
    "Escambray",
    "Guantanamo"
  ],
  "title": "Meeting with Dr. MIRO Cardona on 6 October",
  "date": "1961-10-10",
  "locations_mentioned": [
    "Cuba",
    "Key West",
    "Miami",
    "United States",
    "Latin America",
    "Escambray",
    "Guantanamo",
    "New York City",
    "Buenos Aires"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "MIRO Cardona",
    "Manuel VARELA Castro",
    "Enrique DESPAIGE",
    "MONTEAGUDO",
    "Osvaldo RAMIREZ",
    "President FRONDIZI",
    "ALABAU",
    "VARONA",
    "Julio CARCERAN",
    "CASTRILLO",
    "CONTE AGUERO",
    "MESTRE",
    "PRIO",
    "Juho AMOEDO",
    "VILLANUEVA",
    "Nicanor FERNANDEZ",
    "LACERDA"
  ],
  "recipient": "Record",
  "sender": "Unknown"
}