{
  "classification": "John F. Kennedy Assassination",
  "document_type": "File",
  "security": "Several entries within the file reference Alastair Wicks' involvement in mercenary activities and potential plots to overthrow governments, particularly in the Congo. Revealing these details could expose ongoing or past intelligence operations and compromise relationships with foreign governments. Quoting: 'One of mercenaries involved in July '66 plot to overthrow MOBUTU' and 'MAVICAR JOHN MALLOCH...has been obliged to accept contracts which are obviously illegal.' This type of information, if released, could damage diplomatic relations and potentially endanger individuals involved.",
  "security_level": "SECRET",
  "summary": "This file contains information on Alastair Wicks, a mercenary involved in various activities in Africa, including recruitment, arms trafficking, and plots to overthrow governments, as well as his connections to other individuals and organizations involved in similar activities.",
  "summary_one_paragraph": "This file documents the activities of Alastair Wicks, a mercenary with Rhodesian citizenship, from the 1960s, detailing his involvement in the Katanga gendarme, recruitment for Tshombe's forces in the Congo, his role as second-in-command to Mike Hoare, and participation in plots to overthrow Mobutu. It includes information on his connections to Air Trans Africa, Jack Malloch, and potential involvement in arms trafficking to Yemen and Biafra. The file also contains correspondence and intelligence reports tracking his movements and activities in London and Lisbon, along with assessments of his capabilities and reliability.",
  "tags": [
    "Alastair Wicks",
    "Mercenary",
    "Congo",
    "Recruitment",
    "Arms Trafficking",
    "Plots",
    "Rhodesia",
    "Mike Hoare",
    "Jack Malloch",
    "Air Trans Africa",
    "Yemen",
    "Biafra",
    "Mobutu",
    "Tshombe",
    "Katanga",
    "FOIA"
  ],
  "title": "WICKES, ALASTAIR",
  "date": "1972-11-13",
  "locations_mentioned": [
    "London",
    "England",
    "Rhodesia",
    "Katanga",
    "Congo",
    "South Africa",
    "Johannesburg",
    "Yemen",
    "Salisbury",
    "Brussels",
    "Kinshasa",
    "Pretoria",
    "Lisbon",
    "Luanda",
    "Angola",
    "Sao Tome",
    "Brazzaville",
    "Sudan"
  ],
  "persons_mentioned": [
    "Alastair Wicks",
    "Mike Hoare",
    "Moise Tshombe",
    "Mobutu",
    "Jack Malloch",
    "Jean Schramme",
    "John Peters",
    "Pierre Laupeys",
    "Jack Valloch",
    "John Terrence Peet",
    "Jean Schramme",
    "Kenneth H. Philbrook",
    "Haslanger",
    "Wistatic/1",
    "O'Donovan",
    "John R. Latz",
    "Jerry O. Medlish"
  ],
  "recipient": "Chief of Station, PRETORIA; Chief Africa Division",
  "sender": "Chief of Station, Kinshasa; Nancy Blake"
}