{
  "classification": "Operations",
  "document_type": "Collection of Memos and Reports",
  "security": "Several documents discuss electronic surveillance technology and operational capabilities, revealing specific methods and contacts. For example, one memo discusses forwarding information on an electronic surveillance system developed by Wackenhut Corporation, and the subsequent evaluation by TSD technicians. Another details a case involving Sebastian Charles Volpe and his alleged involvement in installing a wire, potentially compromising ongoing operations. Disclosing these details could expose sensitive techniques, sources, and methods used by the CIA and its contractors, endangering personnel and compromising future intelligence efforts.",
  "security_level": "SECRET/CONFIDENTIAL",
  "summary": "This file contains memos and reports primarily concerning the Wackenhut Corporation, detailing interactions between the CIA and Wackenhut, including discussions about electronic surveillance technology, potential recruitment of former Agency personnel, and instances where Wackenhut provided services or information to the CIA.",
  "summary_one_paragraph": "This collection of documents focuses on the relationship between the CIA and the Wackenhut Corporation, spanning from 1970 to 1976, and includes communications about electronic surveillance systems developed by Wackenhut, instances of Wackenhut providing services such as security for a deported individual, and inquiries into Wackenhut personnel for potential Agency contacts. Memos detail discussions about miniature transmitters, potential adverse publicity related to individuals associated with Wackenhut, and efforts to maintain contact with former Agency employees now working for Wackenhut, reflecting the CIA's interest in leveraging Wackenhut's capabilities and personnel for intelligence purposes.",
  "tags": [
    "Wackenhut Corporation",
    "Electronic Surveillance",
    "DCD",
    "Sebastian Charles Volpe",
    "Bruce Berckmans",
    "Manuel Chavez",
    "Jamaica",
    "Miami Field Office",
    "Electro-Finders"
  ],
  "title": "Wackenhut Corporation File",
  "date": "1974-03-19",
  "locations_mentioned": [
    "Algeria",
    "Coral Gables, Florida",
    "Miami, Florida",
    "Denver, Colorado",
    "Jamaica",
    "Washington D.C.",
    "Panama",
    "El Salvador",
    "Chile",
    "Lima, Peru"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Justin F. Gleichauf",
    "Bruce Berckmans",
    "Sebastian Charles Volpe",
    "Manuel J. Chavez",
    "Richard Gerstein",
    "E. Wilson Purdy",
    "Paul Reilly",
    "Polly Ann Novell",
    "Angus Thuermer",
    "Marty Martinez",
    "George Wackenhut",
    "Henry I. Sayler",
    "Julian Nino Ruiz"
  ],
  "recipient": "Various CIA offices and personnel",
  "sender": "Various CIA officers, including Justin F. Gleichauf, Chief, Denver Field Office"
}