{
  "classification": "Cuba",
  "document_type": "Routing and Record Sheet/Speed Letter/Notices/Propaganda/Article",
  "security": "Disclosing Alpha 66's operational details—such as infiltration tactics and alleged successes within Cuba—could undermine ongoing covert actions and endanger members acting against the Castro regime. Additionally, revealing that Alpha 66 is seeking to instigate rebellion among the Cuban population could strain U.S.-Cuban relations. Quoting directly: “Alpha 66 is distributing hundreds of thousands of small pamphlets inviting the militia, the Rebel Army, and the people to participate in the fight against Castro-Communism.”",
  "security_level": "SECRET",
  "summary": "This collection of documents pertains to the activities of Alpha 66, an anti-Castro Cuban exile group, in Los Angeles during September 1970, including their propaganda efforts and claims of actions within Cuba, along with concerns and reactions to their activities from both the U.S. State Department and the Cuban exile community.",
  "summary_one_paragraph": "This collection of documents, including a routing sheet from the Los Angeles Office of the CIA and a speed letter from the Domestic Contact Service, focuses on Alpha 66's activities in Los Angeles as of September 1970. It includes Alpha 66 notices of meetings, propaganda materials, a history of the organization, a picture of Vicente Mendez, and tapes of meetings and interviews with Alpha 66 leaders. The documents reveal both the organization’s efforts to promote rebellion in Cuba and the U.S. State Department's concerns about Alpha 66's actions potentially violating neutrality laws, leading to federal scrutiny and backlash from the Cuban exile community.",
  "tags": [
    "Alpha 66",
    "Cuban Exiles",
    "Anti-Castro",
    "Propaganda",
    "State Department",
    "Neutrality Laws",
    "Los Angeles",
    "FOIA"
  ],
  "title": "Alpha 66 Doings in Los Angeles as of September 1970",
  "date": "1970-09-29",
  "locations_mentioned": [
    "Los Angeles",
    "Cuba",
    "Miami",
    "Havana",
    "Connecticut",
    "Washington D.C."
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Vicente Mendez",
    "Miguel Talleda",
    "Andreas Nazario Sargent",
    "Fidel Castro",
    "Strom Thurmond",
    "William C. Cramer",
    "Robert M. Closky",
    "John F. Kennedy"
  ],
  "recipient": "DCS Message Center, International Division",
  "sender": "Chief, Los Angeles Office (AMatson/bas); DOMESTIC CONTACT SERVICE Operational Support Statt. (George S. Kusulin)"
}