{
  "classification": "Operations",
  "document_type": "DDO Instruction",
  "security": "This document details the CIA's restrictions on using certain categories of individuals in clandestine operations. Disclosing these policies could expose sensitive operational methods and relationships with other organizations or governments. For example, it states, \"Operational use of publishers or producers of public information media requires prior approval by the Deputy Director for Operations whenever there is danger that such activity might serve in any way to influence U.S. public opinion.\" Sharing this would reveal concerns about influencing domestic public opinion.",
  "security_level": "SECRET",
  "summary": "This DDO instruction outlines restrictions on the operational use of specific categories of individuals by the CIA, including members of ACTION, Fulbright grantees, and employees of certain foundations, requiring special approvals or prohibiting their use altogether.",
  "summary_one_paragraph": "Dated September 4, 1973, this secret DDO instruction (No. 50-10) details restrictions and approval procedures for the operational use of certain individuals by the CIA. It prohibits the use of members and trainees of ACTION, Fulbright grantees, and employees of organizations like the International Association for Cultural Freedom and the Ford, Rockefeller, and Carnegie Foundations. Additionally, it mandates special extra-agency concurrence for employees of other U.S. government agencies and citizens of specific allied countries, as well as DDO approval for journalists, CARE employees, and officials from Communist countries, among others. The document provides definitions for 'operational use' and 'DDO element' and emphasizes the need for careful judgment and adherence to security considerations.",
  "tags": [
    "CIA",
    "DDO",
    "Operational Use",
    "Restrictions",
    "Human Intelligence",
    "Clandestine Operations",
    "ACTION",
    "Fulbright",
    "Foundations",
    "Intelligence Operations"
  ],
  "title": "RESTRICTIONS ON OPERATIONAL USE OF CERTAIN CATEGORIES OF INDIVIDUALS",
  "date": "1973-09-04",
  "origin_agency": "CIA",
  "recipient": "Operations Directorate",
  "sender": "William E. Nelson, Deputy Director for Operations"
}