{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Disclosing operational details, such as code names (SLEEST IMATE), vessel names (PRCIS, PISCIS, WASP, MATUSA TIME), and the use of small boats for beach landings under hazardous circumstances, could compromise ongoing or future clandestine operations. Additionally, revealing PONZOA's disenchantment with AMDIPs and his desire to work under KUBARK control exposes sources and methods of recruitment and management of assets. Specifically, 'On several occasions he has effected rubber-boat beach landings to meet reception parties under extremely hazardous circumstances...He now wishes to disassociate himself completely from any Guban political group and desires to place himself under KUBARK control.'",
  "security_level": "SECRET",
  "summary": "A dispatch from the Chief of the Western Hemisphere Division to the Chief of Base, JMWAVE, regarding the transmittal of a Memorandum of Oral Commitment (MOC) for Alberto PONZOA y Alvarez (aka \"Junior\") for use in maritime operations.",
  "summary_one_paragraph": "This secret dispatch, dated August 10, 1961, transmits a Memorandum of Oral Commitment (MOC) for Alberto PONZOA y Alvarez, also known as \"Junior,\" who was originally a contact of the Havana Station. PONZOA, using his boat PRCIS, conducted four successful sea rendezvous operations with MATUSA TIME before escaping Cuba in PISCIS in December 1960. He has since participated in numerous maritime operations, including hazardous beach landings, and, now disenchanted with Cuban political groups (AMDIPs), seeks to operate under KUBARK control, where he will be utilized as a small boat captain, intermediate craft crewman, interpreter, and trainer for non-English-speaking Cuban crews.",
  "tags": [
    "CIA",
    "JMWAVE",
    "SLEEST IMATE",
    "Alberto PONZOA y Alvarez",
    "KUBARK",
    "Maritime Operations",
    "Cuba",
    "AMDIPs",
    "MOC"
  ],
  "title": "Transmittal of Memorandum of Oral Commitment for Alberto PONZOA y Alvarez",
  "date": "1961-08-10",
  "locations_mentioned": [
    "Cuba",
    "Miami"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Alberto PONZOA y Alvarez"
  ],
  "recipient": "Chief of Base, JMWAVE",
  "sender": "Chief, Western Hemisphere Division"
}