{
  "classification": "Personnel",
  "document_type": "Routing and Record Sheet",
  "security": "Revealing Howard Hao-Sheng Chao as a current asset could compromise his safety and the FR Base New York's operations. Quoting directly: 'I am only concerned about the protection of Howard Hao-Sheng Chao. He is a current asset of the FR Base New York. I would appreciate it if in the course of sanitizing any of the other names listed on the attached routing slip, you would delete Howard's as well.'",
  "security_level": "SECRET",
  "summary": "This document is a routing slip and record sheet regarding a list of names being checked, with specific concern for protecting Howard Hao-Sheng Chao, who is a current asset of the FR Base New York.",
  "summary_one_paragraph": "This routing slip and record sheet, dated March 30, 1978, from C/FR/Plans (Bob Baker) to the Chief of CAS, concerns a list of names being checked, possibly for security or operational reasons. The primary concern is the protection of Howard Hao-Sheng Chao, identified as a current asset of the FR Base New York; the sender requests that his name be deleted from the list during sanitization to ensure his safety.",
  "tags": [
    "CIA",
    "Routing Slip",
    "Personnel Security",
    "Asset Protection",
    "Howard Hao-Sheng Chao",
    "FR Base New York"
  ],
  "title": "List of Names Check and Protection of Howard Hao-Sheng Chao",
  "date": "1978-03-30",
  "persons_mentioned": [
    "Bob Baker",
    "Susan Watkins",
    "Russell Brines",
    "Claudio Benedi",
    "Mary Ellen Scott",
    "Gladys Benedi",
    "Jose Manuel Berenguer",
    "Walter Briggs",
    "Enoc Waters Fox",
    "Leonard J. Desmond",
    "Howard Hao-Sheng Chao",
    "Edward Hau-Sang Lee",
    "Fred Zusy",
    "Peter Knauer",
    "Francisco Chen",
    "Tom Crawford",
    "Jeni Woods",
    "Louse Woods",
    "Fred Randall",
    "Pay Sweder",
    "Pete Wheeler",
    "Thomas keeman",
    "Frank Estucona",
    "Peggy Margar",
    "Howard M.",
    "Leo",
    "Mason, Hope",
    "Tyler, Royall",
    "Sancomb"
  ],
  "recipient": "Chief, CAS (Attn: Susan Watkins)",
  "sender": "C/FR/Plans (Bob Baker)"
}