{
  "classification": "Cuba",
  "document_type": "Mixed Documents",
  "security": "Sharing the financial details of the radio program and the operational aspects could reveal sensitive information about resource allocation and covert activities, potentially compromising ongoing or future operations. Direct quotes supporting the assessment include: 'AMBUD-3 radio program on WRUL for Sept 65 $1,316.25' and details about the 'BROADCAST AGREEMENT' and related 'STANDARD CONDITIONS'.",
  "security_level": "SECRET (When Filled In)",
  "summary": "This collection of documents includes financial records, radio broadcast agreements, and notes about individuals and medical exchanges related to Cuba, specifically mentioning radio broadcasts on WRUL, financial disbursements for the 'AMBUD-3' radio program, and information about individuals with ties to Cuba.",
  "summary_one_paragraph": "This collection of documents contains diverse information related to Cuba, including financial disbursements for the 'AMBUD-3' radio program broadcast on WRUL, a radio broadcast agreement between Dade County Medical Society and Radio New York Worldwide detailing program specifics and costs, notes on individuals like Guillermo Perez Fraga and Etevio Mauri, a news article discussing potential medical exchanges between Cuba and Spain, and observations about medical facilities and practices in Cuba. The collection also includes notes on the transmission of infectious diseases and a letter regarding changes in broadcast agreements.",
  "tags": [
    "Radio New York Worldwide",
    "WRUL",
    "AMBUD-3",
    "Dade County Medical Society",
    "Medical Exchange",
    "Cuba",
    "Propaganda",
    "Finance",
    "Guillermo Perez Fraga",
    "Etevio Mauri"
  ],
  "title": "COROL and Radio America Broadcasts and Miscellaneous Cuba-Related Documents",
  "date": "1965-09-30",
  "locations_mentioned": [
    "Cuba",
    "Spain",
    "Miami, Florida",
    "New York"
  ],
  "origin_agency": "Likely CIA",
  "persons_mentioned": [
    "Agustin P. Pons",
    "Jorge Cao",
    "Guillermo Perez Fraga",
    "Etevio Mauri",
    "Alice B. Caponong",
    "Bruce P. Veddar",
    "Richard W. Grefe"
  ],
  "recipient": "Finance Officer",
  "sender": "Alice B. Caponong"
}