{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Disclosing the relationship between JMWAVE and AMCARBON-1, including the conditions under which AMCARBON-1 provides information and support, could expose operational methods and compromise AMCARBON-1's position. The detail of operational intelligence provided by AMCARBON-1 and the methods used to discredit individuals and promote propaganda items reveal sensitive tactics and could jeopardize ongoing operations.",
  "security_level": "SECRET",
  "summary": "This dispatch details JMWAVE's relationship with AMCARBON-1, a media contact at the Miami Herald, outlining how he provides operational support, intelligence, and serves as a propaganda outlet while ensuring the security of JMWAVE operations.",
  "summary_one_paragraph": "This dispatch, dated April 2, 1964, from Chief of Station, JMWAVE, to Chief, Special Activities Section (SAS), discusses the operational relationship between JMWAVE and AMCARBON-1, a contact at the Miami Herald, established to ensure security, provide a press outlet, and surface propaganda. It outlines the ground rules agreed upon by AMCARBON-1, which involve not embarrassing KUBARK (CIA), providing opportunities for discussion, and receiving steering tips on news stories; it further details instances where AMCARBON-1 provided operational support by locating individuals like Andrew ORDONO Camps, discrediting Carlos BANDIN, furnishing operational intelligence on individuals like AMBEND-1, and serving as a propaganda outlet, as seen in the AMCRAB-1 defection story and the Charles GRIFFIN shrimp boat story; and it concludes that AMCARBON-1 is a reliable and cooperative asset, enhancing JMWAVE's operational capabilities while minimizing media-related difficulties.",
  "tags": [
    "CIA",
    "JMWAVE",
    "AMCARBON-1",
    "Propaganda",
    "Operational Intelligence",
    "Media Relations",
    "Cuba",
    "KUBARK",
    "Miami Herald"
  ],
  "title": "Special Activities Report on JMWAVE'S Relationship with AMCARBON-1",
  "date": "1964-04-02",
  "locations_mentioned": [
    "Miami, Florida",
    "Cuba",
    "Latin America",
    "Houston, Texas",
    "Santiago, Chile",
    "Puno, Peru"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "AMCARBON-1",
    "Andrew K. Reuteman",
    "AMCARBON-2",
    "Andrew ORDONO Camps",
    "Carlos BANDIN",
    "AMBEND-1",
    "Alex E. Carlson",
    "Trevor Armbrister",
    "AMBIDDY-1",
    "Carlos Montalvano",
    "Armando Andres Guirola Forte",
    "Charles Griffin",
    "Luis Fernandez Rocha",
    "Manolo Ray Rivero",
    "Carlos Todd y Lobo",
    "Aureliano Sanchez Arango",
    "Edmund Leahy",
    "Robert Kennedy",
    "Frank Fiorini",
    "Eduardo Suarez Riva",
    "Luis Munoz Marin",
    "Juan Bosch Gavino",
    "Charles Keely",
    "Jorge Volsky Kraisler",
    "Tad Szulc"
  ],
  "recipient": "Chief, Special Activities Section",
  "sender": "Chief of Station, JMWAVE"
}