{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "Releasing the extent and actual conversations captured on the Mexico City tapes is a concern. The good news, at least at this time, is that the ARRB staff has agreed to postpone Board consideration until May and, in the interim, the Agency will have an opportunity to review (i.e., listen and transcribe) and determine the sensitivity and provide detailed arguments in this regard.",
  "security_level": "SECRET",
  "summary": "This memo discusses pending issues before the ARRB (JFK Board) in May 1998, including protection of LITAMIL-9, Richard Gibson, CIA official files, Mexico City tapes, and alias documentation.",
  "summary_one_paragraph": "This secret memorandum from J. Barry Harrelson to Lee S. Strickland and others, dated May 15, 1998, summarizes the results of the ARRB (JFK Board) meeting held on May 13, 1998. The memo details outcomes on six Agency issues, including postponing the release of specific information on alias documentation, protecting the identity of LITAMIL-9, safeguarding Richard Gibson's relationship with the Agency, protecting the names of previously unreleased AMTRUNK assets, postponing a decision on a Mark Lane item, and releasing Carlos Tepedino's name in connection with the AMLASH-Cubela plot. The memo also mentions the successful protection of Agency interests in most cases and acknowledges the loss regarding Tepedino's name release.",
  "tags": [
    "ARRB",
    "JFK Board",
    "LITAMIL-9",
    "Richard Gibson",
    "CIA Officials",
    "Mexico City Tapes",
    "Alias Documentation",
    "AMTRUNK",
    "Mark Lane",
    "Carlos Tepedino",
    "JMWAVE",
    "Covert Actions",
    "Oswald",
    "Cuba",
    "Soviet",
    "NARA",
    "FOIA"
  ],
  "title": "Pending ARRB (JFK Board) Issues",
  "date": "1998-05-15",
  "persons_mentioned": [
    "Lee S. Strickland",
    "Fredrick C. Wickham",
    "William H. McNair",
    "Becky L. Rant",
    "Teresa Wilcox",
    "MaryLou Cummings",
    "Barbara T. Blufer",
    "J. Barry Harrelson",
    "John Newman",
    "Richard Gibson",
    "David Morales",
    "General Charles Cabell",
    "General Marshall Carter",
    "Richard Bissell",
    "Richard Helms",
    "C. Tracy Barnes",
    "Lawrence Houston",
    "William Harvey",
    "Steve White",
    "Dick Kinsman",
    "Lee Harvey Oswald",
    "Fidel Castro",
    "Mark Lane",
    "Carlos Tepedino"
  ],
  "sender": "J. Barry Harrelson, JFK Project Officer, OIM/HRP (Office of Information Management/Historical Review Program?) D/DA"
}