{
  "classification": "Oswald",
  "document_type": "Memorandum",
  "security": "Disclosing that Abram Chayes, in a high-ranking position within the State Department, had security approval for liaison contact to discuss NSC 5412/2 matters and was later criticized for State Department regulations on passports that would allow Reds denied passports to rifle freely the confidential files of the FBI, the CIA and other investigative agencies might be damaging to the reputation of the Agency.",
  "security_level": "SECRET",
  "summary": "This memo discusses Abram Chayes' involvement in Lee Harvey Oswald's return to the U.S. from the Soviet Union and details security clearances, contact with the CIA, and criticism for being soft on communism.",
  "summary_one_paragraph": "A memo from M.D. Stevens, dated January 29, 1964, addresses the Lee Harvey Oswald case, focusing on Abram Chayes, Legal Officer of the State Department, who was reportedly instrumental in Oswald's return to the U.S. from the Soviet Union in 1962. The memo details Chayes' security approvals for liaison contact with the CIA, specifically discussing NSC 5412/2 matters, and notes criticism against him for allegedly lax State Department passport regulations. It also includes information on Samuel Wise, Counsel of the American Embassy in Moscow, who had a similar case to Oswald's and a past connection to the CIA.",
  "tags": [
    "Lee Harvey Oswald",
    "Abram Chayes",
    "State Department",
    "Security Clearance",
    "CIA",
    "Soviet Union",
    "Passport Regulations",
    "Samuel Wise",
    "AEACTIVE",
    "William Orville Munsell",
    "FJALIVE"
  ],
  "title": "THE LEE HARVEY OSWALD CASE #351.164",
  "date": "1964-01-29",
  "locations_mentioned": [
    "United States",
    "Soviet Union",
    "Moscow",
    "Scarsdale, New York",
    "Dhahran, Saudi Arabia",
    "Washington, D.C.",
    "Denver"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Lee Harvey Oswald",
    "Abram Chayes",
    "Llewellyn Thompson",
    "Samuel Wise",
    "J. Foster Collins",
    "Archibald Roosevelt, Jr.",
    "Francis E. Walter",
    "Chester Bowles",
    "William Orville Munsell",
    "Antonia (Toni) Leigh Chayes",
    "Allen and Scott"
  ],
  "recipient": "Files",
  "sender": "M. D. Stevens"
}