{
  "classification": "Mexico",
  "document_type": "DISPATCH",
  "security": "Revealing EKHERALO’s discreet contact policy with U.S. business representatives could jeopardize ongoing operations and damage relationships with key contacts. The discussion about countering leftist propaganda contained in SEMPFE, especially focusing on ACETONE-IB, could also be sensitive. Directly quoting: '...a policy decision to keep EKHERALO contact with U.S. business representatives discreet...countering the leftist propaganda contained in SEMPFE. Fortunately, HIGBY was forewarned and effectively turned and the thrust of that effort upon ACETONE-IB shoulders, without offending him.'",
  "security_level": "SECRET",
  "summary": "A dispatch details a discreet luncheon held in Mexico City between EKHERALO representatives and U.S. business representatives David C. HIGBY and Floyd K. ALMOND to discuss Mexican affairs and counter leftist propaganda, specifically from SEMPFE.",
  "summary_one_paragraph": "This dispatch, dated 16-3-62, from the Eastern Hemisphere Division, outlines a luncheon meeting in Mexico City between EKHERALO representatives and U.S. business representatives David C. HIGBY and Floyd K. ALMOND. The luncheon replaced formal briefings to maintain discretion. Discussions covered Mexican affairs, with the U.S. business representatives expressing concerns about nationalization. The meeting aimed to reassure the guests of parallel goals while addressing leftist propaganda contained in SEMPFE by shifting focus onto ACETONE-1B, and establishing future relations with IDENTITY members.",
  "tags": [
    "EKHERALO",
    "US Business Representatives",
    "Leftist Propaganda",
    "Nationalization",
    "ACETONE-1B",
    "Mexico City",
    "Discreet Meeting",
    "SEMPFE"
  ],
  "title": "EKHERALO Contact with U.S. Business Representatives",
  "date": "1962-03-16",
  "locations_mentioned": [
    "Mexico City",
    "Mexico"
  ],
  "origin_agency": "Eastern Her Division",
  "persons_mentioned": [
    "David C. HIGBY",
    "Floyd K. ALMOND",
    "President ECHEVERRIA",
    "George Blake"
  ],
  "recipient": "Chari",
  "sender": "Malon, Lexas City"
}