{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Memo",
  "security": "These documents detail internal CIA inquiries into E. Howard Hunt's activities, financial transactions, and assignments, specifically his time in Madrid under non-official cover. They reveal internal processes for conducting investigations, contacting former employees, and coordinating with different agency offices. Exposing these details could reveal methods for internal oversight and create vulnerabilities to future investigations. For example, the memo from the Director of Finance outlines specific records searched, unusual financial transactions, and potential sources of information like Karamessines and Chase Manhattan Bank. Disclosing these specifics could provide a roadmap for external entities seeking to understand or disrupt similar inquiries.",
  "security_level": "SECRET",
  "summary": "A collection of memoranda from 1973 and 1974 detailing internal CIA investigations into E. Howard Hunt's activities, particularly focusing on his assignment in Madrid and financial transactions, to address concerns related to Watergate and potential domestic operations.",
  "summary_one_paragraph": "This collection of memoranda, dated between December 1973 and February 1974, outlines the CIA's internal inquiries into E. Howard Hunt's activities, especially his assignment to Madrid during the mid-1960s. The documents detail efforts to reconstruct Hunt's assignments, financial transactions, and potential operational roles, involving interviews with various CIA personnel such as Paul Burns, Fig Coleman, Edward Ryan, Sam Halpern, and Frank O'Malley. The investigations aim to address concerns about Hunt's involvement in domestic operations, his financial dealings, and the unusual circumstances surrounding his Madrid assignment, including the lack of clear operational reporting and funding.",
  "tags": [
    "CIA",
    "E. Howard Hunt",
    "Watergate",
    "Madrid",
    "Internal Investigation",
    "Financial Records",
    "Thomas Karamessines",
    "Richard Helms",
    "Frank O'Malley"
  ],
  "title": "E. Howard Hunt Investigation",
  "date": "1973-12-20",
  "locations_mentioned": [
    "Washington, D.C.",
    "Madrid, Spain",
    "Paris, France",
    "Falls Church, Virginia",
    "Las Vegas, Nevada"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "E. Howard Hunt",
    "Paul Burns",
    "Barry Goldwater",
    "Stan Gaines",
    "Fig Coleman",
    "Thomas Karamessines",
    "Richard Helms",
    "Senator Baker",
    "S. D. Breckinridge",
    "Robert E. Owen",
    "Richard Ouderkirk",
    "Robert Vesco",
    "John Oliver",
    "Thomas B. Yale",
    "Desmond Fitzgerald",
    "Stanley J. Woodward",
    "Jim Noel",
    "President Eisenhower",
    "Tad Szulc",
    "Edward Ryan",
    "Frederick N. Evans",
    "Lawrence J. Howe",
    "Sam Halpern",
    "Evan Parker",
    "Frank A. O'Malley",
    "Robert R. Mullen",
    "Colonel L. K. White",
    "Walter Brayden",
    "Martha Mitchell",
    "McCord",
    "William Shea",
    "Teresa Shea",
    "Thomas C. Amato",
    "Steven L. Kuhn",
    "Willian Caufield",
    "Joseph Hudson",
    "Harold L. Brownman",
    "F. Reid Buckley",
    "Davis Powell"
  ],
  "recipient": "Inspector General",
  "sender": "S. D. Breckinridge, Robert E. Owen, Thomas B. Yale"
}