{
  "classification": "Soviet",
  "document_type": "Memorandum for the Record",
  "security": "The documents discuss details about KGB recruitment, surveillance methods, and interaction with black marketeers which could expose intelligence-gathering tactics. For example, one document mentions 'KGB agents and informers who come into contact with him will be asked to report on him,' and another describes how the KGB uses spotters to recruit informants, preferring those from 'peasant or worker's family.'",
  "security_level": "CONFIDENTIAL",
  "summary": "This collection of memoranda from 1977, sourced from a Belorussian emigre, details various aspects of Soviet life, including MVD and KGB operations in Minsk, methods for circumventing financial regulations, the structure of civilian militia patrols, and KGB recruitment tactics.",
  "summary_one_paragraph": "These memoranda for the record, created in 1977 and relying on information from a Belorussian emigre, cover a range of topics related to Soviet life in Minsk. They describe the organization and functions of the MVD, including departments for combating embezzlement and parasitism, and detail the role of 'druzhinniki' (voluntary civilian militia) and 'operativniki.' The documents also outline strategies for keeping large sums of money secret from the government, the KGB's methods for selecting and recruiting officers and informers, and feature information on specific KGB officers like Anatoliy Aleksandrovich AKSENOV. Additionally, photographs of several individuals, including AKSENOV, are referenced for inclusion in a photo file.",
  "tags": [
    "MVD",
    "KGB",
    "Druzhinniki",
    "Operativniki",
    "Soviet Union",
    "Minsk",
    "Surveillance",
    "Recruitment",
    "Black market",
    "OBKhSS"
  ],
  "title": "Collection of Memoranda on Soviet Life in Minsk",
  "date": "1977-09-26",
  "locations_mentioned": [
    "USSR",
    "Belorussian SSR",
    "Minsk",
    "Yubileynaya Hotel",
    "Hotel Turist"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Vladimir KOVALEV",
    "PINYAZ",
    "Anatoliy Aleksandrovich AKSENOV",
    "General-leytenant KLIMOVSKIY",
    "Aleksandr GLYDOVSKIY",
    "Vladimir MELESHKO",
    "Vladimir KOMAROVICH",
    "MALYSHKO",
    "POLYANSKIY",
    "KELLER",
    "VYSOTSKIY",
    "SUCHKOV",
    "PISKAREV",
    "Vladimir SHUMRIKOV",
    "Yevgeniy SURGATOV",
    "Leonid Ivanovich KOROBOCHKIN",
    "Anatolly MIKHEDO",
    "Sergey TETEKHIN"
  ],
  "recipient": "SE/BIO, IP/DMSE, C/SE/SAG, C/SE/IO, SE/USSR, SE/RR, SE/CI",
  "sender": "Victor F. Zimin"
}