{
  "classification": "Operations",
  "document_type": "Memorandum and Project Outline",
  "security": "Several memoranda discuss providing financial assistance (a loan) to Paul D. Langevin (FULMINATOR-1). The CIA is concerned about maintaining control over the equipment purchased with the loan and maintaining security by not allowing Langevin to take on a Chilean partner. \"Common agreement was expressed on the undesirability of taking on a Chilean partner since this would be a security hazard in any future Fl work, and would also eliminate the possibility of using the plant as cover for another agent.\" The documents also discuss covert training and the use of DIHABEAS as a cover for operations. Revealing this information would expose covert operational methods, financial arrangements with agents, and the use of front organizations.",
  "security_level": "SECRET",
  "summary": "This collection of documents pertains to Project PBGROVEL, involving the establishment of an anti-communist committee in Chile, and details the recruitment, training, and financial support of agent Paul D. Langevin (FULMINATOR-1) for this operation.",
  "summary_one_paragraph": "These documents outline Project PBGROVEL, a CIA operation in Chile aimed at establishing an anti-communist committee. The files include a project outline detailing the authorization, references, and proposal to develop a group of Chilean nationals to engage in anti-Communist work covertly and overtly, utilizing agent FULMINATOR-1 (Paul D. Langevin) as a contract agent. There are discussions about providing Langevin with a loan to support his printing establishment, which serves as cover, and ensuring operational security by preventing the involvement of Chilean partners. The documents also cover Langevin's training in Washington, D.C., and the use of DIHABEAS as a potential front organization. Routing and record sheets, memoranda, and cables track the approval process and logistical arrangements for the project.",
  "tags": [
    "CIA",
    "PBGROVEL",
    "Paul D. Langevin",
    "FULMINATOR-1",
    "Chile",
    "Anti-Communism",
    "Covert Operations",
    "DIHABEAS",
    "Loans",
    "Printing Press",
    "Recruitment",
    "Training"
  ],
  "title": "Project PBGROVEL: Recruitment and Support of Paul D. Langevin in Chile",
  "date": "1952",
  "locations_mentioned": [
    "Chile",
    "Santiago",
    "Washington, D.C.",
    "New York City",
    "Texas"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Paul D. Langevin (FULMINATOR-1)",
    "Victor POBLETE Croca",
    "William Rowland",
    "J. C. King",
    "Preston L. Sutphen",
    "Franklin A. Lindsay",
    "James L. Fisher",
    "MACKENZIE"
  ],
  "recipient": "Various CIA divisions and officers",
  "sender": "Various CIA officers"
}