{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "Releasing the names of covert retirees could \"damage cover credibility, expose her to the public as a CIA employee subject to any physical threats which might ensue, and abrogate our agreement with her as to our willingness to protect her identify in return for her willingness to engage in clandestine operations on behalf of the CIA.\" Additionally, exposing officers could \"endanger his operations and those associated with the operations, but would also place him in physical danger.\"",
  "security_level": "SECRET",
  "summary": "Brian Latell, Director of the Center for the Study of Intelligence, advises against appealing the JFK Review Board's decision to release the names of two CIA employees who retired under cover, arguing that the DO's damage argument wouldn't merit Presidential reversal.",
  "summary_one_paragraph": "This memorandum from Brian Latell, Director of the Center for the Study of Intelligence, to the Director and Deputy Director of Central Intelligence, concerns the JFK Assassination Records Review Board's (ARRB) decision to release the names of two CIA employees who retired under cover; Latell recommends disapproving the DO's recommendation to appeal this decision to the President. He argues that the DO's claim that releasing the names would endanger the officers or compromise past operations lacks \"clear and convincing evidence\" and that the Agency's policy of rolling back cover for retiring officers undermines the credibility of such an appeal. The memo references specific documents (#104-10015-10052 and #104-1005-10153) related to the case.",
  "tags": [
    "JFK Assassination Records Review Board",
    "CIA",
    "Covert Operations",
    "Declassification",
    "Personnel Security",
    "FOIA",
    "Brian Latell"
  ],
  "title": "JFK Review Board Actions on CIA Records",
  "date": "1995-06-27",
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Brian Latell",
    "John Deutch",
    "C. Bustos",
    "R.W. Herbert",
    "L. Kay Oliver",
    "William H. McNair"
  ],
  "recipient": "Director of Central Intelligence, Deputy Director of Central Intelligence",
  "sender": "Brian Latell, Director, Center for the Study of Intelligence"
}