{
  "classification": "Haiti",
  "document_type": "Intelligence Information Report/Cable/Telegram",
  "security": "These documents reveal intelligence collection on Clemard Joseph Charles, a political prisoner in Haiti, including details of his imprisonment, health condition, and reported clemency. The reports contain sensitive information from human sources and could potentially compromise those sources if disclosed. For example, one report relies on \"A reliable source from a Haitian exile leader.\" Dissemination instructions include \"NO FOREIGN DISSEM,\" and multiple documents are marked \"SENSITIVE INTELLIGENCE SOURCES AND METHODS INVOLVED.\"",
  "security_level": "SECRET",
  "summary": "This collection of intelligence reports, cables, and telegrams detail the situation of Clemard Joseph Charles, a former bank president and political prisoner in Haiti, from 1969 to 1974, covering his alleged involvement in anti-government plotting, his imprisonment, health issues, and attempts to secure his release or medical treatment.",
  "summary_one_paragraph": "This collection of documents, spanning from 1969 to 1974, provides intelligence on Clemard Joseph Charles, a former president of the Commercial Bank of Haiti imprisoned for alleged anti-government plotting. It includes reports on a proposed gambling concession involving Charles (1969), his imprisonment and the status of others accused of plotting (1970), interrogations and implications of other officials (1971), reports of President Duvalier granting clemency to prisoners (1972), and his transfer to a hospital due to failing health, possibly influenced by Madame Simone Ovide Duvalier (1974). The documents also touch on the actions taken against alleged conspirators by the Haitian government, including stripping citizenship and confiscating assets.",
  "tags": [
    "Intelligence",
    "Haiti",
    "Clemard Joseph Charles",
    "Political Prisoner",
    "Duvalier",
    "Conspiracy",
    "Human Rights",
    "Gambling Concession"
  ],
  "title": "Intelligence Reports on Clemard Joseph Charles and Political Situation in Haiti",
  "date": "1974-10-18",
  "locations_mentioned": [
    "Haiti",
    "Port-au-Prince",
    "New York City",
    "Montreal",
    "Canada"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Clemard Joseph Charles",
    "Francois Duvalier",
    "Jean Claude Duvalier",
    "Simone Ovide Duvalier",
    "Michel Levitch",
    "Antoine André",
    "Kesner Blain",
    "Octave Cayard",
    "Luckner Cambronne",
    "Aurele Joseph",
    "Max Antoine",
    "Andre Dube",
    "Ulrich St. Louis",
    "Victor Severs Constant",
    "Marcelle Augustin",
    "Breton Claude",
    "Fred M. Arty",
    "Clovis Desinor",
    "Leon Bordes",
    "Rene Saint-Louis",
    "Jean-Baptiste Hilaire",
    "Roger St. Albain",
    "Gracia Jacques"
  ],
  "recipient": "State/INR, DIA, NMCC/MC, SECDEF, JCS, ARMY, NAVY, AIR, CIA/NMCC, NIC, NSA, SDO, ONE, CRS, WORKERTA, FBI, SS/ID, I&NS, USIB",
  "sender": "Beryl E. Backman, Betty A. Vazquez"
}