{
  "classification": "Cuba",
  "document_type": "File",
  "security": "The document contains sensitive intelligence sources and methods, including information acquired by the CIA related to foreign aspects of international terrorist activity. As noted: \"SECRET--WARNING NOTICE-SENSITIVE INTELLIGENCE SOURCES AND METHODS INVOLVED--NOT RELEASABLE TO FOREIGN NATIONALS--NOT RELEASABLE TO CONTRACTORS OR CONTRACTOR/CONSULTANTS--DISSCHINATION AND EXTRACTION OF INFORMATION CONTROLLED BY ORIGINATOR.Y\"",
  "security_level": "SECRET",
  "summary": "This file contains documents related to Luis Clemente Posada Carriles, including State Department cables, FBI documents, and CIA intelligence reports detailing his involvement in terrorist plotting by Cuban exiles and his implication in a CIA plot to kill Castro.",
  "summary_one_paragraph": "This file, titled \"POSADA, LUIS CLEMENTE,\" includes documents from the State Department, FBI, and CIA, covering the period around 1977. The contents range from a State Department cable regarding charges against defendants in the \"Cubana Airliner\" case to FBI documents concerning the Coordination of United Revolutionary Organizations (CORU) and espionage activities related to Cuba and Panama. Additionally, the file contains CIA intelligence reports about terrorist plotting by Cuban exiles, implicating Posada in activities such as attending meetings with anti-Castro groups in Santo Domingo, discussing plans to bomb Cuban aircraft, and potentially coordinating terrorist acts.",
  "tags": [
    "Luis Posada Carriles",
    "Cuban Exiles",
    "Terrorist Plotting",
    "CIA",
    "FBI",
    "State Department",
    "CORU",
    "Anti-Castro",
    "Castro Assassination Plot",
    "Cubana Airliner",
    "Juan Armand Montes",
    "Orlando Bosch Avila",
    "Juan Antonio Prat Mihó"
  ],
  "title": "POSADA, LUIS CLEMENTE 201-300985 VOL. IV",
  "date": "1977",
  "locations_mentioned": [
    "Caracas",
    "Cuba",
    "Panama",
    "Santo Domingo",
    "Miami",
    "Lisbon"
  ],
  "origin_agency": "House Select Committee on Assassinations (HSCA)",
  "persons_mentioned": [
    "Luis Clemente Posada Carriles",
    "Orlando Bosch Avila",
    "Fidel Castro",
    "Salvador Alderegula",
    "Juan Armand Montes",
    "Juan Antonio Prat Mihó",
    "Carlos Rafael Rodriguez",
    "Juan Eduardo Perez Franco",
    "Salvador Llúberes Montas",
    "Juan Disla Abreu",
    "Eladio Marno lejos Abreu",
    "José Coub a Durri",
    "Fernando Muniz",
    "Raul Cor Ruden",
    "Peter Martinez",
    "Pedro Celestino Martinez Garces"
  ],
  "recipient": "FBI Intelligence Division; U.S. Army Intelligence Agency"
}