{
  "classification": "Administrative",
  "document_type": "Letters, Memoranda, and Declaration",
  "security": "Disclosing internal deliberations on document handling could compromise the Agency's ability to negotiate with external oversight bodies. Quoting directly: “Talked Judge Tunheim and he is willing to release the two letters (Cohen & Tenet) and refrain from other derogatory comments if the Carey declaration is substantially like the ones Ed signed.” Revealing this negotiating tactic or the alteration of documents (described by James Oliver) could damage the CIA's credibility and harm its relationship with the ARRB and other oversight entities.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document collection pertains to the CIA's compliance with the JFK Assassination Records Collection Act of 1992 and includes correspondence, declarations, and internal memos related to the search, review, and release of assassination records.",
  "summary_one_paragraph": "The collection contains letters between the Assassination Records Review Board (ARRB) and the CIA, declarations from CIA officials Edmund Cohen and David W. Carey affirming the Agency's compliance with the JFK Act, and internal memoranda detailing the process of ensuring comparable statements and document retrieval for the ARRB. Specifically, it includes a letter from George Tenet assuring the ARRB of the CIA's full compliance, a message indicating negotiations with Judge Tunheim regarding the release of documents, and a memo from James R. Oliver confirming the replacement of the first page of Carey's signed declaration to align it with Cohen's statement, all relating to the review and disclosure of JFK assassination records.",
  "tags": [
    "JFK Assassination Records Collection Act",
    "ARRB",
    "CIA Compliance",
    "Edmund Cohen",
    "David W. Carey",
    "George Tenet",
    "James R. Oliver",
    "Information Management",
    "Declassification",
    "Records Review"
  ],
  "title": "JFK Assassination Records Collection Act of 1992 Compliance Documents",
  "date": "1998-09-16",
  "persons_mentioned": [
    "John R. Tunheim",
    "Edmund Cohen",
    "George J. Tenet",
    "David W. Carey",
    "James R. Oliver",
    "Lee Harvey Oswald",
    "Richard Helms",
    "John McCone",
    "Castro",
    "James Garrison"
  ],
  "recipient": "John R. Tunheim",
  "sender": "George J. Tenet, James R. Oliver, Edmund Cohen, David W. Carey, John F. Pereira, Leo Hazlewood, Lee Strickland, Chief, Historical Review Group/CSI, Executive Director, Chief, Information Review Group, Office of Information Management., Chief, Counterintelligence Center, DO, Chief, Latin America Division, DO, Chief, CE Division, DO"
}