{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "This document discusses potential U.S. involvement in Cuban revolutionary activities and mentions the moral support the U.S. could provide to anti-Castro groups. Directly quoting the document, Mr. Pawley states, \"having been connected with the U. S. Government, I can't get involved in revolutionary movements\". Revealing this information would imply U.S. support for such movements which would damage international relations and compromise the stated neutral position. It also mentions Pawley’s connection to the U.S. Government, which could expose covert operations.",
  "security_level": "SECRET",
  "summary": "A memorandum summarizing a tape-recorded conversation between William D. Pawley and an unidentified Cuban about anti-Castro sabotage plans and the potential for U.S. support.",
  "summary_one_paragraph": "On October 20, 1959, Martha Tharpe documented a tape-recorded conversation between William D. Pawley and an unidentified Cuban, believed to be part of a wealthy anti-Castro group, discussing plans for sabotage of the upcoming sugar harvest. The Cuban sought moral backing and funds, explaining the fear of starting an underground movement in Cuba. Pawley, however, expressed skepticism due to disunity among anti-Castro groups and Castro's control, advising against immediate revolutionary action. Pawley also hesitated to offer direct support, citing his past government ties, while acknowledging the Cuban group's intent to proceed regardless of U.S. backing.",
  "tags": [
    "CIA",
    "William D. Pawley",
    "Anti-Castro",
    "Sabotage",
    "Cuba",
    "Revolutionary Movement",
    "Moral Support",
    "Underground Movement"
  ],
  "title": "Highlights of Tape-Recorded Conversation in Miami Between Mr. William D. Pawley and an Unidentified Cuban during Period 17-18 October",
  "date": "1959-10-20",
  "locations_mentioned": [
    "Miami",
    "Cuba",
    "Dominican Republic",
    "Camaguey",
    "Santa Clara",
    "Habana",
    "Matanzas"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "William D. Pawley",
    "Owen Faust",
    "Colonel King",
    "Jose Eleutorio PEDRAZA",
    "CASTRO",
    "Martha Tharpe"
  ],
  "recipient": "Record",
  "sender": "Martha Tharpe"
}