{
  "classification": "Personnel",
  "document_type": "Personal History Statement",
  "security": "Sharing Daniel Flores's personal information, like his home address, employment history, and military service record, could violate his privacy. This form also lists organizations identified by the Attorney General as potentially subversive, and revealing that Flores has reviewed this list for certification purposes could imply an association or investigation, damaging his reputation.",
  "security_level": "UNCLASSIFIED",
  "summary": "A Personal History Statement form filled out by Daniel Flores on September 6, 1961, providing detailed information about his background, education, employment history, military service, and foreign language abilities.",
  "summary_one_paragraph": "On September 6, 1961, Daniel Flores completed a Personal History Statement detailing his background for potential employment. The form includes personal data such as his birth date (August 4, 1935), place of birth (San Marcos, Texas), current address (2828 Connecticut Avenue, N.W., Washington, D.C.), and physical characteristics. Flores outlines his educational history from elementary school to some college, his fluency in Spanish, and his previous employment at Hillburn's Drug Store and the U.S. Marine Corps. He expresses willingness to travel for work and interest in overseas assignments, noting his Marine Security Guard service in Bolivia and Peru. Flores also acknowledges reviewing a list of organizations identified by the Attorney General as potentially subversive.",
  "tags": [
    "Personal History Statement",
    "Daniel Flores",
    "Employment Application",
    "Marine Corps",
    "Security Clearance",
    "List of Subversive Organizations"
  ],
  "title": "Personal History Statement - (Appendix I)",
  "date": "1961-09-06",
  "locations_mentioned": [
    "Chicago, Illinois",
    "Yugoslavia",
    "Birobidjan",
    "Europe",
    "Greece",
    "New York City",
    "Philadelphia",
    "Southern California",
    "Texas",
    "Maryland",
    "Arkansas",
    "Baltimore",
    "Japan",
    "Seattle, Washington",
    "Missouri",
    "Boston, Massachusetts",
    "Newark, New Jersey",
    "Canal Zone",
    "Panama",
    "Russia",
    "Bolivia",
    "Peru",
    "Chile",
    "Argentina",
    "Uruguay",
    "Washington, D.C."
  ],
  "persons_mentioned": [
    "Harry Bridges",
    "Earl Browder",
    "Marie Richardson",
    "Benjamin Davis",
    "Joseph Wedemeyer",
    "Al Lannon",
    "Maurice Braverman",
    "Tom Paine",
    "Walt Whitman",
    "William (Hillburn)",
    "Ignacio Gonzales",
    "John Sparkman",
    "Max Mendlovitz",
    "John Magruder",
    "L. G. Bruce"
  ],
  "sender": "Daniel Flores"
}