{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "This document reveals the CIA's internal discussions and coordination with the House Permanent Select Committee on Intelligence (HPSCI) regarding the declassification of JFK assassination records. It details the CIA's efforts to manage the release of sensitive information, including names of former employees and operational details, and reveals disagreements with the JFK Assassination Records Review Board. The document also mentions efforts to influence the Board and amend the JFK Act. Sharing details of these discussions could damage the CIA's relationships with Congress and the Review Board, compromise ongoing declassification efforts, and expose internal deliberations on sensitive intelligence matters.",
  "security_level": "SECRET",
  "summary": "A series of memoranda and briefings regarding the CIA's declassification of JFK assassination records and interactions with the House Permanent Select Committee on Intelligence (HPSCI) and the JFK Assassination Records Review Board.",
  "summary_one_paragraph": "This collection of documents, spanning from August 1993 to April 1996, details the CIA's efforts to declassify JFK assassination records and manage its interactions with the HPSCI and the JFK Assassination Records Review Board. It includes outlines for briefings to HPSCI, discussions about the appeals process regarding the release of sensitive information (such as the identities of covert employees and details of intelligence operations), and the CIA's attempts to influence the Board's decisions. The documents also reveal disagreements between the CIA and the Board, efforts to amend the JFK Act, and the extensive resources devoted to the declassification process.",
  "tags": [
    "CIA",
    "JFK Assassination Records",
    "Declassification",
    "HPSCI",
    "JFK Assassination Records Review Board",
    "FOIA",
    "Oswald 201 File",
    "Sequestered Files"
  ],
  "title": "Briefing of HPSCI on Denied JFK Documents",
  "date": "1993-08-25",
  "locations_mentioned": [
    "Mexico City",
    "Helsinki",
    "Nicaragua",
    "Tokyo",
    "Oslo",
    "Stockholm",
    "Copenhagen",
    "Europe"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Dan Glickman",
    "John F. Pereira",
    "Susan Oullette",
    "Richard E. Schroeder",
    "Brian S. Latell",
    "J. Barry Harrelson",
    "Fred Wickham",
    "William McNair",
    "Virginia B. Okum",
    "Montgomery Rogers",
    "Charles Boykin",
    "Joyce Woodburn",
    "Jacqueline Mitchell",
    "Linda C. Cipriani",
    "Mike Sheehy",
    "Christine Healey",
    "Steve Nelson",
    "Doug Bowman",
    "Bill Lieser",
    "Christopher Barton",
    "Louis H. Dupart",
    "Catherine D. Eberwein",
    "Mark M. Lowenthal",
    "David Marwell",
    "Dave Edger",
    "Jeff Smith",
    "Mondale",
    "Cindy Ellis"
  ],
  "recipient": "All HRG Members",
  "sender": "John F. Pereira"
}