{
  "classification": "Administrative",
  "document_type": "Dispatch",
  "security": "Disclosing Vaivada's agreement to become a career agent and details of his wife's citizenship acquisition could expose him and his family to risks, particularly if the information falls into hostile hands. \"VAIVADA has no objections and is agreeable to conversion to the career agent category as described therein...VAIVADA requests, however, that the plans already proposed for acquisition (U.S. citizenship by his wife be carried through.\"",
  "security_level": "SECRET",
  "summary": "A dispatch from the Chief of Station in Habana to the Chief of the Western Hemisphere Division (WHD) confirming Arthur G. VAIVADA's agreement to become a career agent and requesting the continuation of plans to obtain U.S. citizenship for his wife to enhance his security in non-official cover assignments.",
  "summary_one_paragraph": "On February 21, 1957, the Chief of Station in Habana sent a secret dispatch to the Chief of the WHD regarding Arthur G. VAIVADA, confirming that VAIVADA agreed to transition into a career agent role as previously discussed. The dispatch also relays VAIVADA's request to proceed with plans to acquire U.S. citizenship for his wife, believing it will increase his security during non-official cover assignments and reduce administrative burdens related to visa applications for himself and his family. The Station plans to submit a new training request for VAIVADA at a later date.",
  "tags": [
    "CIA",
    "Habana",
    "Arthur G. VAIVADA",
    "Career Agent",
    "U.S. Citizenship",
    "Non-Official Cover",
    "Administrative"
  ],
  "title": "GENERAL- Administrative SPECIFIC- Arthur G. VAIVADA",
  "date": "1957-02-21",
  "locations_mentioned": [
    "Habana",
    "United States"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Arthur G. VAIVADA",
    "James R. Palinger"
  ],
  "recipient": "Chief, WHD",
  "sender": "Chief of Station, Habana"
}