{
  "classification": "Operations",
  "document_type": "Cable",
  "security": "This document contains information regarding the operational status (contact status) of individuals who are station contacts and assets. Revealing the identities and contact status (or lack thereof) of station contacts and assets would jeopardize their safety and compromise ongoing intelligence operations. For example, the document states concerning ((WANTA)), LEO, 'SUBJ AN NWBOLTON AGENT IMPOSTER AND NON-VIOLENT CRANK. SUBJECT IS NOT TO BE MET BY STATION PERSONNEL.' Revealing this information would expose the individual as someone to avoid and could compromise future operations.",
  "security_level": "SECRET",
  "summary": "A cable listing station contacts and assets in a \"no contact\" status, providing reasons for the status, such as being uncooperative, hostile, or considered a \"kook.\"",
  "summary_one_paragraph": "This SECRET cable, dated February 27, 1996, from the Minneapolis station, provides a list of station contacts and assets who are currently in a \"no contact\" status, as requested by a previous directive. The reasons for this status vary and include individuals being uncooperative with the station, deemed hostile or suspicious, unwilling to continue contact, or considered unreliable, such as one individual labeled a \"kook\" and another identified as an NWBOLTON agent imposter. The cable includes the names, affiliations, and dates of birth (DPOB) of these individuals, along with file numbers for some entries.",
  "tags": [
    "NWBOLTON",
    "No Contact List",
    "Assets",
    "Station Contacts",
    "Counterintelligence",
    "HUMINT"
  ],
  "title": "NO CONTACT STATUS OF STATION CONTACTS AND ASSETS",
  "date": "1996-02-27",
  "locations_mentioned": [
    "St. Paul, MN",
    "Minneapolis, MN",
    "Baghdad, Iraq",
    "Battle Creek, MI",
    "Tangiers, Morocco",
    "Shanghai, China",
    "Nassawadox, VA",
    "Bloomington, MN",
    "St. Paul, MN",
    "Shakopee, MN",
    "Belle Plain, MN",
    "Appleton, Wisconsin",
    "Minnetonka, MN",
    "Solothurn, Switzerland"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Michael Andregg",
    "Walid Mohammed Awni",
    "Ronald M. Bosrock",
    "Dennis B. Dickey",
    "Daniel W. Fekete",
    "Eberhard John Fuhr",
    "Michael Gruenberg",
    "J. Woods Halley",
    "Alan B. Hooper",
    "David W. Kwo",
    "Gordon A. Mapp",
    "Lynn M. Marzolf",
    "Richard E. Mouroukian",
    "Keiran W. O'Brien",
    "FNU Oswald",
    "B. Wayne Quist",
    "Elsa Shapiro",
    "James Stageberg",
    "Leo Wanta",
    "Friderick (Fritz) Weibel",
    "Val W. Woodward"
  ],
  "recipient": "Director, Chief/NR, NR/ES, NR/EX/W, NR/EX/E, NR/ECON, NR/TCOM, NR/KRG, CP/NR, NR/CEG, NR/ATA, CIC/NR",
  "sender": "STAFF"
}