{
  "classification": "Espionage",
  "document_type": "Memorandum",
  "security": "Disclosing details about PERISTEROPOULOS’ contacts and activities, including his connections to individuals suspected of Soviet intelligence ties, could compromise ongoing investigations. Also, revealing information about intelligence-gathering operations—such as the use of sensitive sources in Seoul—could jeopardize those sources and methods. Specifically, this document mentions the identities and contacts of individuals, whose exposure could lead to potential harm or operational disruption. Quoting directly, “The activities and contacts of George PERISTEROPOULOS aka PERIS in Japan and Korea are currently being investigated by this Agency.",
  "security_level": "SECRET",
  "summary": "A memo from the CIA to the National Security Agency (NSA) concerning George S. PERISTEROPOULOS, detailing his aliases, background, contacts, and suspected connections to Soviet intelligence, as well as his relationship to William Hamilton MARTIN and Valentine HAHN; the memo also requests any further information on PERISTEROPOULOS and his associates.",
  "summary_one_paragraph": "This SECRET memo, dated November 18, 1960, is from the CIA to the NSA, focusing on George S. PERISTEROPOULOS aka George PARIS, concerning his background and activities in Japan and Korea. The memo identifies PERISTEROPOULOS's various aliases, his past employment, and his connections to individuals such as William Hamilton MARTIN, Valentine HAHN (a former Soviet agent), and Emanuel Abraham USTROVSKY (suspected Soviet agent), along with various businesses in Tokyo and Shanghai. It reports PERISTEROPOULOS's departure from Tokyo to Seoul in January 1960 to work for the Claggett-Nolan Company and requests any additional information on PERISTEROPOULOS, his contacts, and other individuals mentioned in the memo, suggesting that the FBI and Army Intelligence may possess relevant data.",
  "tags": [
    "CIA",
    "NSA",
    "George Peristeropoulos",
    "George Paris",
    "William Hamilton Martin",
    "Valentine Hahn",
    "Emanuel Abraham Ustrovsky",
    "Espionage",
    "Soviet Intelligence",
    "Korea",
    "Japan"
  ],
  "title": "Berson Ferguson MITCHELL William Hamilton MARTIN, Espionage - M",
  "date": "1960-11-18",
  "locations_mentioned": [
    "Korea",
    "Japan",
    "Tokyo",
    "Yokohama",
    "Seoul",
    "San Francisco",
    "China",
    "Shanghai",
    "Tientsin",
    "Constantinople",
    "Odessa",
    "Chita",
    "Harbin"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "George S. Peristeropoulos",
    "William Hamilton Martin",
    "Valentine Hahn",
    "Emanuel Abraham Ustrovsky",
    "Kenneth C. Miller",
    "Alphonse Figod",
    "Gregory Topouz",
    "Antonious E. Pappalopoulos",
    "Richard William Nolan Child",
    "Mortimer Claggett Cooke, Junior",
    "Noriko Matsuzakaya Awaji",
    "Thomas Robert Kirk",
    "Boris Yashkov",
    "Aurelie Peristeropoulos",
    "Bronislawa Czerninska",
    "Irene Adamsky",
    "S. Wesley Reynolds",
    "William James Palin"
  ],
  "recipient": "National Security Agency",
  "sender": "William K. Harvey"
}