{
  "classification": "Operations",
  "document_type": "Dispatch and Memorandum",
  "security": "This dispatch discusses methods for assessing and training an asset, QRPHONE/1, including the use of safehouses and intensive training programs. Revealing these methods could compromise the CIA's ability to effectively train and assess assets in the future. Also revealing asset's real name could be damaging to the asset and his family. \"...necessity of having QRPHONE/1 undergo an intensive seven day STFLIMFLAN training program...ensconced in a safehouse facility which provides security, comfort and an atmosphere conducive to learning...QRPHONE to give his full attention without being disturbed by his multitude of business and social contacts.\"",
  "security_level": "SECRET/RYBAT",
  "summary": "A dispatch from the Chief of Station, London, to the Chief of Station, London, regarding the training and assessment of asset QRPHONE/1, including a request for a safehouse and comments on his operational potential, along with a memorandum detailing QRPHONE/1's training in New York and an evaluation of his performance.",
  "summary_one_paragraph": "This dispatch, sent from the Chief of Station, London, concerns the assessment and training of asset QRPHONE/1 and includes copies of training reports, evaluations, and meeting notes. It highlights plans for an intensive training program led by Harvey B. DAITCHMAN (IDEN), recommends using a secure safehouse to ensure QRPHONE/1's full attention, and seeks comments on the results of previous assessments. An attached memorandum details QRPHONE/1's covert training in New York, praising his engagement and skills while noting a tendency to rely on his quick mind rather than written planning; the memo also requests a detailed evaluation report from the field station in July 1973 to assess the effectiveness of the training.",
  "tags": [
    "CIA",
    "Asset Training",
    "QRPHONE/1",
    "STFLIMFLAN",
    "Safehouse",
    "Operational Potential",
    "JEMINIMUM",
    "WOGEAR",
    "Harvey B. DAITCHMAN",
    "Training Program",
    "New York",
    "Covert Operations"
  ],
  "title": "ACTION REQUIRED - REFERENCES: RYBAT/DTDORIC/PLQRPHONE/MHPROBE/STFLIXPLAN Training",
  "date": "1972-08-04",
  "persons_mentioned": [
    "Harvey B. DAITCHMAN",
    "Andrew F. TELQUIST",
    "Allan W. TEUTSCHMAN",
    "Dino J. Pionzio",
    "Rod Sweet",
    "Harry Webster",
    "PAUPEROS"
  ],
  "sender": "Chief of Station, London for LCPIPIT (Allan W. TEUTSCHMAN, Dino J. Pionzio signature). WOLIME Chief (Memorandum for)"
}