{
  "classification": "Liaison",
  "document_type": "Memorandum/Meeting Minutes/Letters",
  "security": "Several documents discuss using funds and groups to promote political objectives domestically and abroad. For example, a memo suggests cautioning groups supported by the CIA from participating in political pressure groups and public declarations of intent to intervene in domestic American politics: \"Accordingly, we would surest that stens be taken to enstret.t groups which are sponsored b or supported throth affiliation with Co be restrained from participating in or assisting such uomestic political pressure groups as is provosed in subject Sunder ...uc.. groups shoud be cautioned, in any event, to avoid any public declarations of intent to intervene in dorestic berican politics.\"",
  "security_level": "SECRET",
  "summary": "This collection of documents pertains to the coordination and interaction between various organizations, including the CIA, the Department of State, and the Crusade for Freedom, focusing on topics such as political influence, support for anti-communist groups, and the use of student networks.",
  "summary_one_paragraph": "This set of documents from 1951-1952 involves internal discussions and correspondence between the CIA, the Department of State, and related organizations. Topics covered include concerns about using funds to promote domestic political pressure groups, particularly those involving Americans of Central and Eastern European descent, support for anti-communist efforts, discussions on the future of Strasbourg Free Europe University students, and issues related to the Crusade for Freedom's fundraising efforts and its public image. The documents reveal a coordinated effort to manage the political and public perception of these activities while ensuring alignment with U.S. objectives.",
  "tags": [
    "CIA",
    "Department of State",
    "Crusade for Freedom",
    "Anti-Communism",
    "Political Influence",
    "Strasbourg Free Europe University",
    "National Information Bureau",
    "Fundraising"
  ],
  "title": "US RECORD MATERIAL - Coordination and Activities Related to Anti-Communist Efforts and Political Influence",
  "date": "1952-03-20",
  "persons_mentioned": [
    "Joyce",
    "Froot",
    "Kohler",
    "Admiral Kirk",
    "Jerzy Lerski",
    "Cretaionu",
    "Constantine Fotitch",
    "Juraj Slavik",
    "Kenneth B. Keating",
    "Szymczak",
    "Bukowski",
    "Brukl",
    "Salusta",
    "Kazimierz Horochowski",
    "Alfred B. Lecinski",
    "Blatnik",
    "Sabbath",
    "Stefan",
    "Charles Roamarek",
    "Stephen Balogh",
    "John Lichayonack",
    "Philip Trobak",
    "Losins",
    "Milvije Rubisic",
    "Stephen Skubik",
    "Joseph A. Jackovics",
    "Charles Burke",
    "Tyson",
    "Macomber",
    "Reed",
    "Bun",
    "Nanen"
  ],
  "recipient": "Chief, Southeastern Europe Division, Chief, Eastern Europe Division",
  "sender": "Barbour, Chief International Organisations Division, Oliver Hadvood, CIO"
}