{
  "classification": "Oswald",
  "document_type": "Memo",
  "security": "This memo discusses communication with the Helsinki Station regarding Oswald's timeline and contact with the Soviet Consulate. Disclosing internal communication methods and station activities could compromise intelligence gathering efforts and relationships with sources. Quoting directly: 'Friberg gave me the following information...A copy of State's cable inquiry would go to the Helsinki Station and they would assist in preparation of a reply...Mr. Friberg agreed that it would be worthwhile to cable the Station concerning points not covered by State in their inquiry.'",
  "security_level": "UNCLASSIFIED",
  "summary": "A memo detailing a discussion between SR Division members and the COS Helsinki regarding the timeline of Lee Harvey Oswald's stay in Helsinki in October 1959, including his contact with the Soviet Consulate.",
  "summary_one_paragraph": "On June 1, 1964, Lee H. Wigren (C/SR/CI/R) documented a discussion with Frank Friberg, recently returned COS Helsinki, concerning the Warren Commission inquiry into Lee Harvey Oswald's stay in Finland in October 1959. The memo outlines information provided by Friberg, including travel times between the airport and Helsinki, the taxi journey from the Soviet Consulate, the availability of passenger lists, and the U.S. consular official at the time, Mr. Robert Fulton. Friberg also suggested changes incorporated into a cable sent to the Helsinki Station to gather further details.",
  "tags": [
    "CIA",
    "Warren Commission",
    "Lee Harvey Oswald",
    "Helsinki",
    "Soviet Consulate",
    "Finland",
    "Travel Timeline"
  ],
  "title": "DISCUSSION between Members SR Division, and COS Helsinki concerning timetable OF OSWALD'S stay in land Helsinki",
  "date": "1964-06-01",
  "locations_mentioned": [
    "Helsinki",
    "Finland"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Lee Harvey Oswald",
    "Frank Friberg",
    "Robert Fulton",
    "Lee H. Wigren"
  ],
  "recipient": "Record",
  "sender": "Lee H. Wigren (C/SR/CI/R)"
}