{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "Disclosing discussions around NCFE’s cooperation with the CIA and internal debates about individuals joining NCFE could reveal covert activities and relationships, potentially damaging ongoing operations and agency reputation. Citing the document: 'The cooperation of NCFE in certain matters should be brought to your attention...NCFE: (a) has made available complete monitoring of the trial; (b) is translating...transcripts of the trial; and, (c) is sending us complete extracts of the Iron Curtain press.' Also, revealing internal opposition to Edward W. Barrett joining NCFE indicates internal disagreements and could compromise future collaborations.",
  "security_level": "SECRET",
  "summary": "This collection of memoranda and reports from December 1952 discusses various aspects of the National Committee for a Free Europe (NCFE), including cooperation with the CIA, evaluations of the Free University in Exile, and personnel matters.",
  "summary_one_paragraph": "This series of documents from December 1952 primarily concerns the activities and internal operations of the National Committee for a Free Europe (NCFE) and its relationship with the CIA. It includes a memorandum discussing NCFE's cooperation with the CIA in exploiting the Slansky trials, providing translations and press extracts, and conducting research. There are also evaluations of the Free University in Exile, questioning its effectiveness and student recruitment. Additionally, internal discussions about Edward W. Barrett joining NCFE as a director are documented, revealing opposition to his appointment. Finally, a domestic intelligence report extract details concerns about individuals representing the Committee for a Free Asia requesting information from universities.",
  "tags": [
    "NCFE",
    "CIA",
    "Free University in Exile",
    "Slansky Trials",
    "Edward W. Barrett",
    "Committee for a Free Asia",
    "Domestic Intelligence"
  ],
  "title": "Background Material and NCFE Cooperation",
  "date": "1952-12-31",
  "locations_mentioned": [
    "Europe",
    "Iron Curtain",
    "Strasbourg",
    "Vienna",
    "San Francisco",
    "Chicago",
    "New York"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Dr. Tyson",
    "Royal Tyler",
    "Spencer Phenix",
    "Thomas W. Braden",
    "Edward W. Barrett",
    "Admiral Killer",
    "Frank",
    "Bill Durkee",
    "Archie",
    "Slansky",
    "E. A. Ashcraft",
    "S. Chen",
    "Ellen M. Studeli"
  ],
  "recipient": "Deputy Director for Plans",
  "sender": "Thomas W. Braden, Chief, International Organizations Division"
}