{
  "classification": "Personnel",
  "document_type": "Memo",
  "security": "Disclosing that HIDALGO, Balmes, Jr. is a covert employee undergoing sensitive training in the US and the Agency's need to protect his identity could \"jeopardize his future as a covert employee of this Agency.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "A memo regarding Balmes Hidalgo Jr., a covert employee of the Agency, who is in the U.S. for training and being considered for a sensitive assignment, addressing a request from the Immigration and Naturalization Service (INS) to potentially use him as an informant.",
  "summary_one_paragraph": "This memo, dated June 22, 1954, from the Chief of the Special Referral Branch to the Deputy Chief of SSD, concerns Balmes Hidalgo Jr., a covert CIA employee undergoing training in the United States. It discusses a request from the Immigration and Naturalization Service (INS) to utilize Hidalgo as an informant on Communist activities. The memo details internal discussions with WH/FT, WH/Panama, and Staff C/ICB, highlighting concerns that public testimony would compromise Hidalgo's future sensitive assignments and recommends that INS submit questions through the Agency to protect his covert status.",
  "tags": [
    "CIA",
    "Covert Employee",
    "Immigration and Naturalization Service",
    "INS",
    "Balmes Hidalgo Jr.",
    "Training",
    "Sensitive Assignment",
    "Security Flap"
  ],
  "title": "HIDALGO, Balmes, Jr. #65077",
  "date": "1954-06-22",
  "locations_mentioned": [
    "United States",
    "New York City",
    "Washington, D.C.",
    "Calboa Cabrera Canal Zone",
    "Balboa, Panama"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "HIDALGO, Balmes, Jr.",
    "Chester R. HODGSON",
    "Robert DAHLGREN",
    "John BONNET",
    "Peter HOWEL",
    "Paul BIRKE",
    "PENNINGTON",
    "William A. HOGAN",
    "James STROUGH"
  ],
  "recipient": "Deputy Chief, SSD",
  "sender": "Chief, Special Referral Branch"
}