{
  "classification": "Personnel",
  "document_type": "Dispatch",
  "security": "The dispatch discusses potential illegal arms shipments to the Caribbean and mentions individuals involved, including Donald Henry and John Wilbur. It also references Mitchell WerBell and his connection to Defense Systems, Inc., potentially implicating AALD. Providing details of ongoing investigations and contacts could compromise the investigation and endanger individuals.",
  "security_level": "SECRET / RYBAT",
  "summary": "A file from the House Select Committee on Assassinations (HSCA) regarding Mitchell Livingston WerBell III, covering documents from January 1967 to December 1973, includes a dispatch about a potential illegal arms shipment to the Caribbean involving individuals connected to WerBell.",
  "summary_one_paragraph": "This file from the House Select Committee on Assassinations, dated from January 1967 to December 1973, pertains to Mitchell Livingston WerBell III. It includes a dispatch detailing an investigation into a potential illegal arms shipment to Abaco Island, Bahamas, with individuals Donald Henry and John Wilbur (alias John Wilbur) being persons of interest. Customs officers are working with an informant, Henry, who provided the initial information and named WerBell and Bob Brown of Defense Systems, Inc. as potentially involved, with Wilbur attempting to arrange arms shipments.",
  "tags": [
    "Mitchell WerBell",
    "illegal arms shipment",
    "Bahamas",
    "Caribbean",
    "Donald Henry",
    "John Wilbur",
    "Defense Systems, Inc.",
    "HSCA",
    "FBI",
    "Customs",
    "Internal Security"
  ],
  "title": "WERBELL, Mitchell Livingston III",
  "date": "1973-09-17",
  "locations_mentioned": [
    "Caribbean",
    "Abaco Island, Bahamas",
    "Florida",
    "Miami",
    "Atlanta",
    "Dominican Republic",
    "Vietnam"
  ],
  "origin_agency": "House Select Committee on Assassinations (HSCA)",
  "persons_mentioned": [
    "Mitchell Livingston WerBell III",
    "Donald Henry",
    "John Brooks",
    "John Wilbur",
    "Bob Brown",
    "Edwin Marger",
    "Gordon Ingram",
    "Mitch IV",
    "Geoff",
    "Antonio Imbert"
  ],
  "recipient": "Chief, Division",
  "sender": "Chief of Station, /im"
}