{
  "classification": "Liaison",
  "document_type": "Letter",
  "security": "Disclosing information about the Surete Nationale's hesitation to investigate Foster due to political reasons (as mentioned in DB-4777 of 1 July 1947) could strain relations with French intelligence. Quoting from document: \"...the hesitation of the Surete Nationale, for political reasons, to give Foster's visit adequate investigative attention...\"",
  "security_level": "UNCLASSIFIED",
  "summary": "A letter summarizing actions taken regarding William Z. Foster's trip, including alerting stations, monitoring contacts, and conversations with Communist officials in Paris, Rome, and Prague, with a focus on a report from H.I.6 regarding a meeting in Paris.",
  "summary_one_paragraph": "This letter to J. Edgar Hoover discusses the CIA's response to Hoover's request for information regarding William Z. Foster's activities. All stations on Foster's itinerary were alerted during the British Empire Conference, and emphasis was placed on Foster's contacts and conversations with foreign Communist officials in Paris, Rome, and Prague. The letter highlights a meeting in Paris attended by various Communist leaders, including Thorez and Duclos, and references a report from H.I.6, Section 7, providing details of policy matters discussed, though it notes the Surete Nationale hesitated to give Foster's visit adequate attention.",
  "tags": [
    "William Z. Foster",
    "Communist Party",
    "French Communist Party",
    "H.I.6",
    "Surete Nationale",
    "Paris",
    "Prague",
    "Rome"
  ],
  "title": "Summary of Action Regarding William Zebulon Foster's Trip",
  "date": "1952-12-08",
  "locations_mentioned": [
    "Paris",
    "Rome",
    "Prague",
    "Italy",
    "Yugoslavia",
    "France",
    "Great Britain",
    "USA"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "William Zebulon Foster",
    "J. Edgar Hoover",
    "Thorez",
    "Duclos",
    "Lander",
    "Tim Buck Lahaut",
    "Harry Pollitt",
    "Nina Popova",
    "Dolores Ibarruri",
    "Andre Marty",
    "Jacques Duclosauvais",
    "Cachin",
    "Berliderachon Monmousseau Rajon",
    "Robert Aretit",
    "George Williams Gaichailov",
    "John Pittman"
  ],
  "recipient": "J. Edgar Hoover (Director, Federal Bureau of Investigation)",
  "sender": "de Bolos"
}