{
  "classification": "Operations",
  "document_type": "Memo",
  "security": "Disclosing the true names and agency affiliations of staff and agents involved in operations could expose them to risk and compromise ongoing intelligence activities. Quoting directly: \"Listed below are the staff and agent personnel, in true name, who have been in contact with Subject and may be known to him by true name, alias or nickname.\"",
  "security_level": "SECRET",
  "summary": "A memo regarding Emilio Santana Galindo and his potential exposure due to the Garrison investigation, detailing his recruitment, training, and subsequent termination by the Agency, along with a list of staff and agent personnel who had contact with him.",
  "summary_one_paragraph": "This memorandum, dated July 9, 1967, addresses the potential impact of the Garrison investigation and NBC's inquiries on the Agency concerning Emilio Santana Galindo. It outlines that Galindo was recruited by the Agency in October 1962, received limited training, participated in an infiltration operation in May 1963, exfiltrated with his family a week later, and was subsequently terminated. The memo includes a list of staff and agent personnel, with their true names, who had contact with Galindo and might be known to him, and notes the lack of information regarding Galindo's whereabouts between October and December 1963.",
  "tags": [
    "CIA",
    "Garrison Investigation",
    "JMWAVE",
    "Emilio Santana Galindo",
    "Personnel",
    "Operations",
    "Area Guide",
    "Infiltration",
    "Exfiltration"
  ],
  "title": "Garrison Investigation: Emilio SANTANA Galindo 201-335856",
  "date": "1967-07-09",
  "persons_mentioned": [
    "Emilio SANTANA Galindo",
    "Eugene E. Norwinsk",
    "Robert G. L. Wall",
    "William R. Stegall",
    "Vernon J. Goertz",
    "Robert Clark Stevens Jr",
    "Robert Charles Bachmann",
    "Donald D. Never",
    "Dewey A. Stinson",
    "Jose Enrique DAUSA Alvarez",
    "Jose NUNEZ Paez",
    "Alicio NUNEZ Paez",
    "Raul QUESADA Freire",
    "Otto GINER Alonso",
    "Alberto RUIZ Falcon",
    "Joaquin POWELL Rubio",
    "Jose Luis FORNELL Jacinto",
    "Luis Albert BELTRAN Nodarso",
    "Juan Luis COSCULLUEIA Iduate",
    "Manuel VIERA Rodriguez",
    "Juan Carlos JIMENEZ Jimenez",
    "Diego Mario GIMENEZ Cadenas",
    "Heriberto SARDINA Del Campo"
  ],
  "recipient": "DC/CI/R&A",
  "sender": "WIL/COG"
}