{
  "classification": "Personnel",
  "document_type": "Dispatch and Document Service Request",
  "security": "This collection of documents outlines the recruitment, employment, and eventual handling of Dimitur Adamov Dimitrov, aka Lyle O. Kelly, a Bulgarian agent. It details his operational knowledge, potential duplicity, and the decision to remove him from active service due to security concerns. Releasing these details could expose operational methods, compromise past intelligence activities, and reveal the identities of individuals involved.",
  "security_level": "SECRET",
  "summary": "These documents pertain to Dimitur Adamov Dimitrov, also known as Lyle O. Kelly, a Bulgarian agent recruited by the CIA in 1950 for operations against Bulgaria, detailing his activities, security concerns, and eventual relocation and monitoring by the agency.",
  "summary_one_paragraph": "This collection comprises a document service request, a request for dissemination change, and several memorandums and dispatches related to Dimitur Adamov Dimitrov, aka Lyle O. Kelly, a Bulgarian agent recruited by the CIA for political, psychological, and guerrilla warfare operations under Project QKSTAIR. The documents trace Kelly's recruitment in 1950, his involvement in providing agents for infiltration into Bulgaria, growing distrust due to his interactions with French Intelligence, his transfer to a holding facility in 1951, resettlement efforts, and continued monitoring after his immigration to the United States, revealing concerns about his megalomania and potential security risks.",
  "tags": [
    "CIA",
    "Dimitur Adamov Dimitrov",
    "Lyle O. Kelly",
    "QKSTAIR",
    "Bulgaria",
    "Agent",
    "Operational Clearance",
    "Counterintelligence",
    "Greek Intelligence",
    "PBRAMPART"
  ],
  "title": "Dimitur Adamov Dimitrov (aka Lyle O. Kelly) File",
  "date": "1977-09-15",
  "locations_mentioned": [
    "Bulgaria",
    "Greece",
    "Athens",
    "Sofia",
    "Yugoslavia",
    "Macedonia",
    "Lavrion Camp",
    "France",
    "Germany",
    "Panama",
    "Brazil",
    "Syros",
    "Canada",
    "New Zealand",
    "Australia",
    "United States",
    "Italy",
    "Switzerland",
    "Madrid",
    "Frankfurt"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Holmes Russell B",
    "Dimitur Adamov Dimitrov",
    "Lyle O. Kelly",
    "Nikola Petkov",
    "George M. Dimitrov",
    "Lawrence F. MacBride",
    "Frank G. Wisner",
    "ADAMSON",
    "HAND",
    "COVERDALE",
    "CARLAN",
    "TOD",
    "VILLEMETTE",
    "FLORIMOND",
    "PIRAY",
    "Yani KOLOMONOS",
    "W. G. WYMAN",
    "Michel de la Roncier",
    "Ivan Barev",
    "Philip L. Bachman",
    "Vernon H. Raper",
    "Richard P. Swentz",
    "Marjorie Dare",
    "Kalliopi Stylianou Geralexis",
    "Nixon",
    "Kennedy"
  ],
  "recipient": "IP/CFS, Cable Secretariat Branch",
  "sender": "CI/EXO"
}