{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Report",
  "security": "This document contains details of covert operations, potential assassination plots, and US government involvement in the internal affairs of another nation (Dominican Republic). Specifically, it discusses the provision of arms to dissident groups and contingency plans for Trujillo's removal, either by forced abdication or violent overthrow. Disclosing such information could compromise ongoing or future covert actions, damage diplomatic relations, and expose sensitive intelligence methods. Quoting directly: \"Farland stated a need for “minimum but key cooperation” from Dominican military dissidents. He added: “One of the greatest contributions U.S. could make to dissidents would be to let them know we are prepared to assist them; transmission of armament and sabotage material… could fully substantiate this cooperation….”",
  "security_level": "SECRET-EYES ONLY",
  "summary": "This document details U.S. government involvement, particularly through the CIA and State Department, in plotting the overthrow of Rafael Trujillo, the dictator of the Dominican Republic, including providing arms to dissident groups, and discussing potential assassination plots prior to Trujillo's assassination in May 1961.",
  "summary_one_paragraph": "This report, marked 'SECRET-EYES ONLY,' outlines the U.S. government's involvement in plotting the overthrow of Rafael Trujillo, the Dominican dictator, leading up to his assassination in May 1961. It details discussions and plans involving the CIA and the State Department, including consideration of various options from persuading Trujillo to retire to supporting violent action by dissident groups. The report covers Operation Lancet, a plan for political action backed by force, as well as the provision of arms to the plotters and U.S. contingency planning in the event of Trujillo's removal from power, and includes summaries of memos and cables exchanged between U.S. officials regarding the level of support and potential actions to be taken.",
  "tags": [
    "CIA",
    "State Department",
    "Rafael Trujillo",
    "Dominican Republic",
    "Assassination",
    "Coup Plot",
    "Operation EMDEED",
    "Operation EMSLEW",
    "Covert Action",
    "Arms Supply",
    "Farland",
    "Dearborn"
  ],
  "title": "Activities related to the Assassination of Rafael Trujillo",
  "date": "1961-05-30",
  "locations_mentioned": [
    "Dominican Republic",
    "Ciudad Trujillo",
    "San Cristobal",
    "Venezuela",
    "Guantanamo",
    "Haiti"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Rafael Trujillo",
    "Joseph S. Farland",
    "Roy R. Rubottom",
    "Henry Dearborn",
    "John D. Farfield",
    "J.C. King",
    "Ned Holzan",
    "Lear Reed",
    "Robert Owen",
    "Charles Cookson",
    "Isabel Cintron",
    "Jordi Brossa",
    "Juan Vicini",
    "Luis Baquero",
    "S. Thomas Stocker",
    "Lorenzo D. Berry",
    "Flerida Berry",
    "Severo Cabral",
    "Jose Francisco Tapia",
    "Aulio Brea",
    "Andres Freitas",
    "Luis Amiama Tiq",
    "Jose Rene Roman",
    "Juan Tomas Diaz",
    "Donald Reid Cabral",
    "Norman Gall",
    "Richard Bissell",
    "J. D. Esterline",
    "Allen Dulles",
    "Dwight Eisenhower",
    "Douglas Dillon",
    "Ernesto Betancourt",
    "Edwin Clark",
    "Robert Crassweller",
    "Arturo Espaillat",
    "Hector Trujillo",
    "Johnny Abbes",
    "Pedro Livio Cedeno",
    "Robert Reid Cabral",
    "Antonio de la Maza",
    "Juan Tomas",
    "Lieut. Garcia Guerrero",
    "Amiama Tio",
    "General Garcia Urbaez",
    "Guarionex Estrella",
    "Tomas Baez Diaz",
    "Modesto Diaz",
    "Miguel Angel Baez Diaz",
    "General Roman"
  ],
  "recipient": "Unknown",
  "sender": "Unknown"
}