{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Revealing IDEN A's role as a cover company president and funding source, his access to oil companies for operational vessel back-stopping, and his contact with specific individuals (MANGROLL, HOWGRIND, SACHTSCHALE, COSTELLO) and operational elements (YOCOUGH, YOAFT, M/V BARB) would compromise JMWAVE operations.  Quoting directly: \"IDEN A was first enlisted as the President of YOCOUGH, a JMWAVE cover company...IDEN A also permits use of his own company as a funding mechanism for YOCOUGH. He has also made available several oil companies...\"",
  "security_level": "SECRET",
  "summary": "A dispatch from the Chief of Station, JMWAVE, detailing the activities of IDEN A, a wealthy New Orleans businessman used in JMWAVE cover operations, requesting a 201 file number be assigned to him.",
  "summary_one_paragraph": "This secret dispatch from the Chief of Station, JMWAVE, dated May 19, 1965, reports on IDEN A, identified as Alfred J. *Moran, a wealthy New Orleans businessman who serves as the president of YOCOUGH, a JMWAVE cover company. IDEN A also provides funding through his own company and makes oil companies in which he owns interests available to back-stop cover for JMWAVE operational vessels. The dispatch notes IDEN A's contacts with individuals like Rufus E. MANGROLL, Colin R. HOWGRIND, and Eli A. SACHTSCHALE, and it requests that a 201 file number be assigned to IDEN A.",
  "tags": [
    "JMWAVE",
    "Covert Operations",
    "IDEN A",
    "Alfred J. Moran",
    "YOCOUGH",
    "Funding",
    "Oil Companies",
    "New Orleans",
    "201 File"
  ],
  "title": "Contact Report - IDEN A",
  "date": "1965-05-19",
  "locations_mentioned": [
    "New Orleans, Louisiana",
    "Miami"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Alfred J. *Moran",
    "Eli A. SACHTSCHALE",
    "IDEN D (Glean E. Magnuson)",
    "IDEN E (Robert T. Nieset)",
    "Rufus E. MANGROLL",
    "Colin R. HOWGRIND",
    "James Costello"
  ],
  "recipient": "Chief, WH",
  "sender": "Chief of Station, JMWAVE"
}