{
  "classification": "Personnel",
  "document_type": "Report",
  "security": "Revealing that Nosenko was confined involuntarily for approximately three years, in addition to the mention of using prostitutes, could damage the CIA's reputation.",
  "security_level": "ORIGINAL",
  "summary": "This document provides background information on Yurily Ivanovich Nosenko, a KGB officer who defected in 1964 and was subsequently confined by the CIA for approximately three years, later becoming a U.S. citizen and Agency consultant.",
  "summary_one_paragraph": "The document details the history of Yurily Ivanovich Nosenko, a Soviet KGB officer who defected to the U.S. in January 1964 after initial contact with Agency personnel in Switzerland in 1962. Nosenko was involuntarily confined by the CIA from April 1964 to October 1967 at sites in Clinton, Maryland, and Camp Peary, Virginia; he was later given increasing freedom, becoming a U.S. citizen in 1974. Employed by the Agency as a consultant since March 1969, with a current salary of $23,500 per year, legal approval for Nosenko's confinement was obtained in 1964, with various agencies aware of the affair from 1964 to 1969, and the conditions of his confinement established by the Office of Security. The document further notes internal debate over Nosenko's bona fides, a mail cover placed on him in 1969, and the use of prostitutes during a pleasure trip to Florida.",
  "tags": [
    "Yurily Ivanovich Nosenko",
    "Defector",
    "KGB",
    "CIA",
    "Involuntary Confinement",
    "Consultant",
    "Richard Helms",
    "Lawrence Houston",
    "Office of Security",
    "Counterintelligence",
    "Mail Cover",
    "Prostitutes"
  ],
  "title": "Yurily Ivanovich NOSENKO",
  "locations_mentioned": [
    "Switzerland",
    "United States",
    "Clinton, Maryland",
    "Camp Peary, Virginia",
    "Washington, D.C.",
    "Florida"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Yurily Ivanovich Nosenko",
    "Richard Helms",
    "Lawrence Houston",
    "Charles Phalen",
    "Bruce Solie"
  ],
  "recipient": "Office of Security",
  "sender": "Director of Security"
}