{
  "classification": "Cuba, South Viet Nam, Liaison",
  "document_type": "Memo",
  "security": "Several documents discuss covert operations and sensitive negotiations. Specifically, the memorandum of October 30, 1962, outlines the President's directives to cease provocative actions against Cuba and suspend Operation MONGOOSE. The memorandum of November 14, 1962, discusses the negotiation for the release of Cuban prisoners in exchange for drugs, emphasizing the need to minimize publicity and avoid CIA implication. The memorandum regarding South Vietnam discusses CIA activities, coordination with the Ambassador, and internal disagreements. Sharing details of these operations, negotiations, or internal disagreements could damage ongoing operations and the CIA's reputation.",
  "security_level": "SECRET, TOP SECRET",
  "summary": "A collection of memoranda from 1962-1964, primarily from John A. McCone to General Carter, discussing topics such as US policy toward Cuba during the missile crisis, negotiations for the release of Cuban prisoners, analysis of Castro's potential in the Western Hemisphere, and CIA activities in South Vietnam.",
  "summary_one_paragraph": "This collection of memoranda, largely from John A. McCone to General Carter, covers a range of sensitive topics during the early 1960s. Documents address President Kennedy's directives during the Cuban Missile Crisis to prevent provocative actions against Cuba and temporarily halt Operation MONGOOSE. They also detail covert negotiations for the release of Cuban prisoners in exchange for drugs, efforts to maintain secrecy, and concerns about potential publicity. One memo analyzes Castro's potential impact on the Western Hemisphere under varying scenarios of Soviet support, while another outlines CIA activities in South Vietnam, including support for the South Vietnamese government, training of Special Forces, and internal disagreements within the American community regarding the Diem regime.",
  "tags": [
    "Cuban Missile Crisis",
    "Operation MONGOOSE",
    "Cuban Prisoners",
    "Castro",
    "South Vietnam",
    "CIA",
    "Covert Operations",
    "Negotiations",
    "Diem Regime"
  ],
  "title": "Collection of Memoranda on Cuba and South Vietnam",
  "date": "1962-10-30",
  "locations_mentioned": [
    "Cuba",
    "Miami",
    "Bank of Canada",
    "South Viet Nam",
    "Saigon",
    "Hue",
    "Warsaw",
    "Hanoi",
    "Peiping"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "General Marshall S. Carter",
    "President John F. Kennedy",
    "McCone",
    "Bundy",
    "AG (Attorney General)",
    "Lansdale",
    "Salinger",
    "Sylvester",
    "Grogan",
    "Helms",
    "Houston",
    "Miskovsky",
    "McManus",
    "Edward Foley",
    "Donovan",
    "Miro Cardona",
    "Cline",
    "Khrushchev",
    "Dorticos",
    "Mikoyan",
    "Win Scott",
    "Diem",
    "Nhu",
    "Harkins",
    "Nolting",
    "Wheeler",
    "Krulak",
    "Forrestal",
    "Rusk"
  ],
  "recipient": "General Marshall S. Carter",
  "sender": "John A. McCone"
}