{
  "classification": "Security",
  "document_type": "Memorandum",
  "security": "Disclosing details of Project Liberty, including the involvement of specific individuals and the creation of cover credentials, could expose sensitive intelligence operations and compromise the identities of participants. The instruction regarding photographs and inscriptions ('The party requesting the all services furnished should be C') indicates a method of tracking or identifying those using the services, revealing operational procedures. The reference to 'facilitate the movement of individuals with as little scrutiny as possible by the Chief of Standing Braves' suggests an effort to bypass normal security protocols.",
  "security_level": "SECRET",
  "summary": "A memorandum outlining procedures for Project Liberty, including the issuance of credentials and photographs to participants, and coordination with the Department of Justice.",
  "summary_one_paragraph": "This SECRET memorandum, dated June 19, 1962, details procedures for Project Liberty, a CIA initiative. It specifies that credentials should be provided to participants to facilitate movement with minimal scrutiny, coordinates with the Department of Justice on resource allocation, and mandates photographs for seven individuals. It also stipulates the type of employment participants should claim (clerical, commercial, or business-type) and the return of cover credentials after recognition plans are staged by Mr. Rockefeller, with questions raised regarding whether the project should take on the form of an act, SICO.",
  "tags": [
    "Project Liberty",
    "Cover Credentials",
    "CIA",
    "Department of Justice",
    "Security",
    "John F. Kennedy"
  ],
  "title": "Project Liberty Procedures",
  "date": "1962-06-19",
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Gray Rollinson",
    "Mr. Kirkpatrick",
    "Mr. D'Olier",
    "Mr. Rockefeller",
    "John F. Kennedy",
    "David S"
  ],
  "recipient": "Mr. Gray Rollinson",
  "sender": "Mr. Kirkpatrick"
}