{
  "classification": "Operations/Psychological Warfare",
  "document_type": "Memorandum/Cable/Dispatch/Newspaper Articles",
  "security": "The document reveals CIA operations regarding psychological warfare (PSYCH) related to Chile and the media. Specifically, it mentions attempts to place articles favorable to the Junta, potentially influencing public opinion. Citing: \"OARTICLE BY PROF. JAMES THEBERGE, PUBLISHED IN SOVIET ANALYST, VOL. 3, NO. 17. 15 AUG. ENTITLED: \\\"KREMLIN'S HAND IN ALLENDE'S CHILE\\\" IS IDEAL FOR PURPOSES OUTLINED IN REF. WE ATTEMPTING TO PLACE. WILL ADVISE. SUGGEST HO INCLUDE ARTICLE IN PRESS COMMENTS.\"",
  "security_level": "SECRET/CONFIDENTIAL",
  "summary": "This collection of documents pertains to psychological operations (FUOMEN project) related to Chile following Allende's overthrow, including efforts to disseminate favorable articles and manage the narrative around Chilean refugees, with a focus on countering negative perceptions of the Junta in Europe.",
  "summary_one_paragraph": "This collection of documents, primarily from 1974, details aspects of the FUOMEN project, a CIA psychological warfare operation focusing on Chile. It includes a memo discussing whether RFE in Turkey should present itself as a private entity or CIA-financed institution, cables discussing the placement of an article favorable to the Chilean Junta in European media, a dispatch requesting copies of a book offering a balanced view of Allende's policies, and a Dutch newspaper article criticizing Chilean refugees in the Netherlands and questioning their refugee status.",
  "tags": [
    "CIA",
    "Psychological Warfare",
    "Chile",
    "Allende",
    "FUOMEN",
    "Propaganda",
    "RFE",
    "Media Manipulation",
    "Chilean Junta"
  ],
  "title": "FUOMEN Project: Psychological Operations in Chile",
  "date": "1974-05-03",
  "locations_mentioned": [
    "Turkey",
    "Chile",
    "Netherlands",
    "Helsinki",
    "Santiago",
    "Paris",
    "Europe",
    "Soviet Union"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "James Theberge",
    "Allende",
    "Andres Kung",
    "Bob Lang",
    "Bili Durken",
    "Mr. Wadsworth",
    "N. van Nieuwenhuysen",
    "Mario Puelma",
    "Endalkachew Makwanen",
    "Edward Kennedy",
    "Tito",
    "Brezhnev"
  ],
  "recipient": "Deputy Director (Plans), Various CIA Stations",
  "sender": "Thomas W. Braden (Chief, International Organizations Division), Acting Chief of Station, Santiago, COS, Helsinki"
}