{
  "classification": "Soviet, Mexico",
  "document_type": "Contact Reports, Memos",
  "security": "Disclosing the names of individuals acting as contacts or sources, such as LICOZY-5, BESABER, and AVILA, could expose them to harm or compromise their operations. Information about surveillance activities, such as LOGINOV's visits to the Czech Embassy and attempts to cultivate relationships with U.S. Embassy personnel, could damage diplomatic relations and reveal intelligence-gathering methods. Quoting directly, 'Leila has evidently been unsure about how to react to LOGINOV's advances, has not wanted to be rude to him, and seemed relieved when I suggested that she simply decline his invitations by always being busy.' and 'BESABER turned in bio data on girlfriend he had talked to 8GSWIRL operator about...He is rost upset by this matter, particularly since I had told him that Headquartere wanted to drop him.'",
  "security_level": "SECRET",
  "summary": "Collection of contact reports and memos detailing interactions with Soviet officials, including Valentin Sergeyevich Loganov, and related intelligence activities in Mexico.",
  "summary_one_paragraph": "This file contains contact reports and memos related to intelligence activities in Mexico, focusing on interactions with Soviet officials such as Valentin Sergeyevich Loganov. The documents detail Loganov's activities, including his attempts to cultivate relationships with U.S. Embassy personnel, his interest in local reactions to the Israel/Arab conflict, and his visits to the Czech Embassy. It also includes information on various contacts and sources, such as LICOZY-5, BESABER, and Miriam Avila Kats, as well as operational details and financial matters related to these activities.",
  "tags": [
    "CIA",
    "HSCA",
    "FOIA",
    "Valentin Sergeyevich Loganov",
    "Soviet Intelligence",
    "Mexico",
    "Counterintelligence",
    "LICOZY-5",
    "BESABER",
    "Miriam Avila Kats"
  ],
  "title": "LOGANOV, VALENTIN SERGEEVICH",
  "date": "1967-06",
  "locations_mentioned": [
    "Mexico",
    "Soviet Union",
    "U.S. Embassy",
    "Czech Embassy",
    "Moscow",
    "Washington, D.C.",
    "Del Paseo Hotel",
    "Mazatlan"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Valentin Sergeyevich Loganov",
    "Leila Belaval",
    "Vladislav Sergeyevich Kor Musiikin",
    "BAZAROV",
    "William de Mier",
    "Gustavo Ortiz Hernan",
    "Hiriam Avila Kats",
    "Dr. Yuriy Kutler",
    "CHMYKHOV",
    "Lorenzo Cardenas",
    "Gloria Pinto",
    "BEDRIN",
    "GONCHARENKO",
    "ROMANCHENKO",
    "KAZANTSEV",
    "Vladimir SOKOLOV",
    "Pavel KOVALEV",
    "President Diaz Ordas"
  ],
  "recipient": "House Select Committee on Assassinations",
  "sender": "Jim Kelly, Jan K. Kelly"
}