{
  "classification": "Personnel",
  "document_type": "Memorandum & Classified Message",
  "security": "This file reveals the CIA's handling of contract employee Edward G. Tichborn, including compensation, tax assessment, and termination details. Providing specific figures could compromise ongoing operations and reveal sources and methods. For example, the memo states: 'Effective 1 August 1968 you are authorized a one-time lump sum taxable payment in the amount of $3, 511.' and 'A flat rate covert tax assessment of this individual's gross, tazable Agency entitlements has been approved by the Covert Tax Committee'.",
  "security_level": "SECRET",
  "summary": "This file contains memoranda and a classified message regarding Edward G. Tichborn's contract with the CIA, detailing contract amendments, compensation, tax assessments, and eventual termination.",
  "summary_one_paragraph": "This collection of documents focuses on the contractual employment of Edward G. Tichborn by the CIA from 1961 to 1968. It includes memoranda detailing his initial hiring, salary increases (from $8,000 to $17,000 annually), tax assessments handled covertly, extensions of his contract, and his reassignment from the WH Division to the DO Division. A one-time payment of $3,311 was made to Tichborn upon termination of his contract in August 1968 as a 'quit claim', releasing the U.S. Government from further liabilities. The file also contains a notification of contract termination for Henry P. Lopez.",
  "tags": [
    "CIA",
    "Contract Personnel",
    "Edward G. Tichborn",
    "Contract Amendment",
    "Termination",
    "Compensation",
    "Tax Assessment",
    "Covert Operations",
    "Henry P. Lopez",
    "FOIA"
  ],
  "title": "(TICHBORN) LOPER, HENRY P",
  "date": "1968-09-17",
  "persons_mentioned": [
    "Edward G. Tichborn",
    "Henry P. Lopez",
    "Virginia C. Lynch",
    "George Powell",
    "W. T. Montgomery",
    "Dow H. Luetscher",
    "William S. Renehan",
    "William V. Broe",
    "Desmond Fitzgerald",
    "J. C. King",
    "Millen",
    "W. E. Brooks"
  ],
  "recipient": "Chief, Contract Personnel Division",
  "sender": "Chief, DO Personnel & Training (Virginia C. Lynch)"
}