{
  "classification": "Mexico",
  "document_type": "Collection of Documents (various types)",
  "security": "Several documents are classified as SECRET. For example, a cable regarding LIFEAT's basehouse keeper notes, \"1. REQUEST PRIORITY HANDLING TO OBTAIN POA ON IDENTITY FOR USE AS LIFEAT BASEHOUSE KEEPER.\" Another document discusses amending a CA to utilize an individual to translate sensitive telephone tapes (LIFEAT) from Spanish, French, and Creole into English, stating, \"Since it is believed that the Creole portion may contain important operational information from a CI standpoint, the Haiti Desk proposes to utilize Subject to fulfill this gap.\"",
  "security_level": "CONFIDENTIAL / SECRET",
  "summary": "This file contains documents related to Project LIFEAT, including cables, memorandums, and dispatches concerning personnel, transportation allowances, and operational details, primarily focused on activities in Mexico City.",
  "summary_one_paragraph": "This collection of documents, filed under the title \"KDMANGO Support (VOL.2)\" and spanning from July 1957 to August 1968, pertains to Project LIFEAT activities, primarily within Mexico City. The documents include SECRET classified messages and memorandums related to obtaining a POA for a basehouse keeper, LIFEAT personnel resigning and moving to Guadalajara, transportation vehicle allowances (TVAs) for various personnel, and amending a CA to utilize an individual for translating sensitive telephone tapes. The file also addresses logistical issues such as electric service contracts and security incidents.",
  "tags": [
    "LIFEAT",
    "Mexico City",
    "Basehouse",
    "Transportation Allowance",
    "Personnel",
    "KDMANGO",
    "CIA",
    "Guadalajara",
    "Translations"
  ],
  "title": "KDMANGO Support (VOL.2)",
  "date": "1957-07-02 to 1968-08-06",
  "locations_mentioned": [
    "Mexico City",
    "Guadalajara",
    "Sierra Mojada",
    "Coahuila",
    "Chihuahua",
    "Haiti"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Dan Hardway",
    "Emma (Zueck) Ruffini",
    "Fidel (Zueck) S.",
    "Vierginia Ruffini de Zueck",
    "Carol K. Zinskeister",
    "Antonio DOUBLETTE",
    "Ruth Lehman",
    "Robert W. Berg",
    "Lally",
    "Bruce H. Fernald"
  ],
  "recipient": "Director",
  "sender": "Chief of Station, Mexico City"
}