{
  "classification": "Commission",
  "document_type": "Memo",
  "security": "Disclosing that UNSIERRA was an audio operation against the Cuban Embassy in Paris could reveal sensitive intelligence collection methods and compromise current or future operations. Identifying Marta FRAYDE as an unwitting FI source exposes her past role and could endanger her or others. Quoting directly: “the sensitive source cited in paragraph 4, page 29…was an audio operation against the Cuban Embassy in Paris, France encrypted UNSIERRA…Marta FRAYDE…an unwitting FI source at that time.”",
  "security_level": "SECRET",
  "summary": "This memo identifies a sensitive source cited in the SSC's Final Report as an audio operation against the Cuban Embassy in Paris and names Marta FRAYDE as an unwitting FI source.",
  "summary_one_paragraph": "A memo dated April 20, 1977, clarifies the sensitive source mentioned in the Senate Select Committee's Final Report on governmental operations as an UNSIERRA audio operation targeting the Cuban Embassy in Paris; the operation is now defunct and the files are archived in Warrenton. The memo also identifies Marta FRAYDE, a Cuban alternate delegate to UNESCO, as an unwitting FI source referenced in cable PARI 1664 (IN 69266) of November 27, 1963, which was located in Rolando CUBELA's official file. A copy of this memo had previously been provided to Mr. Breckinridge for a June 11, 1976, meeting with Senators Hart and Schweiker.",
  "tags": [
    "CIA",
    "Senate Select Committee",
    "SSC",
    "JFK Assassination",
    "Cuban Embassy",
    "Audio Operation",
    "UNSIERRA",
    "Marta FRAYDE",
    "Rolando CUBELA",
    "FI Source",
    "Breckinridge",
    "Hart",
    "Schweiker",
    "FOIA"
  ],
  "title": "Identification of Sensitive Source",
  "date": "1977-04-20",
  "locations_mentioned": [
    "Paris, France",
    "Warrenton"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Marta FRAYDE",
    "Rolando CUBELA",
    "Breckinridge",
    "Hart",
    "Schweiker",
    "Chris Hopkins"
  ],
  "recipient": "CIA",
  "sender": "Chris Hopkins (LAD/Task Force (JFK))"
}