{
  "classification": "Operations",
  "document_type": "Memorandum",
  "security": "Revealing that LIRING-3 is being considered a \"possibly hostile\" agent and detailing surveillance methods (phone tap, mail intercept, physical surveillance) could compromise the operation and endanger sources. Furthermore, the document outlines efforts to investigate LIRING-3's sources of income and links to communist activities. \"Placing of a phone tap on L-3's telephone...Intercept of all mail going to LIRING-3's home address...Physical and photo surveillance of L-3 to determine any patterns of actions or contacts with suspicious persons...To discretely investigate I-3's sources of income.\"",
  "security_level": "SECRET",
  "summary": "This memorandum discusses the handling of LIRING-3, potentially a hostile agent, suggesting increased surveillance and investigation into his activities and finances, while a separate cable details LIRING-3's contacts with Cuban officials and plans to equip ROWTON with false credentials.",
  "summary_one_paragraph": "This collection of documents outlines concerns about LIRING-3's loyalty and proposes intensified surveillance measures, including phone taps, mail intercepts, and discreet financial investigations. Wallace B. ROWTON is tasked with managing LIRING-3 and his connections, including contacts within the Cuban consulate and potential links to communist activities. The documents reveal efforts to assess LIRING-3's trustworthiness and gather information on his associates, such as Carlos Jurado and Miriam Chichay, while also detailing plans to provide ROWTON with false identification for operational purposes.",
  "tags": [
    "LIRING-3",
    "Wallace B. Rowton",
    "Surveillance",
    "Counterintelligence",
    "Cuba",
    "Communist Activities",
    "Mexico City",
    "Guatemala",
    "Carlos Jurado",
    "Miriam Chichay"
  ],
  "title": "Handling of LIRING-3 as Hostile Agent",
  "date": "1966-05-25",
  "locations_mentioned": [
    "Mexico City",
    "Cuba",
    "Guatemala",
    "Havana",
    "Europe",
    "New York"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "LIRING-3",
    "Wallace B. ROWTON",
    "Carlos Jurado",
    "Miriam Chichay",
    "Rivera",
    "Curbelo",
    "Lienvoy",
    "Rodriguez",
    "Juan Antonio Franco",
    "Octavio",
    "Falcon",
    "Vicky",
    "Carlos Alberts"
  ],
  "recipient": "Director, JMWAVE",
  "sender": "Station Mexico City"
}