{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "These memoranda contain highly sensitive details about covert operations, reconnaissance missions, and policy discussions regarding Cuba, North Vietnam, Chile, and other regions. Disclosing the specifics of these operations could compromise ongoing activities, endanger personnel, and damage relationships with foreign governments. For example, the discussion of sabotage operations against Cuba, support for Chilean presidential elections, and reconnaissance missions near Soviet territory all involve activities that, if revealed, could have significant repercussions. Quoting directly: 'the high risk, dangerous operations are the rewarding ones and the low noise, innocuous operations prove to be unrewarding.'",
  "security_level": "SECRET",
  "summary": "This collection of memoranda details Special Group meetings from January to June 1964, covering covert operations, reconnaissance missions, and policy discussions related to Cuba, North Vietnam, Chile, and other regions.",
  "summary_one_paragraph": "This series of memoranda from January to June 1964 outlines the minutes of Special Group meetings where key decisions were made regarding covert operations, reconnaissance activities, and policy matters. Discussions included proposed sabotage actions against Cuba, support for Chilean presidential elections, reconnaissance forecasts, and actions related to North Vietnam, including targeting decisions and psychological operations. The memoranda also addressed the management of Cuban exile groups, concerns about U-2 overflights, and the establishment of a standby capability for propaganda leaflet balloons, as well as a shift in committee designation and focus due to NSAM 303.",
  "tags": [
    "Cuba",
    "Special Group",
    "Covert Operations",
    "Reconnaissance",
    "North Vietnam",
    "Chile",
    "JFK Assassination Records Act"
  ],
  "title": "Minutes of Special Group Meetings (January - June 1964)",
  "allies": "One memorandum mentions proposed political action in Zanzibar emphasizing the cooperative attitude of the British services and the growing likelihood that Jomo Kenyatta could be persuaded to support the West more actively.",
  "conspiracy": "One memorandum discusses alleged plans involving the underworld to assassinate certain Cuban leaders, prompting concern and a call for investigation and prevention. It was decided that Mr. Bundy would call the matter to the Attorney General's attention as a matter of law enforcement.",
  "date": "1964-01-02",
  "locations_mentioned": [
    "Cuba",
    "North Vietnam",
    "Chile",
    "Zanzibar",
    "Italy",
    "Japan",
    "France",
    "Tibet",
    "Taiwan",
    "China",
    "Kenya",
    "Ottawa",
    "Dominican Republic",
    "Nicaragua",
    "Pinar del Rio"
  ],
  "origin_agency": "U.S. Government (Special Group)",
  "persons_mentioned": [
    "Mr. Bundy",
    "Mr. Johnson",
    "Mr. Gilpatric",
    "General Carter",
    "Mr. FitzGerald",
    "Colonel Steakley",
    "Mr. McCone",
    "Mr. Kiefer",
    "Mr. Vance",
    "General Maxwell D. Taylor",
    "Mr. Thomas A. Mann",
    "Peter Jessup",
    "Bruce Cheever",
    "John Waller",
    "Colonel Ralph D. Steakley",
    "James A. Cunningham, Jr.",
    "Mr. Hughes",
    "Colonel J. C. King",
    "Theodore Shackley",
    "Alexis Johnson",
    "Secretary of State Rusk",
    "Ambassador Cole",
    "Artime",
    "Ray",
    "Castro",
    "Attorney General",
    "Oliva"
  ],
  "recipient": "Mr. Johnson, Mr. Gilpatric, Mr. McCone, Mr. Vance",
  "sender": "Paul Eckel, Peter Jessup, James A. Cunningham, Jr."
}