{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Routing and Record Sheet/Memorandum/Regulation (DOHB 70-1-1)",
  "security": "The document discusses criteria for opening, maintaining, controlling, and closing 201 files by the Operations Directorate. It includes sensitive information about the 201 system. For example, the document notes that standard listings of 201 files \"are by their very nature extremely sensitive compilations of information and must be given every possible safeguard.\"",
  "security_level": "SECRET",
  "summary": "This document concerns the House Select Committee on Assassinations' (HSCA) request for information on the CIA's 201 file system criteria. It includes a memorandum from William F. Donnelly, Chief of the Information Services Staff (ISS), attaching copies of DOHB 70-1-1 and CSHB 43-1-1 regulations to address the HSCA's inquiries, asserting that the regulations provide answers to all questions posed by the HSCA staff regarding the Operations Directorate's management of 201 files.",
  "summary_one_paragraph": "In response to the House Select Committee on Assassinations' (HSCA) request for information on the 201 file system, this record includes a memo dated February 28, 1978, from William F. Donnelly, Chief of the Information Services Staff (ISS), to O/SA/DO/O. The memo transmits copies of DOHB 70-1-1 (dated 15 November 1974) and an earlier version, CSHB 43-1-1 (dated 15 February 1960), arguing that these regulations comprehensively answer all questions posed by the HSCA staff about the criteria for opening, maintaining, controlling, and closing 201 files within the Operations Directorate. The 1960 version reflects practices relevant to the 1958-1964 period, while the later version offers expanded and refined procedures.",
  "tags": [
    "CIA",
    "House Select Committee on Assassinations",
    "HSCA",
    "201 Files",
    "Information Services Staff",
    "Operations Directorate",
    "William F. Donnelly",
    "FOIA"
  ],
  "title": "House Select Committee on Assassinations Request for Information on 201 Criteria",
  "date": "1978-02-28",
  "origin_agency": "CIA",
  "recipient": "O/SA/DO/O",
  "sender": "C/ISS (William F. Donnelly)"
}