{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "The memo details ongoing operations and intelligence gathering activities, including code names and methods of communication. Sharing these specifics would endanger assets and compromise operational effectiveness. For example, the memo states, \"AMLASH-1 was given a resupply of S/W developer pills and carbon. He planned to take the S/W material back with him to Havana,\" revealing covert communication methods.",
  "security_level": "SECRET",
  "summary": "A memo detailing a meeting with AMLASH-1 in Paris from January 31 to February 3, 1965, covering topics such as security concerns related to the capture of Modesto Orlando Orozco Basulto, resupply of S/W materials, potential recruitment of individuals into the Cuban Intelligence Service, and information on Cuban officials and political developments.",
  "summary_one_paragraph": "This memorandum summarizes a meeting with AMLASH-1 in Paris where discussions included the security implications of Modesto Orlando Orozco's infiltration into Cuba, AMLASH-1's resupply of S/W materials for covert communications, and potential changes to his nom de guerre. The meeting also covered AMLASH-1’s insights on recruiting individuals into the Cuban Intelligence Service for possible assignment to Caracas, the upcoming FEU elections, and precautions against sabotage of locomotives being shipped from France to Cuba. AMLASH-1 provided information on various Cuban officials, Cuban Intelligence Service personnel, and political developments, including the influence of Soviet advisors and the ranking of Cuban officials under Fidel Castro.",
  "tags": [
    "AMLASH-1",
    "AMTRUNK-10",
    "AMICE-14",
    "Modesto Orlando Orozco Basulto",
    "Cuba",
    "Cuban Intelligence Service",
    "S/W Communications",
    "FEU Elections",
    "Locomotive Sabotage",
    "Cuban Officials",
    "Soviet Influence",
    "Nestor D. Sanchez"
  ],
  "title": "Meeting with AMLASH-1 in Paris, 31 January to 3 February 1965",
  "date": "1965-02-15",
  "locations_mentioned": [
    "Paris",
    "Rome",
    "Cuba",
    "Havana",
    "Miami",
    "Geneva",
    "Caracas",
    "Venezuela",
    "New York",
    "Madrid",
    "Brazil",
    "Bern",
    "Rabat"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "AMLASH-1",
    "ONTRICH",
    "Modesto Orlando Orozco Basulto",
    "Jose Vasquez Kerey",
    "AMTRUNK-10",
    "AMICE-14",
    "UNSNAFU-9",
    "Juan Ventura",
    "AMUHIP-1",
    "AMWHIP-1",
    "Gustavo Gonzalez",
    "Pinero",
    "Crombet",
    "Laparo Mora",
    "Fizzolo",
    "Alfredo Portela",
    "Samuel Gonzalez Rodriguez-Planes",
    "Antonio Lusson y Batlle",
    "Raul Diaz Arguelles",
    "Elpidio Baez Bigo",
    "Luis Manuel Cantillo Toirac",
    "Enrique Oltuski Osacki",
    "Faustino Perez",
    "Sergio Tollon",
    "Ambassador Carrillo",
    "Aragones",
    "Fidel Castro",
    "Raul Castro",
    "Che Guevara",
    "President Dorticos",
    "Emilio Aragones",
    "Faure Chomon",
    "Alberto Mora",
    "Jose Naranjo",
    "Anibal Escalante",
    "Orlando Blanco",
    "Enrique Rodriguez Loeches",
    "Marina Garcia Gonzalez",
    "Lucy Echevarria"
  ],
  "sender": "Nestor D. Sanchez"
}