{
  "classification": "Operations",
  "document_type": "Memorandum/Cable/Letter",
  "security": "This document reveals a clandestine relationship between the CIA and the Research Institute of America (RIA), specifically its president Leo Cherne, to provide cover for CIA agents. It details how the RIA was used to explain an agent's resignation from the ECA and potentially provide overseas cover. The correspondence includes explicit details of contacts, code names (e.g., Acon), and the agreement terms for Cherne's assistance, as formalized in a 'Letter of Understanding.' The document also discusses operational concerns such as the risk of cover being blown and how to manage those risks. For example the communication from Support details: “WHEN OUR BOY SEES LEVITAS, HE IS GOING TO TELL HIM THAT HE DOES SOME WORK FOR LEO CHERNE…HE WILL NOT OF COURSE, IDENTIFY HINSEIP WITH THE AGENCY…WILL YOU TELL CHERNE THAT LEVITAS IS NOT WITTING OF THE FACT THAT THE HUEX BOY IS CONNECTED WITH THE AGENCY AND THAT HE SHOULD NOT…ASSUME THAT LENTAS KNOWS THE AGENCY RELATIONSHIP.” Revealing this level of detail could expose CIA methods, compromise relationships with organizations like RIA, and potentially endanger current and former agents.",
  "security_level": "SECRET",
  "summary": "This series of documents details the CIA's use of the Research Institute of America (RIA) and its president, Leo Cherne, to provide cover for CIA operatives, involving arrangements for employment backstories and potential overseas cover.",
  "summary_one_paragraph": "These documents from 1952 to 1958 describe the CIA's operational use of the Research Institute of America (RIA) and its president, Leo Cherne, to establish cover for CIA agents. The arrangement involved creating employment backstories for agents, such as William J. Acon, to explain their departures from other organizations like the ECA. Cherne and the RIA agreed to provide limited cover, including potentially employing agents and supporting their stories for a limited duration. The memos and cables outline the coordination between CIA divisions, field offices, and individuals like Rose, Travis, and McCann, to manage the relationship with Cherne, formalize agreements, and address operational risks, such as potential exposure of agents through unwitting contacts.",
  "tags": [
    "CIA",
    "Covert Operation",
    "Research Institute of America",
    "Leo Cherne",
    "William J. Acon",
    "Cover Story",
    "Contact Division",
    "Support Division",
    "Security Information",
    "ECA",
    "Agent Cover"
  ],
  "title": "CIA Use of Research Institute of America for Agent Cover",
  "date": "1952-01-18",
  "locations_mentioned": [
    "Washington",
    "New York",
    "Amsterdam",
    "Netherlands",
    "St. Louis, Missouri",
    "Chicago, Illinois",
    "Italy",
    "Trieste",
    "Boston",
    "Paris"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "R.S. Travis",
    "Ashcraft",
    "Lea",
    "Rose",
    "Leo Cherne",
    "Carl Hovgard",
    "William J. Acon",
    "Engels",
    "Clark",
    "Daniel J. Whealton",
    "William A. Barron",
    "John E. Toulmin",
    "Coleman",
    "Ormond",
    "Connor",
    "Bob McCann",
    "Ray Millard",
    "Robert McCann",
    "John Southard",
    "S. Levitas",
    "Joseph Ardleigh"
  ],
  "recipient": "LEA",
  "sender": "ASHCRAFT, TRAVIS, MCCANN"
}