{
  "classification": "Operations",
  "document_type": "Memorandum",
  "security": "The memo discusses ongoing covert operations and intelligence activities that, if disclosed, could reveal sensitive sources and methods. For example, it mentions \"59 occasions when weather precluded any readout of what was going on in these four Soviet military camps\" and operations involving resident agents, illegal teams, and penetrations of Cuban installations. Revealing these details could compromise ongoing operations and endanger assets.",
  "security_level": "TOP SECRET",
  "summary": "This document contains memoranda from July 1962 to April 1963 regarding meetings of the President's Foreign Intelligence Advisory Board (PFIAB) with CIA officials to discuss covert action programs, intelligence coordination, satellite reconnaissance, and operations in various countries, including Cuba, Brazil, and Southeast Asia.",
  "summary_one_paragraph": "The document comprises memoranda summarizing meetings between CIA officials and the President's Foreign Intelligence Advisory Board (PFIAB) from July 1962 to April 1963. These meetings covered a range of topics, including the Agency's covert financial support to political parties, electoral operations in countries like Brazil and Chile, labor operations, and support to cultural organizations. Discussions extended to intelligence coordination with the Department of Defense, satellite reconnaissance efforts (CORONA, TACKLE, OXCART), and specific operational activities in Cuba, Southeast Asia, and Europe, including efforts to exploit the Sino-Soviet split and actions related to Radio Liberty broadcasting to Soviet troops in Cuba.",
  "tags": [
    "CIA",
    "PFIAB",
    "Covert Action",
    "Intelligence Coordination",
    "Satellite Reconnaissance",
    "Cuba",
    "Brazil",
    "Southeast Asia",
    "CORONA",
    "TACKLE",
    "Oxcart",
    "Soviet Union",
    "China",
    "Latin America",
    "Europe",
    "Radio Liberty",
    "Espionage",
    "National Security"
  ],
  "title": "Meeting on CA Matters with the Panel of the President's Foreign Intelligence Advisory Board",
  "date": "1962-07-25",
  "locations_mentioned": [
    "Peru",
    "Greece",
    "Finland",
    "Italy",
    "Brazil",
    "British Guiana",
    "France",
    "Cuba",
    "Argentina",
    "Haiti",
    "Soviet Union",
    "Laos",
    "South Vietnam",
    "North Vietnam",
    "India",
    "China",
    "Berlin",
    "Spain",
    "Cyprus",
    "Angola"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Robert Murphy",
    "Gordon Gray",
    "William Langer",
    "J. Patrick Coyne",
    "Richard Helms",
    "Coulart",
    "Guido",
    "Duvalier",
    "Nehru",
    "Bowles",
    "Phoumi",
    "Kong Le",
    "Khrushchev",
    "Roberto Holden",
    "Killian",
    "Clifford",
    "Pace",
    "Doolittle",
    "Land",
    "McCone",
    "FitzGerald",
    "Bruce Clarke",
    "Lyman Kirkpatrick",
    "Castro",
    "Donovan",
    "Rockefeller",
    "Gilpatric",
    "McNamara",
    "Purcell",
    "Roddis"
  ],
  "recipient": "Executive Registry",
  "sender": "Richard Helms (Deputy Director, Plans) , Cord Meyer, Jr.(Chief, Covert Action Staff)"
}