{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Revealing the names and potential compromise of AMFAUNA-26 and related sub-agents to unauthorized parties could lead to their capture or harm by Cuban intelligence, as well as disrupt ongoing intelligence operations. Identifying AMFAUNA-26’s vulnerabilities, such as her reliance on developer pills and the challenges in establishing secure communications, could be exploited by the DSE. Additionally, disclosing the suspicions surrounding Ramon PEREZ and his possible role in the roundup compromises intelligence sources and methods, and exposes AMFAUNA-31 to potential repercussions. Quote: \"Communication will be maintained with AMFAUNA-33, first by telephone and later if possible by clandestine means, for the purpose of ¡learning the status and whereabouts of affected members of the AMFAUNA- 26 group. As soon as the situation has crystallized the whereabouts of burned agents learned, and secure communications established, an attempt will be made to exfiltrate endangered personnel.\"",
  "security_level": "SECRET",
  "summary": "This secret dispatch reports on the progress of operation AMFAUNA-26 in Cuba from October to December 1963, detailing communication issues, failed attempts to activate radio systems, and the eventual arrest of AMFAUNA-26.",
  "summary_one_paragraph": "This secret JMWAVE dispatch, dated between October and December 1963, outlines the operational developments of AMFAUNA-26 in Cuba, including challenges in establishing secure communications, the failure to deliver deciphering materials, and concerns about compromised sub-agents. The report details AMFAUNA-26’s attempts to activate her radio systems, the interception of messages, and the eventual arrest of AMFAUNA-26 in late December, with potential reasons ranging from implication by other agents to exposure by an informant, Ramon Perez. The dispatch also notes the production of several intelligence reports related to Soviet and Cuban military activities and future plans to maintain contact with remaining members and exfiltrate endangered personnel.",
  "tags": [
    "CIA",
    "JMWAVE",
    "AMFAUNA-26",
    "Cuba",
    "Counterintelligence",
    "Operational Report",
    "Arrest",
    "Compromise",
    "Soviet",
    "DSE"
  ],
  "title": "AMFAUNA-26 Progress Report for October, November and December 1963",
  "date": "1963-12-31",
  "locations_mentioned": [
    "Cuba",
    "Cienfuegos",
    "Pinar del Rio Province",
    "Mexico City",
    "Caracas",
    "Santa Clara",
    "Havana",
    "Miami",
    "La Isabela",
    "Cienfuegos Surface-to-Air Missile Site, Las Villas Province",
    "Cifuentes SAM Missile Assembly Base, Las Villas Province",
    "Sagua la Grande SAM Missile Site",
    "Remedios Area",
    "Cayo Loco, Las Villas Province",
    "Las Auras, Cienfuegos",
    "Itabo, Las Villas Province",
    "Yaguaja",
    "Fincas La Puntilla",
    "La Bajada",
    "Rojas"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "AMFAUNA-26",
    "AMFAUNA-2",
    "AMFAUNA-14",
    "AMCUTLER-2",
    "AMGLEN-9",
    "AMFAUNA-32",
    "AMWEE-1",
    "AMFLORA-1",
    "Olga",
    "AMFAUNA-31",
    "AMFAUNA-38",
    "Amable SANCHEZ Borroto",
    "Raul SIMON Delgado",
    "Carlos *LOPEZ Avalos",
    "AMLAME-5",
    "Ramon PEREZ",
    "Fidel CASTRO",
    "Antonio Remigio *ESTRADA Diaz"
  ],
  "recipient": "Chief, Special Affairs Staff",
  "sender": "Chief of Station, JMWAVE"
}