{
  "classification": "Personnel",
  "document_type": "Message",
  "security": "Revealing that Werbell “implies that he is U.S. Govt connected and presents a demonstration of a variety of exotic weapons that never fails to impress” and that “full details of his background should not be passed to Liaison since he is a U.S. citizen,” could damage relationships and operations if this information became public.",
  "security_level": "SECRET",
  "summary": "A message details concerns about Mitchell L. WerBell III, a counterinsurgency expert and arms demonstrator with a history of appearing in trouble spots; WerBell is described as an unscrupulous opportunist who implies U.S. government connections.",
  "summary_one_paragraph": "This message, dated May 26, 1969, from Bangkok to multiple destinations including Saigon and the Director, expresses concerns about Mitchell L. WerBell III, Vice President and Director of Rand Dof SIONICS. WerBell, who presents himself as a counterinsurgency expert and retired Colonel, is described as an unscrupulous opportunist with a history of appearing in troubled regions and implying connections to the U.S. government while demonstrating exotic weapons; the message advises caution in dealings with him and notes that while full details of his background should not be shared with liaison services because he is a U.S. citizen, they can be warned about his unsavory reputation.",
  "tags": [
    "Mitchell WerBell III",
    "Counterinsurgency",
    "Weapons",
    "Opportunist",
    "Liaison",
    "OSS"
  ],
  "title": "Mitchell L. WerBell III, Vice President and Director of Rand Dof SIONICS",
  "date": "1969-05-26",
  "locations_mentioned": [
    "Atlanta, Georgia",
    "Thailand",
    "Saigon",
    "Vientiane",
    "Singapore",
    "Manila",
    "Rangoon",
    "Hong Kong",
    "Taipei",
    "Djakarta",
    "Tokyo",
    "Seoul",
    "Kuala Lumpur"
  ],
  "persons_mentioned": [
    "Mitchell L. WerBell III",
    "Gen. Abrams"
  ],
  "recipient": "Director, Vientiane, Singapore, Manila, Rangoon, Hong Kong, Taipei, Djakarta, Tokyo, Seoul, Kuala Lumpur",
  "sender": "Bangkok"
}