{
  "classification": "Personnel",
  "document_type": "Memo",
  "security": "The memo details contacts between the CIA and Wer Bell, including discussions about Cuba, the Dominican Republic, and potential involvement in revolutionary activities. Revealing these contacts and the CIA's assessment of Bell's activities (e.g., arms sales, potential assassination plots) could compromise intelligence sources and methods, damage relationships with foreign governments, and expose past Agency interests in these matters. The document explicitly states that the Agency passed information about Bell’s activities to key personalities in the U.S. mission and the Thai Government, “stressing that he was not sponsored in any way by the U. S. Government”, and that there should be “no contact with WER BELL.”",
  "security_level": "UNCLASSIFIED",
  "summary": "This memorandum summarizes DDO contact with Mitchell Livingston WerBell III in 1959, his activities related to Cuban exiles and potential assassination plots in the 1960s, and his later involvement with the Friends of Abaco group in the 1970s, along with Agency responses to inquiries about his alleged affiliation with the CIA.",
  "summary_one_paragraph": "This memorandum, dated March 3, 1976, from Nestor D. Sanchez, Acting Chief of the Latin America Division, to the Associate General Counsel, OGC, outlines the CIA's past contacts and information regarding Mitchell Livingston Wer Bell III. It details Wer Bell's interactions with the Agency in 1959 concerning the Dominican Republic, Cuba, and potential intelligence gathering, his alleged involvement in a Cuban government in exile, reported assassination plots against Fidel Castro in the 1960s, and his connections to the Friends of Abaco group seeking secession of Abaco from the Bahamas in the 1970s. The memo also notes the Agency's denial of any official affiliation with Wer Bell and instructions to avoid contact with him.",
  "tags": [
    "Mitchell Livingston Wer Bell III",
    "CIA",
    "Cuba",
    "Dominican Republic",
    "Friends of Abaco",
    "Assassination Plot",
    "Counterfeiting",
    "FBI",
    "Security Clearance",
    "Arms Sales"
  ],
  "title": "Mitchell Livingston WER BELL III",
  "date": "1976-03-03",
  "locations_mentioned": [
    "Dominican Republic",
    "Cuba",
    "Washington, D.C.",
    "New York",
    "Miami",
    "Santo Domingo",
    "Abaco, Bahamas",
    "Georgia",
    "Athens, Greece",
    "Guatemala",
    "Nicaragua",
    "El Salvador",
    "Thailand"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Mitchell Livingston Wer Bell III",
    "Nestor D. Sanchez",
    "Thomas J. Flores",
    "General Cabell",
    "Fidel Castro",
    "Fulgencio Batista",
    "General Pedraza",
    "Loos",
    "Colonel Frei",
    "Martha R. Tharpe",
    "Justin Gleichauf",
    "Joseph Luna",
    "John Patrick Muldoon",
    "Theodore John Roussos",
    "Walter Joseph Mackem",
    "E. James McTighe",
    "Prime Minister Pindling",
    "Joseph P. Hayes",
    "Wesley Dyckman",
    "K. Michael Absher",
    "William Colby",
    "Arthur L. Smith",
    "Richard Phillips",
    "Bruce Arman Baker",
    "Lawrence R. Houston",
    "Joseph J. Liebling",
    "David H. Henretta, Jr.",
    "Colonel Bayard"
  ],
  "recipient": "Associate General Counsel, OGC",
  "sender": "Nestor D. Sanchez, Acting Chief, Latin America Division"
}