{
  "classification": "Operations",
  "document_type": "Memorandum",
  "security": "The document discusses operational approvals for intelligence gathering and potential exploitation of commercial entities for intelligence purposes, specifically ICAP Iberia, S.A., and individuals like Edward G. TICHBORN and Henry P. LOPEZ. Revealing these operational details could compromise intelligence sources and methods, expose covert operations, and damage the CIA's relationships with individuals and entities involved. For instance, authorizing the use of Henry P. Lopez to \"identify, cultivate, and acquire intelligence...and (b) to spot and assess individuals...for possible recruitment\" or discussing how ICAP Iberia, S.A. could be utilized for \"non-official commercial cover\" reveals operational intentions and potential targets. Sharing could also compromise Tichborn, exposing possible work in relation to WUBRINY/1.",
  "security_level": "SECRET",
  "summary": "This collection of memoranda details operational approvals and discussions regarding the use of individuals and commercial entities for intelligence gathering in Spain and related activities. It covers the operational approval for Henry P. Lopez, potential support from Edward G. TICHBORN, and the possible exploitation of ICAP Iberia, S.A. for Madrid Station objectives.",
  "summary_one_paragraph": "This document consists of several memoranda from the CIA, including an operational approval for Henry P. Lopez to gather intelligence in Spain, a discussion about using Edward G. TICHBORN (Project WUBRINY) to support Madrid Station objectives through information collection and contact development, an assessment of ICAP Iberia, S.A. as a potential operational asset for non-official cover, and a request for information on economic and commercial power elements in Spain and Portugal. The memos detail specific tasks, caution regarding the subjects, and coordination between different CIA divisions to exploit commercial ventures and individuals for intelligence purposes, as well as an additional memo passing on a press clipping regarding Tichborn in Mexico.",
  "tags": [
    "CIA",
    "Operational Approval",
    "Intelligence Gathering",
    "Spain",
    "Madrid Station",
    "Henry P. Lopez",
    "Edward G. TICHBORN",
    "Project WUBRINY",
    "ICAP Iberia, S.A.",
    "Commercial Cover",
    "Mexico",
    "Press Clip"
  ],
  "title": "Operational Activities and Approvals in Spain",
  "date": "1968-08-19",
  "locations_mentioned": [
    "Spain",
    "Madrid",
    "New York",
    "United States",
    "Portugal",
    "Mexico City"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Richard Long",
    "Henry P. Lopez",
    "Edward P. Brown",
    "Edward G. TICHBORN",
    "Gale Allen",
    "Osborne Day",
    "Stephen Munger",
    "C. Tracy Barnes",
    "Jose Montoya",
    "Katherine Anne Porter",
    "Juan A. Ruiz de Alda",
    "Miguel Echegaray",
    "Juan Antonio Ruiz de Alda",
    "Carlos Denegri",
    "Ramón Tellez",
    "Enrique González",
    "J. Carlos McCormick",
    "Diego Rivera",
    "José Clemente Orozco",
    "David Alfaro Siqueiros",
    "Rufino Tamayo",
    "José Luis Cuevas",
    "Luis Spota",
    "Carlos Fuentes",
    "Mariano Azuela",
    "Carlos González Peña",
    "José Vasconcelos",
    "Anthony Quinn",
    "Gilbert Roland",
    "Raúl Magaña"
  ],
  "recipient": "Chief, EUR Division; Chief, DO Division; Chief, WHD; Action Branch",
  "sender": "Chief, E/IB/S; Gale Allen; C. Tracy Barnes; Chief of Station, Mexico"
}