{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Disclosing the details of the 303 Committee's decision, the planned demobilization process, and the involvement of proprietary companies like Libernic Corporation could compromise ongoing or future covert operations. Specifically, the details regarding weapon disposition, ship transfers, and financial arrangements could be exploited to expose methods and sources, thereby damaging the CIA's operational capabilities. Quote: 'ARTINE was told the decision was to terminate our operational relationship...The case officer had been empowered to convey this information and to conduct an exploratory discussion of the problems and possible solutions connected with a phase-out program...The two main points the United States Government was concerned with were (a) fair but reasonable demobilisation support to the personnel of the autonomous group, and (b) ARTINE's assistance in insuring that the balance of power in Central America was not upset, particularly by preventing the weapons of his group from falling into the hands of political extremists or free-booters.'",
  "security_level": "SECRET",
  "summary": "A memorandum detailing the planned phase-out of the CIA's operational relationship with Manuel ARTINE Buesa's autonomous group, including discussions about demobilization support, weapons disposition, and preventing regional instability.",
  "summary_one_paragraph": "This secret memorandum, dated March 8, 1965, outlines the CIA's decision, reached by the 303 Committee, to terminate its operational relationship with Manuel ARTINE Buesa's autonomous group by May 1, 1965. The discussions covered ensuring fair demobilization support for the group's personnel, preventing the group's weapons from destabilizing Central America, and addressing ARTINE's concerns regarding the welfare of his men and his parents in Cuba. ARTINE reluctantly accepts the decision and agrees to cooperate with the phase-out, suggesting that the group's weapons be stored on the ship XV SANTA MARIA, which would then be taken over by the CIA.",
  "tags": [
    "CIA",
    "Manuel ARTINE Buesa",
    "Phase-out",
    "Autonomous Group",
    "303 Committee",
    "Demobilization",
    "Weapons Disposition",
    "Central America",
    "Cuba"
  ],
  "title": "Phase-out of ARTINE Autonomous Group",
  "persons_mentioned": [
    "Manuel ARTINE Buesa",
    "Vico Starke",
    "Frank Marshall",
    "General Anastacio Somoza",
    "President Francisco Orlich",
    "Mr. Archer (Chief, WH)",
    "Al Burt",
    "Eloy Gutierrez Penoyo",
    "Frank Fiorini",
    "Lee Napir",
    "Frank Campbell",
    "Valdo Bado Perez",
    "Guillermo Tabraue",
    "Rafael Quintero"
  ],
  "recipient": "Record",
  "sender": "Keptor D. Sanchez (WH/SA/AMWORLD) (Possible Case Officer for Manuel ARTINE Buesa meeting with him on the night of 5 March 1965.)WH/SA/AMWORLD"
}