{
  "classification": "Commission",
  "document_type": "Chrono",
  "security": "This document contains numerous names of individuals, organizations, and operations related to the JFK and Martin Luther King assassinations, as well as CIA activities. Releasing these names could potentially compromise ongoing investigations or expose sensitive intelligence sources and methods. For example, it references specific CIA operations (MONGOOSE, COBRA), intelligence personnel (Bagley, Wigren, Miler), and individuals connected to the Warren Commission and HSCA inquiries. Details of these connections could be exploited to damage the CIA’s reputation and impede future investigations.",
  "security_level": "Unclassified",
  "summary": "This is a chronological listing of documents and events related to the House Select Committee on Assassinations (HSCA) investigation into the assassinations of President John F. Kennedy and Martin Luther King Jr., covering the period from September 1976 to June 1978. It details meetings, requests for information, and correspondence between the HSCA and the CIA.",
  "summary_one_paragraph": "The HSCA Chrono outlines the timeline of interactions between the House Select Committee on Assassinations and the CIA from September 1976 to June 1978. It records meetings with key figures like Richard Sprague and Committee members, as well as numerous requests from the HSCA for documents and information related to individuals, organizations, and events connected to the assassinations of JFK and Martin Luther King Jr. The chrono includes details of CIA briefings, document releases, and the establishment of procedures for cooperation between the HSCA and the CIA, reflecting the extensive scope of the committee's investigation and its ongoing engagement with the intelligence agency.",
  "tags": [
    "HSCA",
    "John F. Kennedy",
    "Martin Luther King Jr.",
    "Assassination",
    "CIA",
    "Investigation",
    "FOIA",
    "Warren Commission",
    "MONGOOSE",
    "COBRA",
    "Mexico City"
  ],
  "title": "HSCA Chrono",
  "date": "1976-09-17",
  "persons_mentioned": [
    "Richard Sprague",
    "Lee Harvey Oswald",
    "Downing",
    "DCI (Bush)",
    "Frank Sturgis",
    "Clay Shaw",
    "Santos Trafficante",
    "Jack Ruby",
    "James Earl Ray",
    "William Harvey",
    "E. Howard Hunt",
    "Jim Garrison",
    "Fidel Castro",
    "Yuri Nosenko",
    "David Ferrie",
    "John Roselli",
    "Stokes",
    "Turner",
    "Dulles"
  ],
  "recipient": "House Select Committee on Assassinations (HSCA)",
  "sender": "CIA"
}