{
  "classification": "Security",
  "document_type": "Memo",
  "security": "Disclosing that the CIA is actively exploring non-official cover (NOC) options and considering using private firms to place agents overseas could jeopardize ongoing operations and damage relationships with host governments. The memo explicitly states, 'He is prepared to furnish personnel himself or to permit integration of Agency nominees' and mentions potential clandestine intelligence activities. Revealing this could compromise the Agency’s ability to operate covertly.",
  "security_level": "UNCLASSIFIED",
  "summary": "A 1963 memo details a meeting between the CIA's Central Cover Staff (CCS) and George Wackenhut, President of The Wackenhut Corporation, to explore the firm's potential for providing cover support for CIA operations, including overseas ventures and potential integration of Agency personnel.",
  "summary_one_paragraph": "This memorandum, dated March 26, 1963, summarizes a meeting between Fred R. Youngblood, Chief of the CIA's Central Cover Staff (CCS), and George Wackenhut, President of The Wackenhut Corporation, along with Wes Reynolds, Wackenhut's representative in Washington. The meeting explored Wackenhut's potential to provide cover for CIA operations, focusing on the firm's capabilities in investigations, security services, and international expansion, particularly in areas of interest to the CIA. Wackenhut expressed interest in covert sponsorship for overseas entry and willingness to integrate Agency nominees into his teams, but concerns were raised about the viability and obvious nature of Wackenhut's services in foreign countries.",
  "tags": [
    "CIA",
    "Central Cover Staff",
    "Wackenhut Corporation",
    "George Wackenhut",
    "Nonofficial Cover",
    "Covert Operations",
    "Security Services",
    "FBI",
    "Non-official Cover"
  ],
  "title": "The Wackenhut Corporation",
  "date": "1963-03-26",
  "locations_mentioned": [
    "Coral Gables, Florida",
    "Washington, D.C.",
    "Arlington, Virginia",
    "Miami, Florida",
    "Tampa, Florida",
    "Jacksonville, Florida",
    "Philadelphia, Pennsylvania",
    "New York City, New York",
    "Boston, Massachusetts",
    "Buffalo, New York",
    "Denver, Colorado",
    "Los Angeles, California",
    "San Jose, California",
    "Honolulu, Hawaii",
    "San Juan, Puerto Rico",
    "Ponce, Puerto Rico"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "George Wackenhut",
    "Wes Reynolds",
    "Fred R. Youngblood",
    "Bannerman",
    "Edwards",
    "White",
    "Hangan"
  ],
  "recipient": "Office of Security (Attn: Mr. Bannerman), Col. Edwards, Im. White, JM. Hangan",
  "sender": "Chief, Central Cover Staff, Nonofficial Cover Branch"
}