{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "This document contains information about CIA operations against Cuba, including plots to assassinate Fidel Castro and other Cuban officials. Sharing this information could expose past operations, compromise sources, and damage relations with Cuba. For instance, it details plans involving Cuban exile leaders, connections to the underworld (Cosa Nostra), and the use of covert assets within Cuba. Quoting directly, 'Prices allegedly agreed upon were $100,000 to assassinate Fidel CASTRO; $20,000 for Raul CASTRO; and $20,000 for 'Che' GUEVARA.'",
  "security_level": "TOP SECRET",
  "summary": "The Latin America Division (LAD) report, dated June 29, 1977, summarizes a task force investigation into possible Cuban complicity in the John F. Kennedy assassination, reviewing Agency operations against Cuba from 1960 to 1965 and finding no definitive proof of Cuban involvement.",
  "summary_one_paragraph": "This report from the Latin America Division, addressed to the Inspector General via the Acting Deputy Director for Operations, details the findings of the Latin America Division Task Force's investigation into whether the Castro regime was involved in the assassination of John F. Kennedy. Conducted from mid-October 1976 to June 1977, the task force reviewed all Agency operations against Cuba between January 1960 and January 1965, with a focus on the period leading up to Kennedy's death. The conclusion of the report, as stated, is that no definitive proof was found to implicate the Castro regime in the assassination. The report includes a chronology of findings, a list of task force participants, and an outline of the complete task force files.",
  "tags": [
    "CIA",
    "LAD",
    "JFK Assassination",
    "Cuba",
    "Castro",
    "Task Force Report",
    "Cuban Complicity",
    "Anti-Castro Activities",
    "AMCOVE Operation"
  ],
  "title": "Latin America Division Task Force Report of Possible Cuban Complicity in the John F. Kennedy Assassination",
  "conspiracy": "The report discusses potential connections between anti-Castro groups and the assassination of President Kennedy, referencing FBI reports and CIA operations related to plots against Cuban leaders and potential retaliatory actions. The memo makes explicit mention of Lee Harvey Oswald's visit to Cuba, saying, “Agent reported that he was told that OSWALD was in Havana between 2 and 7 October 1963.”",
  "date": "1977-06-29",
  "locations_mentioned": [
    "Cuba",
    "Havana",
    "Miami",
    "Caracas",
    "Dallas",
    "Mexico"
  ],
  "origin_agency": "Latin America Division/DDO",
  "persons_mentioned": [
    "John F. Kennedy",
    "Fidel Castro",
    "Raul Castro",
    "Che Guevara",
    "Lee Harvey Oswald",
    "E. Henry Knoche",
    "George V. Lauder",
    "Scott Breckinridge, Jr.",
    "William C. Sturbitts",
    "Frederick W. LaTrash",
    "Juan Almeida",
    "Efigenio Ameijeiras Delgado",
    "Pepin Naranjo",
    "Regino Botti",
    "Francisco Suarez Quinones",
    "Byron Cameron",
    "Teofilo Babun Franco",
    "Oscar Fernandez Veigo",
    "Eliseo Gomez Fernandez",
    "Jose \"Pepin\" Bosch",
    "Julio Lobo Olavarria",
    "Eduardo Garcia",
    "Santos Trafficante",
    "Manolo Aguilar",
    "Robert Kennedy",
    "Manuel Artime",
    "Enrique Ruiz Williams",
    "Roberto San Roman",
    "Jose San Roman",
    "Luis Somoza",
    "Manuel Antonio Varona y Loredo",
    "Alexander Rourke",
    "Frank Fiorini",
    "Orlando Bosch",
    "Diego",
    "Eduardo Ojeda Camaraza",
    "Moratori",
    "Martin Elena",
    "Varona",
    "Eugenio Martinez",
    "Eugenio Rolando Martinez Careaga",
    "Paulino A. Sierra",
    "Julio Garceran del Vall y Souza",
    "Jaime Varela Canosa",
    "Perullero",
    "Carl Trettin",
    "S.W. Tyler",
    "Herbert F. Jenne",
    "Miguel Guillermo Truyol-Gimeno",
    "Molyakov",
    "Khrushchev",
    "Raul Roa",
    "Clemente Morera",
    "Miranda",
    "Carlos Manuel Cabral Lofontaine",
    "Osvaldo Relova",
    "Bernardo Milanes Lopez",
    "Joaquin Sanjenis Perdomo"
  ],
  "recipient": "The Inspector General"
}