{
  "classification": "Commission",
  "document_type": "File",
  "security": "The document references third-agency documents, which are explicitly marked as deletions. Releasing information from other agencies could compromise their intelligence operations and relationships. Quoting: \"DELETIONS, IF ANY: THIRDAGENCY DOCUMENTS\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a file from CIA Headquarters reviewed by the House Select Committee on Assassinations (HSCA) staff members, concerning Nikolay Sergeyevich Lednov, a Soviet official, and contains information regarding alleged communist activities in Latin America, particularly Colombia.",
  "summary_one_paragraph": "This file, reviewed by HSCA staff at CIA Headquarters, pertains to Nikolay Sergeyevich Lednov (201-132139), a Soviet official allegedly involved in subversive activities in Latin America. The file contains press articles from July 1969, including reports from 'La Republica,' 'El Tiempo,' and 'El Siglo,' detailing communist plots, kidnappings, and the activities of KGB agents providing funds to Colombian guerillas. The articles accuse Lednov of being the Soviet official who provided money to Feliciano Pachon for subversive activities and note his presence in Latin American countries experiencing increased violence.",
  "tags": [
    "CIA",
    "HSCA",
    "Nikolay Sergeyevich Lednov",
    "Soviet",
    "KGB",
    "Colombia",
    "Latin America",
    "Communist Subversion",
    "Kidnappings",
    "FARC",
    "Feliciano Pachon",
    "Interpol",
    "Press Reports"
  ],
  "title": "LEDNOV, NIKOLAY SERGEYEVICH",
  "date": "1969-07-25",
  "locations_mentioned": [
    "Colombia",
    "Mexico",
    "Medellin",
    "Cali",
    "Buenos Aires",
    "Venezuela",
    "Peru",
    "Ecuador",
    "Bolivia",
    "Madrid",
    "Spain"
  ],
  "persons_mentioned": [
    "Nikolay Sergeyevich Lednov",
    "Feliciano Fachon Choconta",
    "Alexander Operbunov",
    "Victor Mednikov",
    "Ernesto Gonzalez Caicedo",
    "Ruben Norena",
    "Harold Eder",
    "Oliverio Lara Borrero",
    "Tirofijo",
    "Ignacio Ayala Mosquera",
    "Carlos Alberto Lozano",
    "Phaller Idarraga",
    "Jose de Jesus Ortega",
    "Ignacio Valencia Lopez",
    "Alma Valencia de Gonzalez Caicedo",
    "Aurelio Iragorri Hormaza"
  ]
}