{
  "classification": "Mexico",
  "document_type": "File",
  "security": "This file contains information about Victor Rico Galan's activities and associations, including his pro-Cuba and anti-US sentiments, his connections to Communist organizations, and his travels to various countries. Releasing this information could reveal intelligence sources and methods, compromise ongoing investigations, and damage relationships with foreign governments. Directly quoting: \"Subj conferred with leading Communists and leftists...to persuade leftist parties to begin immediate acts of sabotage and violence...\"",
  "security_level": "Unclassified",
  "summary": "This file contains information on Victor Rico Galan, a Mexican Marxist journalist with pro-Cuba and anti-U.S. sentiments, detailing his activities, associations, and travels between 1961 and 1965.",
  "summary_one_paragraph": "This file, covering the period from September 1966 to July 1972, compiles information on Victor Rico Galan, a Mexican Marxist journalist. The documents detail his pro-Cuba and anti-U.S. views, his involvement with various Communist organizations, his travels to countries in South and Central America and Cuba, and his role in leftist activities, including attempts to unify guerrilla movements. The file also references his work for publications like Siempre and Politica, and his interactions with figures such as Fidel Castro and U.S. Ambassador Fulton Freeman.",
  "tags": [
    "Victor Rico Galan",
    "Marxist",
    "Journalist",
    "Cuba",
    "Mexico",
    "Communism",
    "Propaganda",
    "Fulton Freeman",
    "Siempre",
    "Politica"
  ],
  "title": "Victor Rico Galan Vol II",
  "date": "1966-09-01",
  "locations_mentioned": [
    "Mexico",
    "Cuba",
    "Guatemala",
    "Dominican Republic",
    "Panama",
    "Nicaragua",
    "Costa Rica",
    "Venezuela",
    "Brazil",
    "Florida",
    "Chile"
  ],
  "persons_mentioned": [
    "Victor Rico Galan",
    "Fidel Castro",
    "Fulton Freeman",
    "Manuel Marcué Pardiñas",
    "Lázaro Cárdenas",
    "Raúl Roa Kuri",
    "Yon Sosa"
  ],
  "recipient": "CI/EXO",
  "sender": "JKTIGER"
}