{
  "classification": "Operations",
  "document_type": "Cable",
  "security": "Revealing the specifics of BRMODEL/1's interactions with the North Korean trainee, including the request for assassination videos and money, could compromise ongoing intelligence operations and sources. Specifically, the passage, *REQUESTED THAT M/1 PROVIDE HIM WITH VIDEO OF<ASSASSINATIONS>OF *FOREIGN LEADERS, PARTICULARLY THE<JFK ASSASSINATION.*, highlights the sensitivity of the information and the potential ramifications of disclosure.",
  "security_level": "SECRET",
  "summary": "A cable reports on interactions between BRMODEL/1 and a North Korean language trainee, Li Song-an, who requested money, cowboy boots, and videos of assassinations, particularly JFK's, raising concerns about the trainee's motivations and potential intelligence background.",
  "summary_one_paragraph": "This secret cable from June 18, 1996, details interactions between BRMODEL/1 and North Korean language trainee Li Song-an in Harare. Li seeks regular contact with BRMODEL/1 and requests a loan of ZD 1,200 (approximately US$100) and personal items, including size eight cowboy boots. Most notably, Li requested videos of assassinations, specifically of foreign leaders, including the JFK assassination. IOO Ballanger instructed BRMODEL/1 to determine the trainee’s motivations behind the requests, suspecting a connection to Li's claim of being part of a VIP protection unit and to push him to elicit more info on subj's (probable intel) background.",
  "tags": [
    "BRMODEL/1",
    "North Korea",
    "Li Song-an",
    "Assassination Videos",
    "JFK Assassination",
    "Intelligence Operation",
    "VIP Protection",
    "Robert Mugabe"
  ],
  "title": "BRMODEL/1 Contact with DPRK Language Trainee--Money, Boots, and Assassination Videos",
  "date": "1996-06-18",
  "locations_mentioned": [
    "Harare",
    "North Korea"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Li Song-an",
    "IOO Ballanger",
    "Robert Mugabe",
    "Kim Chong Il",
    "Chikombe"
  ],
  "recipient": "Director",
  "sender": "Staff"
}