{
  "classification": "Cuba",
  "document_type": "Information Report",
  "security": "This material contains information affecting the National Defense of the United States within the meaning of the Espionage Laws, Title 18, U.S.C. Secs. 793 and 794, the transmission or revelation of which in any manner to an unauthorized person is prohibited by law.",
  "security_level": "SECRET",
  "summary": "This report details information on Fernando FUENTES Coba, a former Cuban police lieutenant, including his work in the Confidential Department under Commander Efigenio ALMEJEIRAS, his alleged discharge due to drug-related issues, and his subsequent employment in a printing establishment in Halifax, Canada.",
  "summary_one_paragraph": "An information report from October 2, 1964, provides details on Fernando FUENTES Coba, a former Cuban police lieutenant who worked in the Confidential Department under Commander Efigenio ALMEJEIRAS. According to a former Cuban Intelligence Service officer, FUENTES was allegedly discharged from the police force because of drug-related problems and was last known to be working in a printing establishment in Halifax, Canada; supplemental information from the CIA's records notes FUENTES's involvement with the Departamento Tecnico de Investigaciones, his role in issuing regulations for the Cuban Revolutionary Secret Service, his activities within the Tourist and Transit Police, his 1957 conviction for violating U.S. immigration laws, and his later status as a photographer with the Tourist Commission in Habana.",
  "tags": [
    "CIA",
    "Fernando FUENTES Coba",
    "Cuba",
    "Cuban Intelligence Service",
    "Efigenio ALMEJEIRAS",
    "Counterintelligence",
    "Halifax, Canada",
    "Policia Nacional Revolucionaria",
    "Servicio Secreto Revolucionario",
    "Tourist Police",
    "Transit Police"
  ],
  "title": "Fernando FUENTES Coba",
  "date": "1964-10-02",
  "locations_mentioned": [
    "Cuba",
    "Washington, D.C.",
    "Halifax, Canada",
    "Miami",
    "Habana"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Fernando FUENTES Coba",
    "Efigenio ALMEJEIRAS",
    "Rafael del PINO"
  ],
  "recipient": "STATE, DIA, ARMY, NAVY, AIR, NSA, OCR, FBI, REP, CINCLANT, CINCSO, I&NS"
}