{
  "classification": "JFK Assassination",
  "document_type": "Memorandum/Note/Letter",
  "security": "Several documents discuss Nosenko's status as a CIA asset under contract, and the potential for Russian intelligence services to track him, representing a risk to his safety. For example, \"Το protect a CIA asset. Yuriy Ivanovich NOSENKO remains an asset of this agency, and is under contract...Russian intelligence services since the Second World War have tried to track their defectors.\"",
  "security_level": "SECRET",
  "summary": "This collection of documents from 1978-1997 pertains to the CIA's handling of the Yuriy Nosenko case, the House Select Committee on Assassinations' (HSCA) request for access to the Hart Report, and concerns regarding the release of information about Nosenko, particularly in relation to the JFK Assassination Records Collection Act.",
  "summary_one_paragraph": "This set of documents from 1978 to 1997 covers multiple facets of the Yuriy Nosenko case within the CIA. It includes a 1978 memorandum discussing the HSCA's request for access to the Hart Report, which assessed the Agency's handling of Nosenko and his possible KGB ties to Lee Harvey Oswald, along with the Agency's concerns about releasing potentially sensitive information to the committee. It contains notes and correspondence from 1993 and 1994 regarding the Washington Post's request to interview Nosenko and the CIA's internal discussions about protecting his identity and privacy during declassification. Finally, it includes a series of memos and correspondence in 1997 about the ARRB's review of Nosenko-related documents and the Agency's efforts to restrict the release of information that could compromise Nosenko's security or reveal intelligence tradecraft.",
  "tags": [
    "CIA",
    "Yuriy Nosenko",
    "HSCA",
    "Hart Report",
    "JFK Assassination Records Collection Act",
    "Declassification",
    "ARRB",
    "KGB",
    "Lee Harvey Oswald"
  ],
  "title": "Yuriy Nosenko and JFK Assassination Records",
  "date": "1978-05-30",
  "persons_mentioned": [
    "S. D. Breckinridge",
    "Blakey",
    "John Hart",
    "Yuri Nosenko",
    "Lee Harvey Oswald",
    "Stokes",
    "Ted Price",
    "James Woolsey",
    "Peter Bagley",
    "Newton Miller",
    "James Angleton",
    "Robert Fringle",
    "George Kalaris",
    "Oleg M. Gribanov",
    "Anatoliy Koralenko",
    "Matveey",
    "Sergei M. Fedoseyer",
    "Georgi Rastrusin",
    "M. I. Turalin",
    "Chelnekov",
    "Gruzder",
    "Oleg Nechiporenko",
    "Valeriy Kostikov",
    "Pavel Yatzkov",
    "Sue Amiano",
    "Barry Harrelson",
    "Al Bonner",
    "Michelle Combs",
    "Eileen M. Wukitch",
    "James W. Zirkle",
    "Dennis D. Lamb",
    "Ron L. Seckinger",
    "T. Jeremy Gunn"
  ],
  "recipient": "Director of Central Intelligence",
  "sender": "S. D. Breckinridge"
}