{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "Revealing that the FBI is running a Cuban refugee as a source against Cuban intelligence officers in the United States. Specifically, \"Source furnished little information regarding the above individuals and used as an excuse that although he was on close terms with most of them, he has had little or no contact with them since leaving the Miami area.\"",
  "security_level": "SECRET",
  "summary": "A Cuban refugee, acting as an FBI source (NK T-1), reports on meetings with Lazaro Eddy Espinosa Bonet, a Cuban UN Mission official, detailing Espinosa's inquiries about CIA operations, personnel, and infiltration tactics, as well as the source's interactions with an anti-Castro organization.",
  "summary_one_paragraph": "In August 1969, an FBI report details meetings between NK T-1, a Cuban refugee source, and Lazaro Eddy Espinosa Bonet, a Cuban UN Mission official, where Espinosa sought information on CIA activities, personnel in Miami, and Cuban infiltration tactics. Espinosa questioned the source about specific individuals, operations, and his fluency in English, expressing interest in potential collaborations, while the source revealed contact with an anti-Castro organization planning attacks on the Cuban Mission in New York; the report notes Espinosa's precautions, including carrying a weapon and potential counter-surveillance.",
  "tags": [
    "FBI",
    "Espionage",
    "Cuba",
    "Cuban Mission to the United Nations",
    "CIA",
    "Counterintelligence",
    "Infiltration",
    "Source Operation",
    "Anti-Castro Organizations",
    "Miami",
    "New Jersey",
    "New York",
    "Bronx Park"
  ],
  "title": "LAZARO EDDY ESPINOSA BONET - ESPIONAGE - CUBA",
  "date": "1969-08-10",
  "locations_mentioned": [
    "Newark, New Jersey",
    "Carlstadt, New Jersey",
    "Union City, New Jersey",
    "Bronx, New York",
    "Miami",
    "Havana",
    "Venezuela"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "Lazaro Eddy Espinosa Bonet",
    "Fidel Castro",
    "Jose Ramon Egues",
    "Epifanio Romero",
    "Raul Villaverde",
    "Rafael Villaverde",
    "Filiberto Leon Delgado",
    "Justo Luis Llorett",
    "Otto",
    "Javier Souto",
    "Edgar Sopo",
    "Manuel Artimes",
    "Arturo Pallan",
    "Rafael Bolinan Salvuccdo",
    "Andres Romero",
    "Caridad Gonzalez Lachin",
    "Heriberto Delgado",
    "Adolfo Delgado",
    "Cesar Baro",
    "Fernando Cabezas"
  ],
  "recipient": "Unknown",
  "sender": "Federal Bureau of Investigation, Newark, New Jersey"
}