{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "The memorandum discusses using CIA contract personnel to influence political figures and student bodies, which could expose covert operations and compromise relationships with foreign entities. Specifically, it mentions using Curtis Wilgus to influence Figueres and Uduber, and involving Betancourt in the affairs of the MRR, all of which could be seen as interfering in the internal affairs of other countries. It is also explicitly admitted that the combination of Manos Harta/Figueres “is unbeatable and that Artime has little choice but to align himself with their way of looking at things--or at least to pay lip service to it.”",
  "security_level": "SECRET",
  "summary": "This memo outlines a plan to use CIA contract personnel to influence ex-President Figueres and Foreign Minister Uduber to promote AMWORLD and AMBIDDY-1 by involving Cuban exile organizations and enlisting support from Latin American leaders like Betancourt.",
  "summary_one_paragraph": "A secret memorandum dated November 6, 1963, details a strategy to leverage CIA contract personnel, particularly Curtis Wilgus, to influence Figueres and Uduber in promoting the AMWORLD and AMBIDDY-1 projects. The plan includes enrolling Cubans from exile organizations into the School for Inter-American Development to gain acceptance from the moderate left. The memo also suggests having Artime pay respects to Figueres and Betancourt to gain their support, and involving Betancourt in the affairs of the MRR to neutralize the influence of Manolo Ray. Additionally, the memo mentions integrating \"Combate,\" an influential periodical, into the JMHART project to mold the thinking of Central America's left-of-center leadership.",
  "tags": [
    "CIA",
    "AMWORLD",
    "JMHART",
    "Curtis Wilgus",
    "Figueres",
    "Uduber",
    "Artime",
    "Betancourt",
    "MRR",
    "Manolo Ray",
    "Combate",
    "Monje",
    "Cuba"
  ],
  "title": "AMWORLD--Project JMHART",
  "date": "1963-11-06",
  "locations_mentioned": [
    "Cuba",
    "Latin America",
    "Cambridge",
    "San Jose",
    "Guatemala"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Curtis Wilgus",
    "Figueres",
    "Uduber",
    "Artime",
    "Manolo Kay",
    "Betancourt",
    "Monje",
    "Erich Herzog",
    "Santiago Polante",
    "Muñoz Maria"
  ],
  "recipient": "Chief, Special Affairs Staff",
  "sender": "Henry D. Hechcher (SAS/SO)"
}