{
  "classification": "Cuba",
  "document_type": "Classified Message",
  "security": "Revealing the identities of potential agents and their connections, as well as operational details like sabotage targets, communication methods, and supply caches, could compromise ongoing operations and endanger individuals. The document details plans for recruiting action personnel, investigating targets like 'Punto Tomate', and using explosives stored on a farm. Sharing these specifics could expose sensitive information and methods. Quoting directly: 'We are recruiting action personnel in hidden places... I will order Aguilar to investigate who lives at Punto Tomate. The explosive material I will use as selected targets. The other material will be buried.'",
  "security_level": "SECRET",
  "summary": "This message details communications regarding recruitment, potential agents, sabotage objectives, and supply caches in Cuba, mentioning names, locations, and planned actions.",
  "summary_one_paragraph": "This secret message relays communications pertaining to Cuban operations, specifically focusing on recruitment efforts, potential agents like Jose 11511 Gonzalez Canto and others recommended by Ruben and Doimeadios, and sabotage objectives. It discusses biographical data, reconnaissance of potential targets, including a tank park and 'Punto Tomate', and plans for explosive materials, supply caches, and re-supply operations. The message also covers communication protocols, agent recommendations, and requests for financial support, with a concluding station comment noting the unconfirmed validity of information from a GOC controlled agent.",
  "tags": [
    "CIA",
    "Cuba",
    "Recruitment",
    "Sabotage",
    "Agents",
    "Operations",
    "Caches",
    "Communications",
    "Gonzalez Canto",
    "DOIMEADIOS",
    "Ruben",
    "Punto Tomate"
  ],
  "title": "UMWAVE",
  "locations_mentioned": [
    "Cuba",
    "Holguin",
    "Puerto Padre",
    "Havana",
    "Manzanillo",
    "Matanzas",
    "Victoria"
  ],
  "persons_mentioned": [
    "Ruben",
    "Jose 11511 Gonzalez Canto",
    "Ramon",
    "Maric",
    "Mario",
    "Doimeadios",
    "Creste Tamayo Mungs",
    "Medardo Silva Marrero",
    "Roberto Zayas",
    "Rene Cruz Pamon",
    "Roberto Lecon Ping Fing",
    "Aguilar",
    "Padre Ramon Daniel Valdes Leon",
    "Alfredo Diaz Gonzalez",
    "Leonardo Pupo Romero",
    "Mario Torlaro",
    "Yulet",
    "Juakanin Roberto Maupino Miranda",
    "Rene Caramo",
    "Felipe Crue Colon",
    "Delicia Fara"
  ],
  "recipient": "UMWAVE",
  "sender": "C/SAS"
}