{
  "classification": "Personnel",
  "document_type": "Cable",
  "security": "This cable discusses the process of informing former employees about the release of their names in JFK assassination records. Releasing names of covert employees could compromise their cover and potentially endanger them or ongoing operations. The cable mentions the need to assess the viability of continued cover protection if a name is released: 'THE IMPACT OF THE RELEASE OF THE RELATIONSHIP OF YOUR TRUE NAME AND THE AGENCY WILL HAVE TO BE LOOKED AT CAREFULLY TO DETERMINE THE VIABILITY OF CONTINUED COVER PROTECTION.'",
  "security_level": "SECRET",
  "summary": "A cable from the CIA requesting the Mexico City station to contact former employees residing in Mexico who retired under cover, informing them that their names appear in JFK assassination records and may be publicly released.",
  "summary_one_paragraph": "This SECRET cable, dated March 6, 1997, instructs the CIA's Mexico City station to contact former employees who retired under cover and now reside in Mexico, to inform them that their names are present in documents related to the JFK Assassination Records Collection Act of 1992. The message outlines the process by which their names could be released to the public and provides guidance on how former employees can request postponement of the release by demonstrating a credible threat to themselves, their families, or sensitive past activities. The cable includes a form letter explaining the situation and potential grounds for postponing public disclosure, along with answers to frequently asked questions.",
  "tags": [
    "JFK Assassination Records Collection Act",
    "Covert Operations",
    "Personnel Security",
    "Mexico City Station",
    "Public Disclosure",
    "Beth Mills"
  ],
  "title": "Request for Station Assistance: Informing Former Employees about JFK Assassination Records Release",
  "date": "1997-03-06",
  "locations_mentioned": [
    "Mexico",
    "Mexico City",
    "Washington, D.C."
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Beth Mills"
  ],
  "recipient": "Mexico City Station",
  "sender": "Chief/OCC"
}