{
  "classification": "Security",
  "document_type": "Memo",
  "security": "Disclosing the specific items that the CIA wanted to be removed or altered from Hunt's memoir (\"Undercover\") could reveal sensitive operational details or methods. For example, the memo mentions changes to disguise the identity of a fabricated newspaper and remove a reference to journalists as agents; delete the word \"Guatemalan\" to make the entered embassy non-specific; and delete the reference to listening posts and telephone monitoring. ",
  "security_level": "SECRET",
  "summary": "John D. Morrison, Jr., Acting General Counsel, documents a meeting with E. Howard Hunt and his lawyers regarding the review of Hunt's memoirs, \"Undercover\", where they agreed on changes to classified and unclassified items, including alterations to the portrayal of CIA operations and alias documentation.",
  "summary_one_paragraph": "On September 28, 1974, John D. Morrison, Jr., and Ray Rocca met with E. Howard Hunt, his attorney William A. Snyder, Jr., and Snyder’s associate Thomas W. Coons at the DCD Washington Field Office to review Hunt's memoirs, \"Undercover.\" During the meeting, they discussed and agreed upon changes to both classified and unclassified items in the manuscript, including the fabrication of a Shanghai post, entry into a non-specific embassy in Mexico City, joint CIA-Uruguayan telephone monitoring operation, and the deletion of names of certain individuals to protect their cover. The discussion also covered the risk of the publisher resisting the changes and the potential for negative publicity, and Hunt expressed hope that the Agency would not issue a press release, but Morrison persuaded him that a public acknowledgment of the review would be beneficial.",
  "tags": [
    "E. Howard Hunt",
    "CIA",
    "Memoirs",
    "Undercover",
    "Security Review",
    "Classified Information",
    "DCD Washington Field Office"
  ],
  "title": "Meeting with E. Howard Hunt Re His Memoirs, \"Undercover\"",
  "date": "1974-09-30",
  "persons_mentioned": [
    "E. Howard Hunt",
    "Ray Rocca",
    "William A. Snyder, Jr.",
    "Thomas W. Coons",
    "John D. Morrison, Jr.",
    "Henry Pleasants",
    "Frank Holcomb",
    "Walter Pforzheimer"
  ],
  "recipient": "Acting DDO, SAB/DDO, DC/CI Staff, O/Security, Asst. to DCI, Mr. Walter Pforzheimer, C/CCS",
  "sender": "John D. Morrison, Jr., Acting General Counsel"
}