{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "This document reveals sensitive information regarding U.S. plans for sabotage, harassment, and political actions against Cuba and Cuban subversion in Latin America. The memo explicitly discusses \"Actions Against Cuba\" including sabotage of \"Canete Saw Mill, smaller POL storage plants...the Nazabal warehouse and pier, and ships.\" It also mentions \"unactivated incendiary and explosive devices in cargoes and on ships bound for Cuba\" and actions to \"encourage dissidence among different factions in Cuba...by spreading rumors, internal and external sabotage.\" Sharing these plans could severely damage U.S. foreign relations and compromise ongoing covert operations.",
  "security_level": "TOP SECRET",
  "summary": "This collection of memoranda and messages from 1964 outlines discussions and decisions related to covert operations against Cuba and North Vietnam, including sabotage plans, psychological warfare tactics, and reconnaissance activities.",
  "summary_one_paragraph": "This collection of documents from 1964 includes memoranda for the record from 303 Committee and Special Group meetings detailing discussions about autonomous operations against Cuba, potential assassinations of Cuban leaders, and the use of psychological warfare leaflets in North Vietnam. It covers topics such as funding for Cuban exiles like Manuel Ray and Artime, responses to reported assassination plots, authorization for leaflet dissemination despite using U.S.-manufactured paper, and reviews of covert actions including reconnaissance flights and infiltration/exfiltration operations in Cuba. Additionally, it presents a memo from the Deputy Secretary of Defense outlining a strategy of clandestine harassment and sabotage against Cuba to overthrow the Castro regime while minimizing risks of escalation.",
  "tags": [
    "Cuba",
    "North Vietnam",
    "Covert Operations",
    "Sabotage",
    "Psychological Warfare",
    "Reconnaissance",
    "Exile Groups",
    "303 Committee",
    "Special Group",
    "MACV SOG",
    "Oplan 34A"
  ],
  "title": "303 Committee and Special Group Meetings on Cuba and North Vietnam Operations",
  "date": "1964-06-18",
  "locations_mentioned": [
    "Cuba",
    "North Vietnam",
    "South Vietnam",
    "Laos",
    "Cambodia",
    "Puerto Rico",
    "Miami"
  ],
  "origin_agency": "Various (White House, CIA, Department of Defense)",
  "persons_mentioned": [
    "Manuel Ray",
    "Artime",
    "FitzGerald",
    "Bundy",
    "Attorney General",
    "Hoover",
    "General Carter",
    "Helms",
    "Papich",
    "Vance",
    "McMillan",
    "Cheever",
    "Alexis Johnson",
    "McGeorge Bundy",
    "Cyrus R. Vance",
    "Castro"
  ],
  "recipient": "Various (White House, CIA, Department of Defense)",
  "sender": "Various (Memorandum for the Record)"
}