{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Revealing Dr. MIRO Cardona's plans for a commando raid, establishment of a government on Cuban soil, and request for U.S. military intervention could compromise ongoing or future covert operations and damage U.S. foreign relations. The document states: \"First, a commando raid in force to seize a piece of Cuban territory, preferably near Guantanamo, and immediately the members of the Council go ashore, proclaim a provisional government...request U. S. assistance, and the U. S. should furnish such assistance at once in adequate strength to ensure victory.\"",
  "security_level": "SECRET",
  "summary": "A memorandum detailing a meeting with Dr. MIRO Cardona, where he discussed propaganda efforts, underground activities including a commando plan, requests for arms, information on arms received by the Castro regime, and a proposal for the Revolutionary Council to establish a government on Cuban soil with U.S. military assistance.",
  "summary_one_paragraph": "This memorandum documents a meeting on October 6, 1961, with Dr. MIRO Cardona, leader of the Revolutionary Council, where he outlined plans to intensify anti-Castro efforts. These included coordinating propaganda with Agency support, conducting a propaganda campaign targeting Cuba and Latin America, providing funds to resistance groups in Cuba, and executing a commando operation to bolster morale and weaken the Cuban regime. Dr. MIRO also requested U.S. assistance in providing weapons and funds for these operations and shared a report on arms received by the Castro regime. Further, he proposed a bold plan for the Revolutionary Council to establish a government on Cuban soil near Guantanamo, seeking immediate U.S. recognition and military intervention to overthrow Castro.",
  "tags": [
    "MIRO Cardona",
    "Revolutionary Council",
    "Cuba",
    "Anti-Castro",
    "Propaganda",
    "Commando Action",
    "Underground Activities",
    "U.S. Intervention",
    "Arms Request",
    "FOIA"
  ],
  "title": "Meeting with Dr. MIRO Cardona on 6 October",
  "date": "1961-10-10",
  "locations_mentioned": [
    "Cuba",
    "Key West",
    "Miami",
    "United States",
    "Latin America",
    "Escambray",
    "Guantanamo"
  ],
  "persons_mentioned": [
    "MIRO Cardona",
    "Manual VARELA Castro",
    "Enrique DESPAIONE",
    "MONTEAGUDO",
    "Osvaldo RAMIREZ",
    "President FRONDIZI",
    "ALABAU",
    "VARONA",
    "PRIO",
    "CATRILLO",
    "CONTE AGUERO",
    "MESTRE",
    "Julio CARCERAN",
    "Julio AMOFDO",
    "VILLANUEVA",
    "Nicanor FERNANDEZ",
    "LACERDA"
  ]
}