{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Disclosing operational details regarding AMCLOCK/1, a human asset, could jeopardize their safety and compromise ongoing intelligence operations. Explicitly, 'AMCLOCK/1 was not seen going in or out of the room and the NATIONS meeting was conducted without interruption under most secure conditions. DI GERVENO established immediate rapport with AMCLOCK/1 and their relations remained most cordial throughout the meeting. Only DI GERVENO and AMCLOCK/1 were present.' Revealing secure meeting protocols and AMCLOCK/1's identity poses significant risks.",
  "security_level": "SECRET/RYBAT",
  "summary": "This dispatch concerns the transmittal of contact reports regarding meetings between Peter J. DI GERVENO and AMCLOCK/1 in New York, detailing operational chronologies and intelligence gathered.",
  "summary_one_paragraph": "This dispatch, dated October 13, 1967, transmits contact reports from Peter J. DI GERVENO/JMWAVE concerning his first two meetings with the asset AMCLOCK/1, held on September 26 and 27 in New York. The reports detail the arrangements made to contact AMCLOCK/1, who had failed to make contact as instructed, and recount AMCLOCK/1’s operational chronology, including his criticism of living conditions in PBRUMEN, his reasons for not making prior contact, and his belief that his wife opposes the AMTHUG regime; the reports also provide information on internal security within the PBRUMEN mission and AMCLOCK/1's financial transactions. The document specifies future meeting plans and disseminates intelligence on PBRUMEN government attitudes towards the United States, views on specific individuals, and objectives of the AMTHUG regime.",
  "tags": [
    "CIA",
    "JMWAVE",
    "AMCLOCK/1",
    "Contact Reports",
    "PBRUMEN",
    "AMTHUG Regime",
    "Peter J. DI GERVENO",
    "Human Asset",
    "Intelligence",
    "New York",
    "Security",
    "Cuba",
    "Operations"
  ],
  "title": "Transmittal of Contact Resorts for First Two Meetings with AMCLOCK/1",
  "date": "1967-10-13",
  "locations_mentioned": [
    "New York",
    "Cuba",
    "PBRUMEN",
    "Washington"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Peter J. DI GERVENO",
    "AMCLOCK/1",
    "Alberto BOZA Hidalgo-Gatop",
    "Joaquin Camilo GARCIA Alonso",
    "Gonzalo DIAZ Diaz",
    "Rogelio RODRIGUEZ Lopez",
    "Jesus JIMENEZ Escobar",
    "Raul ROA",
    "JOS TERNANDEZ Cossio",
    "Americo CRUZ",
    "Fernando ALVAREZ Tabio",
    "Isidro ROSALES",
    "Antonio CARRILLO",
    "Gabriel MOLINA",
    "MIDDAUGH"
  ],
  "recipient": "Chief, WH/Cuba; COS, JMWAVE; Chief, DOD; Chief of Base, New York",
  "sender": "Howard G. FIGALAN"
}