{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "This document discusses CIA funding of the DRE and their possible animus towards President Kennedy, noting concern that compromise of the CIA sponsorship of this organization might in any way embarrass the Agency. Revealing CIA links to anti-Castro groups and concerns about their potential involvement in the assassination could damage the CIA's reputation and compromise past operations.",
  "security_level": "Unclassified",
  "summary": "A CIA memorandum records recollections of potential animosity held by DRE leadership towards President Kennedy due to his perceived lack of forceful action against Cuba, raising concerns about possible DRE involvement in the assassination investigations.",
  "summary_one_paragraph": "Calvin Thomas, in a memorandum dated March 8, 1967, recounts his time with JMWAVE in 1961, where he worked on funding the DRE (Student Revolutionary Directorate). Thomas recalls that DRE leader Luis FERNANDEZ Rocha and others expressed chagrin and bitterness towards President Kennedy for not aggressively pursuing Cuba's liberation. Prompted by renewed interest in the JFK assassination investigations centered in New Orleans, Thomas documents his concern that the DRE's sentiments may have escalated, although he was no longer directly involved with the group after the summer of 1963. He notes the DRE might be the Cuban Student Directorate investigated for Oswald contacts.",
  "tags": [
    "DRE",
    "JMWAVE",
    "Kennedy Assassination",
    "Cuba",
    "CIA",
    "Luis FERNANDEZ Rocha",
    "Oswald",
    "Cuban Student Directorate"
  ],
  "title": "Possible DRE Animus Towards President Kennedy",
  "conspiracy": "The memorandum connects a CIA-funded organization (DRE) with possible animosity towards President Kennedy, suggesting a tenuous link between anti-Castro elements and the assassination. It mentions potential contacts between the DRE's New Orleans representative and OSWALD, raising concerns about a possible conspiracy. However, it does not definitively clarify who killed JFK or why.",
  "date": "1967-03-08",
  "persons_mentioned": [
    "Calvin Thomas",
    "Ross CROZIER",
    "Luis FERNANDEZ Rocha",
    "President Kennedy",
    "OSWALD"
  ],
  "recipient": "Record",
  "sender": "Calvin Thomas (SB/O/PT)"
}