{
  "classification": "Cuba",
  "document_type": "Contact Report",
  "security": "This report details intelligence gathered from a Cuban source (LITAMIL-9) regarding Cuban Embassy personnel in Mexico City, potential security risks, and Cuban diplomatic activities, including information on the planned body search of a Mexican national. Sharing this information could compromise the source, expose intelligence-gathering methods, and strain diplomatic relations. For example, the document states: \"Cubans plan to conduct a full body search of FAR LAS when she leaves Cuba, i.e. 'en cueros'. I-9 pointed out that FARIAS is a Mexican and if it true what MAIZ reporting about body search etal it would be good for PP play in Mexico.\"",
  "security_level": "SECRET",
  "summary": "A contact report from Mexico City details information provided by LITAMIL-9 regarding Cuban Embassy personnel, potential security breaches, and diplomatic activities, including planned actions against a Mexican national.",
  "summary_one_paragraph": "This secret contact report from the Chief of Station in Mexico City summarizes information provided by the source LITAMIL-9 during meetings in May 1963 concerning the activities of Cuban Embassy personnel and other individuals. The report includes details on potential security risks involving Cuban diplomats, suspicions about individuals connected to the embassy, planned actions against a Mexican national named FARIAS, and information on travel plans and political views shared by various contacts. The information was gathered at pre-arranged meeting points outside of Mexico City to prevent security breaches.",
  "tags": [
    "CIA",
    "Contact Report",
    "LITAMIL-9",
    "Cuban Embassy",
    "Mexico City",
    "Security",
    "Counterintelligence"
  ],
  "title": "Contact Report/ LITAMIL-901",
  "date": "1963-05-21",
  "locations_mentioned": [
    "Mexico City",
    "Cuba",
    "Havana",
    "Miami",
    "Veracruz"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "LITAMIL-9",
    "Willard C. Curtis",
    "Dolores de la Mora Cepeda",
    "VEGA",
    "Conchita Fernandez",
    "Clerge Fabra",
    "Ramon Sinobas Casado",
    "Francisco Maiz",
    "Hector Gallo Portieles",
    "Rogelio Rodriguez Lopez",
    "Heberto Jorrin",
    "Antonio Garcia Lara",
    "Jose Llagostera",
    "Armando Sardinas",
    "Eusebio Azcue Lopez",
    "Buenaventura Reyes Acosta",
    "Ramon Siores",
    "Raul Roa",
    "Rafael Meruza Pedrosa Perez",
    "Antonio Arruza Mon",
    "Coty Bolorzano",
    "Lazaro Cardenas",
    "Emire Farias",
    "Jose Portuondo",
    "Andres Armona",
    "Jose Fernandez Roa",
    "Armina Ramos",
    "Ovidio Sara",
    "Ramon Sinobas del Olmo",
    "Manuel Vega Perez",
    "Joaquin Hernandez de Armas",
    "Duni",
    "Fidel Castro",
    "Lopez N.",
    "Seydou Diallo",
    "Carlos Lechuga",
    "Ram Thuerise",
    "Vicente Lombardo Toledano",
    "Marcial Martinez",
    "Emigdio Vega Calero",
    "Emmanuel Carballo",
    "Chiquior Sarsamendi"
  ],
  "recipient": "Chief, SAS; Chief of Base, Merida; Chief of Station, WAVE; Chief, WHD",
  "sender": "Chief of Station, Mexico City"
}