{
  "classification": "Mexico",
  "document_type": "Memo",
  "security": "The document outlines operational objectives and methods in Mexico, including clandestine collection, covert action, agent recruitment, media manipulation, and penetration of political and governmental organizations. Exposing these activities could compromise ongoing operations, endanger assets, and damage relations with the Mexican government. For example, it states the 'Station's primary emphasis will continue to be placed on clandestine collection...and covert action operations against the Sino-Soviet bloc, Cuban, and Communist elements in Mexico' and calls for the recruitment or defection of bloc personnel.' Revealing these methods would harm US interests.",
  "security_level": "UNCLASSIFIED",
  "summary": "A memorandum from J.C. King, Chief of WH Division, to the Deputy Director (Plans) requesting approval for the revised Related Mission Directive for Mexico, which outlines objectives related to countering communism and maintaining friendly relations with the Mexican government.",
  "summary_one_paragraph": "This memorandum, dated January 24, 1961, from J.C. King, Chief of the WH Division, to the Deputy Director (Plans) requests approval for the revised Related Mission Directive for Mexico. The directive details U.S. policy objectives in Mexico, which include reducing communist influence, encouraging democratic governance, and maintaining a friendly Mexican government. The operational emphasis is on clandestine collection and covert action against Sino-Soviet bloc, Cuban, and Communist elements. Revisions to the directive include a specific focus on Cuban revolutionary activities, refinements of Priority B objectives, and covert action against Cuban targets.",
  "tags": [
    "CIA",
    "Mexico",
    "Related Mission Directive",
    "Communism",
    "Covert Action",
    "Sino-Soviet Bloc",
    "Cuba",
    "Political Action",
    "Propaganda",
    "Counterintelligence"
  ],
  "title": "Related Mission Directive for Mexico",
  "date": "1961-01-24",
  "locations_mentioned": [
    "Mexico",
    "Cuba",
    "United States",
    "Latin America"
  ],
  "origin_agency": "CIA WH Division",
  "persons_mentioned": [
    "J. C. King",
    "S. M. Hines",
    "Fidel Castro"
  ],
  "recipient": "Deputy Director (Plans)",
  "sender": "J. C. King, Chief WH Division"
}