{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "The document discusses the inadvertent destruction of records pertaining to the JFK Assassination, which were protected under the JFK Assassination Records Act. Specifically, it mentions the destruction of a file related to 'Lonnquist (Kennedy Assassination)' and 'allegations regarding the Lee Harvey Oswald file.' Disclosing these details could reveal the Agency's internal processes for handling and archiving sensitive information and potentially lead to legal or reputational repercussions. Quoting the document: 'IG 37/77 Lonnquist (Kennedy Assassination) destroyed on 5/1/95 by S.K.' and 'allegations regarding the Lee Harvey Oswald file'.",
  "security_level": "CONFIDENTIAL",
  "summary": "A memorandum regarding the inadvertent destruction of records related to the JFK assassination, specifically a file related to Lonnquist and allegations involving Lee Harvey Oswald, and the subsequent reporting and reconstruction efforts.",
  "summary_one_paragraph": "This memorandum details the discovery of the inadvertent destruction of permanent OIG records, including a file related to the JFK assassination and Lee Harvey Oswald, during a records search in response to a request from the AD/IG/INV. Jerry Owens of OIG/IMO explains the circumstances, noting that the destruction occurred in 1995, after the enactment of the JFK Assassination Act, and outlines plans to notify the National Archives and Records Administration (NARA) and the Assassination Review Board (ARB) and to reconstruct the file to prevent future occurrences, with the understanding that no further action from the Inspector General's office is required.",
  "tags": [
    "JFK Assassination",
    "Record Destruction",
    "OIG",
    "IMO",
    "ARB",
    "NARA",
    "Lonnquist",
    "Lee Harvey Oswald",
    "JFK Assassination Records Act"
  ],
  "title": "(AIUO) Inadvertent Destruction of Records",
  "date": "1998-01-06",
  "persons_mentioned": [
    "Barry Harrelson",
    "Jerry Owens",
    "Rick Cinquegrana",
    "Judy Sholes",
    "Lonnquist",
    "Lee Harvey Oswald"
  ],
  "recipient": "Barry Harrelson, OIM/HRG",
  "sender": "Jerry Owens (C), OIG/IMO"
}