{
  "classification": "Operations",
  "document_type": "Report",
  "security": "This document details interactions and debriefings of an individual, THERIAULT, including financial arrangements, discussions about influencing foreign leaders (Krishna Menon), and strategies for using THERIAULT's influence to invite the Prime Minister to the U.S. Revealing these operations, especially the details about sterile checks and attempts to cultivate influence, could compromise ongoing intelligence activities and damage diplomatic relations. Additionally, it states: 'THERIAULT is to be advised that she is at liberty to discuss any and all aspects of her trip with anybody with the e: ception of the Agency's role in sponsoring it.' which reveals a covert operational objective.",
  "security_level": "SECRET",
  "summary": "A collection of reports and notes related to 'PAFLIPPER,' concerning the activities and debriefing of THERIAULT in India, including financial arrangements, strategic discussions for influencing Indian leaders, and general observations on US-India relations and personnel.",
  "summary_one_paragraph": "This document consists of reports and notes from May 1955 detailing the CIA's 'PAFLIPPER' project involving an individual named THERIAULT in India. The documents cover administrative aspects such as the transmittal of reports, financial matters including additional funds provided via sterile check, and strategic discussions related to influencing Indian leaders such as Krishna Menon. Key points include using flattery to encourage Menon to write a book, planning for an official invitation to the Prime Minister, ensuring THERIAULT is aware of the positive impact of her reports, and managing her awareness of the Agency's role. General comments also address US-India relations, the work of the Ford Foundation, and observations on key personnel like Evelyn Hersey and Ambassador Allen.",
  "tags": [
    "CIA",
    "PAFLIPPER",
    "THERIAULT",
    "India",
    "Influence Operations",
    "Krishna Menon",
    "US-India Relations",
    "Covert Operations",
    "Ford Foundation"
  ],
  "title": "Transmittal of Reports related to (PA)FLIPPER - Operational/INTEL",
  "date": "1955-05-14",
  "locations_mentioned": [
    "New Delhi",
    "India",
    "New York",
    "Washington"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "THERIAULT",
    "Krishna Menon",
    "Sen. George",
    "Chester Bowles",
    "Ambassador Allen",
    "Evelyn Hersey",
    "Drend Irvine",
    "Mr. Nehru",
    "Mr. Uhuber",
    "Mrs. Gandhi"
  ],
  "recipient": "Chief, FORA",
  "sender": "Senior Representative, (New Delhi)"
}