{
  "classification": "Operations",
  "document_type": "Dispatch",
  "security": "Revealing Davidson's cooperation with U.S. government agencies and his business dealings with foreign entities could expose sources and methods. Specifically, the dispatch mentions that 'Subject usually protects himself by reporting the business proposition to a U.S. Government agency or official.' This suggests a level of cooperation that, if revealed, could compromise ongoing or future intelligence operations involving Davidson or similar individuals.",
  "security_level": "UNCLASSIFIED",
  "summary": "A CIA dispatch details a name check on Irving Davidson, an international businessman, revealing his contacts, activities, and possible role as an informant for the U.S. Government, as well as his involvement in arms deals and casino ventures.",
  "summary_one_paragraph": "This dispatch from the Chief of the Far East Division to the Chief of Station in Manila, dated October 16, 1958, summarizes a name check on Irving Davidson, an international businessman residing in Washington, D.C. Davidson is described as an aggressive individual who often involves U.S. Government agencies in his foreign business propositions. The check reveals his past associations with James Farriss and Drew Pearson, his representation of Nicaraguan President A. Somoza, his attempts to broker arms deals involving Israel, Nicaragua, Cuba, and Indonesia, and his proposed business arrangement to open a PUTNIK travel agency in New York City, along with a failed attempt to gain financial backing from KUBARK. The dispatch also notes Davidson’s connection to a proposed casino venture in Nicaragua with the late President Somoza.",
  "tags": [
    "Irving Davidson",
    "Name Check",
    "Arms Dealing",
    "Nicaragua",
    "Cuba",
    "Indonesia",
    "Drew Pearson",
    "KUBARK",
    "Casino",
    "Foreign Agents Registration Act"
  ],
  "title": "Irving Davidson",
  "date": "1958-10-16",
  "locations_mentioned": [
    "Manila",
    "Washington, D.C.",
    "Cuba",
    "Mexico",
    "Nicaragua",
    "Dominican Republic",
    "New York City",
    "Israel",
    "Indonesia"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Irving Davidson",
    "Drew Pearson",
    "James Farriss",
    "Jack Northan Anderson",
    "Frederick G. Blumenthal",
    "A. Somoza",
    "Max Henriquez",
    "Vincente Toledano",
    "Peter Uthalunec",
    "Isaac Cohen",
    "Dan Cummings",
    "Abdul Rachman Suriokusumo",
    "Enrique Garcia, Jr.",
    "Rafael L. Trujillo",
    "Sam Waugh"
  ],
  "recipient": "Chief of Station, Manila",
  "sender": "Chief, Far East Division"
}