{
  "classification": "Liaison",
  "document_type": "Memorandum and Letter",
  "security": "Several documents discuss liaison relationships between the CIA and foreign services, including details about specific operations and intelligence sharing. For example, one memo discusses protecting the phrase \"with Mexicans\" because it gives away liaison involvement in a tel-tap operation. Releasing such information could damage relationships with foreign services and compromise intelligence sources and methods.",
  "security_level": "SECRET",
  "summary": "This collection of documents primarily concerns the review and declassification of foreign government information, particularly liaison relationships between the CIA and foreign intelligence services, and includes correspondence between the JFK Task Force, the Assassination Records Review Board (ARRB), the Department of State, and the CIA.",
  "summary_one_paragraph": "The documents consist of memoranda, letters, and attachments related to the handling of foreign government information in the JFK assassination records. They address issues such as the implementation of the JFK Act concerning information obtained from foreign governments through liaison channels, the protection of sensitive liaison relationships (particularly with Australia and Mexico), the process for declassifying foreign government information, and instances where the CIA requested the ARRB to reconsider the release of certain documents due to concerns about compromising foreign relations or intelligence operations. Also discussed is the coordination between the CIA, the ARRB, the FBI, and the State Department regarding the release or postponement of foreign liaison information, including a specific request for the CIA to contact its liaison channels in Mexico City for information related to Lee Harvey Oswald's telephone calls.",
  "tags": [
    "CIA",
    "JFK Assassination Records Act",
    "Foreign Government Information",
    "Liaison Relationships",
    "Declassification",
    "Australia",
    "Mexico",
    "ARRB",
    "FBI",
    "State Department",
    "LIENVOY"
  ],
  "title": "Foreign Government Liaison and Information",
  "date": "1995-08-23",
  "persons_mentioned": [
    "John A. Hartingh",
    "Jack Tunheim",
    "Phil Golrick",
    "Kenneth Duncan",
    "T. Jeremy Gunn",
    "Bob Skwirot",
    "Ellie",
    "J. Barry Harrelson",
    "Linda C. Cipriani",
    "Bob Caudle",
    "Jeff",
    "John Pereira",
    "David G. Marwell",
    "Sandy Berger",
    "Philip Flood",
    "Don Russell",
    "Lee Harvey Oswald",
    "Nielson"
  ],
  "recipient": "John A. Hartingh",
  "sender": "T. Jeremy Gunn, John F. Pereira, Linda C. Cipriani"
}