{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "This cable discusses Orestes Guillermo Ruiz-Perez and his activities, including his work for the embassy and interactions with individuals. Discussing such interactions could potentially expose sources or methods used to gather information, thus it is classified. Quoting directly: 'Ruiz says that she could be very useful to them with her student connections, and that without interfering with her studies she can also be helping Cuba.'",
  "security_level": "SECRET",
  "summary": "Cables discuss Orestes Guillermo Ruiz-Perez's activities, including travel arrangements for SAMKO, and reporting an incident at Barajas airport. They detail his interactions with individuals, including a student potentially useful to Cuba, and his intention to report police permissiveness regarding provocations against embassy officials.",
  "summary_one_paragraph": "These SECRET cables from May 1970 focus on Orestes Guillermo Ruiz-Perez's activities, primarily concerning travel arrangements for an individual named SAMKO who is scheduled to arrive in Madrid and be contacted by SACODER. The cables also detail an incident at Barajas airport involving an altercation where embassy officials were provoked, and Ruiz-Perez plans to report the police's permissiveness. Additionally, a report mentions Ruiz-Perez's interaction with a female student visiting from Cuba, whom he suggests could be helpful to them with her student connections while in Spain, and stresses the importance of her staying in contact with the embassy due to potential surveillance.",
  "tags": [
    "CIA",
    "Orestes Guillermo Ruiz-Perez",
    "SAMKO",
    "SACODER",
    "Barajas Airport",
    "Cuban Embassy",
    "Student Connections",
    "Madrid",
    "Travel Arrangements"
  ],
  "title": "PUIZ-Perez, Orestes Guillermo",
  "date": "1970-05-27",
  "locations_mentioned": [
    "Madrid",
    "Barajas Airport",
    "Havana",
    "Spain",
    "Alcala",
    "University of Santander",
    "Paris"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Orestes Guillermo Ruiz-Perez",
    "SAMKO",
    "SACODER",
    "HORACIO",
    "FRANCO",
    "BARREDA"
  ],
  "recipient": "DIRECTOR, WE MIAMI, ROME",
  "sender": "MADRID"
}