{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Memorandum and Process Sheet",
  "security": "This document reveals intelligence collection activities related to the Pugwash Conference and the identification of U.S. participants, which could compromise intelligence sources and methods. Citing the warning notice: 'SENSITIVE INTELLIGENCE SOURCES AND METHODS'.",
  "security_level": "CONFIDENTIAL",
  "summary": "This collection of documents includes a memorandum regarding a House Select Committee on Assassinations request for material on Abram Chayes, Monica Kramer, and Rita Naman, along with a memo detailing intelligence collection efforts related to the Pugwash Conference in Munich, Germany, in August 1977, including a list of attendees and questions for field offices.",
  "summary_one_paragraph": "This collection of documents pertains to the House Select Committee on Assassinations' review of CIA materials, specifically a file on Abram Chayes and documents related to Monica Kramer and Rita Naman. Additionally, it includes a memorandum from August 1977, sent to various field offices, concerning the Pugwash Conference in Munich, Germany. The memo encloses a list of attendees, including Abram Chayes, Carl Djerassi, Paul Doty, and others, along with a set of questions from ORPA analysts intended to gather intelligence related to the conference and its participants, citing CISL, Objective Ala, and KIQ 90.",
  "tags": [
    "CIA",
    "House Select Committee on Assassinations",
    "Abram Chayes",
    "Pugwash Conference",
    "Intelligence Collection",
    "ORPA",
    "Monica Kramer",
    "Rita Naman"
  ],
  "title": "Material Reviewed at CIA Headquarters by House Select Committee on Assassinations Staff Members: CHAYES, ABRAM",
  "date": "1977-08-31",
  "locations_mentioned": [
    "Cambridge, MA",
    "Boston",
    "New York",
    "San Francisco",
    "Syracuse",
    "Washington D.C.",
    "Munich, Germany",
    "McLean, VA",
    "Stony Brook, New York"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Abram Chayes",
    "Monica Kramer",
    "Rita Naman",
    "Carl Djerassi",
    "Paul Doty",
    "Bernard T. Feld",
    "George B. Kistiakowsky",
    "Richard Rosecrance",
    "Jack P. Ruina",
    "Herbert Scoville",
    "N. Murray Todd",
    "John S. Toll",
    "Ruth Elliff",
    "Thomas A. Messer",
    "John Souders",
    "Martha Mautner",
    "Glenn Buchan",
    "William Chapin",
    "Tom Wilber"
  ],
  "recipient": "DDO/ISS/IP/EIS, Chief, Boston Field Office, Chief, New York Field Office, Chief, San Francisco Field Office, Chief, Syracuse Field Office, Chief, Washington Field Office",
  "sender": "Ruth Elliff, Acting Chief, USSR-EE Collection Group, D73"
}