{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "This cable outlines planned PSYCH EXPLOITATION IN MEDIA activities against Fidel Castro and Cuba, designed to portray Castro as a dictator grasping at straws and to draw comparisons to other leaders who have economically failed their nations. It also includes a directive to avoid any references to allegations of GOC that KUBARK (CIA) was involved in the Cubela plot. Sharing these strategies and connections to events could reveal the CIA’s tactics for influencing public opinion and potentially compromise ongoing or future operations.",
  "security_level": "SECRET",
  "summary": "A CIA cable reports on a widespread purge in Cuba targeting military officers, government officials, and Communist Party leaders, and outlines potential psychological exploitation strategies against Fidel Castro in response to the situation.",
  "summary_one_paragraph": "This CIA cable, dated March 18, 1966, discusses a widespread purge underway in Cuba, affecting military officers, government officials, and Communist Party leaders, as reported by Reuters. It details the dismissal of Major Efigenio Ameijeiras, the arrest of several officials for “playboy behavior,” and the trial of Rolando Cubela for plotting to overthrow Fidel Castro. The cable suggests psychological exploitation strategies to portray Castro negatively, highlighting his internal difficulties and comparing him to other failed leaders while avoiding mentioning any CIA involvement in the Cubela plot, and it proposes efforts to establish contacts with Cuban foreign ministry and trade personnel for recruitment.",
  "tags": [
    "CIA",
    "Cuba",
    "Fidel Castro",
    "Purge",
    "Reuters",
    "Efigenio Ameijeiras",
    "Rolando Cubela",
    "Psychological Exploitation",
    "Propaganda",
    "Communist Party"
  ],
  "title": "Report on Purge of Cuban Officials and Military Officers",
  "date": "1966-03-18",
  "locations_mentioned": [
    "Havana, Cuba",
    "United States",
    "Communist China",
    "Yugoslavia"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Fidel Castro",
    "Efigenio Ameijeiras",
    "Rolando Cubela",
    "Ramon Guin",
    "Blas Roca Calderio",
    "Raul Roa Garcia",
    "Faure Chomon",
    "Nrumah",
    "Sukarno"
  ],
  "recipient": "See Below",
  "sender": "Director"
}