{
  "classification": "Cuba",
  "document_type": "Memorandum/Dispatch/Cable",
  "security": "Several documents discuss potential AMOT (American Mole Operations Technique) recruitment attempts and surveillance of Rogelio Rodriguez Lopez, who is identified as a DGI officer. This includes references to LNERGO (FBI) assets and JKLANCE defectors who may be utilized for assessment or approach. For example, one cable states, 'HQS IS ALSO CURRENTLY LOOKING AT RODRIGUEZ AS PRIORITY TARGET BECAUSE OF LARGE NUMBER OF PRESENT AND FORMER JKLANCE ASSETS WHO HAVE BEEN IN CONTACT WITH HIM'. Revealing these operations and assets could jeopardize ongoing recruitment and surveillance efforts, and compromise relationships with LNERGO and other intelligence assets.",
  "security_level": "SECRET",
  "summary": "The documents discuss Rogelio Rodriguez Lopez, a Cuban DGI officer, focusing on surveillance, potential recruitment attempts (AMOT), and coordination between CIA and FBI (LNERGO) using JKLANCE assets; they also cover related intelligence activities, personnel, and operational coordination concerning Cuban UN mission activities.",
  "summary_one_paragraph": "These documents, spanning from April to December 1970, primarily concern Rogelio Rodriguez Lopez, a Cuban DGI officer and First Secretary of the Cuban Mission to the UN (CMUN), detailing CIA and FBI (LNERGO) efforts to surveil, assess, and potentially recruit him using various assets, including JKLANCE defectors. The documents cover discussions of operational coordination, intelligence gathering on Rodriguez's contacts and activities, and internal assessments of recruitment viability and potential targets within the CMUN, along with updates on personnel assignments and related intelligence matters concerning Cuban activities in New York.",
  "tags": [
    "Rogelio Rodriguez Lopez",
    "DGI",
    "Cuban Intelligence",
    "AMOT",
    "JKLANCE",
    "LNERGO",
    "FBI",
    "CMUN",
    "Counterintelligence",
    "Surveillance",
    "Recruitment",
    "UN"
  ],
  "title": "Rogelio Rodriguez Lopez: Surveillance, Recruitment Attempts, and Intelligence Activities",
  "date": "1970-04-27",
  "locations_mentioned": [
    "Cuba",
    "New York",
    "Havana",
    "Washington D.C.",
    "Tanzania",
    "Mozambique",
    "South Africa",
    "Spain"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Rogelio Rodriguez Lopez",
    "Jennifer Enid Miles",
    "Jose Raul Viera Linares",
    "Fidel Castro",
    "Raul Roa",
    "Victor Vaccaro",
    "Esther Gavilan Nogales",
    "Eduardo",
    "Teofilo Acosta",
    "Manuel Pineiro Losada",
    "Francisco V. Portela",
    "Orlando Gutierrez",
    "Ricardo Alarcon Quesada",
    "Pedro Amado Morales Carballo",
    "Joanna Faith Haas"
  ],
  "recipient": "Director, WH/MIAMI, DO BASE/NEW YORK",
  "sender": "Federal Bureau of Investigation, Chief, WH Division, Chief, DO Division, DO BASE WASHINGTON"
}