{
  "classification": "Personnel",
  "document_type": "Memorandum and Personnel Action Request",
  "security": "Sharing details about personnel actions and performance reviews could compromise internal CIA processes and evaluations. The mention of covert actions and specialization in sensitive areas like CI operations could expose operational details. Excerpt: 'varied covert action activities'.",
  "security_level": "SECRET",
  "summary": "This collection of documents relates to personnel actions and performance evaluations for Charlotte Bustos-Videla, a CIA employee, including recommendations for promotions and quality step increases based on her exceptional performance in various roles.",
  "summary_one_paragraph": "This collection of documents details personnel actions and performance evaluations for Charlotte Bustos-Videla, a CIA employee who demonstrated exceptional performance throughout her career. The documents include requests for reassignment, recommendations for promotion from GS-13 to GS-14, requests for quality step increases, and commendations from supervisors. Bustos-Videla is recognized for her indispensable service in various Headquarters Branch and Field Station assignments, her expertise in Latin American affairs, and her contributions to covert actions and operational support, ultimately leading to approvals for promotions and salary increases.",
  "tags": [
    "CIA",
    "Personnel File",
    "Performance Evaluation",
    "Promotion",
    "Quality Step Increase",
    "Charlotte Bustos-Videla",
    "Latin America",
    "Covert Action"
  ],
  "title": "Personnel Actions and Performance Evaluations for Charlotte Bustos-Videla",
  "date": "1973-07-31",
  "persons_mentioned": [
    "Charlotte Bustos-Videla",
    "H.L. Berthold",
    "Theodore G. Shackley",
    "William V. Broe",
    "Desmond FitzGerald",
    "Thomas H. Karamessires"
  ],
  "recipient": "Chairman, GS-13 Evaluation Board; Chairman, QSI - Honor and Merit Awards Panel; Secretary, CBCS Panel (Section A); Charlotte Bustos-Videla; Head, Clandestine Service Career Service",
  "sender": "H.L. Berthold; Theodore G. Shackley, Chief, Western Hemisphere Division; William V. Broe, Chief, Western Hemisphere Division; Desmond FitzGerald, Chief, Western Hemisphere Division; Thomas H. Karamessires, Deputy Director for Plans"
}