{
  "classification": "Operations",
  "document_type": "Memorandum",
  "security": "Disclosing details about the U-2 program, such as the deployment of Detachment C to Atsugi, Japan, the specific dates of overflights of the USSR, and Soviet knowledge of these flights before May 1, 1960, could reveal sensitive intelligence collection methods and capabilities. It could also expose the extent of Soviet radar coverage and early warning systems, which might still be relevant to current intelligence operations. The memo states, '...this mission did not originate or recover at Atsugi' and 'This flight, as other previous flights by other Detachments, was tracked by Russian radar...'. This kind of information could be exploited by adversaries to develop countermeasures or to assess the effectiveness of current U.S. intelligence assets.",
  "security_level": "TOP SECRET",
  "summary": "A Directorate of Science and Technology memorandum provides an interim reply to the House Select Committee on Assassinations (HSCA) regarding their request for information on the U-2 Project, specifically Detachment C stationed in Atsugi, Japan, and Soviet knowledge of the program.",
  "summary_one_paragraph": "On June 22, 1978, a memorandum from the Directorate of Science and Technology (DDS&T) was sent to the Office of Legislative Counsel (OLC), responding to a House Select Committee on Assassinations (HSCA) request for information about the U-2 Project. The memo, marked Top Secret, details the deployment and operations of Detachment C at Atsugi, Japan, including early overflights of the USSR and Soviet awareness of these missions. It admits limited ability to fully address HSCA's broad requests due to file organization and the historical distance of the events, suggesting the HSCA narrow its queries. Attachments included Soviet Aide Memoires protesting U-2 flights and a summary of initial U-2 missions, revealing Soviet air defense knowledge and capabilities during that period.",
  "tags": [
    "HSCA",
    "U-2 Project",
    "Detachment C",
    "Atsugi",
    "Japan",
    "Soviet Union",
    "Overflights",
    "Radar",
    "Defectors",
    "Soviet Knowledge",
    "COMINT",
    "ELINT",
    "EIDER",
    "CHESS"
  ],
  "title": "HSCA Request",
  "date": "1978-06-22",
  "locations_mentioned": [
    "Atsugi, Japan",
    "USSR",
    "Sea of Japan",
    "Washington, D.C.",
    "German Democratic Republic",
    "Poland"
  ],
  "origin_agency": "Directorate of Science and Technology (DDS&T)",
  "persons_mentioned": [
    "Scott Breckenridge",
    "Thomas G. Ward Jr.",
    "Mikhail Menshikov",
    "General Twining"
  ],
  "recipient": "Office of Legislative Counsel",
  "sender": "Thomas G. Ward Jr."
}