{
  "classification": "Personnel",
  "document_type": "Dispatch",
  "security": "Disclosing that TOPOWL/1 hosted Vida Mae Gaynor at his home and provided information on her activities, associations, and political views, could expose TOPOWL/1 to potential threats. This dispatch also contains personal information about Vida Mae Gaynor and her sons (including details about one son evading the draft and another facing a court martial), the unauthorized release of which could violate their privacy. For instance, ‘…set up a mechanism to help him evade the draft and depart the country illegally…He had been promised educational opportunities by the recruiter. When denied these he studied abnormal psych extensively and tried to feign mental illness, but was instead put up for Court Martial for malingering.’",
  "security_level": "SECRET/RYBAT",
  "summary": "A dispatch from the Nairobi station reports on Vida Mae Gaynor, detailing her activities in Tanzania, her background, and her support for Afro-Americans and draft evaders in Dar es Salaam.",
  "summary_one_paragraph": "This SECRET/RYBAT dispatch from the Chief of Station in Nairobi to the Chief of WOMUSE details information obtained by TOPOWL/1 regarding Vida Mae Gaynor (201-867508), who resides in Tanzania. The report covers Gaynor's employment with the National Development Corporation, her past activism in the US including involvement in the African-Methodist-Episcopal Church, CORE, and admiration for Malcom X. She also provides housing and contacts in Dar es Salaam for Afro-Americans, including Daniel Finley, a draft evader from Ohio, and helped her son evade the draft. Gaynor's political views are described as radical, with a desire for a faster revolution in Tanzania aided by experts from China and North Korea.",
  "tags": [
    "CIA",
    "RYBAT",
    "MHCURB",
    "MHCHAOS",
    "Vida Mae Gaynor",
    "TOPOWL/1",
    "Dar es Salaam",
    "Tanzania",
    "Draft Evasion",
    "Afro-American Activism"
  ],
  "title": "RYBAT/MHCURB/MHCHAOS - Vida Mae GAYNOR (201-867508)",
  "date": "1971-04-30",
  "locations_mentioned": [
    "Tanzania",
    "Dar es Salaam",
    "Queens, New York",
    "Jamaica"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Vida Mae Gaynor",
    "Malcom X",
    "Martin Luther King",
    "Dennis (Gaynor's son)",
    "Daniel Finley",
    "Julius Nyerere"
  ],
  "recipient": "Chief, WOMUSE",
  "sender": "Chief of Station, Nairobi"
}