{
  "classification": "Operations",
  "document_type": "Memo",
  "security": "Several activities mentioned, such as breaking into the French Consulate, chemical warfare planning against Cuba and North Vietnam, and wiretapping, could be controversial and damaging if exposed. Also, the memo mentions the Agency's involvement in US labor situations which could be vulnerable to charges that the Agency went behind Meany's back. Furthermore, the memo details the use of Agency funds for controversial projects, such as Project MOSES and the large amount of cash given to Lou Conein. These operations could be misinterpreted and receive great publicity, and no amount of denial would ever set the record straight.",
  "security_level": "UNCLASSIFIED",
  "summary": "This memo from Walter Elder to William Colby details potentially controversial CIA activities that could be misinterpreted or viewed as exceeding the Agency's charter, including operations involving wiretapping, breaking and entering, chemical warfare planning, and questionable use of Agency funds.",
  "summary_one_paragraph": "In a memorandum dated June 1, 1973, Walter Elder informs William Colby of various CIA activities that could be perceived as exceeding the Agency's charter, highlighting instances such as the wiretapping of columnists under pressure from Attorney General Robert F. Kennedy, a counterespionage operation involving breaking into the French Embassy with the approval of Dick Helms, and planning for chemical warfare against Cuba and North Vietnam. The memo also raises concerns about the Agency's involvement in US labor disputes, controversial funding expenditures (Project MOSES), the lack of transparency in Lou Conein's cash handling, and DCI McCone's dealings with the Vatican, pointing out the potential for misinterpretation and public scrutiny.",
  "tags": [
    "CIA",
    "William Colby",
    "John McCone",
    "Robert F. Kennedy",
    "Wiretapping",
    "Counterespionage",
    "French Embassy",
    "Chemical Warfare",
    "Cuba",
    "North Vietnam",
    "Labor Relations",
    "Project MOSES",
    "Lou Conein",
    "Funding",
    "Vatican",
    "Walter Elder"
  ],
  "title": "Special Activities",
  "date": "1973-06-01",
  "persons_mentioned": [
    "William E. Colby",
    "John McCone",
    "Robert F. Kennedy",
    "Robert S. Allen",
    "Paul Scott",
    "Joe Carroll",
    "Philippe de Vosjoli",
    "Anatole Golitsen",
    "James Angleton",
    "Dick Helms",
    "Dean Rusk",
    "John F. Kennedy",
    "Lyndon B. Johnson",
    "McGeorge Bundy",
    "Robert McNamara",
    "Dwight D. Eisenhower",
    "Des FitzGerald",
    "Robert B. Anderson",
    "Clyde Weed",
    "George Meany",
    "Walter Reuther",
    "Cord Meyer",
    "Larry Houston",
    "Mike Miskorsky",
    "George MacManus",
    "James Smith",
    "Lou Conein",
    "Carl Kaysen",
    "George Ball",
    "Rayborn",
    "Ben Read",
    "Aristotle Onassis",
    "Maria Callas",
    "John Hightower",
    "Barry Goldwater",
    "Ross",
    "Wise",
    "Pope John XIII",
    "Pope Paul VI",
    "Walter Elder"
  ],
  "sender": "Walter Elder"
}