{
  "classification": "Personnel",
  "document_type": "File",
  "security": "Several documents discuss financial matters, housing allowances and potential contract amendments related to Crabanac's sensitive assignment in Spain. Sharing these details could highlight specific benefits and arrangements afforded to contract employees and potentially expose operational sensitivities. Quoting directly: “Due to the operational sensitivity of CRABANAC'S assignment, his request formlief on his housing costs was handled by Mr. Thomas Karamessines, A. On 15 September 1005, Ur. Xaranossines, ADDF, approved his being reimbursed on a 78/33 percent basis for the excess allowable costs up to, but not to exceed, 60 percent above his quarters allowance.”, “An operational back acount is being opened through the Monetary Divieton to house an operational advance amount yet undeterained. Subject vas advised not to co-aingle persona. funds with operational funds.”, “Subject is proceeding abroad as a retired OD CID officer who is now pursuin; Career on a writer.”",
  "security_level": "SECRET",
  "summary": "This file contains documents related to E. Howard Hunt and Terence S. Crabanac, including contract details, requests for allowance exceptions, and briefings regarding their roles and financial arrangements with the CIA.",
  "summary_one_paragraph": "This file primarily contains documents relating to the contract and employment details of Terence S. Crabanac within the CIA, including his initial contract in July 1965, salary increases, and eventual transition to a staff employee in September 1966. It includes memoranda regarding his assignment to Spain for a special undertaking, requests for exceptions to housing allowance regulations, discussions regarding the retention of royalties from his writing endeavors, and briefings on his non-official cover as a writer. The file also includes a memo about engaging E. Howard Hunt as an independent contractor in 1970 to write a citation for a CIA employee.",
  "tags": [
    "E. Howard Hunt",
    "Terence S. Crabanac",
    "CIA Contracts",
    "Housing Allowances",
    "Covert Operations",
    "Spain",
    "Contract Personnel",
    "FOIA"
  ],
  "title": "HUNT, E. HOWARD (CONTRACT",
  "date": "1965-01-06",
  "locations_mentioned": [
    "Madrid, Spain"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "E. Howard Hunt",
    "Terence S. Crabanac",
    "Thomas H. Karamessines",
    "Charles M. Davis",
    "Davis B. Powell",
    "William R. Caulfield",
    "Norman D. Block",
    "Rogers C. Brooks",
    "Joseph B. Ragan",
    "Lucile P. Twogood",
    "Ben DeFelice"
  ],
  "recipient": "Office of Finance, Contract Personnel Division",
  "sender": "Chief, Contract Personnel Division"
}