{
  "classification": "Liaison",
  "document_type": "Journal",
  "security": "Revealing the phone numbers of the Chiefs of Station in Panama and Mexico City could potentially expose these individuals to unwanted attention or compromise their operations. Directly quoting: 'Delivered to Charles Snodgrass, House Appropriations Committee staff, phone numbers of Chief of Station, (Panama) and Chief of Station, (Mexico City) for passage to Representatives John J. Flynt (D., Ga.) and J. Kenneth Robinson (R., Va.)'",
  "security_level": "CIA INTERNAL USE ONLY",
  "summary": "This is a journal entry from the CIA's Office of Legislative Counsel detailing administrative deliveries, budget discussions, and liaison activities with congressional staffers and the FBI regarding intelligence matters and the House Select Committee on Assassinations.",
  "summary_one_paragraph": "On February 11, 1977, the CIA's Office of Legislative Counsel recorded several activities in its journal, including the delivery of phone numbers for the Chiefs of Station in Panama and Mexico City to House Appropriations Committee staff for Representatives Flynt and Robinson. Discussions with Senate Appropriations Committee staffer James Fellenbaum revealed concerns about intelligence-related costs and potential new members of the Intelligence Subcommittee. Additionally, the journal notes that the FBI's Paul Daly reported on the House Select Committee on Assassinations' access to unclassified materials and the progress of security clearances for committee staffers.",
  "tags": [
    "CIA",
    "Legislative Counsel",
    "House Appropriations Committee",
    "Senate Appropriations Committee",
    "FBI",
    "House Select Committee on Assassinations",
    "Intelligence Budget",
    "Liaison",
    "Security Clearances"
  ],
  "title": "Journal - Office of Legislative Counsel",
  "date": "1977-02-11",
  "locations_mentioned": [
    "Panama",
    "Mexico City"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Charles Snodgrass",
    "John J. Flynt",
    "J. Kenneth Robinson",
    "James Fellenbaum",
    "William W. Proxmire",
    "Clifford P. Case",
    "Art Kuhl",
    "Tom Carney",
    "Paul Daly",
    "Henry B. Gonzalez",
    "Samuel L. Devine"
  ],
  "recipient": "Internal CIA",
  "sender": "Office of Legislative Counsel"
}