{
  "classification": "Security",
  "document_type": "Memo",
  "security": "This memo details potential security breaches and associations with Soviet agents. Revealing these details could compromise sources, methods, and ongoing counterintelligence efforts. Specifically, the memo mentions, 'While employed as a contract agent of the Tokyo Station, HAHN had pimped for CIA Staff personnel in Tokyo,' disclosing sensitive and potentially damaging information about CIA staff activities.",
  "security_level": "SECRET",
  "summary": "A memo regarding George PERIS, a contact of suspected Soviet agent Valentin HAHN, detailing concerns about his connections to individuals with ties to Soviet intelligence and requesting further investigation into his activities and associations in Tokyo and Korea.",
  "summary_one_paragraph": "This SECRET memorandum, dated September 9, 1960, addresses the ZRGRACE operation and focuses on George PERIS, also known as George PERISTEROPOULOS, a Tokyo businessman identified as a contact of Valentin HAHN, a self-confessed Soviet agent. The memo, written by Anita Potocki, outlines concerns about PERIS's extensive network of contacts with Russian and Eastern European individuals, many of whom are suspected or identified Soviet agents. It also notes his possible involvement with William Hamilton MARTIN and requests further investigation into PERIS's activities in Tokyo and Korea, as well as a check of the \"Tomorrow is Too Late\" club and HAHN's activities, further suggesting that HAHN pimped for CIA staff, and requests information from multiple agencies, including the Office of Security and NSA.",
  "tags": [
    "ZRGRACE",
    "George PERIS",
    "Valentin HAHN",
    "Soviet Agent",
    "Counterintelligence",
    "Security Breach",
    "Tokyo",
    "Japan",
    "William Hamilton Martin",
    "Comintern",
    "Soble Case"
  ],
  "title": "ZRGRACE - Tokyo Aspect; George PERIS aka George PERISTEROPOULOS aka George PARIS, Identified Contact of Valentin HAHN aka Valentine Vasiliyevich KHAN aka Won-shin HAN, Self Confessed Soviet Agent",
  "date": "1960-09-09",
  "locations_mentioned": [
    "Tokyo, Japan",
    "Yokohama, Japan",
    "Tientsin, China",
    "Shanghai, China",
    "Harbin, China",
    "Seoul, Korea",
    "Okinawa",
    "Hokkaido, Japan",
    "Sapporo, Hokkaido, Japan",
    "USA"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "George PERIS",
    "George PERISTEROPOULOS",
    "George PARIS",
    "Valentin HAHN",
    "Valentine Vasiliyevich KHAN",
    "Won-shin HAN",
    "Arseniy YANKOVSKY",
    "Basil EFREMOFF",
    "John Mc COY",
    "Vadim MEDISH",
    "Kasua KANAZAWA",
    "Charlotte BERGHOLTZ",
    "Anastasiya SNOW",
    "Golli-Grigorevna PODSTAVINA",
    "Marguerita PODSTAVINA",
    "Noriko AWAJL",
    "Noriko MATSUZAKAYA",
    "Aurelia CZERWINSKA",
    "William Hamilton MARTIN",
    "Ardelle GASDA",
    "Boris SOLOMONIK",
    "Mitchell",
    "Seliger",
    "Anita Potocki"
  ],
  "recipient": "Chief, FI/Division D",
  "sender": "Anita Potocki"
}