{
  "classification": "Cuba",
  "document_type": "Draft Memorandum",
  "security": "This document details a comprehensive plan for covert operations against Cuba, including espionage, sabotage, and psychological warfare. Disclosing these plans would compromise ongoing operations, expose intelligence sources and methods, and damage relationships with liaison services. For example: 'Every effort will be made to continue to exploit to the fullest, preserve the viability of and, where necessary, re-establish communications with the 131 recruited agents now resident in Cuba.' and 'At the present time we are running 12 Cuben diplomats stationed outside Cuba as controlled agents and have viable operations aimed at an additional 20 Cuban diplomats.'",
  "security_level": "SECRET - SENSITIVE",
  "summary": "A draft memorandum from William Harvey to the DCI, dated November 27, 1962, outlining an operational plan for the CIA's covert actions against Cuba during FY-63 and beyond. The plan details strategies for intelligence gathering, economic pressure, psychological warfare, and potential support for internal resistance, while adjusting to the post-missile crisis environment and U.S. assurances against invasion.",
  "summary_one_paragraph": "This draft memorandum, addressed to the Director of Central Intelligence from William Harvey, Chief of Task Force W, presents an operational plan for continuing covert actions against Cuba following the missile crisis. The plan emphasizes intelligence collection, economic pressure through denial operations and harassment of Free World trade, psychological warfare to undermine the Castro regime, and maintaining the capability to support internal resistance. It also proposes organizational changes, including a reduction in Task Force W's expenditures and personnel, abolishing the Mongoose operational mechanism, and re-positioning Task Force W within the Clandestine Service, adapting to the changed political landscape and U.S. assurances against invading Cuba.",
  "tags": [
    "CIA",
    "Cuba",
    "Covert Operations",
    "William Harvey",
    "Task Force W",
    "Mongoose",
    "Intelligence",
    "Espionage",
    "Sabotage",
    "Psychological Warfare",
    "Economic Warfare",
    "Exile Groups"
  ],
  "title": "Operational Plan - Cuba",
  "date": "1962-11-27",
  "locations_mentioned": [
    "Cuba",
    "Miami",
    "Havana",
    "Latin America"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "William Harvey",
    "Fidel Castro"
  ],
  "recipient": "Director of Central Intelligence (DCI)",
  "sender": "William Harvey, Chief, Task Force W"
}