{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Providing high explosives to AMBANG-1 for sabotage operations against Cuba and arranging a radio link would violate international laws regarding intervention in sovereign nations, potentially damaging diplomatic relations and international credibility. Directly quoting: 'AMBANG-1 asked if we could make available twenty pounds of high explosives as well as six to eight thermite grenades' and 'AMBANG-1 asked me if I would be able to assist him in the establishment of a San Juan-Caracas-Miami radio link.'",
  "security_level": "UNCLASSIFIED",
  "summary": "A memorandum summarizing a meeting with AMBANG-1 in Miami, detailing requests for high explosives for sabotage in Cuba, a contact in Guantanamo, political plans, JURE organization, and other related matters.",
  "summary_one_paragraph": "On August 2, 1963, a memorandum was created summarizing a meeting held on July 27, 1963, in Miami with AMBANG-1, a Cuban exile leader, during which he requested high explosives and thermite grenades for a sabotage operation against a power plant in Havana, Cuba. AMBANG-1 also sought assistance in arranging contact for Rogelio Cisneros to visit Guantanamo to inform his brother, Ramon Cisneros Diaz, about JURE's plans to overthrow the Castro regime. The memorandum details AMBANG-1's political intentions, including planned trips to New York, Santo Domingo, Caracas, Costa Rica, and potentially Mexico, to raise funds and coordinate JURE efforts, also, mentioned is JURE organization and strength which is reported to be about 500 members.",
  "tags": [
    "CIA",
    "AMBANG-1",
    "Cuba",
    "Sabotage",
    "JURE",
    "High Explosives",
    "Guantanamo",
    "Political Plans",
    "Radio Link",
    "Aerial Maps",
    "ARTIME",
    "Cuban Diplomats",
    "Jorge Volsky"
  ],
  "title": "Meeting with AMBANG-1",
  "date": "1963-08-02",
  "locations_mentioned": [
    "Miami",
    "Cuba",
    "Havana",
    "San Juan",
    "Guantanamo",
    "New York",
    "Santo Domingo",
    "Caracas",
    "Costa Rica",
    "Mexico",
    "Dallas",
    "San Francisco",
    "Paris",
    "Brussels"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "AMBANG-1",
    "Rogelio Cisneros",
    "Ramon Cisneros Diaz",
    "Juan Bosch",
    "Betancourt",
    "Manuel Artime",
    "Somoza",
    "Miro Cardona",
    "Gustavo Arcos",
    "Franqui",
    "Cabrera Infante",
    "Jorge Volsky",
    "German Arcienegas",
    "Culver Ladd",
    "Castro",
    "Alfred Fernandez"
  ],
  "recipient": "C/SAS, SAS/Bolten, Hecksher, Amori, Chrono, RAY File",
  "sender": "Alfonso Rodriguez (SAS/SO)"
}