{
  "classification": "Administrative",
  "document_type": "DDO Notice",
  "security": "This document outlines the reorganization of the Operations Directorate staff structure. Revealing these internal structural changes could potentially expose intelligence methods, operational priorities, and resource allocations. This is especially relevant because it covers functional divisions. For example, detailing the functions of the Covert Action Staff regarding \"issuance of propaganda guidances and related background\" could compromise ongoing operations or future strategic planning. Additionally, revealing responsibilities of the International Activities Staff in monitoring activities of organizations like \"the United Nations and its specialized agencies\" and \"the international staff of Communist parties\" might create diplomatic tensions or damage relationships.",
  "security_level": "SECRET",
  "summary": "This DDO Notice announces the reorganization of the Operations Directorate staff structure effective 1 October 1976, outlining the functions of new and redesignated staff components as part of a long-range reorganization program.",
  "summary_one_paragraph": "DDO Notice 1-1462, issued on 29 September 1976 by William W. Wells, the Deputy Director for Operations, announces the reorganization of the Operations Directorate’s staff structure, effective 1 October 1976. This reorganization, the first phase of a three-part plan, aims to adjust the Directorate to align with Executive and Congressional perceptions, adapt to evolving strategies, and optimize the use of resources. The notice details the functions of various staff elements attached to the Office of the DDO, Senior Staffs, and Area and Functional operating Divisions, including the establishment of a Clandestine Corps, the role of the Associate General Counsel, and the responsibilities of the Evaluation and Program Design Staff, Policy and Coordination Staff, and other key units such as the Career Management Staff and Covert Action Staff.",
  "tags": [
    "CIA",
    "Operations Directorate",
    "Reorganization",
    "Staff Structure",
    "Clandestine Corps",
    "Covert Action",
    "Counterintelligence",
    "International Activities",
    "FOIA"
  ],
  "title": "Reorganization of the Staff Structure of the Operations Directorate",
  "date": "1976-09-29",
  "origin_agency": "CIA",
  "sender": "William W. Wells (Deputy Director for Operations)"
}