{
  "classification": "Bolivia",
  "document_type": "Memo",
  "security": "Revealing that WUSLAB/1 is meeting and reporting on Bolivian political figures, including ambassadors and presidents, could compromise those relationships and potentially endanger the individuals involved. The information regarding pressure on Ovando, internal cabinet debates, and military considerations are highly sensitive and could destabilize the Bolivian government if exposed. Specifically, detailing information about the Bolivian Ambassador Julio Sanjines Goytia talking to President Ovando on the phone as well as the details of the USIS installation being damaged could all lead to very negative outcomes.",
  "security_level": "SECRET",
  "summary": "A memorandum detailing a meeting with WUSLAB/1 on April 22, 1970, covering topics such as the political situation in Bolivia, pressure on President Ovando regarding the Debray case, internal dynamics within the Bolivian government, and contact between a staff member and the Soviet Embassy.",
  "summary_one_paragraph": "This secret memorandum, dated April 24, 1970, recounts a meeting with WUSLAB/1 discussing Bolivian political affairs. The discussion included pressure from civilian members of the cabinet on President Ovando to release Debray and Bustos, Ovando's concerns about student unrest, and the potential for military intervention against union members. The memo also covers Minister of Planning Jose Ortiz Mercado's upcoming visit to Washington, the Rogelio Miranda Baldivia problem, and a possible demonstration against the OAS Assembly in Santo Domingo. Furthermore, it details the strained relations between Ambassador Sanjines and Miss Alexander, as well as Sanjines's perspective on the weakened Bolivian government due to the nationalization of Gulf Oil, and contact between Mr. Peary and the Soviet Embassy.",
  "tags": [
    "CIA",
    "WUSLAB/1",
    "Bolivia",
    "Debray Case",
    "Ovando",
    "Sanjines",
    "OAS",
    "Soviet Embassy",
    "Political Situation",
    "Security",
    "Diplomacy"
  ],
  "title": "Meeting With WUSLAB/1/on 22 April 1970",
  "date": "1970-04-24",
  "locations_mentioned": [
    "Bolivia",
    "La Paz",
    "Washington",
    "San Jose",
    "Santo Domingo",
    "Lima",
    "Baltimore"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Julio Sanjines Goytia",
    "Ovando",
    "Debray",
    "Bustos",
    "Alberto Moravia",
    "Jose Ortiz Mercado",
    "Pepe Figueres",
    "Rogelio Miranda Baldivia",
    "Juan Jose Torres",
    "Marcelo Quiroga",
    "Rolz-Bennett",
    "Urquia",
    "Hugo Navegas",
    "Victor Paz Estenssoro",
    "Miss Alexander",
    "Father Eduardo",
    "Colonel Banzer",
    "Rene Barrientos",
    "Colonel Ayoroa",
    "Figueres",
    "Mr. Peary",
    "KUTAKOV",
    "Manton",
    "Thompson"
  ],
  "recipient": "Record",
  "sender": "Floyd B. McCully"
}