{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Cable",
  "security": "Disclosing that the State Department is willing to gather information on US citizens at the request of the CIA could raise concerns about government overreach and potential violations of privacy. Sharing details of intelligence-gathering practices, even in seemingly innocuous cases, can jeopardize those practices and the relationship with the state department. Quoting directly: “LOCAL CONSUL STATE SUBJ HAD NOT REGISTERED AND SAID FURTHER HE FORWARDING COPENHAGEN CONSULATE, AT REQUEST LATTER, BACKGROUND INFO TAKEN FROM 8 MAY 68 SVENSKA DAGBLADET.”",
  "security_level": "SECRET",
  "summary": "A cable from Stockholm to Copenhagen and the Director, regarding a subject named Zanders, indicating no station trace and forwarding background information from a Swedish newspaper via the local US consulate.",
  "summary_one_paragraph": "This SECRET cable, dated June 7, 1968, communicates from Stockholm to Copenhagen and the Director that there is no station trace for an individual named Zanders. The cable notes that the local US consul, upon request from the Copenhagen consulate, is forwarding background information obtained from the Svenska Dagbladet of May 8, 1968. According to the newspaper, Zanders is a 25-year-old engineer from Illinois with a BS degree from California, has two young children, and is involved in civil rights organizations and a former co-worker of Martin Luther King.",
  "tags": [
    "CIA",
    "Zanders",
    "Stockholm",
    "Copenhagen",
    "Background Check",
    "State Department",
    "FOIA",
    "Civil Rights",
    "Martin Luther King"
  ],
  "title": "Station Trace of Zanders",
  "date": "1968-06-07",
  "locations_mentioned": [
    "Stockholm",
    "Copenhagen",
    "Illinois",
    "California"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Zanders",
    "Martin Luther King"
  ],
  "recipient": "Copenhagen, Director",
  "sender": "Stockholm (GOEN acting)"
}