{
  "classification": "Operations, Personnel",
  "document_type": "Collection of Documents",
  "security": "Several documents are classified as SECRET, involving HUMANOID project activities and agent information. Disclosing details about Project HUMANOID, sub-agents like HUMANOID-3 and HUMANOID-4, their activities related to penetrating Costa Rican Communist parties, and the mail intercept operations could compromise intelligence operations and agent safety. Details such as agent motivations, methods of control, and sources of information are particularly sensitive. As the document states: \"Project HUMANOID is the most important single project of the San Jose Station, and the basis for all existing and contemplated 050 activities in the area.\"",
  "security_level": "SECRET",
  "summary": "This collection includes various documents related to Ross L. Crozier (Agent VAIVADA), Project HUMANOID in Costa Rica, and related CIA operations, covering biographical information, agent evaluations, receipts, and file requests.",
  "summary_one_paragraph": "This collection of documents pertains to Ross L. Crozier, a CIA agent involved in Project HUMANOID in Costa Rica and later Project AMPHODARCH in Cuba. It contains biographical details, receipts for services rendered, a memorandum discussing the HUMANOID project's objectives (including infiltration of Costa Rican Communist parties and mail intercepts), evaluations of agent performance, and a personality file request detailing Crozier's background, training, and operational history. The documents span from 1949 to 1975 and include information about Crozier's recruitment, his work as a penetration agent, and his eventual designation as a career agent.",
  "tags": [
    "CIA",
    "Ross L. Crozier",
    "HUMANOID Project",
    "AMPHODARCH Project",
    "Costa Rica",
    "Cuba",
    "Agent",
    "Recruitment",
    "Communist Party Penetration",
    "Mail Intercept",
    "VAIVADA"
  ],
  "title": "Ross L. Crozier (Agent VAIVADA) and Project HUMANOID Documents",
  "date": "1975",
  "locations_mentioned": [
    "Costa Rica",
    "Cuba",
    "San Jose",
    "Havana",
    "Panama",
    "China"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Argentina C. Crozier",
    "Consuelo Felicia Cordero Calderon",
    "Ross L. Crozier",
    "Juan Bordallo",
    "Esperanza Herrera",
    "Arthur G. Vaivada",
    "Jack Kojimoto",
    "Thomas Kline",
    "R. U. Stone",
    "J. Hennessy",
    "P. Kittredge"
  ],
  "recipient": "Plans, Chief of Station, Various CIA Offices",
  "sender": "Various CIA Personnel"
}