{
  "classification": "Cuba",
  "document_type": "Memorandum and Letter",
  "security": "The memorandum from J. E. Pond, Jr. details specific actions to be taken against Cuba, including disseminating propaganda, influencing international organizations, and coordinating intelligence among various U.S. agencies, directly quoting 'State in conjunction with CIA, publish a weekly or bi-weekly letter documenting the actions of the Castro Covernment for the previous period,' which outlines a coordinated disinformation campaign. Sharing these plans could expose U.S. strategies to undermine the Cuban government, potentially damaging international relations and intelligence operations.",
  "security_level": "TOP SECRET",
  "summary": "This collection of documents includes memos and letters between U.S. government officials in 1959 and 1960 concerning actions related to Cuba, including suggestions for undermining the Castro regime and Richard Nixon's summary of his meeting with Fidel Castro.",
  "summary_one_paragraph": "This compilation includes a December 1959 memorandum routing a letter from Admiral Burke to the Director of Central Intelligence, followed by correspondence from March 1960 between Arleigh Burke and Allen Dulles, and Burke and Gordon Gray, regarding suggestions for U.S. actions in Cuba aimed at replacing the Castro regime with a friendly government. A detailed memorandum from J. E. Pond, Jr., outlines specific actions involving various U.S. agencies to influence international opinion and destabilize Cuba, including publishing anti-Castro materials and coordinating intelligence. Also included is Richard Nixon's 1979 recollection of his 1959 meeting with Fidel Castro, expressing concerns about Castro's leadership and naivete regarding communism. An attachment lists CIA's liaison with US agencies (State, USIA, DOD, and INS) re: JMARC activities, including frequency and CIA representative.",
  "tags": [
    "Cuba",
    "Castro",
    "CIA",
    "Richard Nixon",
    "Arleigh Burke",
    "Gordon Gray",
    "JMARC",
    "Guantanamo",
    "Propaganda",
    "State Department",
    "Defense Department",
    "USIA",
    "INS",
    "Fidel Castro"
  ],
  "title": "Memoranda and Letters Regarding U.S. Actions in Cuba and Meeting with Fidel Castro",
  "date": "1959-12-11",
  "locations_mentioned": [
    "Cuba",
    "United States",
    "Caribbean",
    "South America"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "J. C. King",
    "Admiral Burke",
    "Allen Dulles",
    "Gordon Gray",
    "Fidel Castro",
    "Richard Nixon",
    "J. E. Pond, Jr.",
    "J. D. Esterline",
    "George Smathers",
    "S. B. Renkin",
    "Raymond Millard",
    "Robert Reynolds",
    "Robert Whedbee",
    "David A. Phillips",
    "Henry Loomis"
  ],
  "recipient": "Director of Central Intelligence",
  "sender": "J. C. King"
}