{
  "classification": "Mexico",
  "document_type": "Report",
  "security": "Revealing details of Oswald’s interactions with Soviet and Cuban officials in Mexico, along with the surveillance and record-keeping practices of Mexican immigration authorities, could strain diplomatic relations and expose intelligence-gathering operations. The document states, “Se sabe que el expediente de Lee Harvey Oswald, existe en la Dirección General de Servicios Migratorios de la Secretaría de Gobernación y está clasificado como confidencial.”",
  "security_level": "Unclassified",
  "summary": "This document details Lee Harvey Oswald's activities in Mexico City in September and October 1963, including his attempts to obtain visas to Cuba and the Soviet Union, his interactions with Cuban and Soviet officials, and his travel arrangements.",
  "summary_one_paragraph": "This report, dated May 26, 1982, summarizes Lee Harvey Oswald's activities in Mexico City during late September and early October 1963. It recounts his travel from Houston to Mexico, his attempts to secure visas to Cuba and the Soviet Union through the respective embassies, his meetings with Silvia Tirado de Durán and consular officials Pavel Antonovich Yatskov and Valeriy Vladimirovich Kostikov, and his eventual return to the United States. The report notes Oswald's frustration at being denied the visas and his subsequent detention by Mexican immigration authorities before crossing back into the U.S.",
  "tags": [
    "Lee Harvey Oswald",
    "Mexico",
    "Visas",
    "Cuba",
    "Soviet Union",
    "Silvia Tirado de Durán",
    "Pavel Antonovich Yatskov",
    "Valeriy Vladimirovich Kostikov",
    "Mexican Immigration",
    "Hotel Comercio"
  ],
  "title": "Actividades de \"Lee Harvey Oswald\", en Mexico (Activities of \"Lee Harvey Oswald\" in Mexico)",
  "date": "1982-05-26",
  "locations_mentioned": [
    "Mexico City",
    "Houston",
    "Laredo, Texas",
    "Nuevo Laredo, Mexico",
    "Corpus Christi",
    "Alice",
    "Dallas, Texas",
    "Miami",
    "Cuba",
    "Petesburgo",
    "Los Angeles, California"
  ],
  "persons_mentioned": [
    "Lee Harvey Oswald",
    "John B. McFarland",
    "Silvia Tirado de Durán",
    "Marina Oswald",
    "Pavel Antonovich Yatskov",
    "Valeriy Vladimirovich Kostikov",
    "Eusebio Azcue",
    "H.O. Lee",
    "Guillermo García Luna",
    "Rubén Durán Navarro",
    "Betty Cerratos",
    "Horacio Durán Navarro",
    "Vincent Theodoro Lee"
  ]
}