{
  "classification": "Administrative",
  "document_type": "Notes",
  "security": "This document discusses covert actions and suggests increasing resources for them during a period of detente, which could compromise ongoing operations if exposed. It also mentions discussions with the Joint Chiefs about a program against Cuba, including potential bombings, which could be seen as aggressive and destabilizing. Quoting directly, '(b) that during the present period of apparent detente there might well be very good reasons for investing even greater resources in covert actions' and 'General LeMay wondered why we did not use bombings.'",
  "security_level": "UNCLASSIFIED",
  "summary": "This document contains notes for Mr. McCone regarding several topics, including Chiang Ching-kuo's visit to the U.S., a proposal to send Dr. Cavanagh to Rome, an assessment of Penkovskiy's material, discussions with the Joint Chiefs on Cuba, congressional debates on the test ban treaty, recommendations on improving standing in Congress, efforts to replace Colonel Grogan, a briefing of Bureau of Budget officials, and personnel security.",
  "summary_one_paragraph": "These notes, dated October 1, 1963, summarize various topics for Mr. McCone's information, starting with General Chiang Ching-kuo's visit to the U.S. and the agreement that his government would not receive support for a military move to recover the mainland. The notes then touch on proposals to send Dr. Cavanagh to Rome, an assessment of Penkovskiy’s information, a discussion with the Joint Chiefs about the program against Cuba, reviews of congressional debates regarding the test ban treaty, suggestions for improving standing in Congress, and internal personnel matters. Also included is a summary of a briefing to the Bureau of Budget on covert action programs and personnel security.",
  "tags": [
    "CIA",
    "Chiang Ching-kuo",
    "Cuba",
    "Covert Actions",
    "Congress",
    "Penkovskiy",
    "Personnel",
    "Security",
    "Budget"
  ],
  "title": "NOTES FOR MR. McCONE",
  "date": "1963-10-01",
  "persons_mentioned": [
    "Mr. McCone",
    "Chiang Ching-kuo",
    "Chiang Kai-shek",
    "Dr. Cavanagh",
    "Bill Harvey",
    "Cardinal Cicognani",
    "Archbishop O'Connor",
    "Penkovskiy",
    "Helms",
    "Dez Fitzgerald",
    "General LeMay",
    "John Warner",
    "Senators Pastore",
    "Humphrey",
    "Anderson",
    "Russell",
    "Saltonstall",
    "Vinson",
    "Arends",
    "Mr. Kirkpatrick",
    "Colonel Grogan",
    "Dick Helms",
    "McGeorge Bundy",
    "John Bross",
    "Generals Carter",
    "Blake",
    "Carroll",
    "Houston",
    "Bannerman",
    "Mr. Gilpatric",
    "Frank Hand",
    "W. Elder"
  ],
  "recipient": "Mr. McCone",
  "sender": "W. Elder"
}