{
  "classification": "Cuba",
  "document_type": "Contact Report",
  "security": "Revealing the recontact and debriefing of Oliverio A. TOMEU Vasallo, including his opinions on potential involvement with Manuel ARTIME and his favorable view of the JURE, could expose ongoing intelligence operations and compromise sources. Directly quoting: 'TOMEU stated that he would no longer follow any man as an individual or as a leader, because a man's ideals, outlook, and objectives change with time...One could only trust his ideals or an organization which followed those ideals...towards the ideals and goals of the JURE.' Sharing this could highlight efforts to assess and potentially influence anti-Castro elements, damaging CIA's reputation and potentially endangering TOMEU.",
  "security_level": "SECRET",
  "summary": "Oliverio Antonio TOMEU Vasallo was recontacted on 8 June 1964, providing additional details on Carlos and Ana Gloria de VARONA, and identifying Owiel GONZALEZ and \"COCO\" as possible leads to Jose LLANGRA (Gobel).",
  "summary_one_paragraph": "On 8 June 1964, Oliverio A. TOMEU Vasallo was recontacted and debriefed at his residence in Washington, D.C., regarding his knowledge of Cuban exiles and potential leads related to Jose LLANGRA. TOMEU provided further information on Carlos and Ana Gloria de VARONA, identifying \"COCO\" as a secretary to LLANUZA and Owiel GONZALEZ, a former Chief of the Havana Fire Department who may be associated with MEFOTO Gutierrez. During the discussion, TOMEU expressed disillusionment with individual leaders and voiced support for the ideals of the JURE organization, while also mentioning a job offer from Manuel ARTIME.",
  "tags": [
    "CIA",
    "TOMEU Vasallo",
    "VARONA",
    "GONZALEZ",
    "LLANGRA",
    "ARTIME",
    "JURE",
    "Cuban exiles",
    "Contact Report",
    "AMBIDCY-1"
  ],
  "title": "Recontact of Oliverio A. TOMEU Vasallo",
  "date": "1964-06-15",
  "locations_mentioned": [
    "Cuba",
    "Washington, D.C.",
    "Havana",
    "Puerto Rico",
    "United States",
    "Spain",
    "Mexico"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Oliverio Antonio TOMEU Vasallo",
    "Carlos de VARONA",
    "Ana Gloria de VARONA",
    "Owiel GONZALEZ",
    "COCO",
    "Jose LLANGRA (Gobel)",
    "Paul Stroud",
    "Caridad",
    "Carlos Manuel de VARONA Segura",
    "Carlos Arturo VARONA Arjona",
    "Jose LLANUZA Gobel",
    "MEFOTO Gutierrez",
    "Monsignor Eduardo BOZA Masvidal",
    "Manuel VILLANANAN",
    "Wils DIAZ",
    "Publio RUIZ",
    "Jorge Del VALLE",
    "Manuel ARTIME",
    "Fidel Castro",
    "Manolo RAY Rivero",
    "John Hugh Crimmins",
    "Donald WEBSTER"
  ],
  "recipient": "STROPSIS",
  "sender": "C. Paul Plund, Jr."
}