{
  "classification": "Operations",
  "document_type": "Dispatch",
  "security": "This dispatch details the operational relationship between JMWAVE and AMCARDON-1, including instances where AMCARDON-1 was used for operational support tasks and as a propaganda outlet. Revealing these details could expose JMWAVE's methods of influencing media coverage and gathering intelligence, potentially compromising sources and damaging relationships with media outlets. The document explicitly states that AMCARDON-1 was used 'to discredit Carlos BANDIN... as a result of Headquarters' interest in this matter'. Disclosing this could reveal operational tactics and sources of information.",
  "security_level": "SECRET",
  "summary": "This dispatch details the operational relationship between JMWAVE and AMCARDON-1 of The Miami Herald, outlining how AMCARDON-1 was used for operational support, intelligence gathering, and as a propaganda outlet from December 1962 to March 1964. It requests that a 201 number be assigned to AMCARDON-1.",
  "summary_one_paragraph": "The dispatch, from the Chief of Station, JMWAVE, to the Chief, Special Affairs Staff, reports on the relationship between JMWAVE and AMCARDON-1, a Latin American Editor at The Miami Herald. From December 1962 to March 1964, AMCARDON-1 provided operational support, collected operational intelligence, and served as a propaganda outlet for KUBARK, while adhering to an agreement to avoid embarrassing KUBARK's operations in South Florida. The report highlights instances where AMCARDON-1 assisted in locating individuals, discrediting rival groups, and surfacing propaganda, while also providing intelligence on media interests and potential stories. The dispatch requests that AMCARDON-1 be assigned a 201 number, indicating a formal operational relationship.",
  "tags": [
    "JMWAVE",
    "AMCARDON-1",
    "Miami Herald",
    "Operational Support",
    "Propaganda",
    "Intelligence Gathering",
    "KUBARK",
    "Media Relations",
    "UFGA-14781"
  ],
  "title": "Special Activities Report on JMWAVE's Relationship with AMCARDON-1",
  "date": "1964-03-19",
  "locations_mentioned": [
    "Miami, Florida",
    "South Florida",
    "Cuba",
    "Houston, Texas",
    "Peru",
    "Santiago, Chile"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "AMCARDON-1",
    "AMCARDON-2",
    "Andrew K. REUTEMAN",
    "Luis FERNANDEZ Rocha",
    "Manolo RAY Rivero",
    "Carlos TODD y Lobo",
    "AMBIDDY-1",
    "Aureliano SANCHEZ Arango",
    "Edmund LEAHY",
    "Robert KENNEDY",
    "Frank FIORINI",
    "Eduardo SUAREZ Riva",
    "Luis MUNOZ Marin",
    "Juan BOSCH Gavino",
    "Charles KEELY",
    "Jorge VOLSKY Kraisler",
    "Tad SZULC",
    "Andrew ORDONO Camps",
    "Carlos BANDIN Cruz",
    "AMBEND-1",
    "Alex E. CARLSON",
    "Trevor ARMBRISTER",
    "Charles GRIFFIN",
    "Armando Andres GUIROLA Forte",
    "CASTRO",
    "Dudley R. Willings"
  ],
  "recipient": "Chief, Special Affairs Staff",
  "sender": "Chief of Station, JMWAVE"
}