{
  "classification": "Administrative",
  "document_type": "Letter and Memorandum",
  "security": "The memorandum from Cynthia R. Bower discusses budget constraints and potential redirection of funds allocated for declassification efforts, revealing internal resource allocation challenges and potential impact on meeting declassification goals. Quoting directly: '...some of the declass money may be redirected to other priorities.' and '...no one should count on getting the full amount of their add until we have finalized our decisions on FY98 and FY99 unfundeds.'",
  "security_level": "SECRET",
  "summary": "This document includes a letter from the Assassination Records Review Board (ARRB) to the CIA, expressing concerns about the pace of JFK assassination record declassification, and the CIA's response, alongside internal CIA memoranda discussing resource allocation and funding for the project.",
  "summary_one_paragraph": "This collection of documents from October and November 1997 includes a letter from T. Jeremy Gunn, Executive Director of the ARRB, to David W. Carey, Executive Director of the CIA, urging accelerated review and declassification of JFK assassination records to meet the September 1, 1998 deadline, and Carey's response assuring commitment to meeting the statutory obligation. Internal CIA memoranda from John F. Pereira and Cynthia R. Bower discuss the resource requests, potential funding shortfalls, and allocation of resources for both the JFK declassification project and a separate Korean War documents declassification project, highlighting budget constraints and competing priorities within the CIA.",
  "tags": [
    "JFK Assassination Records",
    "Declassification",
    "Assassination Records Review Board",
    "CIA",
    "Funding",
    "Resource Allocation",
    "Korean War Documents"
  ],
  "title": "Completing the Review of JFK Assassination Records",
  "date": "1997-10-28",
  "locations_mentioned": [
    "Washington, DC"
  ],
  "origin_agency": "Assassination Records Review Board (ARRB) and Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "David W. Carey",
    "T. Jeremy Gunn",
    "John Pereira",
    "J. Barry Harrelson",
    "Nora Slatkin",
    "John R. Tunheim",
    "Henry F. Graff",
    "Kermit L. Hall",
    "William L. Joyce",
    "Anna K. Nelson",
    "David G. Marwell",
    "Brian Latell",
    "Patricia F. Duryee",
    "Rodney A. Snyder",
    "Rex H. Latham",
    "Robert E. Leggett",
    "Cynthia R. Bower",
    "Mary K. Sturtevant"
  ],
  "recipient": "David W. Carey",
  "sender": "T. Jeremy Gunn"
}