{
  "classification": "Assassination",
  "document_type": "Dispatch",
  "security": "Revealing Plumlee's alleged past association with NWBOLTON and the Cuban desk, including his supposed sabotage of a magazine article and subsequent classified testimony, could compromise potential sources or methods related to Cuban intelligence and operations. Plumlee's contact with Oliver Stone and his offer of information also presents a security risk if details of those discussions were to become public. Directly quoting from the text: \"Boxes of government documents, pictures, names and dates, were turned over to Denver Magazine...Shorty after that I changed names and dates in the article in an attempt to discredit the article and myself. I did not want to be part of any government probe into my past activities in behalf of the (NWBOLTON) and the Cuban Desk....and my Cuban friends.\"",
  "security_level": "SECRET",
  "summary": "A February 1996 dispatch reports on an unsolicited fax sent to the Denver NVTAG office from Robert Plumlee, also known as William H. Pearson, who claims a former association with NWBOLTON and alleges he sabotaged a Denver Magazine article related to the assassination trail.",
  "summary_one_paragraph": "This dispatch, dated February 1996, details a fax received by the Denver NVTAG office from Robert Plumlee, AKA William H. Pearson, who alleges a past connection with NWBOLTON and indicates that he intentionally discredited a Denver Magazine article, \"Fear and Loathing on the Assassination Trail,\" by changing names and dates after contact with the NVTAG. Plumlee's fax reveals his alleged involvement with the Cuban Desk, his later Congressional testimony concerning the Contra affair, and his contact with Oliver Stone, while NVTAG Denver seeks guidance on whether to forward Plumlee's fax to headquarters for further action, contingent on NWBOLTON's interest.",
  "tags": [
    "Robert Plumlee",
    "William H. Pearson",
    "NWBOLTON",
    "Denver Magazine",
    "Assassination Trail",
    "Cuban Desk",
    "Oliver Stone",
    "NVTAG",
    "JM/WAVE"
  ],
  "title": "Write-in to NVTAG by Individual Claiming Former Association with NWBOLTON",
  "date": "1996-02-02",
  "locations_mentioned": [
    "Denver, Colorado",
    "Grant, Colorado",
    "Evergreen, Colorado",
    "Miami, Florida",
    "California"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Robert Plumlee",
    "William H. Pearson",
    "Paul Lee",
    "Paul Leadem",
    "Doris Keller",
    "Peter Boyles",
    "Dough Vaughn",
    "Robert Vernon",
    "Oliver Stone",
    "Joe"
  ],
  "recipient": "Director",
  "sender": "STAFF"
}