{
  "classification": "Administrative",
  "document_type": "Memo",
  "security": "These memoranda discuss the identification of human sources and request that certain names be protected to avoid harming individuals, families, and intelligence operations. For example, protecting Alphonso Wichtrich is important because 'the release of his name could impact both past and future intelligence operations and directly affect Mr. Wichtrich and his family.'",
  "security_level": "SECRET",
  "summary": "These memoranda from the CIA to the Assassination Records Review Board (ARRB) discuss the release of human source names in the JFK Collection, emphasizing the risks to individuals and intelligence operations, and propose methods for protecting these identities while still complying with the JFK Act.",
  "summary_one_paragraph": "These documents consist of multiple memoranda. The first, dated December 13, 1996, addresses the ARRB, outlining the CIA's concerns about releasing the true names of human sources in the JFK Collection, highlighting the dangers these individuals and their families could face, and proposing the use of substitutions for true names to balance disclosure with source protection. A second, dated September 25, 1998, conveys there is 'No Evidence of Contact Between Lee Harvey Oswald and the CIA's Office of Operations', and a third, dated October 9, 1997, requests protection for several source names, including Manuel Calvillo, Franklin Anthony Garcia Wheelock, Jose Marie Mankel, Alphonso Rudolph Wichtrich, and Phillipe Thyraud De Vosjoli, justifying these requests based on potential harm to the individuals or damage to intelligence operations.",
  "tags": [
    "CIA",
    "Assassination Records Review Board",
    "JFK Collection",
    "Human Sources",
    "Source Protection",
    "Declassification",
    "Lee Harvey Oswald",
    "Office of Operations",
    "Manuel Calvillo",
    "Alphonso Wichtrich",
    "Franklin Anthony Garcia Wheelock",
    "Jose Marie Mankel",
    "Phillipe Thyyraud De Vosjoli",
    "LIHUFF",
    "ZRRIFLE"
  ],
  "title": "Identity of Human Sources/ No Evidence of Contact Between Lee Harvey Oswald and the CIA's Office of Operations",
  "date": "1996-12-13",
  "locations_mentioned": [
    "Washington, D.C.",
    "Cuba",
    "Mexico City",
    "Nicaragua",
    "Luxembourg",
    "Panama",
    "Soviet Union"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "John F. Pereira",
    "Robert Lipka",
    "President Truman",
    "President Clinton",
    "Aldrich Ames",
    "Elena Garro de Paz",
    "Lee Harvey Oswald",
    "Donald E. Deneselya",
    "Robert Edward Webster",
    "Manuel Calvillo",
    "Alfonso Wichtrich",
    "Franklin Anthony Garcia Wheelock",
    "Jose Marie Mankel",
    "Phillipe Thyyraud De Vosjoli",
    "Miguel Nazar-Haro",
    "Jeremy Gunn",
    "J. Barry Harrelson",
    "Laura Denk",
    "Michelle Combs",
    "Bob Skwirot"
  ],
  "recipient": "Executive Director, Assassination Records Review Board",
  "sender": "John F. Pereira/J. Barry Harrelson"
}