{
  "classification": "Cuba",
  "document_type": "Dispatch, Memorandum, Project Action, Finance History",
  "security": "Multiple documents discuss the termination of Project KDAFGHAN due to VWBLANKET contamination and security considerations related to JMYAK, highlighting potential security breaches and the sensitivity of agent information. Quoting directly: 'The KDAFGHAN Project was officially terminated on 22 September 1972. The reason for termination was VWBLANKET contamination.' and 'As a result of the JMYAK damage assessment and other security considerations it was decided that the project should be terminated and the agents resettled in another country.'",
  "security_level": "SECRET",
  "summary": "This file contains documents related to Project KDAFGHAN, a CIA operation in Mexico City involving surveillance of the Cuban Embassy and Consulate, including its approval, renewals, termination, and financial details.",
  "summary_one_paragraph": "This collection of documents outlines Project KDAFGHAN, a CIA endeavor in Mexico City focused on surveilling the Cuban Embassy and Consulate, utilizing Cuban exiles as assets for photographic and physical monitoring. The file details the project's approvals, financial allocations, renewals for FY 1971-1973, and eventual termination in 1972 due to security concerns and VWBLANKET contamination. Included are memoranda discussing the resettlement of agents KDAFGHAN-1 and KDAFGHAN-2 in Spain, budget breakdowns, operational accomplishments, and coordination efforts with other CIA components and the FBI.",
  "tags": [
    "CIA",
    "KDAFGHAN",
    "LIONION",
    "Cuban Embassy",
    "Mexico City",
    "Surveillance",
    "Termination",
    "VWBLANKET",
    "JMYAK",
    "Cuban exiles",
    "Project Renewal",
    "Financial Records",
    "Intelligence Operations"
  ],
  "title": "DEFGHAN VOL I Development Plans",
  "date": "1972-10-02",
  "locations_mentioned": [
    "Mexico City",
    "Cuban Embassy",
    "Cuban Consulate",
    "Spain",
    "Tampa, Florida"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Dan Haroway",
    "Edward K. Laubocker",
    "Perry Smart",
    "John Murray",
    "Robert D. Wiecha",
    "John Davis",
    "Lawrence Sternfield",
    "Orville Bally",
    "John T. Boeck",
    "Richard B. Wright",
    "John Wilson",
    "Roger W. Bicego",
    "Douglas F. Tassell",
    "Charles Y. Bounds",
    "Wyatt B. Thompson",
    "Richard S. Welch",
    "Robert B. Moore",
    "Fred Kravcov",
    "Gerald D. Fahlanger",
    "Terence D. Sistone",
    "Norberto Hernandez",
    "Theodore G. Shackley"
  ],
  "recipient": "Chief of Station, Mexico City",
  "sender": "Chief, Western Hemisphere Division"
}