{
  "classification": "Liaison",
  "document_type": "Journal",
  "security": "Sharing the details of communications with the FBI, particularly regarding access to information related to the House Select Committee on Assassinations, could reveal the extent of inter-agency cooperation and potentially compromise ongoing investigations. Quoting directly: “Daly advised that at the request of Chairman Henry B. Gonzalez (D., Texas) to the Attorney General the Committee staffers will no longer be provided access to the unclassified material they have been reviewing within the Department of Justice.” and “I asked Daly to keep us advised as to the progress on the clearances matter to pave the way for our next coordinated step within the Executive Branch to seek Chairman Gonzalez's and Representative Samuel L. Devine's (R., Ohio) agreement on procedures for access to classified information.”",
  "security_level": "CIA INTERNAL USE ONLY",
  "summary": "A journal entry from the Office of Legislative Counsel details administrative deliveries, budget discussions, and liaison activities with the Senate Appropriations Committee, the Senate Foreign Relations Committee, and the FBI regarding the House Select Committee on Assassinations.",
  "summary_one_paragraph": "This journal entry from the Office of Legislative Counsel on February 11, 1977, outlines several activities: delivering phone numbers for CIA Chiefs of Station in Panama and Mexico City to House Appropriations Committee staff for Representatives Flynt and Robinson, discussing the FY78 budget and intelligence-related costs with Senate Appropriations Committee staffer James Fellenbaum, informing Senate Foreign Relations Committee staffer Art Kuhl about the number of Agency employees covered by a foreign service list, and conferring with FBI's Paul Daly about access to Justice Department materials for the House Select Committee on Assassinations.",
  "tags": [
    "Legislative Counsel",
    "Appropriations Committee",
    "Budget",
    "Foreign Relations Committee",
    "FBI",
    "House Select Committee on Assassinations",
    "Gonzalez",
    "Devine",
    "Security Clearances"
  ],
  "title": "Journal - Office of Legislative Counsel Page 5",
  "date": "1977-02-11",
  "locations_mentioned": [
    "Panama",
    "Mexico City"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Charles Snodgrass",
    "John J. Flynt",
    "J. Kenneth Robinson",
    "James Fellenbaum",
    "William W. Proxmire",
    "Clifford P. Case",
    "Art Kuhl",
    "Tom Carney",
    "Paul Daly",
    "Henry B. Gonzalez",
    "Samuel L. Devine"
  ],
  "recipient": "HSC AS Cont",
  "sender": "Office of Legislative Counsel"
}