{
  "classification": "Personnel, Security, Operations, Cuba, Watergate",
  "document_type": "Memorandum, Contact Report",
  "security": "Disclosing details about Barker's relationship with the Agency, including his contract and termination details, could compromise sources and methods. Releasing details concerning Agency contact with Mrs. Moffett would divulge sources and methods of collecting human intelligence. Directly quoting the documents: '...the Agency is currently not in a position to give Messrs. Barker and Martinez blanket authorization to identify individuals with whom they had contact during their Agency association...''explained the Agency's serious reservations concerning the possibility of compromise of agents and operations that are still in being.'",
  "security_level": "SECRET",
  "summary": "This collection of documents pertains to Bernard Barker's association with the CIA, including inquiries about his contract, termination, and potential connections to the Watergate scandal. It also covers concerns raised by a third party regarding Barker's daughter and her family.",
  "summary_one_paragraph": "This compilation of memoranda and reports, dating from 1970 to 1974, primarily concerns Bernard Barker's past employment with the CIA. Topics include efforts to locate Barker's contract, discussions about releasing him and Eugenio Martinez from secrecy agreements in relation to the Watergate case, and responses to inquiries about Barker's background. Included is correspondence related to Mrs. Edwin T. Moffett's concerns about her son's marriage to Barker's daughter and her safety, along with internal communications regarding Barker's possible connections to criminal activities and his relationship with the Agency.",
  "tags": [
    "Bernard Barker",
    "Eugenio Martinez",
    "Watergate",
    "Secrecy Agreement",
    "Contract",
    "Termination",
    "Cuba",
    "Moffett Inquiry",
    "Helms Testimony",
    "AMSNAP-3"
  ],
  "title": "Bernard Barker's Contract and Related Information",
  "date": "1974-04-19",
  "locations_mentioned": [
    "Washington, D.C.",
    "Havana, Cuba",
    "Chicago, Illinois",
    "Miami, Florida",
    "California",
    "Bethlehem, Pennsylvania",
    "Cuba"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Bernard Barker",
    "Eugenio Martinez",
    "Hudson",
    "Jan",
    "Spencer O. Tertiling",
    "Chris Hopkins",
    "Daniel E. Schultz",
    "David Phillips",
    "Joe Skura",
    "Elvin Nistel",
    "J. Edwin Dietel",
    "John S. Warner",
    "Lann Jaworski",
    "Pete Palmer",
    "Helms",
    "Frank Sturgis",
    "Fred Evans",
    "Scott Breckenridge",
    "Lyle Miller",
    "Norris Z. Gervenol",
    "Jorge Alonso",
    "Guillermo Alonso Pujol",
    "Ray Barker",
    "Miguel Suarez",
    "Fernando Freire",
    "Edwin T. Moffett",
    "Mrs. Edwin T. Moffett",
    "Paul Wilson",
    "Mariaelena Barker",
    "Amado Jimenez",
    "America Collazo"
  ],
  "recipient": "DDO, Dr. Scott Breckenridge, IG, Director of Personnel, Daniel E. Schultz",
  "sender": "Chris Hopkins, J. Edwin Dietel, John S. Warner, Steven L. Kuhn, Narayan Ganity, Norris Z. GERVENOL"
}