{
  "classification": "Security",
  "document_type": "Memo",
  "security": "Extensive and diversified use of Maheu makes us vulnerable to exploitation should he be interrogated in depth regarding his activities.",
  "security_level": "SECRET",
  "summary": "This memo discusses Robert A. Maheu, a personnel relations executive and former FBI agent used by the Office of Security on sensitive assignments since the early 1950s, and the potential risk to the Agency due to Senate Subcommittee interest in his activities.",
  "summary_one_paragraph": "This SECRET memo, dated June 7, 1966, addresses the extensive use of Robert A. Maheu by the Office of Security and DD/P on sensitive assignments since the early 1950s and the potential risks he poses to the Agency. It outlines the Senate Subcommittee's (Long Committee) interest in Maheu, particularly regarding wiretapping activities. The memo details Maheu's involvement in the Onassis/Niarchus feud, Agency support provided to Niarchus, and other sensitive operations involving Sukarno, highlighting that while the Agency's interests in Maheu do not relate to wiretapping, his diversified use makes the Agency vulnerable should he be interrogated in depth.",
  "tags": [
    "Robert A. Maheu",
    "Office of Security",
    "Senate Subcommittee",
    "Wiretapping",
    "Onassis",
    "Niarchus",
    "Sukarno",
    "Long Committee",
    "TWIXT",
    "LPHIDDEN"
  ],
  "title": "MAHEU, Robert A.",
  "date": "1966-06-07",
  "persons_mentioned": [
    "Robert A. Maheu",
    "Lawrence Houston",
    "Walter Yeagley",
    "Raymond A. Taggart",
    "Stavros Niarchus",
    "Aristottle Onassis",
    "Spyridon Catapodis",
    "William Miller",
    "William F. Rowland",
    "George Prussing",
    "Walter Snowden",
    "Charles Williamson",
    "John Frank",
    "Homme",
    "Edward P. Morgan",
    "Senator Long",
    "Bernard Fensterwald",
    "Dave McDonald",
    "Howard Hughes",
    "Allen Dulles",
    "Joseph Smith"
  ],
  "recipient": "EYES ONLY"
}