{
  "classification": "Administrative/Personnel/Operations",
  "document_type": "Dispatch/Message",
  "security": "Several dispatches refer to covert activities, financial transactions and tax returns of individuals including Edward G. Ticheorn, Benadun, and others, and the loan paid by the Station for TICIBORN. Exposing these details could compromise operations and identities. For example: 'SINCE TICIBORN PAID BY STATION, LOAN SHOULD BE CARRIED BY STATION AND $125 PAYROLL DEDUCTION APPLIED.'",
  "security_level": "SECRET/CONFIDENTIAL",
  "summary": "This file contains dispatches and messages related to administrative matters, personnel issues, and operational activities, including financial transactions, tax returns, and potential cover assignments for individuals associated with the Mexico City station.",
  "summary_one_paragraph": "This collection of documents, marked as SECRET and CONFIDENTIAL, comprises dispatches and messages primarily from and to the Mexico City station. The content addresses various administrative and personnel matters, including inquiries about missing tax returns for Edward G. Ticheorn, instructions for handling a loan paid by the station for TICIBORN, and discussions about a potential cover assignment for Ticheorn in La Paz, Bolivia. Also included are details regarding the submission and oversight of covert tax returns for individuals such as Benadun, Limotor 19, and others involved in undisclosed operations.",
  "tags": [
    "CIA",
    "Mexico City Station",
    "Personnel",
    "Administration",
    "Tax Returns",
    "Covert Operations",
    "Financial Transactions",
    "Ticheorn",
    "Benadun",
    "Jerome H. Balsis",
    "Howard C. Ticheorn"
  ],
  "title": "LOPEZ, HENRYP. 201-253203 VOL. II",
  "date": "1965-03-17",
  "locations_mentioned": [
    "Mexico City",
    "La Paz, Bolivia"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Henry Lopez",
    "Edward G. Ticheorn",
    "Jerome H. Balsis",
    "Howard C. Ticheorn",
    "Thomas W. Lund",
    "William V. Broe",
    "Robert D. Carter",
    "Benadun",
    "Limotor 19",
    "Barbara C. Hufig",
    "Fine Inch",
    "Sandamanie",
    "Cazazzus",
    "Douglas J. Feinglass",
    "Lifued JP",
    "Rita N. Blazik"
  ],
  "recipient": "Chief, WHD/Chief, M Division/Mexico City",
  "sender": "Chief of Station, Mexico City/Director"
}