{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Collection of Memos, Cables, and Project Approvals",
  "security": "Several documents discuss ongoing operational activities, cover mechanisms (ICAP, WUSALINE), and agent details (TICHBORN, HARRIOTT, AMANTHEM/1). Revealing this information could compromise operations, expose agents, and damage relationships with cover entities. As an example, one document discusses using WUSALINE as cover: \"...WUSALINE'S EXCELLENT CONTACTS IN THE WOLADY BUSINESS COMMUNITY COULD PROBABLY PRODUCE SUFFICIENT BUSINESS TO JUSTIFY SUCH AN ASSIGNMENT...\"",
  "security_level": "SECRET",
  "summary": "This collection of documents pertains to Edward G. TICHBORN, a contract agent involved in political action and operational surveys for the CIA, particularly in Latin America and Spain; it includes memos regarding his operational activities, financial matters, project approvals, and a transfer of operational responsibility from WHD to DODS.",
  "summary_one_paragraph": "This collection contains memos, cables, and project approval requests related to Edward G. TICHBORN (aka Henry R. Lopez), a CIA contract agent. These documents detail TICHBORN's operational surveys in Spain, his role as a political action advisor, financial matters including travel expenses and indebtedness, and the transfer of his operational responsibility from the Western Hemisphere Division (WHD) to the Directorate of Operations/Covert Operations (DODS). It also includes project extensions and terminations related to TICHBORN’s support, noting his cover employment with WUSALINE and ICAP Iberia.",
  "tags": [
    "CIA",
    "Edward G. TICHBORN",
    "Operational Survey",
    "Spain",
    "Latin America",
    "Political Action",
    "WUSALINE",
    "ICAP Iberia",
    "Project UOACE",
    "Project WUBRINY",
    "Financial Matters",
    "Operational Responsibility Transfer",
    "Counterintelligence"
  ],
  "title": "Edward G. TICHBORN (Henry P. Lopez) Files: Operational Activities and Project Management",
  "date": "1967-06-30",
  "locations_mentioned": [
    "Madrid, Spain",
    "Barcelona, Spain",
    "Paris, France",
    "Central America",
    "Mexico",
    "Boston, MA",
    "New York City",
    "Washington, D.C.",
    "Puerto Rico",
    "Santo Domingo",
    "Dominican Republic"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Edward G. TICHBORN",
    "Henry R. Lopez",
    "Gale Allen",
    "Lee E. Patton",
    "Hank Connor",
    "John Train (WUBRINY/1)",
    "Fr. Osborne Day",
    "EMANTHEM/1",
    "Balaguer",
    "Donald McLouglin",
    "Paul A. Maggio",
    "Gerard Droller",
    "William V. Droege",
    "Gordon L. Jorgensen",
    "Elliotte C. Want",
    "George M. Thompson"
  ],
  "recipient": "Chief, DO",
  "sender": "Chief of Station, Santo Domingo"
}