{
  "classification": "Operations",
  "document_type": "Routing Slip/Notes",
  "security": "The document contains references to individuals and operations, including potential connections to sensitive matters such as Haitian and Cuban operations, and details about individuals with possible links to security agencies and controversial events. Disclosing these details could compromise sources, methods, or ongoing investigations. Directly quoting content that supports this assessment includes references to 'Werbell,' 'Security Agt.,' 'Haitian invasion,' 'Connections in Dominican republic,' and 'DEA Conein'. These specific references indicate the potential for sensitive operational and personal information that requires protection.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document consists of notes and routing slips referencing various individuals, operations, and organizations, including those related to security, intelligence, and law enforcement. It mentions connections to Haitian and Cuban operations, as well as possible involvement of individuals in sensitive activities and organizations.",
  "summary_one_paragraph": "This document appears to be a collection of notes and routing slips from the CIA, referencing individuals, operations, and organizations across various areas, including security, intelligence, and law enforcement. It mentions connections to Haitian and Cuban operations, such as the 'Haitian invasion of Duvalier' and Rolando Masferrer Rojas, along with references to individuals like Werbell and Lucien Emile Conein, and organizations such as DEA and Military Assistance Corporation. The notes also discuss potential leads, contacts, and reviews related to sensitive topics, making it a compilation of diverse information requiring careful handling.",
  "tags": [
    "CIA",
    "DEA",
    "Haitian Operations",
    "Cuban Operations",
    "Lucien Emile Conein",
    "Security",
    "Intelligence",
    "Werbell",
    "FOIA",
    "John F. Kennedy Assassination Records Act"
  ],
  "title": "Official Routing Slip and Notes",
  "date": "Unknown",
  "persons_mentioned": [
    "DDC",
    "Mr. Greaney",
    "Gene Wilson",
    "Fred Rondall",
    "Werbell",
    "Kone Atimison",
    "Sam Shores",
    "Robert Baysid",
    "John Muldoon",
    "Morton, Silver",
    "Robert Pacherson",
    "Charles Jeffers",
    "on Van Cleave",
    "Arom Cheer Putapen",
    "Muellenberg, Kart",
    "Keuch",
    "mork Silver",
    "Marger, Atty",
    "Des. Willion Doll",
    "Gerald Comed",
    "Lucien Emile Conein",
    "Richard L, Kotakof",
    "Macken, Wolfe",
    "Andrew St. George",
    "Rolando Masferrer Rojas",
    "Fred N. Brown",
    "Maximilien",
    "Mishaul Morrisey",
    "John Nardi",
    "Morton Frush",
    "Gerald. Wyn Cumpler",
    "Muto",
    "Robert Bayard"
  ],
  "recipient": "DDC, Mr. Greaney",
  "sender": "C/50G"
}