{
  "classification": "Liaison",
  "document_type": "Memo",
  "security": "The memo discusses contact with Clemard Joseph Charles, a Haitian banker close to President Duvalier, and mentions that the State Department considers Charles to be an 'undesirable character' involved in 'shady financial dealings.' Sharing this assessment from the State Department may damage diplomatic relations with Haiti and expose sensitive internal views on foreign leaders.",
  "security_level": "*CRIAL*",
  "summary": "A memo detailing contact with Clemard Joseph Charles, a Haitian banker, and coordination between CIA, Army, and State Department regarding his potential as an asset.",
  "summary_one_paragraph": "This memorandum, dated May 10, 1963, outlines the interactions and coordination between various US government agencies—including the CIA, ACSI (Army), and the State Department—regarding Clemard Joseph Charles, a Haitian banker with connections to President Duvalier. The memo details Charles's arrival in New York, his attempts to meet with high-ranking US officials, and the efforts to assess his potential as an asset, complicated by conflicting schedules and the State Department's negative assessment of his character. The document also describes a luncheon meeting with Charles and Mr. and Mrs. de Mohrenschildt and addresses concerns about potential interference and the future course of action regarding Charles.",
  "tags": [
    "Clemard Joseph Charles",
    "Haiti",
    "ACSI",
    "State Department",
    "Duvalier",
    "de Mohrenschildt",
    "Liaison",
    "Asset"
  ],
  "title": "Clemard Joseph CHARLES",
  "date": "1963-05-10",
  "locations_mentioned": [
    "Haiti",
    "New York",
    "West Palm Beach, Florida",
    "Washington, D.C.",
    "Poland",
    "Yugoslavia",
    "Belgrade",
    "Dallas, Texas"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Clemard Joseph Charles",
    "Dorothe Matlack",
    "Joseph Dryer",
    "General Delmar",
    "Col. Parm Koil",
    "Vice President Johnson",
    "Senator Keating",
    "Congressman Rogers",
    "Jeans Balog",
    "Captain Rogers",
    "Mr. Dryer",
    "President Kennedy",
    "de Mohrenschildt",
    "Jim Balog",
    "Hugo Stuntz",
    "Gashna",
    "Mr. Green",
    "Wayne Delson",
    "General Pitch",
    "Mr. Weiss",
    "Mr. Zegarald",
    "A. F. Czajkowski"
  ],
  "recipient": "C/WH",
  "sender": "A. F. CZAJKOWSKI"
}