{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Dispatch",
  "security": "Revealing liaison activities with Soviet officials and providing details on the BEHEIREN apparatus, including hideouts and contact methods with US pacifists, could compromise intelligence operations and relationships with foreign entities. Quoting directly, \"A full transcript is available of two phone calls made on 30 October, first by Brian Victoria to Chief Press Attache Nikolay V. Vasilyevich, and second by YOSHIKAWA to First Secretary Sergey D. Anisimov, urgently requesting a private meeting later that day to discuss 'an extremely important, extremely delicate matter', without doubt the case of the four sailors.\"",
  "security_level": "SECRET/RYBAT",
  "summary": "A CIA dispatch from Tokyo details the activities and organization of BEHEIREN, a Japanese group involved in anti-Vietnam War activities and assisting U.S. Navy deserters, including their connections with Soviet officials and U.S. pacifist movements.",
  "summary_one_paragraph": "This SECRET/RYBAT dispatch from the Chief of Station in Tokyo to the Sov Bloc and Far East Divisions discusses BEHEIREN, a Japanese organization supporting anti-Vietnam War efforts and assisting U.S. Navy deserters. The report highlights BEHEIREN's organizational structure, key figures like ODA Makoto and YOSHIKAWA Yuichi, its success in exploiting the case of four U.S. Navy deserters, and its connections with Soviet Embassy officials and American pacifist groups. The dispatch includes attachments listing BEHEIREN supporters, activities, and foreign contacts, emphasizing the group's growing influence and its ability to garner publicity and support.",
  "tags": [
    "CIA",
    "BEHEIREN",
    "Anti-Vietnam War",
    "U.S. Navy Deserters",
    "Soviet Liaison",
    "Pacifist Movement",
    "ODA Makoto",
    "YOSHIKAWA Yuichi",
    "Tokyo",
    "Japan",
    "Propaganda"
  ],
  "title": "RYBAT/MPHASHA REDTOP - Beheiren and the Four U.S. Navy Deserters",
  "date": "1967-12-06",
  "locations_mentioned": [
    "Tokyo",
    "Japan",
    "USSR",
    "Moscow"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "ODA Makoto",
    "YOSHIKAWA Yuichi",
    "KUBO Keinosuke",
    "FUKASAKU Mitsusada",
    "Brian Victoria",
    "Nikolay V. Vasilyevich",
    "Sergey D. Anisimov",
    "Ernest P. Young",
    "Staughton Lynd",
    "Norman Mailer",
    "Dave Dellinger",
    "Howard Zinn",
    "A. J. Kuste",
    "Carl Oglesby",
    "Joan Baez",
    "Mikhail Kotov",
    "Claude Bourdet",
    "Peggy Duff",
    "James Endicott",
    "Jean-Paul Sartre",
    "Simone de Beauvoir",
    "Thich Nhat Hanh"
  ],
  "recipient": "Chief, Sov Bloc Div; Chief, Far East Division",
  "sender": "Chief of Station, (Tokyo)"
}