{
  "classification": "Security",
  "document_type": "Memorandum",
  "security": "Dissemination of the information within the memorandum is restricted, requiring prior permission from the originator before it can be shared beyond the specified addressees. Quoting the document: “The information reported above is for the internal use of addressees only and may not be further disseminated without the prior permission of the originator.” Exposing this restriction could signal to outside parties the sensitivity of the information and potentially lead to efforts to compromise internal security protocols to gain unauthorized access.",
  "security_level": "SECRET",
  "summary": "A memorandum from the CIA to the FBI and NSA providing additional information on Nicholas Georges Damascus and Anastasia Magdalene Martiliane Daskalakis, including their travel history, visa applications, and family details.",
  "summary_one_paragraph": "This SECRET memorandum, dated August 1, 1961, from William K. Harvey of the CIA to the FBI and NSA, supplements previous information on Nicholas Georges Damascus and Anastasia Magdalene Martiliane Daskalakis. It details Nicholas Damascus's travel from Egypt to Australia and his subsequent U.S. visa application, including a notation sent to the Immigration and Naturalization Service in Los Angeles. It also covers Anastasia Damascus's attempts to obtain a Mexican Tourist Card and her U.S. address. The memo includes family details, such as the death of their father and their mother's plans to emigrate to the U.S., and suggests checking Department of State and Immigration and Naturalization Service indices for further information, also suggesting to check the indices of the Department of State for information on Jamil ELIRRA Casarem.",
  "tags": [
    "CIA",
    "FBI",
    "NSA",
    "Nicholas Georges Damascus",
    "Anastasia Magdalene Martiliane Daskalakis",
    "Visa Information",
    "Immigration",
    "Travel History",
    "Counterintelligence"
  ],
  "title": "NICHOLAS GEORGES DAMASCUS, ANASTASIA MAGDALENE MARTILIANE DASKALAKIS",
  "date": "1961-08-01",
  "locations_mentioned": [
    "Alexandria, Egypt",
    "Sydney, Australia",
    "Cairo, Egypt",
    "Mexico City, Mexico",
    "San Antonio, Texas",
    "Macao",
    "Los Angeles, California",
    "London, England",
    "Washington, D.C."
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Nicholas Georges Damascus",
    "Anastasia Magdalene Martiliane Daskalakis",
    "Georges Mitchell",
    "William Hamilton Martin",
    "Angelika Damascou nee Gavouras",
    "Jamil ELIRRA Casarem",
    "J. Wesley Reynolds",
    "William K. Harvey"
  ],
  "recipient": "Federal Bureau of Investigation",
  "sender": "William K. Harvey"
}