{
  "classification": "Personnel",
  "document_type": "Headquarters Traces",
  "security": "The operational approval for utilizing Alberto Lleras in a special operation before he was elected President of Colombia could be viewed as interference in a foreign election. Sharing this could damage international relations and the CIA's reputation. Specifically, the document mentions: \"On 24 February 1958 Son Operational Approval was granted for the utilization of LLERAS in supporting a special operation. However, before the operation was implemented, LLERAS was elected President of Colombia.\"",
  "security_level": "SECRET",
  "summary": "This document contains headquarters traces on Alberto Lleras Camargo and the Hudson Institute. It details Lleras's background, including his political career and prior operational interest by the CIA, and indicates the availability of derogatory information on members of the Hudson Institute.",
  "summary_one_paragraph": "This document, dated August 23, 1960, outlines headquarters traces on Alberto Lleras Camargo and the Hudson Institute, and confirms no identifiable traces on other subjects of paragraph 4 of reference. The trace on Lleras details his birth in Bogota, his career as a journalist and politician, his roles as Secretary General of the Liberal Party, President of Colombia, Secretary General of the Pan American Union, and the Rector of the University of The Andes. It also mentions his friendliness to the United States and prior operational approval for his utilization in a special operation before he was elected President of Colombia. Regarding the Hudson Institute, LERGO files contain derogatory information on several members which LERGO will furnish to WOFACT if they specify which of the members are of interest.",
  "tags": [
    "CIA",
    "Alberto Lleras Camargo",
    "Hudson Institute",
    "Background Check",
    "Colombia",
    "Special Operation"
  ],
  "title": "Headquarters Traces on Alberto Lleras Camargo and the Hudson Institute",
  "date": "1960-08-23",
  "locations_mentioned": [
    "Bogota, Colombia",
    "Buenos Aires, Argentina",
    "Colombia",
    "Spain"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Alberto Lleras Camargo",
    "Alfonso Lopez",
    "Laureano Gomez",
    "Berta Puga"
  ],
  "recipient": "JIHATE",
  "sender": "NOVARD E. COLLRARY"
}