{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Revealing AMLASH-1's true identity and operational details could compromise his safety and the security of ongoing intelligence activities. Disclosing recruitment efforts and assessments of Cuban officials could strain diplomatic relations. For example, AMLASH-1 “was requested to check with (Fizzolo) regarding the precautions being taken to prevent sabotage of the locomotives being shipped from France to Cuba.”",
  "security_level": "Background Use Only",
  "summary": "A memorandum detailing a meeting with AMLASH-1 in Paris concerning security implications of a captured infiltrator, resupply of materials, potential recruitments, upcoming elections, and information on Cuban officials.",
  "summary_one_paragraph": "This memorandum, dated 15 February 1965, summarizes a meeting with AMLASH-1 in Paris from January 31 to February 3, 1965, covering several topics including security concerns related to the infiltration and potential capture of Modesto Orlando Orozco Basulto, AKA Pebo Orozco, a resupply of materials for AMLASH-1, and planned communication methods. The meeting also addressed the feasibility of recruiting an individual to infiltrate Cuban Intelligence for assignment in Caracas, Venezuela; AMLASH-1's insights on the upcoming FEU elections; precautions against sabotage of French locomotives shipped to Cuba; and detailed information on various Cuban Intelligence Service personnel and officials, including their potential vulnerabilities and political influences within the Cuban regime.",
  "tags": [
    "AMLASH-1",
    "Cuba",
    "Recruitment",
    "Security",
    "Cuban Intelligence",
    "Soviet Influence",
    "FEU Elections",
    "Locomotive Sabotage"
  ],
  "title": "Meeting with AMLASH-1 in Paris, 31 January to 3 February 1965",
  "date": "1965-02-15",
  "locations_mentioned": [
    "Paris",
    "Rome",
    "Cuba",
    "Havana",
    "Miami",
    "Geneva",
    "Venezuela",
    "Caracas",
    "La Rochelle",
    "Madrid",
    "Brazil"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "AMLASH-1",
    "ONTRICH",
    "Modesto Orlando Orozco Basulto",
    "Pebo Orozco",
    "Jose Vasquez Kerey",
    "Gloria Cabrera",
    "ANTRUNK-10",
    "AMICE-14",
    "Miguelito",
    "UNSNAFU-9",
    "Juan Ventura",
    "AMWHIP-1",
    "Ernestina Acosta",
    "AVE",
    "Gustavo Gonzalez",
    "Pinero",
    "Crombet",
    "Lazaro Mora",
    "Fizzolo",
    "Alfredo Portela",
    "Samuel Gonzalez Rodriguez-Planes",
    "Antonio Lusson y Batlle",
    "Raul Diaz Arguelles",
    "Elpidio Baez Bigo",
    "Luis Manuel Cantillo Toirac",
    "Enrique Oltuski Osacki",
    "Faustino Perez",
    "Sergio Tollon",
    "Ambassador Carrillo",
    "Fidel Castro",
    "Raul Castro",
    "Che Guevara",
    "President Dorticos",
    "Emilio Aragones",
    "Faure Chomon",
    "Alberto Mora",
    "Jose Naranjo",
    "Anibal Escalante",
    "Orlando Blanco",
    "Enrique Rodriguez Loeches",
    "Marina Garcia Gonzalez",
    "Lucy Echevarria"
  ],
  "recipient": "WH/SA/EOB, WH/AMWORLD",
  "sender": "Nestor D. Sanchez, WH/EA/AMWORLD"
}