{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "This document outlines a comprehensive plan for CIA operations against Cuba, including intelligence gathering, political action, and potential sabotage. Revealing these plans would detail specific operational methods, targets, and the extent of CIA involvement in Cuban affairs, potentially compromising ongoing and future operations. Specifically, it details covert support operations. Quoting directly: 'Assist State in the development of post-Castro concepts, leaders, and political groups,'",
  "security_level": "SECRET - SENSITIVE",
  "summary": "A draft memorandum from William Harvey to the DCI, dated November 27, 1962, outlines an operational plan for continuing CIA operations against Cuba, emphasizing intelligence efforts and reorienting current efforts into a long-term denied area type of operation.",
  "summary_one_paragraph": "This draft memorandum, addressed to the Director of Central Intelligence from William Harvey on November 27, 1962, details a plan for sustained CIA operations against Cuba following the missile crisis. The plan focuses on intensifying intelligence collection, isolating and discrediting the Castro regime, maintaining economic and political pressures, and preparing for potential splits within the regime or uprisings. It proposes utilizing various methods including espionage, third-country operations, liaison services, maritime operations, and psychological warfare, while scaling down paramilitary and commando operations unless specific opportunities arise. The memorandum also recommends organizational changes within the CIA, including a reduction in Task Force W's expenditures and personnel and the abolishment of the Mongoose operational mechanism.",
  "tags": [
    "CIA",
    "Cuba",
    "William Harvey",
    "DCI",
    "Operational Plan",
    "Intelligence",
    "Task Force W",
    "Mongoose",
    "Sabotage",
    "Political Action",
    "Propaganda",
    "Exile Groups"
  ],
  "title": "Operational Plan for Continuing Operations Against Cuba",
  "date": "1962-11-27",
  "locations_mentioned": [
    "Cuba",
    "Western Hemisphere",
    "Latin America",
    "United States"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "William Harvey",
    "Fidel Castro"
  ],
  "recipient": "Director of Central Intelligence (DCI)",
  "sender": "William Harvey, Chief, Task Force W"
}