{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "Disclosing the number of companies involved in the commercial cover program, both in the 1960s and currently, along with the secrecy agreements, could expose ongoing operations and compromise the identities of individuals and businesses involved. As the document states, 'ALL PORTIONS OF THIS DOCUMENT ARE CLASSIFIED SECRET'. Revealing details about the commercial cover program could also damage the CIA's reputation.",
  "security_level": "SECRET",
  "summary": "A memorandum from Linda A. Jasper, Deputy Chief, Office of Central Cover, to John Pereira, Historical Review Group, providing answers to questions posed by the John F. Kennedy Assassination Review Board regarding the CIA's commercial cover program, including the number of businesses involved and copies of the secrecy agreements.",
  "summary_one_paragraph": "This secret memorandum, dated November 19, 1996, is a response from Linda A. Jasper, Deputy Chief of the Office of Central Cover (OCC), to John Pereira of the Historical Review Group, addressing questions from the John F. Kennedy Assassination Review Board about the CIA's commercial cover program. The memo states that a few real businesses are loosely connected to the publications industry, around 500 companies participated in the program in the 1960s, and approximately 1,800 are currently participating. It also includes attached copies of the secrecy agreements used from 1955-1988 and from 1988 to the present, noting the only difference is an addendum added in 1991 related to the Treasury, Postal Service and General Government Appropriations Act of 1991.",
  "tags": [
    "CIA",
    "Commercial Cover Program",
    "John F. Kennedy Assassination Review Board",
    "Secrecy Agreement",
    "OCC",
    "Historical Review Group"
  ],
  "title": "Response to Questions Posed by the John F. Kennedy Assassination Review Board",
  "date": "1996-11-19",
  "origin_agency": "Office of Central Cover (OCC), CIA",
  "persons_mentioned": [
    "John Pereira",
    "Linda A. Jasper",
    "Fredrick Wickham"
  ],
  "recipient": "John Pereira, Historical Review Group",
  "sender": "Linda A. Jasper, Deputy Chief, Office of Central Cover"
}