{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Revealing the specific operational needs and planned propaganda efforts of AMCIZA in Mexico, especially the aim to create a ‘big noise’ through ostensibly independent sources and the intent to use Mexican territory for COIN operations, could compromise these activities. Disclosing the need for safe sites for WHI agents and covert meetings, and the request for unilateral surveillance of AMCIZA members, may expose sensitive operational methods. Quoting directly: '...it will be impossible for them to operate effectively, or indeed at all, if ARCP...insists on AMCIGAR activities in Mexico 'remaining covert and not becoming public or press issue'.'",
  "security_level": "PRIORITY",
  "summary": "This memo outlines points for discussion between Station Mexico and Anthony R. FECHAY regarding the impending relocation of the AMCIZA (Cuban exile group) to Mexico City, highlighting political, propaganda, and logistical considerations.",
  "summary_one_paragraph": "This priority memo, dated August 3, 1960, from Oliver G. Galdomes to the Chief of Station, Mexico, outlines discussion points for a meeting with Anthony R. FECHAY concerning the relocation of AMCIZA to Mexico City. The memo raises concerns about the conflict between the requirement for covert operations and the need for overt publicity, specifically questioning how to manage propaganda efforts and disavow connections with certain individuals without undermining AMCIZA’s public image. It also addresses logistical requirements, such as obtaining permission to use Mexican territory for COIN operations, establishing secure communication channels, and securing safe houses while ensuring unilateral surveillance of AMCIZA members.",
  "tags": [
    "AMCIZA",
    "Cuba",
    "Mexico",
    "Propaganda",
    "Covert Operations",
    "COIN",
    "Cuban Exiles",
    "FECHAY"
  ],
  "title": "Letters for discussion with Anthony R. FECHAY on Home of AMCIZA to Mexico",
  "date": "1960-08-03",
  "locations_mentioned": [
    "Mexico",
    "Mexico City",
    "Cuba",
    "Latin-America"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Anthony R. FECHAY",
    "CASTRO",
    "ARCP",
    "LIEK",
    "ARCP",
    "CANO",
    "WICKER",
    "OLIVER G. GALDOMES"
  ],
  "recipient": "Chief of Station, Mexico",
  "sender": "OLIVER G. GALDOMES"
}