{
  "classification": "Personnel",
  "document_type": "Memo",
  "security": "The documents reveal that Robert West Pugh’s military file indicated he had been found unfit for duty due to excessive drinking. Quoting directly, “His Navy record stated that this drinking problem adversely affected his judgement, reliability, and personal behavior. This weakness had been discussed to no avail with Subject on several occasions.” It also developed that Subject's brother Bartholomew, aka: Bart PUGH, was the Subject of an FBI investigation in 1941, which was conducted to resolve allegations regarding the loyalty of Subject's brother. Disclosing these details could harm Pugh’s reputation and compromise future security assessments.",
  "security_level": "SECRET",
  "summary": "This collection of documents relates to the Covert Security Approval for Robert West Pugh's employment as a First Officer in the Far East under Project HBILKA/JBGREED. It includes memos detailing his approval, concerns about his past drinking issues, his brother's alleged communist ties, and his eventual resignation from the project.",
  "summary_one_paragraph": "These documents trace Robert West Pugh's involvement with Project HBILKA/JBGREED, starting with a request for Covert Security Approval for his position as a First Officer in the Far East. The memos reveal that while the approval was granted, an investigation uncovered Pugh's history of excessive drinking during his Navy service and his brother's past association with communist activities, though no connection was found between Pugh and his brother’s actions. The collection also includes a dispatch informing the Taipei station of these findings, Pugh's identity sheet, confirmation of his resignation, and a request for cancellation of his approval following his resignation.",
  "tags": [
    "CIA",
    "Covert Security Approval",
    "Robert West Pugh",
    "HBILKA/JBGREED",
    "Far East",
    "Personnel Security",
    "Alcoholism",
    "Communist Ties",
    "Resignation"
  ],
  "title": "Robert West Pugh - Covert Security Approval and Project HBILKA/JBGREED",
  "date": "1966-05-27",
  "locations_mentioned": [
    "Far East",
    "Los Angeles, California",
    "Taipei, Taiwan",
    "Santa Rosa, California"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Robert West Pugh",
    "Joseph E. Murphy, Jr.",
    "Bartholomew (Bart) Pugh",
    "Howard J. Osborn",
    "Hugh C. Pardee",
    "David R. Traylor",
    "J.M. Clark"
  ],
  "recipient": "DD/S-HB, Chief Executive Officer Project HBILKA/JBGREED, Chief of Station Taipei, CHIEF OS/ID/1",
  "sender": "Victor R. White (Deputy Director of Security), Howard J. Osborn (Director of Security), Hugh C. Pardee, J.M.Clark"
}