{
  "classification": "Operations, Mexico, Soviet, Cuba",
  "document_type": "Dispatch and Memorandum",
  "security": "Disclosing the project's focus on telephone taps, its targets (Soviet, Satellite, and Cuban agents, and official foreign installations), and the budget allocation for these activities could jeopardize ongoing operations, compromise intelligence-gathering methods, and damage relations with Mexico, especially given the joint operation with the Mexican government (LIEDVOY). Quoting: 'The project supports a unilateral telephone tap operation which provides daily Information on the activities of official foreign installations In Mexico City and personnel thereof... the project provided coverage of the home phones of three Soviet Intelligence officers, the Polish Emigre, the Yugoslav Attache...' and 'LIFEAT remains available to resume coverage of these installations should a change in the local government or its attitude to CIA participation necessitate such change.'",
  "security_level": "SECRET",
  "summary": "These documents pertain to the renewal of Project LIFEAT, a unilateral telephone tap operation in Mexico City, focusing on Soviet, Satellite, and Cuban agents and official foreign installations, with a budget of $99,000 for the period of 1 July 1962 through 30 June 1963.",
  "summary_one_paragraph": "These documents consist of dispatches and a memorandum concerning the renewal of Project LIFEAT, a clandestine CIA telephone tap operation in Mexico City that targets Soviet, Satellite, and Cuban agents, as well as official foreign installations. The documents outline project funding, objectives, operational details, and the types of intelligence gathered, including contacts between Mexican Communists and Cubans, transshipment of goods to Cuba, and activities of exiles. With a reduced budget of $99,000 for the period of 1 July 1962 through 30 June 1963, Project LIFEAT supports Station operations by providing CI/CE information and covering sensitive targets. The documents emphasize the project's value as an operational asset, the quality of its intelligence, and the continuous support it provides to Station operations, including the potential to resume coverage of Soviet and Czech installations independently of the Mexican government.",
  "tags": [
    "LIFEAT",
    "Telephone Tap",
    "Mexico City",
    "Soviet Agents",
    "Cuban Agents",
    "Technical Surveillance",
    "Budget",
    "WH Division",
    "Intelligence Gathering",
    "CI/CE",
    "LIEDVOY"
  ],
  "title": "Project LIFEAT Renewal",
  "date": "1962-07-31",
  "locations_mentioned": [
    "Mexico City",
    "Cuba",
    "Soviet Bloc"
  ],
  "origin_agency": "CIA WH Division",
  "persons_mentioned": [
    "Carmen BRUFAU Civit",
    "Elena VASQUEZ Gomez",
    "Lazaro CARDENAS del Rio",
    "David M. WILSTAD",
    "Juan Jose AREVALO Barmeja",
    "Lee G. Norris",
    "J. C. King",
    "John M. Whitten",
    "Ned P. Holman",
    "Robert D. Carter",
    "Clark V. Simcox",
    "Lloyd George",
    "Hajoes Estey"
  ],
  "recipient": "Assistant Deputy Director, Plans",
  "sender": "Chief, WH Division, Chief of Station, Mexico City"
}