{
  "classification": "Liaison",
  "document_type": "Message",
  "security": "Revealing that Oltmans sought refuge at the Netherlands embassy, claiming to be branded a CIA agent, exposes sensitive information. Quoting the document: 'HE SOUGHT REFUGE AT THE NETHERLANDS EMBASSY...SAYING HE HAD GONE TO THE EMBASSY FOR \"PROTECTION AND ASSISTANCE: I FEEL UNSAFE HAVING BEEN BRANDED A CIA AGENT\".'",
  "security_level": "SECRET",
  "summary": "A message regarding Dutch journalist William Leonard Oltmans, detailing his background, alleged pro-Soviet leanings, and connections, including his testimony before the House of Representatives Assassinations Committee on George de Mohrenschildt's link to Lee Harvey Oswald.",
  "summary_one_paragraph": "This SECRET message provides a trace response on Dutch journalist William Leonard Oltmans, believed to be assigned number 201-0155221, highlighting his pro-Indonesian stance at the UN, suspected Soviet sympathies, and expulsion from Yale. It notes his contact with Indonesian President Sukarno, his anti-American statements to the USIA, and his 1977 testimony regarding George de Mohrenschildt’s relationship with Lee Harvey Oswald before the House of Representatives Assassinations Committee. The message also mentions Dutch service teltap information, high-level contact brokering between a US computer company and the Soviet Union, activities in Martinique, and Oltmans seeking refuge at the Netherlands embassy in Pretoria, claiming to be branded a CIA agent.",
  "tags": [
    "WNINTEL",
    "RYBAT",
    "William Leonard Oltmans",
    "Dutch Journalist",
    "George de Mohrenschildt",
    "Lee Harvey Oswald",
    "Sukarno",
    "Soviet Union",
    "USIA",
    "House of Representatives Assassinations Committee"
  ],
  "title": "TRACE RESPONSE ON DUTCH JOURNALIST",
  "conspiracy": "The document mentions Oltmans testifying before the House of Representatives Assassinations Committee regarding George de Mohrenschildt's connection with Lee Harvey Oswald, and de Mohrenschildt's claim of responsibility for Oswald's assassination of Kennedy.",
  "date": "1996-01-26",
  "locations_mentioned": [
    "Huizen, The Netherlands",
    "New York City",
    "United States",
    "Indonesia",
    "Cuba",
    "Egypt",
    "Soviet Union",
    "Martinique",
    "Pretoria, South Africa"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "William Leonard Oltmans",
    "Sukarno",
    "George de Mohrenschildt",
    "Lee Harvey Oswald",
    "John F. Kennedy"
  ],
  "recipient": "The Hague",
  "sender": "LIMIT EUR/BNL"
}