{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "This memo details the types of technical support TSD provides to other agencies, including training, materials, audio/visual surveillance, secret writing, personal protection, disguise, concealment devices, electronic beaconry, narcotics detection, and counter-sabotage/terrorism. Disclosing these services could compromise intelligence methods and relationships with other agencies. Quoting: \"While varying widely among the different recipients, these services have included training and materials, and in a few instances participation in the fields of audio and visual surveillance, secret writing and related communications, personal protection, alias documentation and questioned document examination, disguise, concealment devices, electronic beaconry, illicit narcotics detection, and counter-sabotage/terrorism.\"",
  "security_level": "SECRET",
  "summary": "Sidney Gottlieb outlines the Technical Services Division's (TSD) support to other agencies, detailing the types of services provided and the coordination process for fulfilling requests.",
  "summary_one_paragraph": "In a memorandum dated May 8, 1973, Sidney Gottlieb, Chief of the Technical Services Division (TSD), informs the Deputy Director for Science & Technology about the TSD's provision of technical assistance to both CIA operations and other agencies, as mandated by CSI 1-8. Over the years, recipients of this support have included various departments such as Defense, FBI, Bureau of Narcotics and Dangerous Drugs, and others, receiving services such as training, materials, and participation in areas like surveillance, secret writing, personal protection, disguise, narcotics detection, and counter-sabotage. The memo describes the coordination and approval processes for these requests, emphasizing the need for validation and coordination with relevant Agency offices, along with a list of primary services provided to the organizations named.",
  "tags": [
    "TSD",
    "Technical Services Division",
    "Interagency Support",
    "Sidney Gottlieb",
    "Covert Operations",
    "Documentation",
    "Surveillance",
    "Counter-terrorism",
    "Narcotics Detection",
    "Alias Documentation",
    "Electronic Beaconry"
  ],
  "title": "TSD Support to Other Agencies",
  "date": "1973-05-08",
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Sidney Gottlieb",
    "Carl E. Duckett"
  ],
  "recipient": "Deputy Director for Science & Technology",
  "sender": "Sidney Gottlieb, Chief, TSD"
}