{
  "classification": "Personnel",
  "document_type": "Biographic Profile (Part 1 & 2)",
  "security": "Revealing specific assignments and locations, such as TDY Standby assignments (Nov 1971) or positions in Indonesia (Djakarta) and Hong Kong, could compromise ongoing or future operations in those areas. Additionally, details of Agency-sponsored training programs, such as Intel Orient (1950) and Russian language training (1953-54), could provide insights into intelligence methodologies. Quoting directly, \"Jun 1967 Ops Off Jul'68 de 0136.0 Indones Haories POP/FE/PMI Indonesia (Stal8 (Djakarta Sep 1968 ' ' Jun 171 de HonP KORP/FE/Chi/Ch, Mil&Sci Er Hong Kong\"",
  "security_level": "SECRET",
  "summary": "This document is a biographic profile of Robert Malcolm Keith, detailing his CIA employment history, education, language skills, and training from 1950 to 1976.",
  "summary_one_paragraph": "This biographic profile outlines the career of Robert Malcolm Keith within the CIA from August 1950 to July 1976. It includes his education, such as his BS in Chemical Engineering and Chemistry from Virginia Polytechnic Institute, language abilities including Russian, and a detailed history of his assignments within the CIA. His career progression includes roles as an Intelligence Assistant, Area Operations Officer, and Operations Officer, with assignments in various locations including Munich, Hong Kong, and Taiwan. The document also notes commendations for his service during the coup attempt in Indonesia in 1965 and for his work with the Agency's task force related to Richard Fecteau.",
  "tags": [
    "CIA",
    "Biographic Profile",
    "Personnel File",
    "Robert Malcolm Keith",
    "Operations Officer",
    "Language Training",
    "Indonesia",
    "Hong Kong",
    "Taiwan"
  ],
  "title": "Biographic Profile of Robert Malcolm Keith",
  "date": "1976-10-07",
  "locations_mentioned": [
    "MA",
    "World-wide",
    "Raleigh, North Carolina",
    "West Point",
    "Charleston, SC",
    "Virginia",
    "Munich",
    "Tokyo",
    "Indonesia",
    "Djakarta",
    "Hong Kong",
    "Taipei",
    "Taiwan"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Robert Malcolm Keith",
    "Richard Fecteau"
  ]
}