{
  "classification": "Liaison",
  "document_type": "Journal",
  "security": "Disclosing the internal tracking of employment requests, interactions with congressional staffers, and the review of intelligence materials by Senate Select Committee staff could reveal sensitive internal procedures and compromise ongoing liaison activities. Specifically, mentioning the review of 'extracts of NIS's relating to the security services' of allied nations could strain international relations. ",
  "security_level": "INTERNAL USE ONLY",
  "summary": "This journal entry from the Office of Legislative Counsel details employment requests, liaison activities with congressional offices and the House Select Committee on Assassinations, and a visit from a Senate Select Committee on Intelligence staff member to review intelligence materials.",
  "summary_one_paragraph": "On November 10, 1977, the Office of Legislative Counsel recorded several activities in its journal: handling an employment inquiry for Representative Applegate, forwarding a CIA tour press release to Representative Biaggi's office, providing the Agency publication 'Soviet Commercial Operations in the West' to Representative Schulze's office, arranging a meeting between DD/OS personnel and Professor G. Robert Blakey of the House Select Committee on Assassinations, informing Professor Blakey about Privacy Act requests from committee staff, and facilitating a visit by Keith Raffel from the Senate Select Committee on Intelligence to review extracts of NIS's relating to allied security services.",
  "tags": [
    "Legislative Counsel",
    "Employment Request",
    "Liaison",
    "House Select Committee on Assassinations",
    "Senate Select Committee on Intelligence",
    "NIS",
    "Privacy Act",
    "CIA Tours"
  ],
  "title": "Journal",
  "date": "1977-11-10",
  "origin_agency": "Office of Legislative Counsel",
  "persons_mentioned": [
    "Debbie",
    "Representative Douglas Applegate",
    "Robert Sensibaugh",
    "Karen",
    "Representative Mario Biaggi",
    "Ted Winicov",
    "Representative Richard T. Schulze",
    "Dawn",
    "Professor G. Robert Blakey",
    "Sidney Stembridge",
    "Cummins",
    "Keith Raffel",
    "Evvy Vidal"
  ],
  "recipient": "Internal Use"
}