{
  "classification": "Operations",
  "document_type": "Draft Memorandum",
  "security": "Revealing details about informants, like RABEL (AMLEO-3), including his potential double agent status and knowledge of AMTRUNK targets, could endanger current and future intelligence operations. Quoting directly: 'RABEL (AMLEO-3), who \"defected\" to the U.S. in 1962, was knowledgeable of on-island AMTRUNK targets...There is a possibility that he was a CASTRO agent.' Also, any use of the SECRET/SENSITIVE attachment requires C/CI approval.",
  "security_level": "SECRET/SENSITIVE",
  "summary": "An interim working draft memorandum from February 1977 discusses the AMTRUNK operation, a possible political action operation run against the U.S.G./CIA, and focuses on Tad Szulc's involvement and potential connections to hostile foreign agents.",
  "summary_one_paragraph": "This SECRET/SENSITIVE memorandum, dated February 14, 1977, details the AMTRUNK operation, exploring whether it was a political maneuver against the U.S. Government and the CIA. It recounts the operation's origins, including how Tad Szulc (AMCAPE-1) of the New York Times presented a proposal to split the Castro regime, the involvement of individuals like Nestor Moreno and Jorge Volsky, and the operation's ultimate termination due to concerns about hostile elements. Additionally, the memo raises suspicions about Szulc's background, potential ties to foreign intelligence services, and his role in the AMTRUNK operation's failure, suggesting that the operation may have been exploited by the opposition to expose anti-Castro forces and tie up CIA resources.",
  "tags": [
    "AMTRUNK Operation",
    "Tad Szulc",
    "Castro Regime",
    "CIA",
    "Political Action",
    "Double Agent",
    "Cuban Affairs",
    "FOIA"
  ],
  "title": "AMTRUNK Operation - Interim Working Draft, with Attachments",
  "date": "1977-02-14",
  "locations_mentioned": [
    "Cuba",
    "Warsaw, Poland",
    "Brazil",
    "Lisbon",
    "Santiago, Chile",
    "Washington D.C.",
    "Madrid, Spain",
    "Portugal",
    "Prague",
    "Zurich"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Tad Szulc (AMCAPE-1)",
    "Fidel Castro",
    "Nestor Moreno (AMICE-27)",
    "Jorge Volsky (AMTRUNK-1)",
    "John F. Kennedy",
    "Albert C. Davies",
    "McGeorge Bundy",
    "David Morales",
    "Alfonso Rodriguez",
    "Ramon Tomas Guin Diaz (AMTRUNK-10)",
    "Modesto Orlando Orozco Basulto (AMTRUNK-9)",
    "Carlos Pedraza Aguilar (AMTRUNK-11)",
    "CUBELA",
    "Richard Helms",
    "RABEL (AMLEO-3)",
    "Miguel A. Diaz Isalgue (AMICE-14)",
    "John C. Wiley",
    "Philip Agee",
    "Nicole Szulc",
    "Boris V. Yarochevskiy"
  ],
  "recipient": "LAD/JFK Task Force",
  "sender": "Chris Hopkins, Marty Miller"
}