{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "Disclosing the identities of the assets and their operations would undoubtedly compromise their safety, and could have a detrimental effect on U.S. intelligence capabilities. Quoting directly: \"LUCY X SHE WAS LATE REPORTING CHARTERED FLIGHTS TO ALGEREANX NEED THIS INFO FASTER X FLIGHTS SHOULD CONTINUE THRU DEC SIX THREE... NIKE X GOOD INTEL X HOPE HE EVENTUALLY AGREES WORK X DO NOT PUSH HIM TOO HARD...MARIA CHRISTINA X WHAT YOUR EVALUATION HER NOW XX DATA UNDERMINING FRANCO GOVT IMPORTANT HERE\".",
  "security_level": "SECRET",
  "summary": "A cable from JAMAVE to the Director provides an update on intelligence operations related to Cuba, with specific requests for information concerning arms shipments, chartered flights, and evaluations of assets.",
  "summary_one_paragraph": "This SECRET cable, sent from JAMAVE to the Director on November 23, 1963, outlines various intelligence objectives related to Cuba. It requests bio data on Tito (Restituto Robaina), information on the movements of Pablo Sandoval Crane and any arms shipments to Latin America. The cable also seeks updates from Lucy (Ester Arango) regarding chartered flights to Algeria and lists of Cubana personnel. The cable also requests an evaluation of asset Maria Christina and any data undermining the Franco government. JAMAVE requests that a message be left in a designated cafeteria dead drop.",
  "tags": [
    "CIA",
    "Cuba",
    "Intelligence Operations",
    "Assets",
    "Arms Shipments",
    "Chartered Flights",
    "Franco Government",
    "Mexico",
    "Algeria"
  ],
  "title": "RYBAT TYPIC AMKHAN-2 COMMO TARROT",
  "date": "1963-11-23",
  "locations_mentioned": [
    "Latin America",
    "Algeria",
    "Mexico",
    "Habana"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Pablo Sandoval Crane",
    "Osvaldo Diaz",
    "Restituto Robaina",
    "Ester Arango (Lucy)",
    "Miguel Mayor (Nike)",
    "Maria Christina",
    "Dareck Izquierdo"
  ],
  "recipient": "Director",
  "sender": "JAMAVE"
}