{
  "classification": "Security",
  "document_type": "Memo",
  "security": "Revealing that Thomas L. Roberts is a deep cover agent in Dakar, Africa could compromise his identity and endanger him. Quoting directly: \"Mr. Roberts is a current employee of this Agency under deep cover in Dakar.\"",
  "security_level": "SECRET",
  "summary": "A memo discusses Herbert Itkin's claims of CIA involvement and possible connections to Allen Dulles, recommending an interview with Dulles to verify Itkin's story, while also tasking Finance to look for a receipt related to Itkin's claim of a $5000 payment. It also highlights the identification of Thomas L. Roberts, a negro lawyer mentioned by Itkin, as a deep cover agent for the Agency in Dakar.",
  "summary_one_paragraph": "This memorandum, dated November 22, 1968, addresses Herbert Itkin's claims of prior CIA utilization and contacts with Allen Dulles and a case officer named Philip Harbin. Despite internal searches yielding no record of Itkin or Harbin, the memo recommends interviewing Dulles due to the potential for a significant public relations issue if Itkin's story reaches the newspapers. Additionally, it tasks Finance to investigate a $5000 receipt Itkin claims he provided to Harbin. The memo also reveals that Thomas L. Roberts, a lawyer mentioned by Itkin, is a deep cover CIA agent in Dakar, Africa, who previously associated with both Itkin and Mario Brod.",
  "tags": [
    "Herbert Itkin",
    "Mario Brod",
    "Allen Dulles",
    "Philip Harbin",
    "Thomas L. Roberts",
    "CIA",
    "Security",
    "Deep Cover Agent",
    "JFK Assassination Records Act"
  ],
  "title": "Herbert Itkin/Mario Brod et. al.",
  "date": "1968-11-22",
  "locations_mentioned": [
    "New York City",
    "Philadelphia",
    "Burma",
    "Indonesia",
    "New Delhi",
    "El Salvador",
    "Guatemala",
    "Dakar",
    "Africa"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Herbert Itkin",
    "Mario Brod",
    "Allen Dulles",
    "Philip Harbin",
    "Ward K. Greene",
    "Harry Mason",
    "Alger Hiss",
    "Cyrus Eaton",
    "Joseph McCarthy",
    "U Nu",
    "Luis Gutierrez",
    "Thomas L. Roberts"
  ],
  "recipient": "Director of Security",
  "sender": "Ward K. Greene, SA/EPD"
}