{
  "classification": "Liaison",
  "document_type": "Memo",
  "security": "Disclosing the nonofficial cover arrangement with the Aircraft Division of the Hughes Tool Company, including the name of the witting official (Rhea Hopper), could compromise current or future operations. The document also reveals the author's past involvement with the CIA and their awareness of Maheu's relationship with the Agency, which could potentially damage the CIA's reputation if exposed. Quoting directly: 'Simultaneously the undersigned was working out the details of a nonofficial cover arrangement with the Aircraft Division of the Hughes Tool Company in Culver City, California. Mr. Rhea Hopper, Vice President in Charge of the Aircraft Division was the principle cleared witting official.'",
  "security_level": "SECRET",
  "summary": "A memorandum from John G. Southard detailing his encounter with Robert D. Peloquin of International Intelligence, Inc. (INTERTEL) while seeking employment, and providing information on INTERTEL's activities, particularly its investigation of Robert A. Maheu on behalf of the Hughes Tool Company.",
  "summary_one_paragraph": "On May 20, 1971, John G. Southard composed a memo recounting his introduction to Robert D. Peloquin, President of INTERTEL, through former Agency employee Alfred A. Pease, while exploring job opportunities. Southard detailed INTERTEL's background, its investigation into Robert A. Maheu for the Hughes Tool Company, and allegations of INTERTEL's connections to organized crime as reported by The Las Vegas Sun. He also mentioned Edward P. Morgan's potential conflict of interest and Maheu's past relationship with the CIA, emphasizing the need to protect his identity as the source of this information due to his confidential relationship with Pease.",
  "tags": [
    "INTERTEL",
    "Robert D. Peloquin",
    "Robert A. Maheu",
    "Hughes Tool Company",
    "Howard Hughes",
    "Las Vegas Sun",
    "Edward P. Morgan",
    "CIA",
    "Alfred A. Pease",
    "John G. Southard",
    "Nonofficial Cover",
    "Organized Crime"
  ],
  "title": "Robert D. Peloquin, President International Intelligence, Inc. (INTERTEL)",
  "conspiracy": "The memo touches on Maheu's role in the Cuban Revolution, potentially linking him to events surrounding the JFK assassination, but the information is presented more as background on Maheu's activities and relationships rather than direct evidence related to the assassination.",
  "date": "1971-05-20",
  "locations_mentioned": [
    "Washington, D.C.",
    "California",
    "Paradise Island, Bahamas",
    "Chicago",
    "Los Angeles",
    "Philadelphia",
    "Canada",
    "Las Vegas",
    "Culver City"
  ],
  "origin_agency": "Central Intelligence Agency (Inferred)",
  "persons_mentioned": [
    "Robert D. Peloquin",
    "Alfred A. Pease",
    "John D. O'Connell",
    "J. Shane Creamer",
    "Robert A. Maheu",
    "Howard Hughes",
    "Herman M. Greenspun",
    "William A. Kolar",
    "Edward P. Morgan",
    "Jack Anderson",
    "Peter Maheu",
    "Rhea Hopper",
    "Bernard Fensterwald",
    "Senator Brewster",
    "Robert J. Flynn",
    "Senator Margaret Chase Smith"
  ],
  "recipient": "Record"
}