{
  "classification": "Administrative",
  "document_type": "Address Book/Contact List",
  "security": "Sharing internal contact information could compromise operational security and expose personnel to potential risks.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a contact list containing names, phone numbers, and addresses of various individuals, likely CIA personnel, including their office and home contact information.",
  "summary_one_paragraph": "This document, created by the Central Intelligence Agency, is an internal contact list containing names, phone numbers (both office and home), and addresses of various individuals, potentially CIA personnel, in the Washington D.C. area, Roslyn, VA and Bethesda, MD. It includes names like John Stuart Phillips, Tom Flores, Earl Williamson, John Sherwood Harlet, Harry Mustakis, Paul Best, Bud Steely, Vincent Lago, Alex Tejeda, Lee Poole, William V. Broe, Jake Esterline, Larry Sternfield, Dave McLean, Desmond FitzGerald, Dick Helms, Ed Finnimore, Les Ratty, Ralph Kisley, Steve Monger, A.C White, Dorthy, Ed Laffin, Maj-Lis, Clemente Hernandez, Sally Svenson, Fred Henderson, and Mathew McCullough, along with relevant contact information for each person.",
  "tags": [
    "Contact List",
    "Personnel",
    "Addresses",
    "Phone Numbers",
    "CIA"
  ],
  "title": "CIA Personnel Contact Information",
  "locations_mentioned": [
    "Washington D.C.",
    "Roslyn, VA",
    "Bethesda, MD",
    "Silver Spring, MD",
    "Chevy Chase, MD",
    "Falls Church, Virginia",
    "Rockville, MD",
    "Spain"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "John Stuart Phillips",
    "Tom Flores",
    "Earl Williamson",
    "John Sherwood Harlet",
    "Harry Mustakis",
    "Paul Best",
    "Bud Steely",
    "Vincent Lago",
    "Alex Tejeda",
    "Lee Poole",
    "William V. Broe",
    "Jake Esterline",
    "Larry Sternfield",
    "Dave McLean",
    "Desmond FitzGerald",
    "Dick Helms",
    "Ed Finnimore",
    "Les Ratty",
    "Ralph Kisley",
    "Steve Monger",
    "A.C White",
    "Dorthy",
    "Ed Laffin",
    "Maj-Lis",
    "Clemente Hernandez",
    "Sally Svenson",
    "Fred Henderson",
    "Mathew McCullough",
    "Ronald Marelics",
    "Martin"
  ]
}