{
  "classification": "Personnel",
  "document_type": "Report",
  "security": "This document contains details about CIA internal organization, staffing, and investigations into potential security leaks and compromise of personnel. Specifically, it details the functions of the CI/SIG and the HTLINGUAL mail intercept program, its targets, and methods, along with internal concerns about the security and ethics of these operations. Disclosing this would reveal the CIA's internal security procedures, counterintelligence methods, and surveillance activities, potentially compromising ongoing or future operations.",
  "security_level": "SECRET",
  "summary": "This document outlines the evolution and activities of the CI/SIG (Special Investigations Group) within the CIA, from its modest beginnings in 1955 to its expanded role in counterintelligence and internal security by 1973, including involvement in projects like HTLINGUAL.",
  "summary_one_paragraph": "The report details the CI/SIG's evolution within the CIA, beginning with its establishment in 1955 as a special investigation unit focused on security leaks and personnel cover, to its expanded functions by 1973 which included research into hostile capabilities, coordination with other agencies, maintenance of sensitive counterintelligence holdings, participation in the American Targets Program, liaison with foreign intelligence services, cover compatibility reviews, data collection on news media leaks and compromised personnel, and studies of individuals with foreign intelligence connections; it also describes the early focus on the LCM LCMAYFOWL complex and the later surge in activity following the defection of Golitsyn, leading to the HONETOL investigations and a period of internal scrutiny and reorganization within the CI Staff under Kalaris, including addressing the extensive records accumulated by Angleton and the mail-intercept program.",
  "tags": [
    "CIA",
    "CI/SIG",
    "Special Investigations Group",
    "Counterintelligence",
    "Internal Security",
    "HTLINGUAL",
    "HONETOL",
    "James Angleton",
    "Golitsyn",
    "Kalaris",
    "Security Leaks",
    "Personnel Compromise",
    "Mail Intercept Program"
  ],
  "title": "The Special Investigations Group of the CI Staff (CI/SIG)",
  "date": "1998-09-28",
  "persons_mentioned": [
    "Birch O'Neal",
    "Jean Evans",
    "Golitsyn",
    "Angleton",
    "Kalaris",
    "Blee",
    "McCoy",
    "Rocca",
    "Miler",
    "Hood",
    "W. Averell Harriman",
    "Henry Kissinger",
    "Lyman Kirkpatrick",
    "Richard Helms",
    "Nelson",
    "John Edgar Hoover",
    "Anatoliy Golitsyn"
  ],
  "recipient": "CI Staff",
  "sender": "CI Staff"
}