{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "Identifying members of anti-Castro groups, especially naming contacts like Ramon Parejon Porazas, could expose them to danger and compromise ongoing operations. Revealing Vertice Tres's interest in obtaining a radio plant and their technical approach, even vaguely described as a 'Delta System Radio', could also compromise their activities. The document includes a quote: Source was reluctant to name any FAL contact, but finally named Ramon Parejon Porazas a contact man.",
  "security_level": "UNCLASSIFIED",
  "summary": "A report details an interview with Alberto Mariano Parojon Cerconas, a member of anti-Castro groups EAC, FAL, and Vertice Tres, providing information on their organization, activities, and contacts.",
  "summary_one_paragraph": "This report, dated April 2, 1962, summarizes an interview with Alberto Mariano Parojon Cerconas in Miami, who identified himself as a member of anti-Castro groups EAC, FAL (Fuerza Anti-Camunista de Liberacion), and Vertice Tres. Cerconas provided details on FAL's organization and activities in Piner del Rio Province, including their plans for an uprising and communications disruption, naming Ramon Parejon Porazas as a contact. He described Vertice Tres as an organization focused on propaganda and industrial sabotage, seeking to acquire a radio plant, and identified a Miami contact named Carillo. Additionally, he shared information about a message regarding 'Flavio' (Evelio Duque) and identified Arturo Colri as a member of G-2 in Habana.",
  "tags": [
    "Anti-Castro",
    "EAC",
    "FAL",
    "Vertice Tres",
    "Alberto Mariano Parojon Cerconas",
    "Ramon Parejon Porazas",
    "Evelio Duque",
    "Arturo Colri",
    "G-2",
    "Propaganda",
    "Sabotage"
  ],
  "title": "Operational/GYROSE FAL/Vertice Tres 05",
  "date": "1932-04-02",
  "locations_mentioned": [
    "Miami",
    "Cuba",
    "Piner del Rio Province",
    "Habana"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Alberto Mariano Parojon Cerconas",
    "Ramon Parejon Porazas",
    "Justo Carrillo",
    "Placio Carrillo",
    "Flavio (Evelio Duque)",
    "Evelio Duque",
    "Trent",
    "Manolito",
    "Arturo Colri"
  ],
  "recipient": "Chief of Station, JAVE",
  "sender": "Chief, Task Force/W"
}