{
  "classification": "Administrative",
  "document_type": "Cable",
  "security": "This document reveals operational strategies for influencing media coverage and public perception regarding the political situation in Chile. Specific instructions are given to CIA stations on leveraging the announcement of press freedom by General Pinochet to promote a narrative that supports the Junta's stability and deflects criticism. Sharing such directives could compromise ongoing efforts to manage international perceptions and reveal covert information activities.",
  "security_level": "SECRET",
  "summary": "This cable discusses strategies for influencing media coverage related to Chile, particularly regarding General Pinochet's announcement of press freedom. It involves coordinating editorial comments, leveraging assets, and addressing Soviet denial of involvement in prisoner exchanges.",
  "summary_one_paragraph": "The series of SECRET cables from October-November 1974 outline efforts to manage media perceptions surrounding Chile following General Pinochet's announcement of press freedom. CIA stations were instructed to use this announcement as a basis for editorial comments emphasizing the Junta's confidence and political stability, while downplaying any prior censorship. Instructions included engaging media assets like Robert Moss to write articles highlighting Soviet involvement in Chile, countering Soviet denials of prisoner exchange negotiations, and influencing organizations like Amnesty International to avoid actions that might pressure the Soviets. These cables also discuss coordinating with ANSA wire service and timing comments to coincide with OAS meetings, all under file number 200-120-356.",
  "tags": [
    "Psychological Warfare",
    "Chile",
    "Media Influence",
    "Pinochet",
    "Press Freedom",
    "Soviet Union",
    "Amnesty International",
    "MHSPAWN",
    "REDLEG",
    "E-2 IMPDET"
  ],
  "title": "Psych Warfare General",
  "date": "1974-10-21",
  "locations_mentioned": [
    "Chile",
    "Moscow",
    "London",
    "Rome",
    "Buenos Aires",
    "Guayaquil",
    "Bogota",
    "San Jose",
    "Quito"
  ],
  "origin_agency": "CIA Headquarters",
  "persons_mentioned": [
    "General Pinochet",
    "Robert Moss",
    "Corvalan",
    "Denis Feldmeyer",
    "Gruno Doppler",
    "Sergei Bulantsev",
    "Martin Miller",
    "E. James McTighe",
    "Lawrence C. Laser"
  ],
  "recipient": "Caracas, Guayaquil, Bogota, San Jose, Buenos Aires, Quito, Santiago, Lima, London, Rome",
  "sender": "Director"
}