{
  "classification": "Liaison",
  "document_type": "Routing and Record Sheet",
  "security": "Disclosing details about individuals expressing disillusionment with America and seeking residence in the USSR could potentially harm the CIA's reputation. Quoting directly: 'BLOCK stated to the Dutch passport control officer that there was only one country in the world where freedom was really possible, and that he wished to go there. He no longer wanted to live in America, for the laws were made there by three or four families and the rest had to fall in line. He had had more than enough of the clique around Eisenhower. He stated he no longer valued his American nationality...'",
  "security_level": "SECRET",
  "summary": "A CIA routing and record sheet forwards information from the Dutch Internal Security Service (BVD) concerning Morris and Mollie Block's travel plans to the USSR, detailing Morris Block's attempt to enter the Netherlands with a falsified passport and their stated desire to settle in Moscow.",
  "summary_one_paragraph": "This document, dated February 11, 1959, details information received by the CIA from the Dutch Internal Security Service (BVD) regarding Morris and Mollie Block. It reports that Mollie Block, traveling with her child, departed for Moscow via Warsaw on November 4, 1958, while her husband, Morris Block, was denied entry to the Netherlands on August 30, 1958, due to a falsified American passport. Morris Block expressed disillusionment with the United States, stating his desire to settle in the USSR, and revealed to Dutch authorities that he had previously visited the USSR in 1957 as a delegate to the World Youth Festival in Moscow.",
  "tags": [
    "CIA",
    "FBI",
    "BVD",
    "Morris Block",
    "Mollie Block",
    "Defection",
    "USSR",
    "Passport Fraud",
    "World Youth Festival"
  ],
  "title": "Mollie BLOCK; Morris BLOCK",
  "date": "1959-02-11",
  "locations_mentioned": [
    "Netherlands",
    "Amsterdam",
    "Moscow",
    "Warsaw",
    "Montreal",
    "New York",
    "London",
    "Dover",
    "Brussels",
    "Strasbourg",
    "Kastrup Airport",
    "Canada",
    "USSR",
    "The Hague"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Mollie Block",
    "Morris Block",
    "Johanna Morris Block",
    "S.J. Rapich",
    "Eisenhower",
    "Stanley Faulker",
    "Stella Eliashow",
    "Jack Kloert",
    "Jack Elgert",
    "Marion E. Linde"
  ],
  "recipient": "Director, Federal Bureau of Investigation",
  "sender": "Deputy Director, Plans"
}