{
  "classification": "Cuba",
  "document_type": "Historical Staff Study",
  "security": "This document details CIA's covert operations in Latin America and against Cuba, including the expenditure of funds, support for political candidates, wiretapping, media manipulation, and the recruitment of agents within foreign governments. Sharing information on these activities could damage relationships with foreign governments, expose sensitive intelligence-gathering methods, and compromise ongoing operations. Quoting directly: \"high-level telephone taps, photographic surveillance, unilateral intelligence assets and a broad scale of covert action capabilities...the campaign to assure Frei's victory cost CIA about $2,600,000. Its success kept Allende at bay until 1970...\"",
  "security_level": "SECRET",
  "summary": "A historical staff study by David R. McLeat, approved by David A. Phillips in December 1973, detailing the CIA's Western Hemisphere Division activities from 1946 to 1965, with a focus on operations in Latin America and Cuba.",
  "summary_one_paragraph": "This historical staff study, compiled by David R. McLeat and approved by David A. Phillips in December 1973, provides a comprehensive overview of the CIA's Western Hemisphere Division operations between 1946 and 1965. It covers a wide range of activities, including support for anti-communist movements, responses to Castro's revolution, the Bay of Pigs invasion, propaganda efforts, political polling, and attempts to manipulate sugar prices. The study also discusses specific operations in countries like Mexico, Bolivia, and Chile, detailing the use of covert methods such as wiretapping, agent recruitment, and financial support for political candidates.",
  "tags": [
    "CIA",
    "Western Hemisphere Division",
    "Latin America",
    "Cuba",
    "Covert Operations",
    "Historical Study",
    "Propaganda",
    "Bay of Pigs",
    "Political Polling",
    "Economic Warfare",
    "Mexico City Station",
    "Chilean Election",
    "MHVIPER"
  ],
  "title": "Western Hemisphere Division 1946 - 1965",
  "date": "1973-12-01",
  "locations_mentioned": [
    "Panama",
    "Havana, Cuba",
    "Key West, USA",
    "Honduras",
    "La Paz, Bolivia",
    "Mexico City, Mexico",
    "Venezuela",
    "Chile",
    "Miami, USA",
    "Guantanamo, Cuba",
    "Antwerp",
    "Detroit, USA"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "David R. McLeat",
    "David A. Phillips",
    "Fidel Castro",
    "James A. Noel",
    "Arthur Avignon",
    "Frank Belsito",
    "Ralph Seehafer",
    "Frederick W. Cole",
    "Ben Stephansky",
    "Lyle T. Shannon",
    "J.C. King",
    "Jacob D. Esterline",
    "William K. Harvey",
    "Desmond FitzGerald",
    "Bruce B. Cheever",
    "John L. Hart",
    "Eduardo Frei",
    "Salvador Allende",
    "Lyndon B. Johnson",
    "Dean Rusk",
    "Robert S. McNamara",
    "Maxwell Taylor",
    "McGeorge Bundy",
    "John A. McCone",
    "Richard Helms",
    "Roman C. Pucinski",
    "Eugene McCarthy",
    "Natalie Scott",
    "Francis S. Sherry",
    "William C. Boner, Jr.",
    "Juan Bautista Perez Luis"
  ],
  "recipient": "O/DDO",
  "sender": "David R. McLeat"
}