{
  "classification": "Personnel",
  "document_type": "Outline/Memo",
  "security": "Disclosing the details of Elsie Scaletti’s experiences, her responsibilities within the CIA (especially concerning routing of correspondence related to Soviet/Satellite/Chinese matters), and her involvement in specific operations (like LILINK and LPGLOBE) could jeopardize current or future intelligence operations and personnel. It also reveals methods used by the CIA, like using ‘tourist’ cover for employees working inside embassies. Quoting directly: “Phil could definitely identify me as a long-time BKTRUST employee… He knew I was assigned to Mexico under tourist cover but worked inside the Embassy… In Headquarters Phil knew I handled mostly the support projects plus suci extras as LILINK and LGLOBE.”",
  "security_level": "SECRET/SENSITIVE",
  "summary": "Elsie Scaletti provides information regarding her personal and professional relationship with Philip Agee, detailing their time together at CIA Headquarters and in Mexico, the extent of Agee's knowledge of her projects and operations, and other Agency personnel who had contact with Agee.",
  "summary_one_paragraph": "This document outlines Elsie Scaletti’s knowledge of Philip Agee, covering their shared time in Branch I at CIA Headquarters and their assignment in Mexico. Scaletti details how she and Agee came to be in Mexico around the same time, specifying that Agee helped her move household effects due to her 'tourist' cover status. She describes Agee's knowledge of her role within the Cuban section, her involvement in projects like LILINK and LPGLOBE, and her work against Cuban targets. Scaletti also identifies other Agency personnel who had contact with Agee, including Ex-LIADLIB-1, noting potential security concerns arising from Agee's knowledge of these individuals and operations.",
  "tags": [
    "Philip Agee",
    "Elsie Scaletti",
    "Mexico City Station",
    "LILINK",
    "LPGLOBE",
    "BKTRUST",
    "WH/1",
    "Cuban Section",
    "LIADLIB-1",
    "Personnel Security",
    "FOIA"
  ],
  "title": "Philip Burnett Franklin Agee Bustos - Vidilla",
  "date": "1972-07-10",
  "locations_mentioned": [
    "Mexico",
    "Mexico City",
    "Virginia",
    "United States"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Philip Burnett Franklin Agee Bustos",
    "Elsie I. Scaletti",
    "Willard C. Curtis",
    "Laura B. Utstine",
    "John Probert",
    "Raymond F. Fradyer",
    "Gary R. Reymander",
    "Howard R. Benjaja",
    "Ex-LIADLIB-1"
  ],
  "recipient": "CIA Files",
  "sender": "Elsie I. Scaletti"
}