{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "This dispatch reveals operational weaknesses and security risks associated with Project AMTRUNK, including potential compromise of agents and exposure of KUBARK's (CIA) involvement. It explicitly states that the AMTRUNKers are anti-KUBARK and may \"sell out\" the operation, and that there is a high \"flap potential\" should any agents be captured by the opposition. Quoting directly: \"The AMTRUNKers admit to being anti-KUBARK...It is believed that AMICE/27 would have no hesitation 'selling out' the operation...This operation has a very high 'flap potential'.\"",
  "security_level": "SECRET",
  "summary": "A dispatch from JMWAVE Station evaluating Project AMTRUNK, highlighting its weaknesses, including agent reliability and security concerns, and recommending its termination due to high risk of exposure and potential for operational compromise.",
  "summary_one_paragraph": "This dispatch, originating from the Chief of Station at JMWAVE, assesses Project AMTRUNK, a clandestine operation aimed at overthrowing the Cuban government. It details significant disadvantages, such as the anti-KUBARK sentiments of the AMTRUNK agents, their potential to betray the operation, and the high risk of exposure that could implicate KUBARK (CIA) and ODACID. The report also raises concerns about security breaches among the agents and a risky landing point near a Cuban cruise missile site. Despite recognizing the agents' potential and the objective's value, the Station recommends terminating the operation, requesting a decision from Headquarters while continuing training and planning in the interim.",
  "tags": [
    "CIA",
    "JMWAVE",
    "AMTRUNK",
    "KUBARK",
    "Cuba",
    "Operational Review",
    "FOIA",
    "Project Termination"
  ],
  "title": "Operational/TYPIC/AMTRUNK: Project AMTRUNK Operational Review",
  "date": "April 1963",
  "locations_mentioned": [
    "Cuba",
    "Havana",
    "Plantation Key",
    "Miami",
    "Guanabo Beach"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "AMICE/27",
    "AMICE/14",
    "AMTRUNK/2",
    "AMTRUNK/3",
    "AMTRUNK/1",
    "AMCAPE/1",
    "Eloy Gutierrez Menoyo",
    "Manuel Ray",
    "Andrew S. Parmers",
    "Irving N. Peggins",
    "Hobart J. Vandeborn",
    "Fidel Castro",
    "Batista",
    "Santos Suarez",
    "Pedro Cruz",
    "Roman Hernandez",
    "Augusto Machon",
    "Elsa Marela Negron",
    "Pedro Iglesias Betancourt",
    "Sergio Mendez",
    "Che Guevara",
    "Isabel Menocol",
    "Gloria Bamatalla",
    "Jorge Vals",
    "Jose Duarte Oropesa",
    "Camilio Cienfuegos",
    "Lester Rodriguez",
    "Raul Castro"
  ],
  "recipient": "Chief, Special Affairs Staff",
  "sender": "Chief of Station, JMWAVE"
}