{
  "classification": "Commission",
  "document_type": "Memo",
  "security": "Releasing information about covert financial support to political parties and labor unions, as well as details about the JMWAVE organization and Mexico City tapes, could reveal sensitive operational methods and relationships. Protecting the alias documentation and accommodation addresses of former Agency employees is crucial to avoid compromising ongoing operations and sources. As stated in the document, the release of the JMWAVE chart is opposed due to 'its similarity to current organizational plans.' Revealing details about LITAMIL-9, a CIA penetration of the Cuban Embassy, could endanger the individual and their family.",
  "security_level": "SECRET",
  "summary": "This memorandum outlines pending issues between the CIA and the ARRB (JFK Board) regarding the release of JFK assassination-related records, focusing on protecting sensitive Agency equities and operational details. It details ongoing negotiations and potential compromises on issues such as unacknowledged covert actions, alias documentation, organizational materials, Mexico City tapes, protection of LITAMIL-9, Richard Gibson (CIA Asset), and files of CIA officials.",
  "summary_one_paragraph": "In this SECRET memorandum dated April 13, 1998, Lee S. Strickland, Chief of the Information Review Group/OIM, informs the Deputy Executive Director about ongoing negotiations with the JFK Board concerning the release of assassination records. The memo details the CIA's multi-step approach to protecting Agency equities, including arguing relevance and potential current damage. Key issues under deliberation include records of covert actions in several countries, alias documentation of former employees like David Morales, organizational charts (particularly the JMWAVE organization), Mexico City tapes, protection of CIA assets like LITAMIL-9 and Richard Gibson, and files of CIA officials, highlighting the complexities and sensitivities involved in balancing transparency with national security concerns as the statutory end of the Board nears.",
  "tags": [
    "CIA",
    "ARRB",
    "JFK Board",
    "JFK Assassination Records",
    "Covert Actions",
    "Alias Documentation",
    "Organizational Materials",
    "Mexico City Tapes",
    "LITAMIL-9",
    "Richard Gibson",
    "HSCA",
    "Information Review"
  ],
  "title": "Pending ARRB (JFK Board) Issues",
  "date": "1998-04-13",
  "locations_mentioned": [
    "Peru",
    "Greece",
    "Italy",
    "Brazil",
    "France",
    "Mexico City",
    "Cuba",
    "England"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Lee S. Strickland",
    "David Morales",
    "Richard Gibson",
    "John Newman",
    "General Charles Cabell",
    "General Marshall Carter",
    "Richard Bissell",
    "Richard Helms",
    "C. Tracy Barnes",
    "Lawrence Houston",
    "William Harvey",
    "Lee Harvey Oswald"
  ],
  "recipient": "Deputy Executive Director",
  "sender": "Lee S. Strickland"
}