{
  "classification": "Security",
  "document_type": "Request for Approval or Investigative Action",
  "security": "Revealing that the CIA is considering employing an individual through the King of Jordan for public relations purposes in the U.S. could compromise ongoing operations or damage international relations. This is particularly true if the individual is unaware of U.S. government or CIA interest in him. Direct quote: 'May be employed by the King of Jordan to handle Jordanian public relations in the U. S.' and 'IS OR WILL SUBJECT BE AWARE OF CIA INTEREST IN HIM? x YES NO'",
  "security_level": "SECRET",
  "summary": "This is a request for covert security approval for Robert A. Maheu, who may be employed by the King of Jordan to handle Jordanian public relations in the U.S., with Maheu aware of U.S. government and CIA interest in him.",
  "summary_one_paragraph": "On October 7, 1959, NE/2/Jordan submitted a request to the CI/Operational Approval and Support Division and the Security Support Division for covert security approval for Robert A. Maheu, who may be employed by the King of Jordan to manage Jordanian public relations in the U.S. The form indicates that Maheu is aware of U.S. government and CIA interest in him. According to J. O'Connell, sufficient Security Office investigation has already taken place, and derogatory information has been found during RI traces but has not been initiated in the area.",
  "tags": [
    "CIA",
    "Security Approval",
    "Robert A. Maheu",
    "Jordan",
    "Public Relations",
    "Covert Operation",
    "King of Jordan"
  ],
  "title": "Robert A. Maheu PROJECT",
  "date": "1959-10-07",
  "locations_mentioned": [
    "U.S.",
    "Jordan"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Robert A. Maheu",
    "J. O'Connell",
    "William R. Freeman",
    "James E. Burkart",
    "King of Jordan"
  ],
  "recipient": "CI/Operational Approval and Support Division, Security Support Division/Office of Security",
  "sender": "NE/2/Jordan"
}