{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Disclosing the names and activities of resistance members in Cuba could jeopardize their safety and compromise ongoing resistance efforts. The document states, 'Hans, a member of the Revolutionary Student Directorate, was recently taken prisoner...As a result of this, a house in Wajay, in Havana Province, was seized and arms and gelatina were found.' This reveals both the methods and consequences of compromised operations.",
  "security_level": "SECRET",
  "summary": "A CIA dispatch from August 1962 relays information provided by Cuban refugee Francisco Luis Rodrigues Gonzales (CC-1169) regarding resistance activity against the Castro regime, including details about the Revolutionary Student Directorate, their failed insurrection plans in the Sierra Maestra, and subsequent arrests and imprisonments.",
  "summary_one_paragraph": "This secret dispatch, sent from the Chief of Station in Madrid to the Acting Chief of WE on August 31, 1962, details anti-government resistance activities in Cuba based on information provided by Cuban refugee Francisco Luis Rodrigues Gonzales (CC-1169). Gonzales, formerly active in the Revolutionary Student Directorate, describes a failed insurrection attempt in the Sierra Maestra led by Alberto Muller, the group's leader, and the subsequent capture and imprisonment of its members, including Gonzales himself. The dispatch recounts the experiences of prisoners at G-2 Headquarters in Santiago de Cuba and Boniato Prison, including the presence of American prisoners from Guantanamo Naval Base, and highlights the independent sabotage activities of various resistance groups and the severe repression faced by those involved.",
  "tags": [
    "CIA",
    "Cuba",
    "Revolutionary Student Directorate",
    "Resistance",
    "Francisco Luis Rodrigues Gonzales",
    "Alberto Muller",
    "Sierra Maestra",
    "Boniato Prison",
    "Counter-Intelligence"
  ],
  "title": "SUBUWEB/PBRUEN Resistance Activity in Cuba",
  "date": "1962-08-31",
  "locations_mentioned": [
    "Cuba",
    "Spain",
    "Sierra Maestra",
    "Oriente Province",
    "Las Villas",
    "Havana",
    "Santuario del Cobre",
    "Bayamo",
    "Santiago de Cuba",
    "Boniato Prison",
    "Playa Giron",
    "Fortaleza de la Cabaña",
    "Imias",
    "Pinar del Rio",
    "Wajay",
    "Havana Province"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Francisco Luis Rodrigues Gonzales (CC-1169)",
    "Diaz Lanz",
    "Angel Fontanills",
    "Charles",
    "Alberto Muller",
    "Flores",
    "Rolando Valdés D'Wolf",
    "Eduardo Díaz Lanz",
    "Jorge Cruz Peña",
    "Castro",
    "Aníbal Rodriguez",
    "Hans"
  ],
  "recipient": "Acting Chief, WE",
  "sender": "Chief, Task Force, Chief of Station, Madrid"
}