{
  "classification": "Personnel",
  "document_type": "Record",
  "security": "This document concerns the 201 file of a protectable source, specifically LITAMIL-7, including details about termination of contact and operational approval. Releasing the 201 file and details regarding the agent could reveal intelligence sources and methods, and potentially endanger the agent if they are still alive, which is the explicit reason for the postponed release. Quoting directly: 'RELEASE DELAYED UNTIL DEATH OF SUBJECT.'",
  "security_level": "SECRET",
  "summary": "This document is an identification form and related memoranda and reports pertaining to the CIA 201 file of a protectable source, codenamed LITAMIL-7, including termination of contact with Mexico City Station in 1970 and a report on the agent's activities.",
  "summary_one_paragraph": "The document is a collection of records related to a CIA agent, LITAMIL-7, operating under the project LITAMIL, as it is documented by agency administration. LITAMIL-7 worked in the PBRUMEN Embassy in Mexico City until being dismissed in 1970. The agent was compensated via spot payments, averaging $20 per month. A memorandum indicates that operational approval for LITAMIL-7, granted in 1968, remained active until files were reviewed and retired, with the agent's file retired in 1972 following contact termination. The agent's termination was amicable, and it was agreed they would report any future information of value. A note indicates the record's release is postponed until the agent's death.",
  "tags": [
    "CIA",
    "JFK Assassination",
    "201 File",
    "Protectable Source",
    "LITAMIL-7",
    "Mexico City",
    "Agent Termination",
    "Personnel File"
  ],
  "title": "201 FILE OF PROTECTABLE SOURCE.",
  "date": "1967-04-27",
  "locations_mentioned": [
    "Mexico City"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Luis Albepu-Souto",
    "Jane F. Zerance",
    "Gerald D. Fahlanger",
    "LITAMIL-3",
    "LITAMIL-7"
  ]
}