{
  "classification": "Administrative",
  "document_type": "Memo",
  "security": "Disclosing specific companies or individuals involved in providing cover arrangements to the CIA in Mexico could compromise ongoing operations and relationships. Mentioning a 'sensitive and active situation' like the 'WH flap' and the Agency's parallel to the White House Plumbers' situation could damage the CIA's reputation and expose sensitive activities. As the memo states: 'I told him we were getting into unchartered waters because I didn't know where his questioning was going to end up' and 'I told Thompson this involved a sensitive and active situation which had been explained to Senator Baker and that Lukoskie was not an Agency witness in this respect, but we would note his interest and see what could be provided'.",
  "security_level": "UNCLASSIFIED",
  "summary": "A memo from Lyle L. Miller to the record, summarizing the Senate Select Committee testimony on February 4, 1974, regarding CIA involvement in Presidential Campaign Activities, covering witness preparation, agreements with the committee, and sensitive areas of questioning.",
  "summary_one_paragraph": "Lyle L. Miller, Deputy Legislative Counsel, documented the Senate Select Committee's February 4, 1974, hearing concerning CIA involvement in Presidential Campaign Activities; the memo details pre-session agreements, including voluntary witness appearances and security arrangements, and summarizes the testimonies of Mary McGillen, Robert Ritchie, and Martin Lukoskie. It highlights the committee's focus on CIA relationships with General Foods, the Mormon church, Summa Corporation, Hughes Tool Company, and the \"WH flap,\" as well as concerns about disclosing sensitive information unrelated to Watergate, leading to agreements to limit the scope of questioning.",
  "tags": [
    "Senate Select Committee",
    "Presidential Campaign Activities",
    "Watergate",
    "CIA Testimony",
    "Executive Session",
    "Cover Arrangements",
    "WH Flap",
    "Mullen Company",
    "Lyle L. Miller"
  ],
  "title": "Senate Select Committee on Presidential Campaign Activities Testimony of 4 February 1974",
  "date": "1974-02-04",
  "persons_mentioned": [
    "Howard Baker",
    "Mary McGillen",
    "Robert Ritchie",
    "Martin Lukoskie",
    "Erich Isenstead",
    "James Angleton",
    "Richard A. Krueger",
    "Steven Greenwood",
    "Dr. Sidney Gottlieb",
    "Thomas Karamessines",
    "Frank O'Malley",
    "Jacob Esterline",
    "Lansdale",
    "Thompson",
    "Marchetti",
    "McCord",
    "Hollis Whitaker",
    "Liebengood",
    "Martinez",
    "Bennett",
    "Mullen",
    "Maheu",
    "Colby",
    "Jim Everett"
  ],
  "recipient": "Record",
  "sender": "Lyle L. Miller, Deputy Legislative Counsel"
}