{
  "classification": "Martin Luther King",
  "document_type": "Dispatch and Memoranda",
  "security": "These documents reveal the CIA's interest in monitoring and collecting information on Communist views and reactions to Martin Luther King Jr.'s death, as well as any potential connections or influences between Stokely Carmichael, Fidel Castro, and local communist movements. Disclosing such intelligence-gathering activities and sources of information could compromise ongoing operations, expose intelligence sources, and damage the agency's reputation. Specific quotes include: 'Communist Comments on the Death of Martin Luther King/Reference to 'Black Power' Concept' and 'summary of Cuban media treatment of death of Martin Luther King, Jr.'",
  "security_level": "SECRET",
  "summary": "This collection includes a dispatch from Santo Domingo and telepouches from JMWAVE summarizing communist reactions to Martin Luther King's assassination, as well as a memo detailing information provided by a Panamanian national about a potential assassination plot against King in 1962.",
  "summary_one_paragraph": "This collection of documents consists of intelligence reports and internal memoranda related to Martin Luther King Jr. Following King's assassination, there's a summary of communist reactions reported by JMWAVE (Cuban media) and a dispatch from Santo Domingo regarding communist party statements. In addition, there's an earlier memo discussing claims made by a Panamanian national about a potential assassination plot discussed in 1962 involving Marvin P. Littrell, adding complexity to the narrative around King's life and death.",
  "tags": [
    "CIA",
    "Martin Luther King Jr.",
    "Assassination",
    "Communist Reactions",
    "Cuban Media",
    "Santo Domingo",
    "JMWAVE",
    "Black Power",
    "Stokely Carmichael",
    "Fidel Castro",
    "Marvin P. Littrell",
    "Panama",
    "Federal Bureau of Investigation"
  ],
  "title": "Collection of Documents Related to Martin Luther King Jr.",
  "date": "1968-04-06",
  "locations_mentioned": [
    "Cuba",
    "United States",
    "Panama",
    "Dominican Republic",
    "Havana",
    "Washington D.C.",
    "Memphis",
    "Mobile, Alabama",
    "Athens, Alabama",
    "New York City",
    "Vietnam",
    "Warsaw, Poland",
    "Chile",
    "Japan"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Martin Luther King Jr.",
    "Stokely Carmichael",
    "Fidel Castro",
    "Lyndon Johnson",
    "Floyd McKissick",
    "Rap Brown",
    "Juan Marrero",
    "Marvin P. Littrell",
    "Roderick Claflin Brown",
    "Juan Mari Bras",
    "Agustin Gonzalez Martinez",
    "Rafael Pastor"
  ],
  "recipient": "Chief, WH Division",
  "sender": "COS, JMWAVE and Chief of Station, Santo Domingo"
}