{
  "classification": "Personnel, Administrative",
  "document_type": "Dispatch, Memorandum",
  "security": "The dispatch discusses the agent's cover status and methods, including the use of journalism and a notional business (Public Surveys Institute) to satisfy local security probes. It also mentions a PEPRIME checking account used for financial management of the cover. Directly quoting: '...journalism is considered a weak and time-worn cover; yet if it is worked at, and financially managed through a PEPRIME checking account, it not only satisfies local SS probes but it does not have the inherent disadvantages involved in setting up a full-fledged business cover.' Revealing these operational details could compromise the agent's future assignments and expose CIA methods to hostile intelligence services.",
  "security_level": "SECRET",
  "summary": "This dispatch from the Chief of Station in Habana to the Chief of the Western Hemisphere Division (WHD) forwards a memorandum from Arthur G. Vaivada requesting reassignment from Cuba in June 1958 and provides an evaluation of Vaivada's performance.",
  "summary_one_paragraph": "Dated November 7, 1957, this dispatch from the Chief of Station in Habana, Cuba, transmits a memorandum from Arthur G. Vaivada to Headquarters, requesting reassignment from his post in Cuba by June 1958. Vaivada, who has been working on communist targets within the University of Habana since 1954, expressed an interest in assignment under unofficial cover in Spain, while also indicating willingness to serve in other locations outside the Central America-Caribbean area. The dispatch highlights Vaivada's successful navigation of difficult situations during his three-year tour, recommending his reassignment request be given consideration.",
  "tags": [
    "CIA",
    "Reassignment",
    "Arthur G. Vaivada",
    "Habana",
    "Cuba",
    "Covert Operations",
    "PEPRIME",
    "Student Cover",
    "Journalism Cover",
    "Business Cover"
  ],
  "title": "Reassignment - Arthur G. Vaivada",
  "date": "1957-11-07",
  "locations_mentioned": [
    "Habana, Cuba",
    "Spain",
    "Central America",
    "Caribbean",
    "Argentina",
    "Chile",
    "South America"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Arthur G. Vaivada",
    "James R. Palinger"
  ],
  "recipient": "Chief, WHD",
  "sender": "Chief of Station, Habana"
}