{
  "classification": "Personnel",
  "document_type": "Memorandum and Personnel Actions",
  "security": "The documents contain internal personnel actions, including reassignments, promotions, and delegation of authority. Disclosing the specific organizational units (e.g., DDO/CI Staff, Research and Analysis Group, External Research Branch) and positions held by Lee H. Wigren (e.g., Operations Officer) could reveal sensitive information about CIA's structure and operational focus. Additionally, revealing details of retirement planning assistance could expose the Agency's practices for managing its personnel. Specific position titles and organizational details should be protected.",
  "security_level": "SECRET/CONFIDENTIAL",
  "summary": "This file contains personnel actions and a memorandum related to Lee H. Wigren, including his reassignments, promotion, delegation of authority, and retirement planning information from 1950 to 1978.",
  "summary_one_paragraph": "This collection of documents pertains to Lee H. Wigren's career within the CIA from 1950 to 1978, encompassing personnel actions such as reassignments and a promotion within the DDO/CI Staff's Research and Analysis Group, alongside delegation of NSCA authority. It also includes a memorandum from B. DeFelice, Acting Director of Personnel, outlining retirement planning services offered by the Agency, like pre-retirement counseling and information seminars, intended to facilitate Wigren's transition to retirement.",
  "tags": [
    "Personnel File",
    "Lee H. Wigren",
    "Reassignment",
    "Promotion",
    "Retirement Planning",
    "Career Service",
    "DDO/CI Staff",
    "Research and Analysis Group"
  ],
  "title": "WIGREN, Lee H.",
  "date": "1978-01-12",
  "locations_mentioned": [
    "Washington, D.C."
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Lee H. Wigren",
    "B. DeFelice",
    "D. McCallum",
    "Raymond Rocca",
    "William Decker",
    "William Donnelly",
    "John Bogart",
    "Joseph Flaherty",
    "Robert Thomas",
    "Paul Johnson",
    "William E. Nelson",
    "W. J. Forkas"
  ],
  "recipient": "Lee H. Wigren",
  "sender": "B. DeFelice, Acting Director of Personnel"
}