{
  "classification": "Operations",
  "document_type": "Memorandum",
  "security": "The memo details covert activities, including contact with an agent (MPTROIKA-7), infiltration of a pro-Mao study group, and participation in a women's tour potentially meeting with a DRV delegation. It mentions JBMINIMUM testing and training, revealing psychological assessment methods. Disclosing these activities could compromise ongoing operations, expose intelligence sources, and reveal sensitive operational techniques. For example: \"Acting on a suggestion proposed by Mr. Jason Horn, CI/SO, the undersigned raised the subject of the Women's Tour...with (M) 7 and instructed her to attempt to determine the interest in, and likely composition of, the New York group and explore the possibility of joining such a group.\" and \"(M7 was notified of the change in the tax assessment and of the adjustments in her salary due to the legislative pay increase and the withholding of premiums for hospitaliza-\"",
  "security_level": "SECRET",
  "summary": "A memo from William E. Gavaghen of CI/SO details recent meetings with agent MPTROIKA-7, covering her operational activities including infiltrating a pro-Mao study group, enrolling in courses at the New School, and exploring participation in a women's tour to Europe. It also covers administrative matters such as salary advances, tax adjustments, and plans for her assignment to Bangkok.",
  "summary_one_paragraph": "William E. Gavaghen (FE/OPS) authored this memorandum detailing meetings with the agent MPTROIKA-7 in February 1972, covering various operational activities and administrative tasks. MPTROIKA-7 infiltrated a USCFA study group led by Mrs. Susan Warren, enrolled in courses at the New School for Social Research, and considered joining a women's tour to Europe, potentially meeting with the DRV peace delegation. The memo also discusses MPTROIKA-7's participation as a staff member for the New York University Students Mobilization Committee's newsletter (SEAR), undergoing JBMINIMUM testing and training, receiving salary and operational advances, and plans for her assignment to Bangkok.",
  "tags": [
    "CIA",
    "MPTROIKA-7",
    "USCFA",
    "New School for Social Research",
    "Ramparts' Tours",
    "SEAR",
    "JBMINIMUM",
    "Bangkok",
    "Covert Operations",
    "CI/SO",
    "DRV delegation"
  ],
  "title": "CI/SO Summary on: Contact Report with (MP)TROIKA-7",
  "date": "1972-03-01",
  "locations_mentioned": [
    "New York City",
    "Virginia",
    "London",
    "Paris",
    "Rome",
    "Bangkok"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "MPTROIKA-7",
    "Susan Warren (aka Frank)",
    "Andy Ness",
    "Jason Horn",
    "DeMarco",
    "Saunders",
    "Julie",
    "Flitcroft",
    "Cornish",
    "William E. Gavaghen"
  ],
  "recipient": "Officer designations",
  "sender": "C/CI/SO Robert"
}