{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "Several messages discuss AMBIDDY-1's (Manuel Artime's) potential involvement in arms dealings and contacts with various individuals and organizations. Disclosing these activities could compromise ongoing operations and relationships with foreign entities. For instance, the cable from Mexico City discusses LISASSY-1's efforts to facilitate a meeting between Cuban exiles and Fidel Castro, which could be jeopardized if revealed. Quoting directly: '...REQUEST AGENT CONTACT PANAMANIAN CONSUL MIAMI TO SEE IF SHE KNOWS WHAT ALEMAN WANTED...IT NOT IMPOSSIBLE HE SEEKING CONTRACT CUBAN EXILE STRONG ARM TYPES...'",
  "security_level": "SECRET",
  "summary": "This collection of cables and documents primarily concerns Manuel Artime (AMBIDDY-1), his activities, contacts, and potential involvement in arms dealings and political maneuverings, particularly related to Cuba, Central America, and Haiti, spanning from the 1960s to the early 1970s.",
  "summary_one_paragraph": "This collection of documents, spanning from the 1960s to the early 1970s, primarily focuses on the activities and contacts of Manuel Artime (cryptonym AMBIDDY-1), a key figure involved in Cuban exile operations. The records include cables detailing his potential involvement in arms deals with El Salvador and Honduras, his contacts with Haitian officials, and his role as a liaison between various political figures. Concerns are raised about Artime's potential double-dealing, his relationships with individuals of interest, and the security risks associated with his activities, leading to requests for ongoing monitoring and debriefing.",
  "tags": [
    "Manuel Artime",
    "AMBIDDY-1",
    "Cuba",
    "Arms Dealing",
    "Central America",
    "Haiti",
    "CIA",
    "Political Maneuvering",
    "FOIA",
    "JFK Assassination Records Act"
  ],
  "title": "Various cables and documents regarding Manuel Artime (AMBIDDY-1) activities and contacts",
  "date": "1960-03-21",
  "locations_mentioned": [
    "Moron, Cuba",
    "Camaguey, Cuba",
    "Miami, Florida",
    "San Salvador",
    "Tegucigalpa",
    "Managua",
    "Port Au Prince",
    "Mexico City",
    "Madrid",
    "Frankfurt",
    "East Berlin",
    "West Berlin",
    "Paris",
    "Honduras",
    "Spain",
    "Belgium",
    "Portugal",
    "Haiti"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Manuel Francisco Artime Buesa",
    "Nigel P. Yasuinas",
    "Ruben Martinez",
    "David Samudio",
    "Alfredo Aleman Junior",
    "Fidel Castro",
    "Enrique Huertas",
    "Blanca Robles",
    "Eugene Maximillian",
    "Duvalier",
    "Somoza",
    "Humberto Rodezno",
    "Ricardo Zuniga",
    "Rafael Garcia",
    "Alfredo Aleman Junior",
    "Lisassy"
  ],
  "recipient": "WH/MIAMI, DIRECTOR, G Al McWade, JOHN M. BURKE",
  "sender": "CI/OA, WILLIAM V. BROE, Robert C. Yoney"
}