{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Memorandum",
  "security": "These documents reveal details of an internal CIA investigation into E. Howard Hunt's activities, potentially exposing operational methods and internal discussions. References to specific individuals, such as Helms and Karamessines, and details of financial transactions could compromise covert activities. The memorandum from the Office of Finance explicitly suggests questioning Karamessines and approaching Chase Manhattan Bank for account details, which if exposed, would highlight CIA's methods of financial tracking and could damage relationships with financial institutions. Quoting directly from one document, it states, 'Therefore, it is suggested that Mr. Karamessines be questioned as to a project or projects to which. Mr. Hunt's operational expenditures if incurred would have been charged.' This could expose sensitive operational details if revealed.",
  "security_level": "SECRET",
  "summary": "This collection of memoranda details investigations into E. Howard Hunt's activities, particularly his assignment to Madrid in the mid-1960s, focusing on financial transactions, operational roles, and connections to Watergate-related events.",
  "summary_one_paragraph": "These memoranda from 1973 and 1974 document efforts to investigate E. Howard Hunt's activities, with a significant focus on his time in Madrid during the mid-1960s. The documents include inquiries into financial records by the Office of Finance, interviews with CIA personnel such as Fig Coleman, Edward Ryan, Sam Halpern, and Frank O'Malley, as well as attempts to reconstruct Hunt’s operational assignments and financial transactions. The investigations seek to uncover details about Hunt's role, funding, and any unusual financial activities during his assignment, and explore his connections to individuals and events relevant to the Watergate scandal.",
  "tags": [
    "E. Howard Hunt",
    "CIA",
    "Watergate",
    "Madrid",
    "Investigation",
    "Finance",
    "Karamessines",
    "Helms",
    "FOIA"
  ],
  "title": "E. Howard Hunt Investigation",
  "date": "1973-12-20",
  "locations_mentioned": [
    "Madrid, Spain",
    "Paris, France",
    "Washington, D.C.",
    "Las Vegas, Nevada",
    "Falls Church, Virginia",
    "New York"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "E. Howard Hunt",
    "Paul Burns",
    "Barry Goldwater",
    "Stan Gaines",
    "Fig Coleman",
    "Thomas Karamessines",
    "Richard Helms",
    "Senator Baker",
    "S. D. Breckinridge",
    "Robert E. Owen",
    "Thomas B. Yale",
    "Jim Noel",
    "Stanley J. Woodward",
    "Bill Ryan",
    "Tad Szulc",
    "Edward Ryan",
    "Frederick N. Evans",
    "Lawrence J. Howe",
    "Robert Vesco",
    "John Oliver",
    "Richard Ouderkirk",
    "Sam Halpern",
    "Desmond FitzGerald",
    "Evan Parker",
    "Frank A. O'Malley",
    "Robert R. Mullen",
    "L. K. White",
    "Walter Brayden",
    "Martha Mitchell",
    "McCord",
    "William Shea",
    "Teresa Shea",
    "Thomas C. Amato",
    "Steven L. Kuhn",
    "William Caufield",
    "Joseph Hudson",
    "Quinn",
    "Harold L. Brownman",
    "F. Reid Buckley",
    "Davis Powell"
  ],
  "recipient": "Inspector General",
  "sender": "S. D. Breckinridge (Various Offices)"
}