{
  "classification": "Cuba",
  "document_type": "Memorandum for the Record/Classified Message",
  "security": "This document discusses the potential assassination of Eduardo Ojeda Camaraza and Fidel Castro, involving intelligence operations and agents, which could be highly sensitive and damaging if revealed. Specifically, the message states 'AMRUNG/AMYUM may arrange to kill (OJEDA) as he was either very untrustworthy or positive CASTRO penetration/provocateur' and references 'plans for invasion within 30 days after killing Fidel.'",
  "security_level": "SECRET",
  "summary": "A memorandum summarizing support activities for infiltration forces in 1960-61, including information on potential threats and plans related to individuals associated with AMYUM/AMRUNG and a possible invasion scenario after the assassination of Fidel Castro.",
  "summary_one_paragraph": "This memorandum for the record summarizes support activities for the training and supply of infiltration forces in 1960-61, referencing files related to the JMARC Program. It details incidents such as a report from Manuel Artime's deputy about Eduardo Ojeda Camaraza potentially being killed by AMRUNG/AMYUM due to trustworthiness concerns or Castro penetration, and a radio message about an Italian Embassy functionary named Moratori claiming knowledge of invasion plans after Castro's assassination, which was dismissed as untrue. The memo includes attachments by Chris Hopkins and researcher Martin Miller.",
  "tags": [
    "JMARC Program",
    "AMBIDDY-1",
    "AMYUM/AMRUNG",
    "Eduardo Ojeda Camaraza",
    "Fidel Castro",
    "Invasion Plans",
    "Moratori",
    "Infiltration Forces",
    "Cuba",
    "Assassination Plot"
  ],
  "title": "JMARC Program",
  "date": "1977-02",
  "locations_mentioned": [
    "Havana",
    "Cuba",
    "Guatemala"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Manuel Artime (AMBIDDY-1)",
    "Eduardo Ojeda Camaraza",
    "Fidel Castro",
    "Moratori",
    "Martin Elena"
  ],
  "recipient": "LAD/JFK Task Force",
  "sender": "Chris Hopkins (Attachments), Martin Miller (Researcher)"
}