{
  "classification": "Personnel",
  "document_type": "Cable",
  "security": "Revealing Ref IDEN’s identity would jeopardize his safety and well-being, given his age, health, and prominent position in Vienna. The cable states, “SUBJ PROMINENT IN LOCAL MUSIC CIRCLES, RADIO, TV, AND POLITICS AND MILITARY, GREAT SCANDAL POTENTIAL” and “SUBJ WOULD BE ENDANGERED BY ISLAMIC GROUPS HERE WHO HAVE *<ASSASSINATED>SEVERAL INCL ONE CITY COUNCILMAN. EMBASSY GETS THREATENING PHONE CALLS.” Exposing him would also reveal operational details, as highlighted: “SUBJ ALSO ENDANGERED BY FORMER NAZI ASSASSIN AND INTEL SWI NDLER HE INTERROGATED AND BROKE 25 YEARS AGO, PROMISING HIM SECRECY; BUT US ARMY PUT OUT BURN NOTICE, FORCING NAZI TO MOVE TO GERMANY.” The disclosure also risks exposing methods of maintaining cover, as indicated by “USING RETIRED STATE COVER ON SWORN AUSTRIAN FORMS THUS COMMITTING PERJURY TWICE BY AUSTRIAN LAW.”",
  "security_level": "SECRET",
  "summary": "A cable regarding the Records Collection Act in which Noblehorse (REF IDEN) vehemently objects to the revelation of his name, citing personal safety concerns, legal repercussions for past actions, and potential damage to his established life in Vienna.",
  "summary_one_paragraph": "This cable, dated November 17, 1995, details Noblehorse's (REF IDEN) strong objection to the release of his name under the Records Collection Act. He articulates concerns, including potential prosecution for perjury under Austrian law due to using a retired state cover during his immigration, his prominence in Viennese musical and political circles making him a target, and threats from Islamic terrorists and a former Nazi assassin he interrogated. Furthermore, REF IDEN expresses concerns about the financial and logistical challenges of relocating from his Vienna apartment, given his age (75) and poor health following a stroke, and his belief that the law is dishonorable.",
  "tags": [
    "Noblehorse",
    "REF IDEN",
    "Records Collection Act",
    "Vienna",
    "Austria",
    "Perjury",
    "Security Concerns",
    "WNINTEL"
  ],
  "title": "RESPONSE FOR RECORDS COLLECTION ACT",
  "persons_mentioned": [
    "Noblehorse",
    "Bert Mills",
    "Cord Meyer",
    "Dick Helms",
    "Tom Karamessinis",
    "Angleton"
  ],
  "recipient": "Director",
  "sender": "Staff (Vienna)"
}