{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "The document contains raw intelligence and names individuals suspected of involvement in clandestine activities, which, if exposed, could compromise intelligence sources and methods, endanger individuals, and disrupt ongoing operations. For example, it mentions, \"Cuban Communist penetration agents in all branches of importance of the U.S. Government\" and identifies specific individuals suspected of Castro affiliations: \"Federico Claramont...is a suspected member of Castro's G-2\" and \"Captain(Lieutenant, known formerly as) Ernesto Despain...is definitely strongly suspected of giving everything of Intelligence to Castro\".",
  "security_level": "SECRET",
  "summary": "This memorandum discusses the AMBRUSH organization, a Revolutionary Council Anti-Castro Security and Counter-Intelligence Team, detailing findings, potential leads, and information obtained from various sources regarding Cuban activities and possible penetration into U.S. government agencies and anti-Castro groups.",
  "summary_one_paragraph": "The memorandum summarizes findings related to the AMBRUSH organization, a Revolutionary Council Anti-Castro Security and Counter-Intelligence Team, noting a lack of direct findings relevant to the original terms of reference but highlighting a document from August 1961 mentioning potential Cuban Communist penetration agents within the U.S. Government and the Revolutionary Democratic Front (FRD). It includes detailed reports from various sources in Miami and Cuba, implicating individuals like Federico Claramont and Captain Ernesto Despain as potential Castro agents, discussing the alleged infiltration of G-2 women into the U.S., and relaying concerns about internal corruption and intelligence leaks within the anti-Castro movement, as well as potential threats to U.S. security.",
  "tags": [
    "AMBRUSH",
    "Anti-Castro",
    "Cuba",
    "Counter-Intelligence",
    "Cuban Penetration",
    "G-2",
    "FRD",
    "JMWAVE",
    "Eugenio Martinez",
    "Watergate",
    "Miami",
    "Espionage"
  ],
  "title": "AMBRUSH Organization",
  "date": "1961-04 to 1962-01",
  "locations_mentioned": [
    "Cuba",
    "Miami",
    "Washington D.C.",
    "Mexico",
    "Prague",
    "New York",
    "Costa Rica",
    "Havana",
    "Switzerland"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Barbara Boyle",
    "Eugenio Martinez",
    "Armando Munero",
    "Jacinto Luzarraga",
    "Lino Fernandez",
    "Antonio Valdes Rodriguez",
    "Ben Volpe",
    "Federico Claramont",
    "Guillermo Rojas",
    "Fidel Castro",
    "Kruschev",
    "Juez Garceran",
    "Carlos Prio",
    "Alberto Del Junco",
    "Oscar Diaz",
    "Urrutia",
    "Machado",
    "Captain Despain",
    "Jose Julio Fernandez",
    "Ceferino Alvarez",
    "Josefina Socarras",
    "Frank Arias",
    "Alberto Iglesias",
    "Mario Garcia",
    "Emanuel Carvajal",
    "Eduardo Odio",
    "Armando Morales",
    "Paula Grau",
    "Pepe Aguero"
  ]
}