{
  "classification": "Commission",
  "document_type": "Memo",
  "security": "Disclosing that Alledda Massing was an Agency contract agent and the details surrounding her pseudonym, Marie L. PRISBECK, could expose her previous intelligence activities and any current cover arrangements. The memo states, 'CCS files contain information on a Marie L. PRISBECK, a pseudonym officially assigned to Alledda Massing...who was an Agency contract agent from 1956 until her retirement in 1975. The information is contained in approximately 60 documents, virtually all of which concern the establishment and maintenance of cover.'",
  "security_level": "SECRET",
  "summary": "A memorandum from M. L. Latta of the Central Cover Staff (CCS) to the DDO/ISS/IP/LIS, responding to a request from the House Select Committee on Assassinations (HSCA) regarding information on individuals, confirming CCS files contain information only on Alledda Massing (pseudonym Marie L. PRISBECK).",
  "summary_one_paragraph": "This SECRET memorandum, dated 18 July 1978, is a response from M. L. Latta of the Central Cover Staff (CCS) to the DDO/ISS/IP/LIS regarding a request from the House Select Committee on Assassinations (HSCA). Latta confirms that CCS files contain information pertaining to Marie L. PRISBECK, a pseudonym for Alledda Massing, who was a U.S. citizen and Agency contract agent from 1956 until her retirement in 1975. The memo notes that this information is predominantly related to the establishment and maintenance of her cover, and that CCS files contain no information on the other individuals the HSCA inquired about.",
  "tags": [
    "HSCA",
    "Central Cover Staff",
    "Alledda Massing",
    "Marie L. PRISBECK",
    "Pseudonym",
    "Covert Operations",
    "FOIA"
  ],
  "title": "House Select Committee on Assassinations (HSCA) Request",
  "date": "1978-07-18",
  "origin_agency": "CIA",
  "persons_mentioned": [
    "M. L. Latta",
    "Alledda Massing",
    "Marie L. PRISBECK"
  ],
  "recipient": "DDO/ISS/IP/LIS",
  "sender": "M. L. Latta, Plans and Review Group, Central Cover Staff"
}