{
  "classification": "Personnel",
  "document_type": "Memorandum",
  "security": "Disclosing Piccolo's real employer as CIA and his nominal state cover in Mexico could compromise sensitive operations and expose methods of maintaining cover. \"Mr. Piccolo was instructed to indicate his employer for the entire period as CIA, 2430 E Street, N. W., Washington 25, D. C.\" Revealing his forwarding address could also pose a security risk.",
  "security_level": "SECRET",
  "summary": "A memo details the cover debriefing of Joseph S. Piccolo, a CIA employee resigning on 4 October 1961, outlining instructions for maintaining cover regarding his employment and travel history.",
  "summary_one_paragraph": "This memorandum, dated 28 September 1961, outlines the cover debriefing instructions for Joseph S. Piccolo (GS-7), who is resigning from the CIA on 4 October 1961. The memo, sent from C. T. Dolla to the Chief of Records and Services Division, details that Piccolo used nominal state cover in Mexico from 1 November 1957 to 14 January 1960, and subsequently nominal Department of the Army cover at Headquarters from 15 January 1961. Instructions are provided for Piccolo to identify his employer as the CIA at 2430 E Street, N.W., Washington, D.C., and to obscure the specifics of his cover assignment when discussing his travels. His forwarding address and new employment at the 121st Tactical Fighter Sq., Andrews AFB, are also noted for inclusion in his personnel and security files.",
  "tags": [
    "CIA",
    "Cover Debriefing",
    "Joseph S. Piccolo",
    "Personnel",
    "Mexico",
    "Cover Story"
  ],
  "title": "PICCOLO, Joseph S. - Cover Debriefing",
  "date": "1961-09-28",
  "locations_mentioned": [
    "Mexico",
    "Washington, D.C.",
    "Ft. Lauderdale, Florida",
    "Andrews AFB"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Joseph S. Piccolo",
    "Robert C. Swendimen",
    "C. T. Dolla",
    "Robert E. Young"
  ],
  "recipient": "Chief, Records and Services Division, Office of Personnel",
  "sender": "C. T. Dolla (Chief, Military Cover Branch, CCG)"
}