{
  "classification": "Cuba",
  "document_type": "File",
  "security": "This file details CIA operations related to Cuban exiles, anti-Castro activities, and potential plots against foreign governments. Revealing these operations could compromise ongoing intelligence activities, expose sources and methods, and strain relationships with foreign governments. Direct quotes include: \"During August-September-October 1964 picket lines were formed in front of the airline companies that had flights to Mexico...\" and \"In November 1964 we began to pass information to the 'friends' about the training camps which were being opened in New Jersey...\"",
  "security_level": "SECRET",
  "summary": "This file contains documents related to Rolando Masferrer Rojas, Cuban exile activities, and CIA operations from 1964-1965, including plots against Haiti and Cuba.",
  "summary_one_paragraph": "This file, reviewed by the House Select Committee on Assassinations, contains documents related to Rolando Masferrer Rojas, covering the period from January 1964 through December 1965. The documents detail CIA activities involving Cuban exiles, including the infiltration of exile groups, propaganda campaigns, and support for anti-Castro activities. It also includes information on plots to invade Haiti and harass Cuba, involving individuals like Leon Cantave and groups like FACCE. The file also contains information on Masferrer's contacts with Averell Clark and Stanley Ross of El Tiempo newspaper.",
  "tags": [
    "Rolando Masferrer Rojas",
    "Cuban Exiles",
    "CIA",
    "Haiti",
    "Cuba",
    "Anti-Castro",
    "FACCE",
    "Averell Clark",
    "El Tiempo",
    "Propaganda",
    "Infiltration",
    "Plots",
    "FOIA"
  ],
  "title": "MASFERRER Y ROJAS, ROLANDO",
  "date": "1965",
  "locations_mentioned": [
    "Cuba",
    "Haiti",
    "Dominican Republic",
    "Miami",
    "New York",
    "New Jersey",
    "Mexico",
    "Venezuela",
    "Puerto Rico"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Rolando Masferrer Rojas",
    "Leon Cantave",
    "Antonio Rojas Masferrer",
    "Homero Leon Fernandez",
    "Averell Clark",
    "Stanley Ross",
    "Juanita Castro",
    "López Mateos",
    "Charles Forben",
    "François Duvalier",
    "Miguel Taberno Blas",
    "Aurea Esther Poggio Aragon"
  ],
  "recipient": "ACTION BRANCH",
  "sender": "Chief, DO Division"
}