{
  "classification": "Cuba",
  "document_type": "File",
  "security": "This file contains information about Rolando Masferrer, who was allegedly involved in plotting against the government of President Duvalier in Haiti and had ties to the CIA.  Disclosing these details could reveal past agency operations, sources, and methods.",
  "security_level": "SECRET",
  "summary": "This file contains documents related to Rolando Masferrer, a Cuban exile involved in plotting against the Haitian government and his connections to the CIA, including his trial and alleged recruitment efforts.  The documents span from January 1967 to December 1968 and include information from the FBI and CIA.",
  "summary_one_paragraph": "This file, spanning from January 1967 to December 1968, comprises documents concerning Rolando Masferrer, a Cuban exile linked to plotting against the Haitian government. It contains CIA information reports, FBI documents, and classified messages detailing Masferrer's activities, including alleged recruitment attempts and negotiations related to potential revolutionary movements in Haiti and Costa Rica. Key aspects covered are Masferrer's trial, connections to Ludwig Starke Jimenez, and the CIA's assessment of the trial's impact, with efforts to manage potential exposure of CIA involvement.",
  "tags": [
    "Rolando Masferrer",
    "Cuba",
    "Haiti",
    "CIA",
    "FBI",
    "Duvalier",
    "Plotting",
    "Exile",
    "JM WAVE",
    "Ludwig Starke Jimenez",
    "Costa Rica",
    "Trial",
    "Anti-CIA"
  ],
  "title": "Masferrer, Rolando File",
  "persons_mentioned": [
    "Rolando Masferrer",
    "Ludwig Starke Jimenez",
    "Francois Duvalier",
    "Fernando Melo Fontanills",
    "Diego Madrigal Alvarez",
    "Robert K. Brown",
    "Martin Casey",
    "Ralph Edens",
    "Jim Garrison",
    "Fidel Castro",
    "David Cabeza",
    "Judge Cabot",
    "U.S. Attorney Meadows",
    "NEY Tejeda",
    "Vladimir Secen",
    "Jacques Moringlane",
    "Rodrigo Arauz Bonilla",
    "Aludes Perry Buza"
  ],
  "sender": "CIA Headquarters, JMWAVE, San Jose Station, Director (CIA), OEIC: George Kulstad, V. Broz, David A. Phillips, Jacobra (Station Contact, Possible Code Name), LNYUMA (Possible Code Name), JMWAVE"
}