{
  "classification": "Liaison",
  "document_type": "Memorandum",
  "security": "Disclosing details of liaison conversations (e.g., Wilkinson's comments about Farrow's discussion with Kernov) could compromise the working relationships between intelligence agencies. Additionally, revealing details about individuals like Martin and Mitchell, who are seeking to leave the USSR, could jeopardize their safety.",
  "security_level": "SECRET",
  "summary": "A memorandum regarding William Hamilton Martin and Bernon Ferguson Mitchell, two American defectors in the USSR who are seeking to leave, detailing conversations reported through Canadian liaison channels and the FBI's awareness of the situation.",
  "summary_one_paragraph": "This secret memorandum, addressed to the Director of the National Security Agency, concerns William Hamilton Martin and Bernon Ferguson Mitchell, American defectors in the USSR seeking to leave. It includes a report from Canadian liaison channels regarding a conversation between Canadian professor Dr. Hans Kunov and Martin in Moscow, indicating their desire to leave the USSR and Kunov's subsequent inquiries with the Canadian Embassy on their behalf. The memo also mentions Yuriy Igoryevich Torgov, Kunov's host at the USSR Academy of Sciences Computer Center, and notes that the FBI has received the same information.",
  "tags": [
    "CIA",
    "NSA",
    "William Hamilton Martin",
    "Bernon Ferguson Mitchell",
    "Defectors",
    "USSR",
    "Canadian Liaison",
    "FBI",
    "Hans Kunov",
    "Yuriy Igoryevich Torgov",
    "Emigration",
    "Moscow",
    "Leningrad"
  ],
  "title": "Willian Hamilton Martin and Bernon Ferguson Mitchell",
  "date": "1975-12-12",
  "locations_mentioned": [
    "Moscow",
    "USSR",
    "Canada",
    "Toronto",
    "Ottawa",
    "Leningrad"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "William Hamilton Martin",
    "Bernon Ferguson Mitchell",
    "Hans Kunov",
    "Yuriy Igoryevich Torgov",
    "Benson Buffman",
    "George T. Kalaris",
    "Paul L. Rinaldo",
    "Louise O'Connor",
    "James Wilkinson",
    "Geoffrey Farrow",
    "Harry Brandes",
    "E.R.J. Miller",
    "Leonid Brezhnev",
    "Stalin"
  ],
  "recipient": "Director, National Security Agency",
  "sender": "George T. Kalaris"
}