{
  "classification": "Operations",
  "document_type": "Classified Message Collection",
  "security": "Several messages discuss the recruitment, assessment, and potential deployment of agents into the USSR, including operational details and cover stories. For example, messages detail the coordination of meetings, travel arrangements, and secure housing for 'AEASPIC' and other candidates. Disclosing these communications could reveal operational methods, agent identities, and planned clandestine activities. Quoting directly: '...will be dispatched on black mission into the USSR as member of a REDSCI team...' and '...keeping him safehouse awkward but possible if not prolonged and also not riskless.'",
  "security_level": "SECRET",
  "summary": "This collection of classified messages from 1959 pertains to the CIA's recruitment, assessment, and planned deployment of agents for operations, potentially within the USSR (REDSOX/REDSCI operations), involving individuals cryptonymed AEASPIC, ARMUTHEO, and ARSATCHEL.",
  "summary_one_paragraph": "This collection of classified messages, primarily from March 1959, centers on CIA activities related to the selection, assessment, and preparation of agents for potential deployment in clandestine operations. Key figures and operations mentioned include AEASPIC, a candidate being considered for REDSOX (a potential black mission into the USSR), along with ARMUTHEO and ARSATCHEL as other potential candidates. The messages detail travel arrangements, secure housing considerations, interviews, medical evaluations, and the coordination between CIA stations in Frankfurt and Paris, along with Headquarters, regarding these operations. Discussions also involve managing contact with potential agents, handling administrative issues, and ensuring controlled conditions for interrogations and training.",
  "tags": [
    "CIA",
    "Classified Messages",
    "Recruitment",
    "Assessment",
    "Agent Deployment",
    "USSR",
    "REDSOX",
    "REDSCI",
    "AEASPIC",
    "ARMUTHEO",
    "ARSATCHEL",
    "LCFLUTTER",
    "FRIGANZA",
    "Travel Arrangements",
    "Secure Housing",
    "Black Mission",
    "FOIA",
    "JFK Assassination"
  ],
  "title": "WIROGUE - Collection of Classified Messages Regarding Agent Recruitment and Deployment",
  "date": "1959-03-27",
  "locations_mentioned": [
    "Paris",
    "Frankfurt",
    "USSR",
    "Germany",
    "Ambert",
    "United States"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "AEASPIC (David TZITZICHVILI)",
    "Annick",
    "Rostedt",
    "Friganza",
    "Paul Belkin",
    "David",
    "Zubin",
    "Francis M. Bankshire",
    "Anthony H. Priganza",
    "Brewer",
    "George A. Fill",
    "Michael Rae",
    "Cookeny"
  ],
  "recipient": "Director, CIA",
  "sender": "Paris, Frankfurt"
}