{
  "classification": "Mexico",
  "document_type": "Cable",
  "security": "Revealing the intention to avoid KUBARK involvement and develop ABREU GOMEZ for PERUKEN operations exposes sensitive operational methods and potential recruitment targets. Specifically, the line 'ODCOIL MEXI SHOULD BE GIVEN LEAD ON MILTON LYWN, AVOIDING KUBARK INVOLVEMENT THIS CASE' and 'INFORMAL DISCUSSIONS WITH ABREU GOMEZ ON LYNN CASE AND POSSIBLY LATER INTRODUCTION TO ODCOIL AGENT MAY PROVIDE OPPORTUNITY POR ASSESSMENT AND DEVELOPING RAPORT' outline a clandestine approach to intelligence gathering and agent recruitment, which could damage the CIA's relationships if exposed.",
  "security_level": "UNCLASSIFIED",
  "summary": "A cable discussing the handling of Milton Lywn's case, suggesting ODCOIL MEXI take the lead to avoid KUBARK involvement, and proposing the development of Ernesto Abreu Gomez for PERUKEN operations through informal discussions and agent introduction.",
  "summary_one_paragraph": "This cable, dated November 6, outlines a strategy for handling the Milton Lywn case by having ODCOIL MEXI take the lead to avoid KUBARK involvement. The cable suggests that Ernesto Abreu Gomez be considered a target for PERUKEN operations and proposes using informal discussions about the Lywn case, followed by an introduction to an ODCOIL agent, as an opportunity to assess and develop a rapport with Abreu Gomez. The WH COMMENT notes that a U.S. citizen reported a drugs case to the Merida police chief, who suggested U.S. agent involvement and wished to develop Chief ABREU for PEROMEN operations.",
  "tags": [
    "CIA",
    "KUBARK",
    "PERUKEN",
    "ODCOIL",
    "Milton Lywn",
    "Ernesto Abreu Gomez",
    "Mexico",
    "Recruitment",
    "Drugs Case"
  ],
  "title": "KAPOK PBRUMEN",
  "date": "1963-11-06",
  "locations_mentioned": [
    "Mexico City",
    "Merida"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Milton Lywn",
    "Ernesto Abreu Gomez"
  ],
  "recipient": "CEF, ADDP, C/CI, C/SAS S, VR Y",
  "sender": "DIR"
}