{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Revealing contacts between LING and individuals associated with the Cuban government could expose intelligence-gathering methods and compromise relationships with foreign services. Quoting directly: \"LING was contacted in late August 1960 in Santa Maria, the Azores, by Eloy GUTIERREZ Manoyo, a Cuban National, and Rafael probably Rafael HERNANDEZ, a Cuban diplomat. In 1958 and 1959, GUTIERREZ was reliably reported...to have been a military supporter of Fidel CASTRO's revolution and to be employed by CASTRO possibly as a G-2 agent.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This memo provides information about Lindsey LING's contact with Cuban nationals, including a potential G-2 agent, and Heinz Theodor WEINER's activities, including a suspicion of espionage.",
  "summary_one_paragraph": "A memo dated March 2, 1961, from the Deputy Director, Plans to the Director of Special Investigations and the Inspector General, USAF, provides information on Lindsey LING and Heinz Theodor WEINER, based on a telephone request on February 24, 1961. It details LING's contact in August 1960 with Eloy GUTIERREZ Manoyo, a Cuban national believed to be a military supporter and possibly a G-2 agent for Fidel Castro, and Rafael HERNANDEZ, a Cuban diplomat, in Santa Maria, Azores. The memo further notes that WEINER, who represented a clothing firm, was reportedly arrested in the Azores in December 1958 on suspicion of espionage and was reportedly in Bermuda as of September 1960, where LING intended to set up another restaurant.",
  "tags": [
    "Lindsey LING",
    "Heinz Theodor WEINER",
    "Eloy GUTIERREZ Manoyo",
    "Rafael HERNANDEZ",
    "Fidel Castro",
    "Espionage",
    "Cuba",
    "Azores",
    "Madrid",
    "Bermuda"
  ],
  "title": "LING Lindsey, WEINER Heinz Theodor",
  "date": "1961-03-02",
  "locations_mentioned": [
    "Santa Maria, Azores",
    "Madrid, Spain",
    "Bermuda"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Lindsey LING",
    "Heinz Theodor WEINER",
    "Eloy GUTIERREZ Manoyo",
    "Rafael HERNANDEZ",
    "Fidel Castro",
    "Gilbert K. Levy",
    "Major Malone"
  ],
  "recipient": "Director of Special Investigations, Inspector General, USAF",
  "sender": "Deputy Director, Plans"
}