{
  "classification": "Oswald, Security, Liaison, Personnel",
  "document_type": "Memo",
  "security": "Disclosing details about security approvals and liaison contacts could compromise sources and methods. Revealing that Samuel Wise was considered for CIA employment but disapproved due to associations with individuals of questionable loyalty, and further that Scarsdale High School was investigated for Communist influence, could be used to generate controversy and undermine public trust. 'WISE was an applicant for CIA employment in early 1953 and was security approved subject to polygraph...WISE was granted a CSA to permit his use as a contract employee on AEACTIVE...MUNSELL was Security disapproved for CIA employment in June 1952 because of his close association...with persons of questionable loyality.'",
  "security_level": "SECRET",
  "summary": "A memo from M.D. Stevens details information related to Lee Harvey Oswald, Abram Chayes, and Samuel Wise, including Chayes' security clearance for liaison contact regarding NSC 5412/2 matters and Wise's past connections to CIA employment and security concerns.",
  "summary_one_paragraph": "This memorandum, dated January 29, 1964, from M. D. Stevens to the files, concerns the Lee Harvey Oswald case, referencing a newspaper column alleging that Abram Chayes and Llewellyn Thompson were responsible for Oswald's return to the U.S. from the Soviet Union. The memo details Abram Chayes' security approval for liaison contact with J. Foster Collins regarding NSC 5412/2 matters and mentions a White House namecheck request on Chayes' wife. Additionally, it explores Samuel Wise's potential past involvement with the CIA, his connection to AEACTIVE, his acquaintance with William Orville Munsell (who was denied CIA employment due to questionable associations), and Wise’s attendance at Scarsdale High School during a period of alleged Communist influence.",
  "tags": [
    "Lee Harvey Oswald",
    "Abram Chayes",
    "Samuel Wise",
    "Security Clearance",
    "CIA Employment",
    "AEACTIVE",
    "Communism",
    "NSC 5412/2",
    "Liaison Contact",
    "FOIA"
  ],
  "title": "THE LEE HARVEY OSWALD CASE #351164",
  "date": "1964-01-29",
  "locations_mentioned": [
    "Chicago",
    "Soviet Union",
    "Moscow",
    "New York City",
    "Washington, D.C.",
    "Columbia University",
    "Scarsdale, New York",
    "Denver University",
    "Dhahran, Saudi Arabia",
    "Germany"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Lee Harvey Oswald",
    "Abram Chayes",
    "Llewellyn Thompson",
    "Samuel Wise",
    "J. Foster Collins",
    "Archibald Roosevelt, Jr.",
    "Francis E. Walter",
    "Chester Bowles",
    "Samuel Griffin Wise Jr.",
    "Bruce Frederick Davis",
    "William Orville Munsell",
    "Antonia (Toni) Leigh Chayes"
  ],
  "recipient": "Files",
  "sender": "M. D. Stevens"
}