{
  "classification": "Cuba, Mexico, Operations",
  "document_type": "Dispatch, Telegram Information Report",
  "security": "This document reveals the CIA's clandestine operations and monitoring activities related to Cuban and Guatemalan affairs in the 1960s. Specifically, it outlines the identification and assessment of DGI personnel within the Cuban Mission to the UN, as well as details regarding support for guerrilla groups in Guatemala. Sharing this information could expose intelligence sources and methods, compromising ongoing operations and endangering individuals involved. For example, the document states: \"Addressces will note the preponderance of DGI personnel on the CMUN roster\" and \"The main hope of the PGT now hinges on the actions of the guerrilla group organized and armed in Mexico.\"",
  "security_level": "SECRET",
  "summary": "The document consists of a dispatch from the Chief of Base, New York, providing an analysis of the Cuban UN Mission and DGI Center in New York, along with a telegram detailing the views of the Guatemalan Communist Party (PGT) on the political situation in Guatemala and Cuban involvement. It identifies DGI personnel within the Cuban Mission and discusses the PGT's reliance on guerrilla groups in Mexico.",
  "summary_one_paragraph": "This document comprises two parts: a dispatch from the Chief of Base in New York providing a current analysis of the Cuban UN Mission and DGI Center as of April 1970, and a telegram detailing a 1962 report on the Guatemalan Communist Party's (PGT) views on the political situation in Guatemala. The dispatch identifies DGI personnel within the Cuban Mission, noting the impending departures of some members and the potential impact on the Center's operational capabilities. The telegram relays information from a source in Mexico regarding the PGT's regrets about the guerrilla fight's development in Guatemala and their reliance on a guerrilla group organized and armed in Mexico, with reported Cuban support.",
  "tags": [
    "CIA",
    "DGI",
    "Cuban Mission to the UN",
    "Guatemala",
    "PGT",
    "Guerrilla Warfare",
    "Mexico",
    "LNERCO",
    "TYPIC/AMROSE/DONOPS"
  ],
  "title": "TYPIC/AMROSE/DONOPS: Current Analysis of Cuban UN Mission and DGI Center in New York; PGT Views on the Political Situation in Guatemala",
  "date": "1970-04-13",
  "locations_mentioned": [
    "New York",
    "Cuba",
    "Guatemala",
    "Mexico"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Jose Raul VIERA Linares",
    "Maria BERMUDEZ Garela",
    "Consuelo HORTA Larrinaga",
    "Teresita FERNANDEZ Arango",
    "Orlando PRENDES Gutierrez",
    "Rolando PEREZ Alfonso",
    "Pedro Luis PINERO Eirin",
    "Rogelio RODRIGUEZ Lopez",
    "Orlando PEREIRA Gonzalez",
    "Miguel Manuel SANTANA Fraiz",
    "Justo Cesar GELABERT Martinez",
    "Ruben Rafael FRANCO Gonzalez",
    "Raul REYES Goicochea",
    "Roberto SANTIAGO Humet",
    "Pablo DRAKE Capiro",
    "Rafael CADALSO Bandomo",
    "Jorge REYES Vega",
    "Howard G. Figalan",
    "Ricardo Alarcon Quesada",
    "Victor Manuel Gutierrez",
    "Marco Antonio Yon Sosa",
    "Carlos Paz Tejada",
    "Miguel Ydigoras Fuentes",
    "Rodriguez Lopez",
    "Alfonso Prera"
  ],
  "recipient": "Chief, WH/COG; Chief of Station, WH/MIAMI; Chief, Domestic Operations",
  "sender": "Chief of Base, New York"
}