{
  "classification": "Security",
  "document_type": "Report/Memorandum/Document Transfer",
  "security": "These documents include personal information about Harold Robert Isaacs and his family (dates of birth, addresses, employment history, relatives) and details of investigations into his activities and associations. Releasing this data could violate privacy laws, reveal sources and methods used in investigations, and expose the extent of surveillance on individuals of interest. Mentioned directly in text: 'In 1933 Shanghai authorities listed Subject's wife, Viola ROBINSON, as a suspect Soviet agent residing in Shanghai.'",
  "security_level": "SECRET/CONFIDENTIAL/TOP SECRET",
  "summary": "Collection of documents concerning Harold Robert Isaacs, an American journalist and writer, focusing on his alleged communist affiliations, activities in China, and scrutiny by US intelligence agencies, including the FBI and CIA.",
  "summary_one_paragraph": "This compilation of documents primarily concerns Harold Robert Isaacs, an American journalist and writer, spanning from the 1930s to the 1960s. The documents detail investigations into Isaacs's alleged communist affiliations and activities, particularly during his time in China, including his work with the China Forum and Havas News Agency. They reveal the scrutiny of Isaacs and his family by US intelligence agencies, including the FBI and CIA, which tracked his employment, travels, and associations. The documents include FBI reports, CIA memoranda, and document transfer records cross-referencing Isaacs with other individuals of interest, such as Agnes Smedley and Tillman Durdin.",
  "tags": [
    "Harold Robert Isaacs",
    "FBI",
    "CIA",
    "China",
    "Communism",
    "Surveillance",
    "Internal Security",
    "Agnes Smedley",
    "Tillman Durdin"
  ],
  "title": "Various Reports and Newspaper Clippings Relating to Harold Robert Isaacs",
  "date": "1963-11-27",
  "locations_mentioned": [
    "China",
    "Shanghai",
    "New York City",
    "Washington D.C.",
    "Cambridge, Massachusetts",
    "Honolulu",
    "Philippines",
    "Massachusetts Institute of Technology"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI), CIA",
  "persons_mentioned": [
    "Harold Robert Isaacs",
    "Viola Robinson",
    "Agnes Smedley",
    "Tillman Durdin",
    "John King Fairbank",
    "George Herring",
    "Willi Muenzenberg",
    "Anthon Bm. Comell STEIN",
    "Liu Tsun-Ch'i",
    "Fernando SUGURA",
    "Josephine",
    "Manuel CU!!",
    "Jose LANSCO",
    "William CARTEät, Jr.",
    "Filsdolfo PMLILIO",
    "Father DELANEY",
    "Ricardo WDER"
  ],
  "recipient": "Director, Federal Bureau of Investigation; Assistant Chief of Staff, Intelligence, Department of the Army",
  "sender": "Deputy Director, Plans; Chief of Station, Karachi Luk"
}