{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "Releasing the cryptonym IJDECANTER in document SX-59777 could \"provide an identifiable benefit to the Russian counterintelligence effort\" and \"result in concomitant damage to US counter-intelligence interests.\" The CIA also fears a \"chilling impact on cooperation of current and prospective intelligence sources\" due to the disclosure, which could be viewed as an \"official betrayal of confidence.\"",
  "security_level": "SECRET",
  "summary": "A series of memoranda discuss the CIA's efforts to protect the cryptonym IJDECANTER from release, arguing that its disclosure would benefit Russian counterintelligence and damage U.S. intelligence interests, while also detailing the identification of a source in a related request regarding Lee Harvey Oswald's time in the Soviet Union.",
  "summary_one_paragraph": "This collection of memoranda, dated between August and September 1998, centers on the CIA's concern over the potential release of the cryptonym IJDECANTER to the public and to the Assassination Records Review Board (ARRB). The CIA argues that releasing IJDECANTER's cryptonym in conjunction with a Los Angeles Times article and document SX-59777 would benefit Russian counterintelligence, damage U.S. intelligence, and deter future intelligence sources from cooperating. The documents also detail a response to a request from the ARRB, identifying a source who provided information on Lee Harvey and Marina Oswald's time in the Soviet Union, leading to the designation of several assassination records for inclusion in the JFK Collection at the National Archives.",
  "tags": [
    "CIA",
    "IJDECANTER",
    "Cryptonym Protection",
    "Lee Harvey Oswald",
    "ARRB",
    "Counterintelligence",
    "Russian Intelligence",
    "JFK Assassination Records Act"
  ],
  "title": "CIA-IR-35, Source Identified in RIF Number 104-10151-1-206",
  "conspiracy": "The memoranda references information provided by sources on Lee Harvey Oswald being a KGB source, however there is no definitive confirmation of this in the document.",
  "date": "1998-09-17",
  "persons_mentioned": [
    "Laura Denk",
    "J. Barry Harrelson",
    "Bob Skwirot",
    "Michelle Combs",
    "Lee S. Strickland",
    "Jim Pavitt",
    "Boris Zhuravlev",
    "Sergei Papushin",
    "Aldrich Ames"
  ],
  "sender": "J. Barry Harrelson, Michelle Combs, Lee S. Strickland, Jim Pavitt (indirectly mentioned)"
}