{
  "classification": "Personnel",
  "document_type": "Memorandum and Security Records",
  "security": "Revealing that Thomas E. Davis has a 'Q' clearance with the Atomic Energy Commission and was investigated by the FBI could expose sensitive personal information and compromise security protocols. Referencing CIA's planned use of academic institutions for cover purposes could damage the reputation of the university and the CIA, and compromise ongoing operations.",
  "security_level": "SECRET",
  "summary": "This file contains documents related to the operational clearance and background investigation of Thomas E. Davis, including his employment at Ohio State University Research Foundation, his previous 'Q' clearance with the Atomic Energy Commission, and a planned operation involving James S. Owens to send an agent to Scandinavia.",
  "summary_one_paragraph": "This collection of documents details the CIA's investigation and operational clearance process for Thomas E. Davis, an employee at the Ohio State University (OSU) Research Foundation. The records, dating from 1951-1952, include background checks, neighborhood investigations, credit and police records, and correspondence regarding Davis's suitability for covert operations. The documents reveal that Davis held a 'Q' clearance with the Atomic Energy Commission, had been investigated by the FBI, and was part of a plan involving James S. Owens, Director of the OSU Research Foundation, to facilitate an agent's placement in Scandinavia via the American-Scandinavian Foundation. The file also includes memos discussing a request for operational clearance, suggesting potential CIA activities using the university's research connections as cover.",
  "tags": [
    "CIA",
    "Operational Clearance",
    "Background Investigation",
    "Thomas E. Davis",
    "James S. Owens",
    "Ohio State University Research Foundation",
    "Atomic Energy Commission",
    "FBI",
    "Covert Operations",
    "Scandinavia",
    "American-Scandinavian Foundation",
    "Mapping and Charting Laboratory"
  ],
  "title": "File on Thomas E. Davis",
  "date": "1951-12-21",
  "locations_mentioned": [
    "Columbus, Ohio",
    "Hilliard, Ohio",
    "Wellston, Ohio",
    "Scandinavia",
    "New York"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Thomas E. Davis",
    "James S. Owens",
    "Arch Alder",
    "Ed Davis",
    "Helen B. Davis",
    "Harris Lyons"
  ],
  "recipient": "Chief, PLANS",
  "sender": "Chief, STC/BPB"
}