{
  "classification": "Personnel",
  "document_type": "Memo",
  "security": "The memo highlights the tension between protecting sources/methods and open government, stating, \"The tension in law between protection of sources and methods and more open government was apparent, daily, to those involved...to regain, through this process, some credibility for the Agency.\" Sharing the internal struggle could undermine the Agency's credibility and reveal operational concerns.",
  "security_level": "CONFIDENTIAL",
  "summary": "Charles A. Briggs expresses appreciation for the support received from the Privacy and Information Action Group (PIAG) and others in handling Freedom of Information and Privacy Acts requests as he transitions out of the DDO Information Review Officer role.",
  "summary_one_paragraph": "As he prepares to relinquish his role as DDO Information Review Officer, Charles A. Briggs pens a memorandum expressing his gratitude for the exceptional support from the Privacy and Information Action Group (PIAG), Paul Haefner's team (for their work on the CHAOS files), Joe Gigliotti, and retired officers dealing with OSS records requests. Briggs highlights the challenges of balancing source and method protection with demands for more open government under the Freedom of Information and Privacy Acts, while also acknowledging the efforts made to enhance the Agency’s credibility through this process.",
  "tags": [
    "DDO",
    "Freedom of Information Act",
    "Privacy Act",
    "Appreciation",
    "Personnel",
    "Information Review",
    "PIAG",
    "OSS Records",
    "CHAOS Files"
  ],
  "title": "Appreciation",
  "date": "1977-09-15",
  "persons_mentioned": [
    "Charles A. Briggs",
    "Win Brown",
    "Cis Cass",
    "Lou Dube",
    "Mary Felton",
    "Doris LeBaron",
    "Fred McCann",
    "Karen Rice",
    "Helen Stilson",
    "Jon Wolfe",
    "Mack Wood",
    "Fred Randall",
    "Andy Addona",
    "Paul Haefner",
    "Joe Gigliotti",
    "Bob Owen",
    "William E. Nelson"
  ],
  "recipient": "Chief, Information Services Staff",
  "sender": "Charles A. Briggs"
}