{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Disclosing the identity of IUSTEER-1 and AMANCHOR-1 as sources could compromise their safety and effectiveness. Revealing that Anthony Abraham Chevrolet is a source of Cuban rumors and gossip could damage relations with the business and its employees. Quoting directly, 'the offices of Anthony Abraham Chevrolet in Miami was a \"a nest\" of Cuban rumors and gossip' and identifying specific individuals tied to the Washington Break-In affair and the Torriente Group could expose ongoing intelligence operations and sources.",
  "security_level": "UNCLASSIFIED",
  "summary": "A memorandum from Peter S. Jasutis regarding IUSTEER-1's observations about Anthony Abraham Chevrolet in Miami being a hub for Cuban rumors and gossip, and its connections to individuals involved in the Washington Break-In scandal.",
  "summary_one_paragraph": "On June 20, 1972, IUSTEER-1 informed Peter S. Jasutis that Anthony Abraham Chevrolet in Miami is a center for Cuban rumors and gossip, which he avoids due to encountering Cuban exiles. IUSTEER-1 noted Manuel Villamanan, Chief of Latin American Sales, is well-informed on Cuban exile matters and sympathetic to Barker from the Washington Break-In Scandal. Alberto Bequiristain (AMANCHOR-1), a salesman at the firm, was previously a frogman for the Agency under Consolidated Engineering, associated with Eugenio Martinez (also involved in the Washington Break-In), and Tony Iglesias, Chief of Security, is identified as the military chief for the Torriente Group.",
  "tags": [
    "IUSTEER-1",
    "Anthony Abraham Chevrolet",
    "Cuban exiles",
    "Miami",
    "Washington Break-In",
    "Watergate",
    "Manuel Villamanan",
    "Alberto Bequiristain",
    "AMANCHOR-1",
    "Eugenio Martinez",
    "Consolidated Engineering",
    "Tony Iglesias",
    "Torriente Group"
  ],
  "title": "IUSTEER-1 - Anthony Abraham Chevrolet, Miami",
  "date": "1972-06-30",
  "locations_mentioned": [
    "Miami, Florida",
    "Washington, D.C."
  ],
  "persons_mentioned": [
    "IUSTEER-1",
    "Anthony Abraham",
    "Manuel Villamanan",
    "Barker",
    "Alberto Bequiristain",
    "AMANCHOR-1",
    "Eugenio Martinez",
    "Tony Iglesias",
    "Peter S. Jasutis"
  ],
  "sender": "Peter S. Jasutis"
}