{
  "classification": "Personnel",
  "document_type": "Memo",
  "security": "These documents detail performance evaluations, promotion recommendations, and discussions about Calvin W. Hicks's medical condition, which could reveal details about his health and potentially impact his privacy. For example, one memorandum mentions: \"He has a medical hold which will not allow him to serve overseas at this time and he therefore, contemplates retirement at age 50 (in late 1974).\" Revealing such details could violate his privacy.",
  "security_level": "SECRET",
  "summary": "This file contains memos and personnel actions related to Calvin W. Hicks, documenting his career progression, performance evaluations, promotion recommendations, and eventual disability retirement from the CIA.",
  "summary_one_paragraph": "This collection of documents details the career of Calvin W. Hicks within the CIA, spanning from the late 1960s to the mid-1970s. It includes multiple recommendations for his promotion to GS-14 based on his strong performance in the Intelligence Watch, commendations for his work during critical events, and notifications of personnel actions such as reassignments and a quality step increase. The documents also reveal discussions surrounding his potential retirement due to a medical condition, as well as the formal process for his disability retirement under the CIA Retirement and Disability System.",
  "tags": [
    "CIA",
    "Calvin W. Hicks",
    "Personnel File",
    "Promotion",
    "Intelligence Watch",
    "Disability Retirement",
    "Performance Evaluation"
  ],
  "title": "HICKS, CALVIN OP FILE",
  "date": "1975-01-24",
  "persons_mentioned": [
    "Calvin W. Hicks",
    "R. L. Austin, Jr.",
    "L. A. Campbell",
    "Eloise R. Page",
    "Joseph A. Procaccino",
    "David A. Phillips",
    "Cord Moyer, Jr.",
    "Thomas H. Karamessines",
    "Harry B. Fisher",
    "Joseph Procaccino",
    "Howard Orr",
    "John L. Hart",
    "Walter Kuzmuk",
    "Robert Heron",
    "George Papadopolos",
    "James Pekich",
    "Robert Sawicki",
    "Frank Levy",
    "Pat Coble",
    "Peer de Silva",
    "Edward J. Carroll",
    "John L. Hart"
  ],
  "recipient": "Chairman, Board of Medical Examiners",
  "sender": "R. L. Austin, Jr., Deputy Director of Personnel for Special Programs"
}