{
  "classification": "Cuba",
  "document_type": "Intelligence Information Cables and FBI/State Department Cables",
  "security": "These cables contain SENSITIVE INTELLIGENCE SOURCES AND METHODS INVOLVED and detailed information on Venezuelan government deliberations regarding Orlando Bosch, including potential financial arrangements. Direct quotes include: \"President PEREZ is currently considering giving BOSCH'S wife BS. 10.000 (U.S. $2,300) a month\" and \"SHOULD BOSCH DIE, CUBAN EXILE GROUPS WILL STEP UP THEIR ATTACKS ON VENEZUELAN FACILITIES.\" Releasing this information could jeopardize intelligence gathering operations and damage diplomatic relations with Venezuela.",
  "security_level": "SECRET/CONFIDENTIAL",
  "summary": "This file primarily consists of intelligence reports and cables from 1976-1978 concerning Orlando Bosch, a Cuban exile leader, and the Venezuelan government's considerations regarding his imprisonment and potential release, including concerns about exile reprisals and Venezuelan facilities being targeted.",
  "summary_one_paragraph": "This collection of documents, dating from 1976 to 1978, centers on Orlando Bosch, a Cuban exile leader detained in Venezuela in connection with the 1976 Cubana airliner bombing. The documents include Intelligence Information Cables detailing Venezuelan President Carlos Andres Perez's deliberations on potentially releasing Bosch or providing financial aid in exchange for Bosch's assurance that Venezuelan personnel and facilities would not be targeted. The files also address concerns that Bosch’s death or continued imprisonment could lead to retaliatory attacks by Cuban exile groups, and they chronicle various related activities and communications between Venezuelan authorities, Cuban exiles, and U.S. agencies like the FBI and State Department.",
  "tags": [
    "Orlando Bosch",
    "Cuban Exiles",
    "Venezuela",
    "Carlos Andres Perez",
    "Cubana Airliner Bombing",
    "Intelligence Gathering",
    "FBI",
    "State Department"
  ],
  "title": "BISCH AVILA, ORLANDO",
  "date": "1978-01-10",
  "locations_mentioned": [
    "Venezuela",
    "Cuba",
    "Miami, Florida",
    "Puerto Rico",
    "Caracas",
    "United States"
  ],
  "origin_agency": "CIA/FBI/State Department",
  "persons_mentioned": [
    "Orlando Bosch",
    "Carlos Andres Perez",
    "Francisco Leandro Mora",
    "Octavio Lepage",
    "Reinaldo Martin Cano"
  ]
}