{
  "classification": "Mexico/Soviet/Commission",
  "document_type": "Memo",
  "security": "Identifying Yuriy Ivanovich MOSKALEV as a possible contact between the Soviet Embassy in Mexico City and Lee Harvey Oswald, and also tying him to an individual claiming involvement in the Kennedy assassination (Saul), reveals potentially sensitive information. The memo states, “Photos of the unidentified man were taken by our Mexico City Station… going into or coming out of both the Cuban and Soviet Embassies in Mexico City… the individual has never been identified.” Furthermore, the document discusses attempts to verify MOSKALEV's identity and background, which could expose intelligence-gathering methods and sources. Finally, the memo references a book by Hugh C. McDonald, who was at one time, “under contract to CIA in regard to the Identi-Kit.”",
  "security_level": "SECRET",
  "summary": "This memorandum discusses the possibility that Yuriy Ivanovich MOSKALEV, a Soviet scientist, might be the 'unidentified man' photographed entering and departing the Soviet and Cuban embassies in Mexico City in October 1963, and explores potential connections between MOSKALEV and an individual known as 'Saul' who claimed involvement in the Kennedy assassination.",
  "summary_one_paragraph": "A secret memorandum dated July 13, 1978, from Raymond A. Warren, Chief of the Latin America Division, to Scott Breckinridge, Principal Coordinator/HSCA, forwards research suggesting that Yuriy Ivanovich MOSKALEV might be the 'unidentified man' seen at the Soviet Embassy in Mexico City in October 1963, and notes similarities between MOSKALEV and an individual known as 'Saul' from the book 'Appointment in Dallas,' who claimed to have been involved in the JFK assassination. The research, led by Christine Hopkins, also explores whether there could have been Cuban complicity in the assassination. The memo emphasizes that the attached file contains only theoretical, unofficial research, not official Agency findings, and is being provided for review by Messrs. Blakey and Cornwell of the HSCA.",
  "tags": [
    "Yuriy Ivanovich MOSKALEV",
    "Unidentified Man",
    "Mexico City",
    "Soviet Embassy",
    "Cuban Embassy",
    "JFK Assassination",
    "HSCA",
    "Saul",
    "Hugh C. McDonald",
    "Appointment in Dallas"
  ],
  "title": "Yuriy Ivanovich MOSKALEV",
  "date": "1978-07-13",
  "locations_mentioned": [
    "Mexico City, Mexico",
    "Moscow",
    "Dallas, Texas",
    "Brookhaven, Long Island, New York",
    "Sun Valley, Idaho",
    "London"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Yuriy Ivanovich MOSKALEV",
    "Scott Breckinridge",
    "Russell Holmes",
    "Raymond A. Warren",
    "Christine Hopkins",
    "Blakey",
    "Cornwell",
    "John F. Kennedy",
    "Yuri (KGB officer)",
    "Juan (KGB officer)",
    "PENKOVSKY",
    "Aleksey A. MOISEEV",
    "V.A. STRELTSOVA",
    "Hugh C. McDonald",
    "Saul"
  ],
  "recipient": "Scott Breckinridge",
  "sender": "Raymond A. Warren"
}