{
  "classification": "Personnel",
  "document_type": "Memorandum and Cable",
  "security": "Discusses potential recruitment and past employment of Eduardo Whitehouse, a pilot with connections to the Bay of Pigs invasion and WITHRUSH Project. Details financial settlements and performance evaluations. Exposing Whitehouse's involvement with the Agency could compromise sensitive information.",
  "security_level": "SECRET",
  "summary": "This file contains documents related to Eduardo Whitehouse, a pilot involved in the Bay of Pigs invasion and later contracted by the CIA for the WITHRUSH Project, including memos on financial settlements, recruitment efforts in 1969, and background checks.",
  "summary_one_paragraph": "This collection of documents primarily focuses on Eduardo Whitehouse, a Cuban pilot who participated in the Bay of Pigs invasion and was subsequently contracted by the CIA for the WITHRUSH Project in the Congo between 1964 and 1965. The file includes memoranda detailing financial settlements made to Whitehouse, an immigration name check, and a 1969 cable reporting his alleged recruitment efforts in Miami to hire pilots for an El Salvador mission. Additionally, there is correspondence from Whitehouse expressing his satisfaction with the Agency's handling of his financial claims and his willingness to serve the United States.",
  "tags": [
    "Eduardo Whitehouse",
    "Bay of Pigs",
    "WITHRUSH Project",
    "Recruitment",
    "Pilot",
    "El Salvador",
    "Miami",
    "Financial Settlement",
    "KUBARK",
    "IUSTEER"
  ],
  "title": "MPW: LEM:HUSSE -1, STÅ, EDUARDE -1, S11 3001-14",
  "date": "1960-1921",
  "locations_mentioned": [
    "Miami, Florida",
    "El Salvador",
    "Congo",
    "Rome",
    "Leopoldville"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Eduardo WHITEHOUSE",
    "Ed Sullivan",
    "Chris Hopkins",
    "Teddy Whitehouse",
    "Fausto Gomez",
    "Jerry Sounders",
    "Edward W. LORENTZ",
    "Jack Anderson",
    "Dr. Elkhoury",
    "Rogelio Enrique Whitehouse",
    "Gerald Sounders",
    "William V. Broe",
    "Paul Gottke",
    "John C. Murray",
    "Janice Mulaya",
    "Janice Roman",
    "Robert Rogers"
  ],
  "recipient": "Various CIA officials and offices"
}