{
  "classification": "Personnel",
  "document_type": "Memo",
  "security": "The memo expresses concern that releasing a large number of CIA employee names “has the potential to do unacceptable harm to US national security…It undermines the basic concept of cover for a clandestine service.” It also notes potential harm to future employees and operations because “There is no way to measure the possible effect of these releases on future employees and operations.”",
  "security_level": "Secret",
  "summary": "A CIA memorandum from Barry Harrelson to John Pereira, dated February 26, 1997, discusses the Agency's concerns regarding the release of CIA employees' names in JFK records and proposes revisiting the agreement with the ARRB to protect a larger number of names, especially those with little connection to the JFK assassination story.",
  "summary_one_paragraph": "This memorandum from Barry Harrelson to John Pereira outlines the CIA's apprehension about the ARRB's plan to release the names of hundreds of Agency employees in JFK-related documents, many of whom have minimal connection to the JFK assassination, potentially harming US national security by undermining cover for clandestine services. It recommends re-engaging the ARRB to revise the name release policy, suggesting a focus on releasing the names of individuals directly relevant to the JFK story while protecting the identities of others through pseudonyms, and proposes a meeting with Fred and Linda to discuss the issue and prepare a memo for top management.",
  "tags": [
    "CIA",
    "JFK Records Act",
    "ARRB",
    "Employee Names",
    "National Security",
    "Cover",
    "Historical Review Group"
  ],
  "title": "CIA Employees Names in JFK Records",
  "date": "1997-02-26",
  "origin_agency": "CIA",
  "persons_mentioned": [
    "John Pereira",
    "Barry Harrelson",
    "Jeremy Gunn",
    "Fredrick C. Wickham, Jr.",
    "Gary Breneman",
    "Linda"
  ],
  "recipient": "John Pereira",
  "sender": "Barry Harrelson"
}