{
  "classification": "Operations",
  "document_type": "Cable",
  "security": "Revealing that PJBREEZY-1 is a 'sensitive unilateral penetration local drug milieu' could compromise the agent, the operation, and future intelligence gathering activities. The instruction 'FOLLOWING INFO NOT PASSABLE DEA FOR TIME BEING' and 'REQUEST LIAISON NOT BE QUERIED. NO OBJECTION/UNILATERAL CHECK' highlight sensitive methods, potentially damaging relationships with other agencies if exposed.",
  "security_level": "SECRET",
  "summary": "A secret cable from Guayaquil reports that drug trafficker Alfredo Ordonez Gonzalez returned to Guayaquil after traveling through Mexico, Guatemala, and Costa Rica, where he met with drug traffickers Evelio Duque and Herminio or Ermenegildo Diaz; it requests traces on Duque and Diaz, and specifies the information is not to be shared with the DEA at this time.",
  "summary_one_paragraph": "This secret cable, originating from Guayaquil on August 1, 1973, reports that Alfredo Ordonez Gonzalez, a drug trafficker, returned to Guayaquil after traveling through Mexico, Guatemala, and Costa Rica, where he met with Evelio Duque and Herminio or Ermenegildo Diaz in San Jose. The cable provides background data on Duque and Diaz, noting their connections to Cuba and past involvement in drug trafficking, and requests that WHMIAMI and San Jose stations conduct traces on Duque and Diaz's citizenship. The cable emphasizes that this information is not to be shared with the DEA and any liaison is not to be queried during the unilateral check.",
  "tags": [
    "Drug Trafficking",
    "PJBREEZY-1",
    "Alfredo Ordonez Gonzalez",
    "Evelio Duque",
    "Herminio Diaz",
    "DEA",
    "Unilateral Operation",
    "CIA",
    "Guayaquil",
    "Mexico",
    "Guatemala",
    "Costa Rica"
  ],
  "title": "PJBREEZY LEADS",
  "date": "1973-08-01",
  "locations_mentioned": [
    "Guayaquil",
    "Mexico",
    "Culiacan",
    "Guatemala",
    "San Jose",
    "Costa Rica",
    "Cuba",
    "Atlanta"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Alfredo Ordonez Gonzalez",
    "Evelio Duque",
    "Herminio Diaz",
    "Antonio Prieto Morejon"
  ],
  "recipient": "WHKAMI, San Jose",
  "sender": "Guayaquil Station"
}