{
  "classification": "Martin Luther King, Jr.",
  "document_type": "Memo",
  "security": "This document reveals specific sources (Rufus F. Rodigast, QRPHONE/1, QRPEONY/1, SMABOVE, JAGUAR, MLDUST, KRHOLLY, MHRUPEE) and methods (clandestine method of the station for obtaining information, surveillance team followed an American National with a striking resemblance to Galt, a sensitive teletap and mail intercept operation coverage) used by the CIA to gather intelligence.  Disclosure of this information would identify a clandestine method of the station for obtaining information; exempt under (b) (3) (a) and (b)(6).",
  "security_level": "CONFIDENTIAL",
  "summary": "A memorandum details the results of a FOIA request concerning Martin Luther King, Jr., listing releasable and non-releasable documents, including books, newspaper articles, and cables, with specific exemptions cited for the withheld information.",
  "summary_one_paragraph": "This confidential memorandum, dated July 27, 1976, responds to a FOIA request (76-F-382) regarding Martin Luther King, Jr., and outlines the documents maintained by the International Terrorism Group (ITG) within the CIA's Operations Staff. It identifies releasable overt items, such as excerpts from published books, as well as overt items not available in the office, including various newspaper and magazine articles. The memo also specifies a list of sanitized documents releasable under the Freedom of Information Act and identifies Top Secret documents held in the OPS/ITG (SI) vault. Additionally, it details cables, dispatches, and memoranda that are exempt from release due to source protection, operational methods, or privacy concerns, referencing specific exemptions under FOIA.",
  "tags": [
    "FOIA",
    "Martin Luther King Jr.",
    "CIA",
    "Intelligence Gathering",
    "MHCHAOS",
    "Document Release",
    "Overt Items",
    "Sanitized Documents",
    "Exempt Documents"
  ],
  "title": "Weisberg Request (Martin Luther King, Jr.) Part I",
  "date": "1976-07-27",
  "persons_mentioned": [
    "Martin Luther King Jr.",
    "Fred Powledge",
    "Louis E. Lomax",
    "Claude M. Lightfoot",
    "C. Eric Lincoln",
    "William Robert Miller",
    "Howard Zinn",
    "Shloma Katz",
    "Albert B. Cleage Jr.",
    "Joseph C. Hough Jr.",
    "Jerome Bennett Jr.",
    "John Oliver Killens",
    "Herbert Garfinkel",
    "Simeon Booker",
    "Gerald Wayne Kirk",
    "Harold R. Isaacs",
    "President Johnson",
    "Galt",
    "Forman",
    "Robert F. Williams",
    "Richard George Perrin",
    "Hosea Williams",
    "Rufus F. Rodigast",
    "Jonathan Power",
    "Andrew Pulley",
    "William Moses Kunstler",
    "Daniel Mallette",
    "Thomas Emmett Hayden",
    "Stokely Carmichael",
    "James Rufus Forman",
    "Howard Zinn",
    "Mark William Rudd",
    "Albert John Szymanski Jr.",
    "Clarence Fielden Jones",
    "Ralph Henry",
    "Ray",
    "Annette",
    "Mary Moran",
    "Karen W.",
    "John J. Reagan",
    "Felton"
  ],
  "recipient": "Privacy and Information Officer, DDO",
  "sender": "John J. Reagan, Chief, International Terrorism Group, Operations Staff"
}