{
  "classification": "Personnel",
  "document_type": "Personnel Action Forms and Memoranda",
  "security": "The document contains personal information about James S. Woods, including his retirement details, performance evaluations, and internal agency movements. This information, if disclosed, could be used to compromise his privacy and security. Additionally, the document's classification markings (SECRET and CONFIDENTIAL) indicate that its disclosure could cause damage to national security. Quoting directly: 'Official Personnel Folder SECRET'.",
  "security_level": "SECRET",
  "summary": "This document contains personnel action forms and memoranda related to James S. Woods, a CIA employee, detailing his promotion, commendation, reassignment, and eventual voluntary retirement in 1978, including his role in the Directorate of Operations Records Review Task Force.",
  "summary_one_paragraph": "This collection of documents pertains to James S. Woods, a Records Management Officer at the CIA, and includes personnel action requests and memoranda spanning from February to August 1978. It details his promotion within the NE Division, a commendation from Deputy Director John N. McMahon for his exceptional performance in the Directorate of Operations Records Review Task Force, a reassignment within the DDO/IMS, and finally, his voluntary retirement, effective August 4, 1978. The documents also confirm Woods’s career details, including his entry into the CIA in April 1952, his GS-13 grade, and his years of service, all culminating in his retirement at the age of 50 with 26 years of qualifying service.",
  "tags": [
    "Personnel Records",
    "Retirement",
    "Promotion",
    "Reassignment",
    "Commendation",
    "James S. Woods",
    "Records Management",
    "Directorate of Operations",
    "DDO/IMS",
    "DDO/NE"
  ],
  "title": "Personnel Records of James S. Woods: Promotion, Commendation, Reassignment, and Retirement",
  "date": "1978-08-04",
  "persons_mentioned": [
    "James S. Woods",
    "John N. McMahon",
    "Kenneth Corbat",
    "Henry Walton",
    "John Diffley",
    "Abraham Schwartz",
    "John F Dy"
  ],
  "recipient": "Director of Personnel",
  "sender": "Kenneth Corbat, John N. McMahon, John F Dy"
}