{
  "classification": "Cuba, Personnel, Operations, Security",
  "document_type": "Memorandum",
  "security": "Revealing operational details about the STESCALADE operation, the contingency plan for extracting personnel, and the cover arrangements for TSD technicians could compromise current and future clandestine activities. Specifically, the document states: 'For planning purposes the subjects will be released in Havana, Mexico City or other...'. Sharing the identities of personnel involved in these operations, along with their cover arrangements, exposes them to potential risk. The document also details the communication and support provided to the families of the detained technicians, noting that the \"wives are telling their neighbors that their husbands are on a trip,\" which is a security measure.",
  "security_level": "S-E-C-R-E-T",
  "summary": "The documents consist of a memo discussing Jim McCord's potential Cuban activities, a summary of the STESCALADE audio operation against the New China News Agency in Havana, and a contingency plan for the recovery of TSD employees captured in Cuba. The STESCALADE operation involved installing audio surveillance equipment in apartments near the NCNA office, which led to the capture of three TSD technicians, and the contingency plan outlines procedures for their potential release and extraction.",
  "summary_one_paragraph": "This collection of documents includes a memo regarding Jim McCord's possible involvement in Cuban activities, a comprehensive summary of the STESCALADE audio operation conducted against the New China News Agency (NCNA) in Havana, and the RELEASE CONTINGENCY OPLAN 62-2, a detailed plan for the potential recovery of three TSD employees (Daniel L. Carswell, Jess H. Taransky, and Floyd R. Anderson) who were apprehended by Cuban authorities in September 1960 while installing surveillance equipment. The STESCALADE operation involved leasing apartments, installing microphones and transmitters, and utilizing embassy personnel for support, but it resulted in the capture of the technicians; the contingency plan outlines procedures, communication channels, and resources for their extraction, including black air transport and cover stories to maintain their status as Agency assets.",
  "tags": [
    "OTS",
    "TSD",
    "Jim McCord",
    "Cuban Activities",
    "STESCALADE",
    "Audio Operation",
    "New China News Agency",
    "Havana",
    "Contingency Plan",
    "Personnel Recovery",
    "Covert Operations"
  ],
  "title": "OTS (late TSD) and Jim McCord’s Cuban Activities / Summary of STESCALADE - Audio Operation Against the New China News Agency in Havana / RELEASE CONTINENCY OPLAN 62-2",
  "date": "1974-07-03",
  "locations_mentioned": [
    "Cuba",
    "Havana",
    "China",
    "Mexico City",
    "Switzerland",
    "Spain",
    "Eglin Air Force Base, Florida",
    "Boston",
    "Japan"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Jim McCord",
    "Ben Colling",
    "Carolyn O. Stacey",
    "Ambassador Bonsal",
    "Bryan Mills",
    "Robert Neet",
    "Marjorie Lennox",
    "David L. Christ (alias Carswell)",
    "Walter E. Szuminski (alias Taransky)",
    "Thornton J. Anderson (alias Danbrunt)",
    "Hugh Kessler",
    "L. Houston",
    "Rudolph E. Gomez",
    "Richard I. Skinner",
    "Robert Marrero",
    "Billy B. Campbell",
    "Kenneth R. Burton"
  ],
  "recipient": "File, Director of Central Intelligence",
  "sender": "SDB, Rudolph E. Gomez (Acting Chief, WH)"
}