{
  "classification": "Operations",
  "document_type": "Record Sheet / Memo / Telegram",
  "security": "Several memos and telegrams discuss a CIA project to create a propaganda photo book on Stalin, including details about collaborating with Boris Shub, potential publishers, and the need to balance propaganda with commercial viability. Disclosing these discussions could compromise ongoing operations and damage the CIA’s reputation. Quoting directly: \"The book must be locked up by July 1. Otherwise it couldn't be printed in September...It must be the sort of book that Doubleday might be putting out...Swen as a going concern is more important than any one book: the book shouldn't be allowed to jeopardize Swen by being too obviously propaganda.\"",
  "security_level": "SECRET",
  "summary": "This file contains documents related to the House Select Committee on Assassinations' (HSCA) investigation, including a memo regarding lost documents related to Claire Beye Luce, along with various memos and telegrams detailing CIA activities, such as a planned propaganda photo book on Stalin and related discussions about its content and publication.",
  "summary_one_paragraph": "This collection of documents includes an HSCA record sheet noting the file on Claire Beye Luce and documenting a search for 'lost documents.' Also included are memos from the Office of Strategic Services (OSS) regarding Luce’s travels and comments about the British Empire, as well as CIA documents discussing a photo book project on Stalin, covering topics such as collaboration with Boris Shub, desired content, publication strategies with Doubleday, and concerns about maintaining commercial viability while producing effective propaganda. Additional telegrams detail proposed content for the Stalin photo book and internal discussions about its themes and potential impact.",
  "tags": [
    "HSCA",
    "Claire Beye Luce",
    "OSS",
    "CIA",
    "Stalin",
    "Propaganda",
    "Boris Shub",
    "Photo Book",
    "Soviet Union",
    "Cold War",
    "Munson",
    "Lyle",
    "Lou Scherer",
    "Levitas",
    "New Leader",
    "Communist Zoo"
  ],
  "title": "LUCE CLAIRE BEYLE - Lost DOCUMENTS",
  "date": "1978-07-28",
  "persons_mentioned": [
    "Claire Beye Luce",
    "Col. William Donovan",
    "Auchinleck",
    "Moncton",
    "Churchill",
    "Stalin",
    "Trotsky",
    "Hitler",
    "Bukharin",
    "Tito",
    "Clementis",
    "McCloy",
    "Lunt",
    "Boris Shub",
    "Munson",
    "Lyle",
    "Lou Scherer",
    "Levitas"
  ],
  "sender": "Walli Deuel, Dick Cornish, Lou Scherer, Department of State (Frankfort station), SDS"
}