{
  "classification": "Personnel",
  "document_type": "Routing Slip and FBI Reports",
  "security": "The document contains references to potential narcotics activities, a possible connection to the CIA through Lucien Conein, and mentions of internal security matters related to Abaco and Grenada, which could be sensitive if disclosed. Specifically, the notes mention 'Narcotirio a Dayuns Drugo' and 'Conspring to sprit of distribute.' Disclosing this information could reveal ongoing or past investigations, potentially compromising sources and methods. Also, the note 'CIA/DEM. Start - interfatin Lucien CONE CONEIN' shows a possible link that, if exposed, could damage CIA's reputation.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document consists of a routing slip and a collection of FBI reports and notes regarding Mitchell Livingston WerBell, III, dating from 1974 to 1975, covering internal security matters, neutrality issues, and possible connections to narcotics and the CIA.",
  "summary_one_paragraph": "This document contains a routing slip indicating the distribution of information related to Mitchell Livingston WerBell, III to Ernie Mayerfeld and Walt Lloyd, accompanied by a series of FBI reports and handwritten notes spanning from 1974 to 1975. These records originate from various FBI field offices and the Director's office, focusing on subjects such as internal security concerns related to Abaco, neutrality matters in Abaco and Grenada, and possible connections to narcotics activities and Lucien Conein of the CIA. The reports and notes include references to investigations, individuals involved (Pete Kinsey, Charles Colson, and others), and possible drug-related conspiracies.",
  "tags": [
    "Mitchell Livingston WerBell, III",
    "FBI",
    "CIA",
    "Internal Security",
    "Abaco",
    "Grenada",
    "Narcotics",
    "Lucien Conein",
    "FOIA"
  ],
  "title": "Mitchell Livingston WerBell, III - FBI Reports and Routing Slip",
  "date": "1975-08-06",
  "persons_mentioned": [
    "Mitchell Livingston WerBell, III",
    "Ernie Mayerfeld",
    "Walt Lloyd",
    "William Martin Bell",
    "Aladdin N, Al-Tayyar",
    "Then Wilson",
    "Gene",
    "Karin Athinon",
    "Marvin",
    "Pete Kinsey",
    "Charles Colson",
    "Lucien Conein",
    "Pete Fay",
    "Dudley Lively",
    "Vony Brown",
    "Keren",
    "Shafer",
    "Nixon"
  ],
  "sender": "A.F. Addona, C/DDO/PIC/AL"
}