{
  "classification": "Security",
  "document_type": "Dispatch",
  "security": "Disclosing SNECHI's suspected contacts with Soviet agents and BURCHHARDT's doubtful background as a journalist could jeopardize ongoing investigations, compromise sources, and damage relationships with the French Ministry of Information. The dispatch states, 'We suspect him of being identical with an individual of the same name who belonged to the Swiss \"Rota Japollo\" network' and notes BURCHHARDT is 'a doubtful individual.'",
  "security_level": "SECRET",
  "summary": "A dispatch from the Paris Station to Chief, WI, providing information on Frits (aka Fred) SNECHI, a journalist suspected of having connections to the Swiss \"Rota Japollo\" network and possible Soviet contacts, as well as Head BURCHHARDT, a journalist with a doubtful background.",
  "summary_one_paragraph": "This dispatch, dated 5 February 1953, from the Chief of Station in Paris to the Chief, WI, concerns Frits (aka Fred) SNECHI, a French-naturalized journalist, and Head BURCHHARDT, a correspondent for \"Der Bund\". SNECHI is suspected of connections to the Swiss \"Rota Japollo\" network and possible ties to Konstanti Yefimov of the Soviet Commercial Mission. The dispatch details SNECHI's background, including his work for various newspapers and radio stations, his naturalization in France, and his alleged contacts with Soviet agents. The dispatch also raises concerns about BURCHHARDT's background and seeks further derogatory information about both individuals and their activities, particularly any confirmation of their involvement in the \"Rota Kapollo\" network.",
  "tags": [
    "CIA",
    "Frits SNECHI",
    "Fred SNECHI",
    "Head BURCHHARDT",
    "Rota Japollo network",
    "Soviet contacts",
    "Counterespionage",
    "Journalist",
    "Security Information",
    "Operational"
  ],
  "title": "SPECIFIC OPERATIONAL: Frits (aka Fred) SNECHI",
  "date": "1953-02-05",
  "locations_mentioned": [
    "Paris",
    "Berlin",
    "Morocco",
    "Switzerland",
    "Zurich",
    "Lugano",
    "Hamburg",
    "Saarbruecken",
    "Pyrenees",
    "Elbe",
    "Bonn",
    "France",
    "Antwerp",
    "Belgium"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Frits (aka Fred) SNECHI",
    "Wil TRELLER",
    "Martha TRELLER",
    "Helen STRICKEL",
    "Konstanti Yefimov",
    "Head BURCHHARDT",
    "Lloyd D. Lager"
  ],
  "recipient": "Chief, WI",
  "sender": "Chief of Station, Paris"
}