{
  "classification": "Security",
  "document_type": "Background Report",
  "security": "Revealing Maheu's involvement in sensitive operations such as the King Hussein assignment, the attempted assassination of Fidel Castro using Mafia members, and providing cover for clandestine service officers, could expose covert methods and compromise ongoing or future operations. Specifically, the document states: \"He performed many sensitive assignments for the Office of Security, and also accepted assignments from elements of the predecessor of the Deputy Director for Operations.\"",
  "security_level": "SECRET",
  "summary": "This document is a background report on Robert A. Maheu, detailing his employment history, including his time with the FBI, Small Business Administration, and his own investigative organization, Robert A. Maheu Associates, as well as his recruitment by the CIA Office of Security in 1954 and subsequent involvement in sensitive assignments.",
  "summary_one_paragraph": "This background report provides details on Robert A. Maheu, born in 1917, covering his career from being a Special Agent with the FBI (1940-1947) to his work with the Small Business Administration and eventual establishment of Robert A. Maheu Associates. Recruited by the CIA's Office of Security in 1954, Maheu performed various sensitive assignments including the procurement of female companionship for King Hussein, involvement in an attempt to assassinate Fidel Castro using Johnny Roselli of the Mafia, and providing cover for Clandestine Service officers. The document notes that contact with Maheu ceased upon termination of the cover arrangement.",
  "tags": [
    "Robert A. Maheu",
    "FBI",
    "CIA",
    "Office of Security",
    "King Hussein",
    "Fidel Castro",
    "Johnny Roselli",
    "Covert Operations",
    "Clandestine Service"
  ],
  "title": "Robert A. Maheu",
  "persons_mentioned": [
    "Robert A. Maheu",
    "King Hussein",
    "Johnny Roselli",
    "Fidel Castro",
    "Carmine S. Bellino",
    "Niarchos",
    "Schenley Distillers",
    "Howard Hughes"
  ],
  "sender": "CIA Office of Security (Implied)"
}