{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Disclosing the identities of contacts and their activities (e.g., \"AMCUTLER-1 reported that he had been invited by one \"Chique\" KONTES CIT:Cuba...to join a maritime expedition aimed against tanker traffic on the south coast of Cuba\") could endanger these individuals and compromise ongoing operations. Sharing the potential courier channel to AMTAUNA-1 involving the ARELEM brothers, along with their personal details and occupations, could expose them to harm and disrupt intelligence gathering efforts. Revealing that KUBARK weapons were allegedly stored on an unidentified key and the details of the planned raid ('an armed raid on the key would have to be simulated') could expose sensitive operational details.",
  "security_level": "SECRET",
  "summary": "This dispatch from the Chief of Station, JMWAVE, to the Chief of Task Force W provides a progress report on Operational/GYROSLEZAMCUTLEF activities for November and December 1962, focusing on supporting the AMFAUNA operation and developing new KUTUBE operations.",
  "summary_one_paragraph": "The JMWAVE dispatch, dated January 9, 1963, summarizes AMCUTLER-1's activities in support of Operation AMFAUNA, including investigating AMFAUNA-4 through interviews in Miami and New York. The dispatch also details a potential courier channel to AMTAUNA-1, involving Brazilian citizens Gonzalo ABELEN Martin and Manuel PAHELEN Martin, who could potentially smuggle items in canned goods between Miami and Havana. AMCUTLER-1 has also been following up leads for new KUTUBE operations, interviewing Carlos Manuel CACERES-Blay, Evelio CRUZ, Luis CHERNANDEZ, and seeking information on Dr. Carlos PEDEMONTE, who is looking to leave Cuba. Additionally, AMCUTLER-1 was invited to join a maritime expedition against Cuban tanker traffic and was offered weapons allegedly belonging to KUBARK.",
  "tags": [
    "JMWAVE",
    "AMCUTLER-1",
    "AMFAUNA",
    "KUTUBE",
    "Cuba",
    "GYROSLEZAMCUTLEF",
    "Courier Channel",
    "Maritime Expedition",
    "KUBARK",
    "Weapons"
  ],
  "title": "AMCUTLER-1 Progress Report for November and December 1962",
  "date": "1963-01-09",
  "locations_mentioned": [
    "Miami, Florida",
    "New York",
    "Havana, Cuba",
    "Brazil",
    "Trinidad, Cuba",
    "Esquivel Caves",
    "Soroa Zone",
    "Candelaria, Pinar del Rio, Cuba",
    "Spain",
    "Puerto Rico",
    "Cuba"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "AMCUTLER-1",
    "AMFAUNA-4",
    "ANTAUNA-1",
    "Gonzalo ABELEN Martin",
    "Manuel PAHELEN Martin",
    "AMCUTLER-2",
    "Carlos Manuel CACERES-Blay",
    "Evelio CRUZ",
    "Luis CHERNANDEZ",
    "Dioninio QUGARTE",
    "Sixtor PUGARTET",
    "Anita PERRASTE Betancourt",
    "Pepe GONZALEZ",
    "Carlos PEDEMONTE",
    "Chique KONTES",
    "Pedro Luis DIAZ Lanz",
    "Reinard LOPEZ Llub",
    "Enrique CEIJAS"
  ],
  "recipient": "Chief, Task Force W",
  "sender": "Chief of Station, JMWAVE"
}