{
  "classification": "Personnel",
  "document_type": "Extract",
  "security": "Sharing details of specific operations, locations, or individuals involved in covert actions, such as those in Chile, could expose methods, compromise ongoing activities, and endanger individuals. Quoting: \"...planning and guiding of Covert Action programs...various commendation and laudatory reports concerning Mr. Kent's performance during the 'Chilean crisis'.\"",
  "security_level": "CONFIDENTIAL",
  "summary": "This document is an extract detailing the career of Mr. William M. Kent within the CIA, highlighting his assignments, commendations, and overall performance from 1951 until his retirement, with a recommendation that he receive the Career Intelligence Medal.",
  "summary_one_paragraph": "The extract outlines the career of William M. Kent, who joined the CIA in December 1951, detailing his initial assignment in the Office of Special Operations before serving as an intelligence officer in Panama under non-official cover. After various roles, including a stint in the Cuba section and a productive tour in Caracas, he joined JMWAVE in Miami, where his exceptional handling of difficult situations was noted; Kent later headed sections in the Western Hemisphere Division at Headquarters, worked under non-official cover in New Orleans and at the Washington Base, and held managerial positions. His commendable performance during the \"Chilean crisis\" led to further investigations, culminating in a recommendation for the Career Intelligence Medal upon his retirement after 26 years of service.",
  "tags": [
    "CIA",
    "William M. Kent",
    "Career Intelligence Medal",
    "Personnel File",
    "Covert Operations",
    "Chilean Crisis",
    "JMWAVE",
    "Non-Official Cover"
  ],
  "title": "KENT EXTRACT",
  "date": "1975-12-05",
  "locations_mentioned": [
    "New York City",
    "Panama",
    "Caracas",
    "Miami",
    "New Orleans",
    "Washington D.C.",
    "Chile"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "William M. Kent",
    "Director of Central Intelligence (DCI)",
    "Deputy Director of Operations (DDO)"
  ]
}