{
  "classification": "Liaison",
  "document_type": "Report",
  "security": "This report details alleged illicit armament traffic and communist activities in Costa Rica, potentially revealing intelligence sources and methods. Specifically, it mentions a 'Controlled American Source' providing information, and describes the surveillance of individuals suspected of arms dealing and communist affiliations, such as Richard Rown and Charles Lufborrow. Sharing this information could compromise these sources and impede ongoing investigations. Directly quoting: 'The Costa Rican authorities have sent some of their best intelligence agents to Golfito to investigate the movements of Arture BOTERO...'",
  "security_level": "SECRET",
  "summary": "A report detailing alleged illicit armament traffic and communist activities in Costa Rica during August and September 1950, based on information from a controlled American source and investigated by Colombian authorities.",
  "summary_one_paragraph": "This SECRET report, dated September 18, 1950, relays information regarding alleged illicit arms trafficking and communist activity in Costa Rica. It summarizes a report from the Colombian National Chief of Detectives following an investigation in Costa Rica concerning clandestine arms movements possibly destined for Colombia. The report identifies individuals involved, including American citizens Richard Rown and Charles Lufborrow, and notes communist influence in the Palmar and Piedras Blancas regions. The investigator recommends that the Colombian government offer scholarships to young Costa Ricans for detective training in Colombia, to establish an organization that would reflect Colombian interests in Central America.",
  "tags": [
    "Illicit Arms Traffic",
    "Costa Rica",
    "Colombia",
    "Communism",
    "Richard Rown",
    "Charles Lufborrow",
    "Fulgencio Lequerica Velez",
    "Carlos Rodriguez Teller",
    "José Figueres Ferrer",
    "Legión Caribe",
    "Golfito",
    "Palmar",
    "Piedras Blancas",
    "FOIA"
  ],
  "title": "Illicit Armament Traffic Report",
  "date": "1950-09-18",
  "locations_mentioned": [
    "Bogotá, Colombia",
    "Costa Rica",
    "Golfito",
    "Palmar",
    "Piedras Blancas",
    "Puerto Limon",
    "Panama",
    "Sierpe",
    "San José",
    "Mexico",
    "Guatemala",
    "Venezuela"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Carlos RODRIGUEZ Teller",
    "Arturo Botero",
    "Richard Rown",
    "Charles LUFBORROW",
    "Carlos VALDES Gonzalez",
    "Jose FIGURES",
    "Fulgencio LEQUERICA Velez",
    "José Figueres Ferrer",
    "Juan Busch",
    "Angel y Juan Rodriguez",
    "José Pars",
    "Manuel Mora Valverde",
    "Teodoro Picado",
    "Gilberto Vieira",
    "Prío Socrrás",
    "Edgar Gerier Quirós",
    "Manuel Angel Frafres",
    "Calderón Valdés",
    "Jacobo Arbenz Guzmán"
  ],
  "recipient": "Hdqtrs.",
  "sender": "Wallace H. Ladison"
}