{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "Revealing that the Lykes Brothers Steamship Company is utilized as a source of foreign intelligence information, and that DCD provides introductions for Cover and Commercial Staff officers could compromise intelligence gathering operations. Specifically, the memo states, \"The Domestic Collection Division (DCD) utilizes the Lykes Brothers Steamship Company primarily as a source of foreign intelligence information. Secondarily, DCD provides introductions for Cover and Commercial Staff officers to Lykes Brothers/officials for operational discussions...\"",
  "security_level": "SECRET",
  "summary": "A memo from Jackson R. Horton to the Special Assistant to the DDO regarding the SSC request for information on Lykes Brothers Steamship Company and Owen Johnson Darnell. DCD uses Lykes Brothers for foreign intelligence and introductions, and Darnell was considered a 'source lead' but never used.",
  "summary_one_paragraph": "This memorandum, dated May 20, 1976, is from Jackson R. Horton, Chief of the Domestic Collection Division (DCD), to the Special Assistant to the DDO, addressing an SSC request about the Lykes Brothers Steamship Company and Owen Johnson Darnell. The memo states that the DCD uses Lykes Brothers primarily for foreign intelligence information and secondarily to provide introductions for Cover and Commercial Staff officers, and to obtain assessment data on potential foreign targets. It also notes that Owen Johnson Darnell was considered a 'source lead' before 1965 but was never utilized, and his file was destroyed in June 1971 per DCD authorization.",
  "tags": [
    "Lykes Brothers Steamship Company",
    "Owen Johnson Darnell",
    "Domestic Collection Division",
    "Foreign Intelligence",
    "Covert Operations",
    "Source Lead",
    "SSC Request",
    "FOIA"
  ],
  "title": "SSC Request for Information on Lykes Brothers Steamship Company and Owen Johnson Darnell",
  "date": "1976-05-20",
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Jackson R. Horton",
    "Owen Johnson Darnell"
  ],
  "recipient": "Special Assistant to the DDO",
  "sender": "Jackson R. Horton (Chief, Domestic Collection Division)"
}