{
  "classification": "Soviet",
  "document_type": "Report",
  "security": "These documents detail information about KGB defector Yuriy I. Nosenko, including assessments of his bona fides, statements from Soviet officials, and summaries of KGB operations. The documents state, \"Certain portions of Annex A of this study are deleted since it contains information which bears on the security of ongoing, viable CIA operations, or is related thereto.\" and \"We have deleted certain portions of these pages containing information which bears on the security of ongoing, viable CIA operations, or is related thereto.\"",
  "security_level": "TOP SECRET",
  "summary": "This document contains information pertaining to the defection of KGB officer Yuriy Ivanovich Nosenko, including statements from Soviet officials, assessments of his claims, and details on KGB operations. Portions have been redacted to protect ongoing CIA operations.",
  "summary_one_paragraph": "This document, dated October 1, 1968, consists of a summary and related annex concerning the case of KGB defector Yuriy Ivanovich Nosenko, along with pages from a Top Secret study dated February 1968, which examines Nosenko’s bona fides. The documents include statements from Soviet officials about Nosenko, summaries of cases, and an index of personalities. Certain portions have been deleted to protect the security of ongoing CIA operations. The material was forwarded for review and then requested to be returned.",
  "tags": [
    "KGB",
    "Nosenko",
    "Defector",
    "Counterintelligence",
    "CIA",
    "Soviet Officials",
    "Operations",
    "Security",
    "FOIA"
  ],
  "title": "Statements of Soviet Officials About NOSENKO & Examination of the Bona Fides of a KGB Defector - Yuriy I. NOSENKO",
  "persons_mentioned": [
    "Yuriy Ivanovich Nosenko",
    "General Gribanov",
    "Svenchanskiy",
    "Slesinger",
    "Koten",
    "Shubin",
    "Barghoorn",
    "Oswald",
    "Cherepanov",
    "George Blake",
    "Flippel",
    "Johannes Preisfreund",
    "Golitsyn",
    "Shakhov",
    "S.M. Golubev",
    "S.K. Tsarapkin",
    "Rastvorov",
    "Petrov",
    "Deryabin",
    "I.S. Mayorov",
    "M.S. Tsymbal",
    "Ambassador Zorin",
    "Yu.I. Guk",
    "Kislov",
    "Yu. M. Dvorkin",
    "A.A. Vetlitskiy",
    "Sokolov",
    "S.M. Fedoseyev",
    "Artamonov",
    "Ivan I. NOSENKO",
    "Kobulov"
  ],
  "recipient": "Unspecified (For Review)",
  "sender": "CIA - Unspecified"
}