{
  "classification": "Liaison",
  "document_type": "Routing and Record Sheet/Correspondence",
  "security": "Dissemination of this information outside the DDO requires coordination with E/BC.",
  "security_level": "CONFIDENTIAL",
  "summary": "Correspondence from Sergyj Czornonoh to British and U.S. officials regarding information he claims to have provided about Lee Harvey Oswald in 1963, including alleged warnings about Oswald's intent to assassinate President Kennedy. The documents also include Czornonoh's claims of FBI harassment and mind control.",
  "summary_one_paragraph": "This collection of documents primarily consists of letters from Sergyj Czornonoh to various British and American authorities in March 1978, relaying his claims of having informed officials in Sofia, Bulgaria, and London in 1963 about Lee Harvey Oswald's intentions to assassinate President John F. Kennedy. Czornonoh asserts he reported this information to an American Vice Consul and British police, and he requests these agencies to verify his record. He also details alleged harassment, torture, and mind control by FBI agents, suggesting a conspiracy to use him in political assassinations, and includes correspondence indicating his claims were shared with the FBI and the HSCA.",
  "tags": [
    "Sergyj Czornonoh",
    "Lee Harvey Oswald",
    "John F. Kennedy",
    "Assassination",
    "FBI",
    "Mind Control",
    "Conspiracy",
    "British Embassy",
    "HSCA",
    "Sofia",
    "Bulgaria"
  ],
  "title": "Sergyj Czornonoh claims regarding Lee Harvey Oswald and alleged FBI harassment",
  "conspiracy": "The documents include Czornonoh's claim of warning officials about Oswald's intent to assassinate President Kennedy. Additionally, Czornonoh claims that the Director of Special Counselor Service at the Department of State was informed that Oswald would be killed after killing Kennedy and that Dr. Martin Luther King, Jr. would also be killed, specifically mentioning James Earl Ray. Czornonoh alleges that the FBI used anesthesia gas to drug him and induce amnesia.",
  "date": "1978-03-30",
  "persons_mentioned": [
    "Sergyj Czornonoh",
    "Lee Harvey Oswald",
    "John F. Kennedy",
    "Tom Blackshear",
    "Mr. Smith",
    "James Callaghan",
    "Jimmy Carter",
    "Daniel K. Inouye",
    "Mr. Wasilev",
    "Besera Asenova",
    "Mr. Kippingan",
    "Martin Luther King, Jr.",
    "James Earl Ray",
    "Richard A. Sprague"
  ],
  "recipient": "British Embassy, U.S. Government, Russian Ambassador",
  "sender": "DH Jones for G M L Blackburne-Kane, Sergyj Czornonoh, Leslie Kay"
}