{
  "classification": "Operations",
  "document_type": "File/Dispatch/Memorandum/Report",
  "security": "This file details the operational aspects of Project LIENVOY, including the monitoring of specific individuals and embassies, as well as the processing and exploitation of intelligence gathered. Disclosing this information could compromise ongoing intelligence operations, reveal sensitive sources and methods (such as telephone tapping), and damage relations with foreign governments. Specifically, the file mentions, 'The agreement made with top Mexican officials...is as much in effect today as it was at the start', indicating a clandestine agreement that could be jeopardized if revealed.",
  "security_level": "SECRET",
  "summary": "This file documents Project LIENVOY operations from January 1962 to December 1963, including telephone intercepts of Cuban, Soviet, Czech, and Yugoslav embassies, as well as key individuals, and details the processing, exploitation, and personnel involved in the operation.",
  "summary_one_paragraph": "This file encompasses Project LIENVOY activities between January 1962 and December 1963, detailing the monitoring of various targets, including the Cuban, Soviet, Czech, and Yugoslav embassies, alongside Mexican political figures and organizations. The file contains dispatches from the Chief of Station in Mexico City to Headquarters, reporting on the operational aspects of LIENVOY, such as target lines, processing of information, personnel involved (including translators), and liaison activities. It also includes a memorandum assessing the effectiveness of LIENVOY and its counterpart, LIFEAT, emphasizing the importance of intelligence targeting, efficient processing, and the quality of the monitoring staff.",
  "tags": [
    "LIENVOY",
    "LIFEAT",
    "Mexico City",
    "Telephone Intercepts",
    "Cuban Embassy",
    "Soviet Embassy",
    "Czech Embassy",
    "Yugoslav Embassy",
    "Intelligence Operations",
    "KDBADGER",
    "Counterintelligence",
    "Political Surveillance"
  ],
  "title": "KDBADGER File: Operations - Project LIENVOY Vol I",
  "date": "1963-12-19",
  "locations_mentioned": [
    "Mexico City",
    "Cuba",
    "Soviet Union",
    "Czech Republic",
    "Yugoslavia",
    "United States",
    "Caracas",
    "Panama"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Lazaro Cardenas del Rio",
    "Braulio Maldonado Sandez",
    "Alonso Aguilar Monteverde",
    "Jorge Leonidas Tamayo Castillejos",
    "Jose David Alfaro Siqueiros",
    "Roberto Romero Adams",
    "Enrique Gonzalez Pedrero",
    "Ignacio Acosta Lagunes",
    "Manuel Rangel Escamilla",
    "Fidel Castro",
    "Orville Horsfall",
    "David B. Schlageter",
    "Victor W. Obold",
    "Douglas J. Feinglass",
    "Oliver G. Galbond",
    "Willard C. Curtis",
    "Gregory D. Parmuth",
    "Paul V. Levister",
    "Woodrow Gabfott",
    "Nikolaly Sergeyevich Leonov",
    "Paul Baran",
    "Svyatoslav Fedorovich Kuznetsov",
    "Gerard Campagna",
    "Manuel Vega Perez"
  ],
  "recipient": "Chief, WH Division",
  "sender": "Chief of Station, Mexico City"
}