{
  "classification": "John F. Kennedy Assassination Records Act",
  "document_type": "File Review/Memorandum/Name Check Request",
  "security": "Releasing details of Gordon Barton McLendon's assessment and potential recruitment could compromise ongoing or future intelligence operations. Disclosing CIA interest in McLendon may hinder future recruitment efforts. Quote: 'Subject will be contacted and assessed on a witting basis in support of WUENTREE.'",
  "security_level": "SECRET/CONFIDENTIAL",
  "summary": "This file contains documents related to Gordon Barton McLendon, including a review of his 201 file, a memorandum discussing his potential as a witting collaborator, and a name check request. It details the CIA's interest in McLendon and actions taken to assess his suitability for operational support.",
  "summary_one_paragraph": "This collection of documents pertains to Gordon Barton McLendon, a U.S. citizen and owner of multiple radio stations, and his interactions with the CIA. Included are records of a 201 file review categorizing McLendon, a 1972 memo detailing discussions about McLendon's desire to assist the government and his business activities, and a name check request from 1972 consolidating information about him. The documents also involve requests for security clearances and operational approvals related to McLendon's potential use in CIA projects, with discussions dating back to 1952 about providing accreditation in Japan to a contract agent.",
  "tags": [
    "Gordon Barton McLendon",
    "201 File",
    "Witting Collaborator",
    "Name Check",
    "Security Clearance",
    "Operational Approval",
    "CIA",
    "WUENTREE",
    "File Review"
  ],
  "title": "MCLENDON, GORDON 201-79764",
  "date": "1975-01-06",
  "locations_mentioned": [
    "Paris, Texas",
    "Dallas, Texas",
    "Denton, Texas",
    "Washington, D.C.",
    "Stockholm",
    "Japan"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Gordon Barton McLendon",
    "John K. McLean",
    "Wallace Lampshire",
    "Lincoln Epworth",
    "Ikvo Kasai",
    "Frederick Larkin, Jr.",
    "Eli Wilcoxen",
    "Peter Beers",
    "William A. Foyer",
    "Robert K. Carr",
    "Howell d. Christy",
    "James Gl. Kole",
    "John F. Brewer"
  ],
  "recipient": "DO/S90",
  "sender": "Lan H. Girardi"
}