{
  "classification": "Security",
  "document_type": "Memorandum",
  "security": "Disclosure of Maheu's association with the CIA and his involvement in sensitive operations, such as the attempted assassination of Fidel Castro and the procurement of feminine companionship for King Hussein, could severely damage the CIA's reputation and compromise past and potentially future operations. Specifically, mentioning “The use of a member of the Mafia in an attempt to assassinate Fidel Castro, initiated in August 1960” reveals unethical operational practices. His utilization for non-official cover purposes also exposes methods that, if revealed, could compromise current intelligence activities.",
  "security_level": "SECRET",
  "summary": "This memorandum details the background of Robert A. Maheu, including his employment history, his association with the FBI and CIA, and his involvement in sensitive assignments such as the attempted assassination of Fidel Castro and providing companionship to King Hussein.",
  "summary_one_paragraph": "This \"Eyes Only\" memorandum, dated October 4, 1973, provides a comprehensive background of Robert A. Maheu, born October 30, 1917. It covers his career from being an FBI Special Agent (1940-1947) to his work as a Special Assistant in the Small Business Administration and eventual establishment of Robert A. Maheu Associates. The memo highlights Maheu’s recruitment by the Office of Security in 1954, his Covert Security Approval, and his involvement in sensitive assignments, including procuring feminine companionship for King Hussein, an attempt to assassinate Fidel Castro using Johnny Roselli, and providing cover for Clandestine Service officers. The memo indicates that no contact has been made with Maheu since the termination of the cover arrangement.",
  "tags": [
    "Robert A. Maheu",
    "FBI",
    "CIA",
    "Office of Security",
    "King Hussein",
    "Fidel Castro",
    "Johnny Roselli",
    "Covert Operations",
    "Family Jewels",
    "Covert Security Approval",
    "Assassination"
  ],
  "title": "Robert A. Maheu",
  "date": "1973-10-04",
  "persons_mentioned": [
    "Robert A. Maheu",
    "King Hussein",
    "Johnny Roselli",
    "Fidel Castro",
    "Carmine S. Bellino"
  ],
  "recipient": "Unspecified",
  "sender": "Unspecified"
}