{
  "classification": "Personnel",
  "document_type": "Memo",
  "security": "Releasing Bagley's personnel file, specifically items like fitness reports and promotion recommendations, could reveal performance assessments and career trajectories, potentially harming his professional reputation. The memo states that some personnel records are classified, indicating sensitive information that could be compromised. Revealing that Bagley is retired in Belgium under State cover is also problematic: “CCS has a standing position on non-release of citations and awards to persons retired under cover (Bagley is retired in Belgium under State caver) so he would have to make a decision on that before he could have the material.”",
  "security_level": "INTERNAL - ADMINISTRATIVE USE ONLY",
  "summary": "A memo detailing a request from Tennent Bagley's attorney for specific documents related to Bagley's career and testimony, and outlining internal considerations regarding the release of classified personnel information and cover status.",
  "summary_one_paragraph": "This memo, dated November 16, 1978, outlines a request made by Tennent Bagley's attorney for several documents, including memos concerning Nosenko's disposal options and polygraph, a letter regarding 'devastating consequences,' and Bagley's complete personnel file. The memo details internal discussions regarding the release of this information, noting concerns about Bagley's cover status in Belgium, the classified nature of some personnel records, and the CI Staff's position on materials not directly cited in Hart's testimony. John McMahon and Mike Malanik were consulted, with the understanding that Bagley should be treated as anyone else once his cover is addressed, and Bagley has expressed intent to have his cover removed.",
  "tags": [
    "Tennent Bagley",
    "HSCA",
    "Personnel File",
    "Nosenko",
    "Cover Status",
    "Classification",
    "FOIA"
  ],
  "title": "Tennent Bagley",
  "date": "1978-11-16",
  "persons_mentioned": [
    "Tennent Bagley",
    "Nosenko",
    "John McMahon",
    "Mike Malanik",
    "Dick Rininger",
    "Mr. Chabot",
    "Helms",
    "Hart"
  ],
  "recipient": "File",
  "sender": "SDBreckinridge"
}