{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Disclosing the identities of AMCARBON-1, AMCARBON-2, and other individuals involved in these operations, as well as the codenames for entities like JMWAVE and KUBARK, could compromise ongoing intelligence activities, expose sources, and undermine the CIA's ability to gather information and influence media narratives in the region. Also exposing operational support activities using journalistic contacts could damage sources and methods. Quoting the document: \"In keeping with the traditional pattern of source protection which is common to newspapermen, intelligence officers and law enforcement officers, AMCARBON-1 attempts to guard the true identity of all of his sources.\"",
  "security_level": "SECRET",
  "summary": "This dispatch details JMWAVE's relationship with AMCARBON-1, a journalist, outlining how he provides operational support, intelligence, and serves as a propaganda outlet, while also protecting KUBARK's operations in South Florida.",
  "summary_one_paragraph": "This secret dispatch from April 2, 1964, discusses JMWAVE's operational relationship with AMCARBON-1, a journalist who provides operational support, intelligence, and propaganda dissemination, while also ensuring the protection of KUBARK operations in South Florida; AMCARBON-1's journalistic career, contacts, and support activities, such as locating individuals and discrediting targets, are described. The journalist's role as a propaganda outlet includes publishing articles on topics of interest to KUBARK, like the AMCRAB-1 defection story and the LAYC meeting.",
  "tags": [
    "CIA",
    "JMWAVE",
    "KUBARK",
    "AMCARBON-1",
    "Propaganda",
    "Operational Support",
    "Intelligence",
    "South Florida",
    "Media Relations",
    "Cuba",
    "Miami Herald"
  ],
  "title": "Special Activities Report on JMWAVE'S Relationship with AMCARBON-1",
  "date": "1964-04-02",
  "locations_mentioned": [
    "Miami, Florida",
    "Cuba",
    "Latin America",
    "Santiago, Chile",
    "Houston, Texas",
    "Puno, Peru",
    "Montevideo, Uruguay"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "AMCARBON-1",
    "AMCARBON-2",
    "REUTEMAN",
    "Luis FERNANDEZ Rocha",
    "Manolo RAY Rivero",
    "Carlos FODD y Lobo",
    "AMBIDDY-1",
    "Aureliano SANCHEZ Arango",
    "Edmund LEAHY",
    "Robert KENNEDY",
    "Frank FIORINI",
    "Eduardo SUAREZ Riva",
    "Luis MUNOZ Marin",
    "Juan BOSCH Gavino",
    "Charles KEELY",
    "Jorge VOLSKY Kraisler",
    "Tad SZULC",
    "Andrew ORDONO Camps",
    "Carlos BANDIN Cruz",
    "AMBEND-1",
    "Alex E. CARLSON",
    "Trevor ARMBRISTER",
    "Carlos MONTALVANO",
    "Armando Andres GUIROLA Forte",
    "AMCRAB-1",
    "Charles GRIFFIN",
    "Joaquin Mas Martinez",
    "Salvador Allende",
    "Jorge Alessandri",
    "Aldo Alvarez"
  ],
  "recipient": "Chief of Station, JMWAVE",
  "sender": "Chief, Special Affairs Staff"
}