{
  "classification": "Soviet",
  "document_type": "Memorandum",
  "security": "The documents discuss the involuntary confinement of Yurily Ivanovich Nosenko, a KGB defector, and details of his living conditions during that time. Releasing these details could expose methods and locations used for confining defectors. Additionally, the mention of obtaining prostitutes for Nosenko during a trip to Florida could damage the CIA's reputation. Quoting: \"During this trip, Agency personnel, with apparent Headquarters approval, obtained the services of prostitutes. This apparently occurred on at least two occasions.\"",
  "security_level": "TOP SECRET-EYES ONLY",
  "summary": "This document provides background information on Yurily Ivanovich Nosenko, a Soviet KGB officer who defected to the U.S. in 1964 and was involuntarily confined by the CIA for approximately three years, and details his confinement, employment as a consultant, and later life as a U.S. citizen under Agency contract.",
  "summary_one_paragraph": "The document outlines the history of Yurily Ivanovich Nosenko, a Soviet KGB officer who defected in 1964, his confinement by the CIA from April 1964 to October 1967 in Clinton, Maryland, and Camp Peary, Virginia, due to questions about his bona fides, legal justifications for his confinement approved by the Deputy Attorney General and Agency General Counsel, and the agency's ongoing consultations with him as a paid consultant earning $23,500 per year, including details about his living conditions during confinement and a controversial incident involving the procurement of prostitutes during a trip to Florida, with the Office of Security maintaining files on his case.",
  "tags": [
    "Yurily Ivanovich Nosenko",
    "KGB",
    "Defector",
    "CIA",
    "Confinement",
    "Counterintelligence",
    "Security",
    "Richard Helms",
    "Lawrence Houston"
  ],
  "title": "Yurily Ivanovich NOSENKO",
  "date": "1964-02-13",
  "locations_mentioned": [
    "Switzerland",
    "U.S.",
    "Clinton, Maryland",
    "Camp Peary, Virginia",
    "Washington, D.C.",
    "Germany",
    "USSR",
    "Moscow",
    "Geneva",
    "Frankfurt",
    "Ukraine"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Yurily Ivanovich Nosenko",
    "Richard Helms",
    "Lawrence Houston",
    "David E. Murphy",
    "Charles Kane",
    "Jack Bauman",
    "Charles Bohrer",
    "Bagley",
    "Karpovich",
    "McMahon",
    "Raymond F. Farrell",
    "Victor R. White",
    "Frank E. Bartos",
    "H. J. Osborn",
    "Thomas Karamessines",
    "McGeorge Bundy",
    "Andre Gromyko",
    "Foy Kooler",
    "Semyon Tsarapkin",
    "William C. Foster",
    "Tad Szulc",
    "Chalmers M Roberts"
  ],
  "recipient": "DD/OS",
  "sender": "Chief, SR Division"
}