{
  "classification": "Operations",
  "document_type": "Memorandum and Intelligence Reports",
  "security": "Several sections discuss the operational use of Bruce Berkman and the Wackenhut Corporation, including potential activities in Latin America and the Middle East. Revealing these activities, particularly the intent to use a US company to gather information from SONATRACH in Algeria, could compromise ongoing or future intelligence operations. The document directly states: 'ACTIVITY WOULD BE CONDUCTED THROUGH A SUBSIDIARY AND INVOLVES THE PROTECTIVE, NON-INVESTIGATORY, CLIMATE OF THE COMPANY.'",
  "security_level": "SECRET",
  "summary": "This file contains memos and reports regarding Bruce Berkmans, a former CIA staff agent now working for Wackenhut Corporation, and discusses the possibility of using him as a DCD contact and gathering information from Wackenhut's international operations, including a potential contract with SONATRACH in Algeria.",
  "summary_one_paragraph": "This collection of documents pertains to DCD (Domestic Collection Division) Case 65805 concerning Bruce Berkmans, a former CIA agent now employed by the Wackenhut Corporation. The documents reveal discussions about re-establishing contact with Berkmans to potentially leverage his position for intelligence gathering, including information related to a significant contract Wackenhut is negotiating with SONATRACH, the Algerian national oil and gas company. The memos and intelligence reports detail meetings with Berkmans, his offer to act as a voluntary contact, and the Agency's internal deliberations on whether to pursue a relationship given his past grievances against the Agency and potential operational conflicts. The file also covers Wackenhut's activities in Latin America and the Middle East, along with assessments of Berkmans' reliability and potential future use.",
  "tags": [
    "CIA",
    "DCD",
    "Wackenhut Corporation",
    "Bruce Berkmans",
    "SONATRACH",
    "Algeria",
    "Intelligence Gathering",
    "LPGLOBE",
    "Covert Operations",
    "Executive Protection",
    "Latin America",
    "Middle East"
  ],
  "title": "JACKENHUT CORP.",
  "date": "1976-06-23",
  "locations_mentioned": [
    "Miami, Florida",
    "Coral Gables, Florida",
    "Algeria",
    "Latin America",
    "Middle East",
    "Jamaica"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Bruce Berkmans",
    "George Wackenhut",
    "Tom Clines",
    "Anthony Goldin",
    "Lloyd C. Burnett",
    "Jon French",
    "Mainwaring"
  ],
  "recipient": "DCD/Headquarters",
  "sender": "DCD/Miami"
}