{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "Revealing details of individuals involved in anti-Castro activities and their connections to terrorist groups could compromise their safety and ongoing operations. Also, mentioning the Agency's contact with Vera and the nature of that contact could reveal intelligence-gathering methods. For example: \"Lesnick was associated with Orlando Bosch and was involved in and supported a number of Cuban exile revolutionary groups' terrorist activities.\"",
  "security_level": "SECRET",
  "summary": "This document contains cables and reports about Max Lesnick and Aldo Vera, two Cuban exiles involved in anti-Castro activities, including details of their associations with exile groups and potential terrorist connections.",
  "summary_one_paragraph": "The document includes cables from 1979 and 1976 pertaining to Max Lesnick and Aldo Vera, both Cuban exiles. Lesnick, publisher of 'Replica' in Miami, is noted for his associations with Orlando Bosch and involvement in Cuban exile revolutionary groups' terrorist activities, as well as alleged connections to narcotics traffic and a plot against the Torrijos government in Panama. Vera, a former leader against Batista and member of Castro’s government before becoming a refugee in the U.S., was later assassinated in Puerto Rico. The cables detail their backgrounds, activities, and interactions with the FBI, with a focus on providing information that could be passed to the 470th.",
  "tags": [
    "Max Lesnick",
    "Aldo Vera",
    "Cuban Exiles",
    "Anti-Castro",
    "Terrorist Activities",
    "Orlando Bosch",
    "FBI",
    "WNINTEL",
    "FGI EMPYREX",
    "CUIS",
    "REPLICA",
    "AMWORLD",
    "Internal Security",
    "WILD STALLION",
    "FCI - CURA"
  ],
  "title": "LESNICK MAX",
  "date": "1979-02-09",
  "locations_mentioned": [
    "Havana, Cuba",
    "Dominican Republic",
    "Miami, Florida",
    "Puerto Rico",
    "Panama"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Max Lesnick",
    "E. Menendez",
    "Orlando Bosch Avila",
    "Aldo Inocencio Vera Serafin",
    "Fidel Castro",
    "Gabriel Gregorio Rodriguez",
    "Torrijos",
    "Samuel Lesnick",
    "Teresa Miriam Menendez",
    "Harry Irevey",
    "Leslie Brudzinski",
    "Paulette Dancy",
    "W. Murray",
    "CIN (likely initials)",
    "MeH (likely initials)"
  ],
  "recipient": "Washington",
  "sender": "SANTO DOMINGO"
}