{
  "classification": "Cuba",
  "document_type": "Dispatch/FBI Documents/Cable",
  "security": "These documents reveal the FBI and CIA's active monitoring and information gathering on Cuban exile groups and individuals, specifically Orlando Bosch, including his aliases, movements, and alleged terrorist activities. Releasing details about sources, methods, and specific intelligence passed to foreign security forces could compromise ongoing investigations, jeopardize sources, and strain international relations.",
  "security_level": "SECRET/CONFIDENTIAL",
  "summary": "This collection of FBI and CIA documents from 1973-1974 focuses on Orlando Bosch, a Cuban exile and alleged terrorist, and the activities of Cuban exile groups such as Accion Cubana. The documents detail Bosch's movements, aliases, connections, and the efforts of U.S. agencies to track and apprehend him, coordinating with foreign security forces.",
  "summary_one_paragraph": "This compilation of FBI and CIA documents, spanning from 1973 to 1974, centers on Orlando Bosch, a Cuban exile wanted for parole violation and alleged involvement in terrorist activities. The documents reveal details regarding Bosch's aliases (Efrain LEITOKE, Errain Lettone), his travels through Venezuela, Curacao, and potential presence in Quito. Also reported are the efforts of U.S. agencies to monitor his activities, coordinate with foreign law enforcement (specifically in Ecuador and Venezuela), and track his connections to Cuban exile groups like Accion Cubana, including their claimed responsibility for bombings. The documents also mention the assistance provided by Assistant Legat Gordon Ellison in identifying and locating Bosch, who is described as armed, dangerous, and traveling with a false Dominican passport.",
  "tags": [
    "FBI",
    "CIA",
    "Orlando Bosch",
    "Accion Cubana",
    "Cuban Exiles",
    "Terrorism",
    "Fugitive",
    "Parole Violation",
    "OAS Conference",
    "Quito",
    "Venezuela",
    "Curacao"
  ],
  "title": "FBI/CIA Documents Regarding Orlando Bosch and Cuban Exile Activities",
  "date": "1974-11-29",
  "locations_mentioned": [
    "Miami",
    "Quito, Ecuador",
    "Bogota",
    "Guayaquil",
    "Madrid, Spain",
    "Caracas, Venezuela",
    "Curacao",
    "Santo Domingo",
    "Dominican Republic",
    "Ottawa, Ontario, Canada",
    "Mexico City, Mexico",
    "Las Villas Province, Cuba",
    "Lima",
    "Atlanta"
  ],
  "origin_agency": "FBI/CIA",
  "persons_mentioned": [
    "Orlando Bosch Avila",
    "Efrain LEITOKE",
    "Errain Lettone",
    "Roberto Verdaguer Boan",
    "Gordon Ellison",
    "Miguel Gallastegui",
    "Max Lesnick",
    "Alfredo Santiago Boler Alverez",
    "Ricardo Feliciano Casanueva"
  ],
  "recipient": "Various FBI/CIA offices and personnel",
  "sender": "Theodore E. KUVALLIS/Harry Archer/Director, FBI"
}