{
  "classification": "Personnel",
  "document_type": "Dispatch",
  "security": "Disclosing that Melbourne Station is seeking to contact Patrick PO HLA for discussions could potentially compromise the operation. The specific lines of inquiry are not detailed, but any unauthorized revelation of contact could alert the subject or others to the intelligence interest. The passage, \"Please advise if still desired that Melbourne Station contact subject\" highlights the risk of exposure if this information is leaked.",
  "security_level": "SECRET",
  "summary": "This dispatch concerns Patrick PO HLA, who is being considered for discussions with Melbourne Station, and relays information about his availability and his daughter's family's intention to leave Rangoon.",
  "summary_one_paragraph": "A secret dispatch dated October 10, 1968, communicates between various CIA stations (Bangkok, Rangoon, Melbourne, and Far East Division) regarding Patrick PO HLA and his potential for discussions with Melbourne Station. The dispatch references prior communications outlining the discussions' intended nature and notes PO HLA's availability after November 4, 1968. It also highlights PO HLA's expressed anti-communist stance and his past experiences, including work in Vietnam. For Rangoon Station, it points out a detail from PO HLA's letter indicating his daughter's and her family's plans to leave Rangoon permanently, inquiring if Rangoon has relevant information about this situation given the daughter's marriage to a Burma Air Force pilot.",
  "tags": [
    "CIA",
    "Patrick PO HLA",
    "Melbourne Station",
    "Bangkok Station",
    "Rangoon Station",
    "Far East Division",
    "Anti-Communism",
    "Personnel",
    "Vietnam",
    "Burma"
  ],
  "title": "Patrick PO HLA",
  "date": "1968-10-10",
  "locations_mentioned": [
    "Bangkok",
    "Rangoon",
    "Melbourne",
    "Thailand",
    "Perth",
    "Rio Tinto",
    "Copper Project",
    "Vietnam",
    "Rayoon",
    "Australia",
    "KIETA",
    "BOUGAINVILLE",
    "NEW GUINEA"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Patrick PO HLA",
    "Leslie H. GEVOLB",
    "Daughter of Patrick PO HLA",
    "Son-in-law of Patrick PO HLA",
    "Grandson of Patrick PO HLA"
  ],
  "recipient": "Chief of Station, Bangkok; Chief of Station, Rangoon; Chief, Far East Division; Chief of Station, Melbourne",
  "sender": "Not known"
}