{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Dispatch",
  "security": "Revealing Pawley's business activities and his procurement of Dominican postage stamps could compromise his relationships and create diplomatic issues, as the document details sensitive business activities and relationships with government officials. Quoting directly: \"Another activity which is kept very much under wraps is the concession granted PARLEY for procurement and world-wide sale of all new issues of Dominican postage stamps.\"",
  "security_level": "SECRET",
  "summary": "A dispatch from the Chief of Station in Ciudad Trujillo reports on William D. Pawley's business interests in the Dominican Republic, including mineral exploitation and a postage stamp concession managed by his brother, Edward F. Pawley.",
  "summary_one_paragraph": "This secret dispatch, sent from the Chief of Station in Ciudad Trujillo on June 12, 1958, details the operational activities surrounding William D. Pawley’s business interests in the Dominican Republic. It highlights Pawley's investments in mineral exploitation and his impending purchase of the Hotel Hamaca in Boca Chica. The dispatch also reveals a concealed concession granted to Pawley for the procurement and global sale of new Dominican postage stamps, managed by his brother Edward F. Pawley, and includes information sourced from Mrs. Nora Britzius, a U.S. citizen employed by Pawley, who confidentially disclosed these details at a social gathering.",
  "tags": [
    "CIA",
    "William D. Pawley",
    "Dominican Republic",
    "Business Interests",
    "Postage Stamps",
    "Hotel Hamaca"
  ],
  "title": "PAWLEY Business Interests in the Dominican Republic",
  "date": "1958-06-12",
  "locations_mentioned": [
    "Dominican Republic",
    "Ciudad Trujillo",
    "Boca Chica"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "William D. Pawley",
    "Edward F. Pawley",
    "Nora Britzius",
    "Helene I. Dahlerup"
  ],
  "sender": "Chief of Station, Ciudad Trujillo"
}