{
  "classification": "Personnel",
  "document_type": "Memorandum",
  "security": "This memo details an arrangement to place a Contract Agent on retainer through a corporate cover, involving financial transactions designed to obscure the Agency's involvement. Revealing these details could expose covert operational methods, compromise the identities of individuals and entities involved, and undermine the Agency's ability to conduct similar operations in the future. Directly quoting: \"Provision is made in this amount to offset any nominal expenses the firm incurs in its overt associations or support of(TOPHONE/1. It also serves, in part, to minimize the chances that auditing personnel will identify a wash transfer between the notional facility and payments to(TOPHONE/1.\"",
  "security_level": "SECRET",
  "summary": "A memo from Joel E. Keys to Chief, Contract Personnel Division, requesting a Letter of Agreement to place a Contract Agent on retainer through (P)BLUE, a firm whose President, Emmett M. Steele, has agreed to the arrangement, effective October 1, 1976.",
  "summary_one_paragraph": "This SECRET memorandum, dated October 7, 1976, from Joel E. Keys, Chief of the Corporate Cover Branch, to the Chief of the Contract Personnel Division, requests the preparation of a Letter of Agreement for placing a Europe Division Contract Agent, (TOPHONE/1, on retainer with (P)BLUE. Under the agreement, (P)BLUE, through its President Emmett M. Steele, will pay (TOPHONE/1 an annual retainer of $9,000 in monthly installments, while the Agency will reimburse (P)BLUE $10,000 annually via a contrived contractual arrangement. The memo outlines measures to ensure secrecy and prevent detection of the Agency's involvement, including provisions for nominal expenses and minimizing the risk of identifying a wash transfer during audits.",
  "tags": [
    "CIA",
    "Contract Agent",
    "Corporate Cover",
    "Retainer Agreement",
    "Covert Operation",
    "Financial Arrangement",
    "Secrecy",
    "Emmett M. Steele",
    "TOPHONE/1",
    "Joel E. Keys"
  ],
  "title": "Request for Letter of Agreement",
  "date": "1976-10-07",
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Emmett M. Steele",
    "John J. Murray, Jr.",
    "Joel E. Keys",
    "Rod Brooks"
  ],
  "recipient": "Chief, Contract Personnel Division",
  "sender": "Joel E. Keys, Chief, Corporate Cover Branch"
}