{
  "classification": "Soviet",
  "document_type": "Memo",
  "security": "Disclosing the plan for 'hostile interrogation' of Nosenko could expose interrogation methods. Revealing suspicions of Soviet control over FBI sources could damage liaison relationships. Quoting directly: 'The DDP and Chief, SR met with Ambassador Thompson in his office to advise him of our plans to proceed to hostile interrogation in order to clarify the NOSENKO case' and 'it was the opinion of several officers in the Clandestine Services that some of these FBI sources were under Soviet control whereas the FBI believed them to be genuine'.",
  "security_level": "UNCLASSIFIED",
  "summary": "A memo details a meeting between the DDP, Chief of SR, and Ambassador Thompson regarding plans for a hostile interrogation of Yuriy Ivanovich Nosenko to clarify his case, including discussions about escape, suicide, and potential turn-back scenarios.",
  "summary_one_paragraph": "This memorandum, dated January 21, 1965, outlines a meeting involving the DDP, Chief of SR, and Ambassador Thompson concerning the planned hostile interrogation of Yuriy Ivanovich Nosenko, a suspected Soviet provocateur. The discussion covered various contingencies, including the improbability of Nosenko's escape, the possibility of suicide, and potential scenarios for turning him back to the Soviets, possibly with a U.S. government statement to establish him as a provocateur. The memo also references FBI findings that generally agree with CIA views on Nosenko, and mentions differing opinions on Soviet control over some FBI sources.",
  "tags": [
    "CIA",
    "DDP",
    "SR Division",
    "Ambassador Thompson",
    "Yuriy Ivanovich Nosenko",
    "Hostile Interrogation",
    "FBI",
    "AEJOYFUL"
  ],
  "title": "Yuriy Ivanovich NOSENKO",
  "date": "1965-01-21",
  "persons_mentioned": [
    "Yuriy Ivanovich Nosenko",
    "Ambassador Thompson",
    "William C. Sullivan",
    "John Edgar Hoover",
    "David E. Murphy",
    "Mr. Hughes"
  ],
  "recipient": "Record",
  "sender": "David E. Murphy (Chief, SR Division)"
}