{
  "classification": "Cuba",
  "document_type": "Collection of Documents",
  "security": "Several documents discuss liaison activities with the FBI, including a meeting with Agent Frank O'Brien. Releasing these details could reveal the nature and extent of coordination between the CIA and FBI on Cuban-related matters, which could compromise ongoing investigations or sources. The document also mentions sensitive cover arrangements and the potential compromise of sources.",
  "security_level": "SECRET",
  "summary": "This file contains documents related to Rolando Masferrer, including reports on his activities against Haiti, liaison with the FBI, and internal discussions about the legal implications of indicting Masferrer due to his claims of U.S. government backing.",
  "summary_one_paragraph": "This collection of documents, spanning from 1966 to 1967, primarily focuses on Rolando Masferrer's activities, particularly his plans to invade Haiti and the U.S. government's response. The documents include intelligence reports, memoranda of conversations, and internal communications discussing the legal and operational considerations of indicting Masferrer, given his claims of U.S. government approval. Liaison activities with the FBI, potential cover arrangements, and the risk of exposing CIA sources are also discussed.",
  "tags": [
    "Rolando Masferrer",
    "Haiti",
    "FBI",
    "Liaison",
    "Indictment",
    "Covert Operations",
    "Cuban Exiles",
    "JMWAVE",
    "Duvalier"
  ],
  "title": "MASFERRER Y ROJAS, ROLANDO",
  "date": "1966-01-01/1966-12-31",
  "locations_mentioned": [
    "Miami, Florida",
    "Haiti",
    "Dominican Republic",
    "Bahamas",
    "Port-au-Prince",
    "New York",
    "Long Island"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Rolando Masferrer Rojas",
    "J. Walter Yeagley",
    "President Duvalier",
    "Lawrence R. Houston",
    "David C. Acheson",
    "Thomas J. Flores",
    "James D. Esterline",
    "Father Jean Baptiste Georges",
    "Colonel Rene Leon",
    "Napoleon Villaboise",
    "Eigene L. Maximilien",
    "Andrew St. George",
    "William G. Bowdler",
    "Frank O'Brien",
    "Ken Millian",
    "Raiwindo F. Antonio de la Torre Ugarte",
    "Lee J. Lockwood",
    "Miguel Morales",
    "Nellie Barletta",
    "Carlos Franqui"
  ],
  "recipient": "J. Walter Yeagley",
  "sender": "Lawrence R. Houston"
}