{
  "classification": "Mexico/Cuba",
  "document_type": "Field Information Report",
  "security": "Sharing that CORTES is being discussed with the Archbishop and possible actions are being considered against him could impede the CIA's ability to gain information from CORTES. Quoting directly: \"Father PEREZ Alonso has been conferring with Archbishop Miguel Dario Miranda, Primate of Mexico, regarding CORTES Hernandez and possible actions against him.\"",
  "security_level": "SECRET/NOFORN",
  "summary": "A report from Mexico City details Jose Xavier CORTES Hernandez's interactions with the Cuban Ambassador regarding actions in Cuba and his claims of being a priest, which is refuted by a source in the Roman Catholic Church.",
  "summary_one_paragraph": "This SECRET/NOFORN field information report from Mexico City, dated December 16, 1960, concerns Jose Xavier CORTES Hernandez, who is reported to have represented himself as a priest while discussing with Cuban Ambassador Jose Antonio PORTUONDO Valdor potential actions in Cuba and the influence of the Knights of Columbus. The report notes CORTES's interest in establishing a schismatic church in Cuba, his disputed status as a priest, and that the Cuban Ambassador considered a church bombing in Cuba an act of 'auto-aggression'. The information was sourced from a person with connections in the Cuban Embassy and Father Manuel PEREZ Alonso, a Jesuit contact.",
  "tags": [
    "CIA",
    "Cuba",
    "Mexico",
    "Jose Xavier CORTES Hernandez",
    "Cuban Embassy",
    "Catholic Church",
    "Schismatic Church",
    "NOFORN"
  ],
  "title": "Jose Xavier CORTES Hernandez",
  "date": "1960-12-16",
  "locations_mentioned": [
    "Mexico",
    "Mexico City",
    "Cuba"
  ],
  "origin_agency": "CIA Mexico City Station",
  "persons_mentioned": [
    "Jose Xavier CORTES Hernandez",
    "Dolores R. CASSAVETIS",
    "Willard C. CURTIS",
    "Jose Antonio PORTUONDO Valdor",
    "Father Manuel PEREZ Alonso",
    "Miguel Dario Miranda",
    "Father BOZA",
    "Carlos OLIVARES",
    "German Lence"
  ],
  "sender": "Dolores R. CASSAVETIS, Willard C. CURTIS"
}