{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "Disclosing that the Agency is providing 'loans' to a high-level defector for real estate purchases and is arranging a Deed of Trust could reveal sensitive financial operations and compromise the defector's cover. Specifically, the memo states, 'PDLADLE is a high-level defector residing in New York who has had advanced to him a number of large 'loans' over the years, in addition to his 'salary.' Some of these monies have gone into the purchase of some real estate in the State of New York. The Agency now wants a Deed of Trust executed in favor of one of its nominees on the New York real property.'",
  "security_level": "SECRET",
  "summary": "A memo from Robert D. Clark discussing options for an outside lawyer to draw up a Deed of Trust for PDLADLE, a high-level defector, including considerations of security, operational use, and legal implications.",
  "summary_one_paragraph": "Robert D. Clark, from the Office of General Counsel, authored this memorandum to the record concerning the selection of a lawyer to draft a Deed of Trust for PDLADLE, a high-level defector residing in New York. PDLADLE has received significant 'loans' from the Agency for real estate purchases, necessitating the Deed of Trust in favor of a CIA nominee. The memo evaluates several options: using a cleared New York lawyer (Natalie Koether) despite operational concerns, updating the clearance of another attorney (Richard C. Kullen, Jr.), employing the case officer (MONCURE) who is also a lawyer, or having an attorney from the Office of General Counsel handle it, which would require researching New York mortgage law.",
  "tags": [
    "CIA",
    "PDLADLE",
    "Defector",
    "Deed of Trust",
    "Office of General Counsel",
    "Security",
    "Cover",
    "Loans"
  ],
  "title": "PDLADLE: Outside Lawyer to Draw Up Deed of Trust",
  "date": "Unknown",
  "locations_mentioned": [
    "New York",
    "Washington, D.C."
  ],
  "origin_agency": "Office of General Counsel",
  "persons_mentioned": [
    "Robert D. Clark",
    "PDLADLE",
    "Natalie Koether",
    "Eric Sowers",
    "Bill Ashbaugh",
    "Richard C. Kullen, Jr.",
    "MONCURE",
    "Vasia Gmirkin"
  ],
  "sender": "Robert D. Clark"
}