{
  "classification": "Liaison",
  "document_type": "Cable",
  "security": "Revealing that the CIA has a working agreement with the HSCA and the details of that agreement, particularly the notification process, could compromise future interactions with similar committees or investigations. Directly quoting the relevant sections: \"HOS WORKING AGREEMENT WITH HOUSE SELECT COMMITTEE ON ASSASSINATIONS (HSCA) PROVIDES FOR NOTICE TO HOS BY HSCA INVESTIGATORS OF ALL PLANNED CONTACTS WITH CURRENT OR FORMER STAFF PERSONNEL. IN ABSENCE OF SUCH NOTICE IN THIS CASE IT OUR ASSUMPTION THAT NO CONTACT WITH STATION/BASE STAFFERS, AS SUCH, IS PLANNED.\" Sharing this information could expose internal protocols and create challenges in maintaining confidentiality during sensitive inquiries.",
  "security_level": "SECRET",
  "summary": "A cable from the Director to Guayaquil, Quito, and Caracas stations, concerning interactions with the House Select Committee on Assassinations (HSCA) and advising staff to restrict comments to their cover capacity.",
  "summary_one_paragraph": "This SECRET cable, dated May 24, 1978, originates from the Director and is addressed to the CIA stations in Guayaquil, Quito, and Caracas. It references a working agreement between the CIA (HOS) and the House Select Committee on Assassinations (HSCA), stipulating that HSCA investigators should notify the CIA of planned contacts with current or former CIA staff. The cable advises personnel to restrict their comments to work performed in their cover capacity if contacted, assuming no contact is planned due to the absence of prior notification. It notes that no file exists and references E2 and IMPDET.",
  "tags": [
    "CIA",
    "HSCA",
    "House Select Committee on Assassinations",
    "Liaison",
    "Covert Operations",
    "Guayaquil",
    "Quito",
    "Caracas"
  ],
  "title": "Director 228470",
  "date": "1978-05-24",
  "locations_mentioned": [
    "Guayaquil",
    "Quito",
    "Caracas"
  ],
  "origin_agency": "CIA",
  "recipient": "Guayaquil, Quito, Caracas",
  "sender": "Director"
}