{
  "classification": "Personnel",
  "document_type": "Memorandum and Information Reports",
  "security": "Several documents within discuss methods of clandestine intelligence gathering, and anti-Castro sentiments of Cuban nationals working in the oil industry after the revolution. For instance, oil technicians are referenced sabotaging efforts by the Castro regime. Revealing these activities may endanger individuals and compromise future intelligence operations.",
  "security_level": "CONFIDENTIAL",
  "summary": "This file contains information related to Winfred Clark Barnes, including security checks, biographic data, passport details, and his involvement with Esso Inter-America Inc. The file also includes intelligence reports on Cuba's oil industry operations and the attitudes of personnel post-revolution.",
  "summary_one_paragraph": "This collection of documents primarily concerns Winfred Clark Barnes, detailing security checks, passport information, and his professional background as a director at Esso Inter-America Inc. The file includes memoranda regarding security clearances, biographic information, and reports on his attendance at executive leadership conferences. Additionally, it contains several intelligence reports from 1960 concerning the Cuban oil industry after the revolution, covering topics such as the impact of Soviet crude oil, shortages of lubricating oil, friction within the new management of the Esso refinery, the anti-Castro sentiment among Cuban oil personnel, and efforts to undermine the regime by some oil technicians and engineers.",
  "tags": [
    "Winfred Clark Barnes",
    "Security Check",
    "Passport",
    "Esso Inter-America Inc.",
    "Cuba",
    "Oil Industry",
    "Castro Regime",
    "Intelligence Report"
  ],
  "title": "BARNES, WINIFRED C. DOD FILE 08 97 44",
  "date": "1967-02-28",
  "locations_mentioned": [
    "Miami, Florida",
    "Gatesville, Texas",
    "Kennedy, Texas",
    "Thelaza, Texas",
    "Mexico",
    "Guatemala",
    "Costa Rica",
    "Peru",
    "Columbia",
    "Venezuela",
    "Argentina",
    "Brazil",
    "Coral Gables, Florida",
    "New Haven, Connecticut",
    "Bermuda",
    "Bahamas",
    "Jamaica",
    "Trinidad",
    "British Guiana",
    "Guadeloupe",
    "Barbados",
    "Suriname",
    "Washington, D.C.",
    "Haiti",
    "Honduras",
    "El Salvador",
    "Panama",
    "Nicaragua",
    "Havana, Cuba"
  ],
  "persons_mentioned": [
    "Winfred Clark Barnes",
    "Shaw Andrew Barnes",
    "Velma Elizabeth Harris",
    "Lois Enquist Barnes",
    "Fidel Castro",
    "Raúl Castro",
    "Che Guevara",
    "Segundo Cevallos",
    "Leon Hequin Maya",
    "Jose Ramon Alvarez",
    "Santiago Pardo Suarez del Villar",
    "Raul Capote Ortiz",
    "Commander Olivio Pino",
    "Frank García",
    "Alfredo Gutiérrez"
  ],
  "recipient": "Director, Domestic Contact Service",
  "sender": "Steven L. Kuen, Chief, Personnel Security Division"
}