{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Disclosing Posada Carriles' ties to the RECE organization and his offer to help them secure funding could expose his ongoing intelligence activities and damage relationships with individuals and organizations mentioned in the document. Specifically, the document states, \"POSADA offering to help RECE in this respect,\" which could implicate Posada Carriles and the CIA in sensitive foreign relations.",
  "security_level": "SECRET",
  "summary": "This file contains documents related to Luis Clemente Posada Carriles, including dispatches about his activities and associations with Cuban exile groups like RECE, and his potential involvement in plans against the Castro regime. It also includes a PRQ Part I on Posada Carriles and details of an SGSWIRL examination conducted to assess his reliability and potential ties to PBRUMEN intelligence.",
  "summary_one_paragraph": "This collection of documents focuses on Luis Clemente Posada Carriles, a figure of interest to the CIA, and includes dispatches, reports, and memoranda spanning from 1968. The documents detail his connections to various Cuban exile organizations, such as RECE, and his potential role in anti-Castro activities, including efforts to secure funding and support from Venezuelan entities. Additionally, the file contains a report on an SGSWIRL examination conducted to evaluate Posada Carriles' bona fides and possible affiliations with PBRUMEN intelligence, revealing concerns about his reliability and past dealings with certain individuals and organizations.",
  "tags": [
    "Luis Clemente Posada Carriles",
    "RECE",
    "Cuban Exiles",
    "Anti-Castro Activities",
    "SGSWIRL",
    "PBRUMEN",
    "Venezuela",
    "CIUSTY",
    "CIVISTA-5",
    "AMCLEVE-15",
    "IDEN",
    "JMWAVE",
    "AKOT"
  ],
  "title": "POSADA LUIS CLEMENTE",
  "date": "1968-06-28",
  "locations_mentioned": [
    "Cuba",
    "Cienfuegos",
    "Havana",
    "USSR",
    "Miami",
    "Venezuela",
    "Caracas",
    "Washington, D.C.",
    "Communist China",
    "New Jersey",
    "California"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Luis Clemente Posada Carriles",
    "Raul Posada Carriles",
    "Roberto Posada Carriles",
    "Oscar C. Kalbing",
    "Jorge Mas Canosa",
    "Johnny Alvart",
    "Jorge Horate",
    "Il Gallego Fernandez",
    "Fidel Castro",
    "Augusto Valdes Miranda",
    "Polo Miranda",
    "Erasto Fernandez",
    "Juan Pasid",
    "Hugo Alencar Tovar",
    "Coco Elias",
    "Lauserica \"El Poeta\"",
    "Antonio Comellas",
    "Aldo Hernandez",
    "Rafael Tremol",
    "Orasto Fernandez",
    "Aguedo Lugo",
    "Rodriguez",
    "Allen Jarbough",
    "John P. Gover"
  ],
  "recipient": "Chief of Station, Caracas",
  "sender": "Chief, Western Hemisphere Division"
}