{
  "classification": "Security",
  "document_type": "Cable",
  "security": "Releasing information about the CIA's presence in Japan could have \"adverse consequences for US-Japan relations\" and \"disrupt cooperation with Japanese liaison services on important counterterrorist and counterintelligence cases.\" Acknowledgment could \"lower the confidence of existing and new sources in our ability to protect their identity and security.\"",
  "security_level": "SECRET",
  "summary": "This cable from the Tokyo Station urges the Director to prevent the JFK Assassination Records Review Board from releasing any information confirming the existence of a CIA station in Japan, citing potential damage to US-Japan relations and intelligence operations.",
  "summary_one_paragraph": "A SECRET cable from the Tokyo Station, dated March 26, 1996, urgently requests the Director to incorporate talking points into the presentation for the JFK Assassination Records Review Board to prevent the public release of any reference confirming the existence of a CIA station in Japan. The cable argues that acknowledging the station's existence could negatively impact US-Japan relations, disrupt cooperation with Japanese liaison services on counterterrorism and counterintelligence cases, revive controversies over past CIA activities (such as wiretapping and funding of the Liberal Democratic Party), and undermine the security of existing and new sources by making the station a target of public scrutiny.",
  "tags": [
    "CIA",
    "Japan",
    "US-Japan Relations",
    "Intelligence Operations",
    "JFK Assassination Records Review Board",
    "Security",
    "Counterterrorism",
    "Counterintelligence",
    "Liaison",
    "Tokyo Station"
  ],
  "title": "Official Acknowledgement of Tokyo Station",
  "date": "1996-03-26",
  "locations_mentioned": [
    "Japan",
    "Tokyo",
    "Okinawa",
    "South Korea"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Ambassador Mondale",
    "Kono Yohei",
    "Hashimoto Ryutaro",
    "Kim Dae Jung"
  ],
  "recipient": "Director",
  "sender": "STAFF"
}