{
  "classification": "Personnel, Operations, Mexico",
  "document_type": "Classified Message, Speed Letter, Memorandum",
  "security": "Disclosing details about Edward G. Tichborn's involvement as an agent, payment structures, and cover arrangements (including the use of proprietary companies like WUSALINE and WUTACTIC), along with potential operational deployments (such as the possibility of a TDY in Chile), could severely compromise ongoing or future operations. It could also reveal intelligence-gathering methods and financial processes, potentially endangering Tichborn and other assets.  For example, disclosing the information regarding Tichborn potentially taking on a job in Chile, and details regarding his payment through covert companies.",
  "security_level": "SECRET, CONFIDENTIAL",
  "summary": "The documents relate to Henry P. Lopez and Edward G. Tichborn, detailing their activities, expenses, cover arrangements, and termination settlements with the CIA, including the use of proprietary companies and potential operational deployments.",
  "summary_one_paragraph": "This collection of documents primarily concerns Henry P. Lopez and Edward G. Tichborn, involving classified messages about Tichborn's potential return to the Dominican Republic for political study under journalist cover, his cover limitations, and the agency's desire to assess the desirability of his trip given these constraints. It also details Tichborn's termination settlement, including financial arrangements through proprietary companies like WUSALINE and WUTACTIC, efforts to ensure accurate expense accountings, and considerations for a possible operational TDY in Chile. A speed letter indicates the need to update Lopez's Operational Approval, and there are various memoranda detailing financial advances, expense accountings, and reimbursement issues for both Lopez and Tichborn, reflecting the administrative and financial aspects of their relationships with the CIA.",
  "tags": [
    "CIA",
    "Henry P. Lopez",
    "Edward G. Tichborn",
    "WUBRINY",
    "WUTACTIC",
    "Covert Operations",
    "Financial Records",
    "Termination Settlement",
    "Dominican Republic",
    "Mexico",
    "Chile",
    "DYVOUR",
    "LIBELER",
    "LITEA-1"
  ],
  "title": "LOPEZ, HENRY P.",
  "date": "1961-07-17",
  "locations_mentioned": [
    "Ciudad Trujillo",
    "Mexico City",
    "Dominican Republic",
    "NYC",
    "Los Angeles",
    "Washington",
    "Spain",
    "Madrid",
    "Cambridge",
    "Caracas",
    "Venezuela",
    "Mexico",
    "Los Angeles",
    "Texas",
    "Puerto Rico",
    "Washington, D.C.",
    "Madrid",
    "Paris",
    "Boston, Mass.",
    "Chile"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Henry P. Lopez",
    "Edward G. Tichborn",
    "BELL",
    "Gale W. Allen",
    "Miguel Tirado",
    "Christopher D. Costanzo",
    "Howard T. Fazzare",
    "John Trask",
    "Donald G. Lemieux"
  ],
  "recipient": "Director",
  "sender": "Director, Mexico City, Trujillo, OSG-OC, E/IE/S, AC/DO"
}