{
  "classification": "Counter Espionage",
  "document_type": "Dispatch and Memorandum",
  "security": "These documents detail the CIA's investigation into Luis Tedeschi, including requests to check local services and police files for information, indicating the agency’s efforts to gather intelligence on individuals potentially linked to Communist or RIS activities. Quoting directly: \"It is requested that you check all available records including any appropriate local services for any information on TEDESCHI that may be available.\" Releasing these activities could compromise sources and methods used in intelligence gathering and reveal the extent of CIA interest in individuals and groups.",
  "security_level": "SECRET",
  "summary": "These documents concern the CIA's investigation into Luis Tedeschi, focusing on his potential connections to the Spanish Communist Party and Soviet intelligence (RIS) during the 1940s, with requests for information from various stations and local services.",
  "summary_one_paragraph": "This collection of dispatches and memoranda, dating from 1960 to 1963, outlines the CIA's efforts to gather information on Luis Tedeschi, suspected of having ties to the Spanish Communist Party and the Soviet RIS during the 1940s. The documents include requests for record checks from stations in Buenos Aires, Rome, Madrid, and Barcelona, as well as inquiries to local police and intelligence services. They also reference mail intercepts related to Tedeschi in 1942 and his potential use of addresses as covers for a UDE (Union Democratica Espanola) manifesto sent from Cuba, reflecting a broad intelligence sweep to determine his affiliations and activities.",
  "tags": [
    "CIA",
    "Counter Espionage",
    "Luis Tedeschi",
    "Spanish Communist Party",
    "RIS",
    "Mail Intercepts",
    "Cuba",
    "Union Democratica Espanola"
  ],
  "title": "Investigation into Luis Tedeschi",
  "date": "1961-08-25",
  "locations_mentioned": [
    "Buenos Aires, Argentina",
    "Spain",
    "Cuba",
    "Italy",
    "Portugal"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Luis Tedeschi",
    "Carl Winter",
    "Helen Winter",
    "Michele Winter",
    "Anthony B. Kaka",
    "Francis K. Bucky",
    "Elaine B. Friedwald",
    "Gerald Nuttand",
    "John D. Walker",
    "Thomas Thiele",
    "Oscar H. Selle",
    "Birch D. O'Neal",
    "Oliver G. Galbond",
    "Carlton G. Recart",
    "Riccardo Gorich",
    "Bruno Parsetti",
    "Constantino De Marco",
    "Aurelio D'Alessio",
    "Pasquale Buonatuto",
    "Orazio Boscolo",
    "Duilio Sanna",
    "Natale (last name missing)",
    "Vicente Uribe"
  ],
  "recipient": "Chief of Station, Buenos Aires; Chief, WE; Chief, H CATE; Chiefs of Station, Rome, Madrid; CCB, Barcelona",
  "sender": "Acting Chief of Station, Madrid; Chief of Station, Rome; Chief of Base, Barcelona; Chief of Station, Buenos Aires; Chief, WH Division; Chief of Mission, Trieste; London, England"
}