{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "This document details a comprehensive plan for clandestine operations against Cuba, including intelligence gathering, economic warfare, and political action. It outlines methods to 'discredit the Castro-communist regime,' 'induce a split in the Cuban regime,' and 'deny through clandestine and covert means critical materials to the Cuban economy.' Revealing these operational plans could expose sensitive intelligence sources and methods, compromise ongoing clandestine activities, and damage international relations.",
  "security_level": "TOP SECRET - SENSITIVE",
  "summary": "A top-secret memorandum outlining a plan for continuing CIA operations against Cuba, focusing on intelligence gathering, isolating and discrediting the Castro regime, maintaining economic and political pressures, and exploiting any potential splits within the Cuban government or its relationships with the Bloc.",
  "summary_one_paragraph": "This memorandum, dated November 27, 1962, details a comprehensive CIA operational plan for sustained actions against Cuba following the Cuban Missile Crisis. Approved in principle by the DCI, the plan aims to intensify intelligence efforts, isolate and discredit the Castro regime, maintain economic and political pressures, and exploit potential divisions within the government. Given the U.S. government's assurances against invasion, the plan emphasizes clandestine operations, including espionage, economic warfare, counterintelligence, and psychological warfare, while maintaining the capability to exploit any significant revolt or uprising, recommending a reorganization of Task Force W and the abolition of the Mongoose operational mechanism.",
  "tags": [
    "CIA",
    "Cuba",
    "Castro",
    "Clandestine Operations",
    "Intelligence",
    "Economic Warfare",
    "Political Action",
    "Task Force W",
    "Mongoose",
    "FOIA"
  ],
  "title": "Operational Plan for Continuing Operations Against Cuba",
  "date": "1962-11-27",
  "locations_mentioned": [
    "Cuba",
    "United States",
    "Miami",
    "Havana",
    "Latin America"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Fidel Castro",
    "William K. Harvey"
  ],
  "recipient": "Director of Central Intelligence",
  "sender": "William K. Harvey (Chief, Task Force W)"
}