{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "Disclosing the specific methods and relationships used for maintaining cover for Agency personnel could endanger sources, methods, and ongoing operations. \"CCS files contain information on individuals and entities cited in certain numbered items of Reference C as follows: ... (details on cover for NOC officers and Staff Employees)\"",
  "security_level": "SECRET",
  "summary": "A memorandum from H. Clark Schor to SA/DO/O providing additional information in response to a request from the House Select Committee on Assassinations (HSCA) regarding individuals and entities of interest, detailing the types and quantity of documents held by the Central Cover Staff (CCS) on each.",
  "summary_one_paragraph": "This memorandum, dated January 27, 1978, is from H. Clark Schor, Chief of the Plans and Review Group, Central Cover Staff, to SA/DO/O, supplementing a previous memo in response to a request from the House Select Committee on Assassinations (HSCA). It details the CCS files' contents pertaining to individuals and entities cited in the HSCA's request, including George DeMohrenschildt, Leo Cherne, William Harvey, the International Rescue Committee, Alexander Rorke, Richard Helms, James Angleton, Raymond Rocca, Southern Research Corporation, and the Wackenhut Corporation, specifying the number of documents and their primary subject matter, such as contact reports, cover establishment, travel orders, and contacts with officials.",
  "tags": [
    "HSCA",
    "Central Cover Staff",
    "George DeMohrenschildt",
    "Leo Cherne",
    "William Harvey",
    "International Rescue Committee",
    "Alexander Rorke",
    "Richard Helms",
    "James Angleton",
    "Raymond Rocca",
    "Southern Research Corporation",
    "Wackenhut Corporation",
    "Covert Operations",
    "FOIA"
  ],
  "title": "House Select Committee on Assassinations (HSCA) Request",
  "date": "1978-01-27",
  "persons_mentioned": [
    "H. Clark Schor",
    "George DeMohrenschildt",
    "Leo Cherne",
    "William Harvey",
    "Richard Helms",
    "James Angleton",
    "Raymond Rocca",
    "Alexander Rorke"
  ],
  "recipient": "SA/DO/O",
  "sender": "H. Clark Schor (C/CCS/PRG)"
}