{
  "classification": "Operations",
  "document_type": "Report",
  "security": "Disclosing operational details about individuals involved in potential smuggling and the actions taken by the U.S. Embassy and Panamanian officials could compromise ongoing investigations and intelligence gathering efforts. Specifically, the document mentions: 'On 8 July, Minister of Government Alfredo Aleman reported the matter to the U.S. Ambassador, stating that prior to arriving in Panama the plane had been signaled, that all was not well at the airport and that the crew had jettisoned cargo prior to arrival.'",
  "security_level": "UNCLASSIFIED",
  "summary": "A report details suspected gold smuggling activities involving a B-26 plane traveling between Brownsville, Texas, and Panama, implicating U.S. citizens, Panamanian officials, and potential connections to the Caribbean Legion.",
  "summary_one_paragraph": "This report, dated July 10, 1950, outlines suspicions of gold smuggling involving a B-26 bomber making frequent trips between Brownsville, Texas, and Tocumen and David in Panama. The report identifies Steve Murray and other U.S. citizens as crew members, along with Panamanian officials Tito, Harmodito, and Toni Arias allegedly meeting the plane at Tocumen Airport. The plane's activities raised suspicions due to the violation of Pan-American air agreement landing rules. The Minister of Government reported to the U.S. Ambassador that the plane jettisoned cargo before landing. The plane was eventually searched but nothing was found, leading to personnel changes at the airport and tensions among those involved, including potential threats against Toni Arias.",
  "tags": [
    "Gold Smuggling",
    "Panama",
    "B-26 Bomber",
    "Caribbean Legion",
    "U.S. Embassy",
    "Civil Intelligence",
    "Tocumen Airport",
    "David, Panama",
    "Brownsville, Texas",
    "Smuggling"
  ],
  "title": "Gold Shipments",
  "date": "1950-07-10",
  "locations_mentioned": [
    "Panama City, Panama",
    "David, Panama",
    "Brownsville, Texas",
    "Tocumen Airport",
    "Mexico City",
    "Managua",
    "Buenos Aires",
    "Montevideo",
    "Havana",
    "Philippines",
    "Far East"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Howard R. Antell",
    "Julio Mori Hasegoza",
    "Frank Ogehl",
    "O. Martinez",
    "Steve Murray",
    "Mauricio De Castro",
    "John LeRoy",
    "Zorrillo",
    "Tito Arias",
    "Harmodito Arias",
    "Toni Arias",
    "Pastor Ponce",
    "Virgilio Ramirez",
    "Alfredo Aleman",
    "Sas (Fernandez)",
    "Cristobal Martinez",
    "T-1",
    "TAM-639",
    "T-2",
    "G-2"
  ],
  "recipient": "Wash, Nord, Kana, Files",
  "sender": "Berets Made By Howard R. Antell"
}