{
  "classification": "Personnel",
  "document_type": "Memorandum and Contract Amendments",
  "security": "These documents concern the contract details, compensation, and allowances of CIA contract personnel, specifically George Martin Rosnek and Bruce A. Bertotally, including adjustments to their pay and travel allowances.  Disclosure of these details could expose contractual obligations, financial commitments, and operational expense policies, potentially impacting the agency's ability to manage its covert relationships.  Specifically, the discussion of George Martin Rosnek's KGB background and financial claims could compromise his security and that of related operations. Quoting directly: 'This $20,000 claim has become an obsession with Mr. Rosnek and is likely to affect negatively his relationship with the Agency unless resolved to his relative satisfaction.'",
  "security_level": "SECRET",
  "summary": "This collection consists of contract amendments, memoranda, and related documentation pertaining to George Martin Rosnek and Bruce A. Bertotally, detailing adjustments to their compensation, allowances, and contractual terms with the CIA.",
  "summary_one_paragraph": "This collection of documents, primarily from 1977-1979 with references to earlier dates, includes memoranda, contract amendments, and related correspondence concerning George Martin Rosnek and Bruce A. Bertotally, who were independent contractors for the CIA. These documents detail modifications to their compensation, travel allowances, and other contractual terms, reflecting cost-of-living increases and resolution of financial claims. A significant portion addresses a dispute regarding financial commitments to Rosnek, a former KGB officer, and the legal and security considerations surrounding settling his claim.",
  "tags": [
    "CIA",
    "Contract Personnel",
    "George Martin Rosnek",
    "Bruce A. Bertotally",
    "Contract Amendment",
    "Compensation",
    "KGB Defector",
    "Financial Claims",
    "Allowances"
  ],
  "title": "Contract Personnel File: George Martin Rosnek and Bruce A. Bertotally - Contract Amendments and Financial Matters",
  "date": "1970-03-01",
  "persons_mentioned": [
    "George Martin Rosnek",
    "Bruce A. Bertotally",
    "David H. Blee",
    "Steven K. Rubenstein",
    "John A. Rizzo",
    "Charles W. Sandman",
    "Tennent Bagley",
    "William Vassall",
    "Gena L. Byrd",
    "Nosenko",
    "Colby"
  ],
  "recipient": "Chief, Contract Personnel Division",
  "sender": "David H. Blee, Chief, Counterintelligence Staff; Steven K. Rubenstein; John A. Rizzo; Charles W. Sandman; Special Contracting Officer"
}