{
  "classification": "Cuba",
  "document_type": "Memorandum of Contact",
  "security": "Sharing the operational proposals, particularly the potential use of Subject in an approach to AZCUE in Mexico City, could compromise ongoing intelligence operations. Detailing Subject's reservations and the agency's attempts to reassure him also exposes recruitment tactics. Quoting directly: “it is suggested that a dispatch be prepared to Mexico City Station outlining all information on Esubio AZCUE including that supplied by Subject...Subject tentatively indicated his willingness to cooperate in such a venture but appeared to have some reservation re the danger that might accrue him...We attempted to reassure Subject that very little danger would be involved since he would be under surveillance by AUBARK officers at all times.”",
  "security_level": "SECRET",
  "summary": "A CIA memorandum detailing contacts with Jose Antonio CASAS Rodriguez regarding Cuban government officials and potential operational proposals for approaching them, specifically targeting Esubio AZCUE in Mexico City.",
  "summary_one_paragraph": "This SECRET memorandum outlines two meetings in May 1963 with Jose Antonio CASAS Rodriguez in Harrisburg, Pennsylvania, where he provided information on various Cuban government officials, focusing on their potential for recruitment. CASAS Rodriguez, a Cuban defector, offered insights into figures like Esubio AZCUE, Enrique RODRIGUEZ Loeches, Orlando BLANCO, and Faure and Floreal CHOMON. The memo proposes using CASAS Rodriguez for an operational approach to AZCUE in Mexico City and shares the gathered intelligence with SAS/11 to explore other leads, while also noting CASAS Rodriguez's eccentric personality traits and economic theories.",
  "tags": [
    "CIA",
    "Jose Antonio CASAS Rodriguez",
    "Esubio AZCUE",
    "Cuban Government Officials",
    "Recruitment",
    "KUBARK",
    "Mexico City",
    "SAS/11"
  ],
  "title": "Memorandum of Contact: Jose Antonio CASAS Rodriguez",
  "date": "1963-05-16",
  "locations_mentioned": [
    "Harrisburg, Pennsylvania",
    "Cuba",
    "Miami",
    "Mexico City",
    "Morocco",
    "USSR",
    "Iraq",
    "Madrid",
    "Belgium",
    "Minnesota"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Jose Antonio CASAS Rodriguez",
    "Esubio AZCUE",
    "Fidel Castro",
    "Manolo Castro",
    "Enrique RODRIGUEZ Loeches",
    "Orlando Blanco",
    "Faure Chomon Mediavilla",
    "Floreal Chomon Mediavilla",
    "Carlos Figarello",
    "Jimenez",
    "Santos Jimenez",
    "Silvino Sorheguy Matos",
    "Jose Antonio Pulido y Ledesma",
    "Armando Perez Pinto",
    "Juan Juarbe y Juarbo",
    "Laura Meneses de Albizu Campos",
    "Gilberto Mediavilla",
    "Orlando Perez",
    "Eloy Gutierrez Menoyo",
    "Gonzalez",
    "Sagaro",
    "Otto Skorzeny",
    "Raul Rodriguez Feo",
    "Carlos Lao",
    "Galen Peary"
  ],
  "recipient": "C/SAS/CI, RID/Index, C/SAS",
  "sender": "Galen Peary, SAS/CI"
}