{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "The report details reconnaissance of a site in Jamaica, potential Cuban recruits, and a plan to land people on the south coast of Cuba. Providing these details could reveal operational methods, compromise individuals, and expose sensitive intelligence activities. Specifically, revealing the intended operational use of Robin Moore’s property and the identities of potential collaborators could endanger them and compromise future operations. Additionally, mentioning George Eubanks, the immigration chief for Jamaica, and Mike Hedges could compromise their positions. For example: \"I instructed Moore to refer to Manolo as George King, and the operatios of landing him in Cuba would be referred to as Operatiouning.\" and \"Moore claims that they are very close personal friends.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "A report detailing a reconnaissance trip to Jamaica to assess Robin Moore and his property, Blue Hole, as a potential base of operations for landing people on the south coast of Cuba, including evaluations of personnel, site suitability, and operational considerations.",
  "summary_one_paragraph": "This report outlines a reconnaissance trip to Jamaica to evaluate Robin Moore and his property, Blue Hole, as a potential base for operations related to Cuba. The author assesses Moore's willingness to help, site suitability (including harbor protection, dock facilities, and proximity to supplies), and personnel, such as Fred Barrett and George Munroe. Operational considerations include establishing a suitable boat at Blue Hole, housing Cubans, and potential radio transmission facilities, recommending the acquisition of a boat in the United States and Rudy as a coordinator for initial operations.",
  "tags": [
    "Robin Moore",
    "Blue Hole",
    "Jamaica",
    "Cuba",
    "Operation",
    "Guerrilla Warfare",
    "Reconnaissance",
    "CIA",
    "Jack Reed",
    "Antonio de la Carrera",
    "George King",
    "Landing Operation"
  ],
  "title": "RETVRT: Site Evaluation and Assessment of Robin Moore in Jamaica",
  "date": "196",
  "locations_mentioned": [
    "Miami",
    "Kingston, Jamaica",
    "Montego Bay",
    "San Juan, Puerto Rico",
    "Port Antonio",
    "Blue Hole",
    "Cuba",
    "Fort Campbell, Kentucky",
    "Vancouver, B.C.",
    "Guantanamo Bay",
    "Turtle Cove",
    "Chile"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Robin Moore",
    "Antonio de la Carrera",
    "Margot Palmer",
    "Rita Palmer",
    "Fred Barrett",
    "George Munroe",
    "Anthony Gason",
    "George Eubanks",
    "Mike Hedges",
    "Burke Hedges",
    "Manolo",
    "George King",
    "Jack Reed",
    "Rudy",
    "Jack Youngblood",
    "Batista",
    "Castro"
  ],
  "sender": "Jack Reed"
}