{
  "classification": "Security",
  "document_type": "Memorandum/Teletype/Biographic Data",
  "security": "The documents reference multiple ongoing investigations and concerns about revealing classified information, particularly in relation to Werbell's contacts and activities. Releasing specifics could jeopardize ongoing investigations, expose sources and methods, and potentially damage relations with other agencies. For example: OGC is aware of Werbell's 'propensity to raise his past affiliations with the Agency, we can anticipate problems during this trial.' and that 'no, repeat no, contact with Werbel take place between now and the beginning of the trial.'",
  "security_level": "SECRET",
  "summary": "This collection of documents primarily concerns Mitchell Livingston Werbell III, his contacts with the CIA, his legal troubles (including a revocation of his security clearance and indictment on drug charges), and the CIA's concerns about his potential to reveal classified information or agency connections.",
  "summary_one_paragraph": "This collection of documents, spanning from 1961 to 1979, focuses on Mitchell Livingston Werbell III, a figure with long-standing but unsavory connections to the CIA. The documents detail Werbell's interactions with the Miami Field Office, his involvement in various scrapes (including an abortive invasion of Haiti), and his subsequent legal troubles, including the revocation of his Department of Defense security clearance and a later indictment on drug charges. CIA personnel express concerns about Werbell exploiting his past agency affiliations, particularly during his trial, and take measures to limit contact with him. The documents also reveal investigations into Werbell's activities related to possible mercenary actions and attempts to involve retired CIA employees in schemes, along with details about his contacts and biographical information.",
  "tags": [
    "Mitchell Livingston Werbell III",
    "Security Clearance",
    "Domestic Contact Service",
    "Haiti",
    "Drug Trafficking",
    "House Select Committee on Assassinations",
    "Security Checks",
    "CIA",
    "FBI",
    "Department of Justice",
    "Edwin Marger",
    "Chet Gray",
    "Rolando Masferrer",
    "Colonel Bayard"
  ],
  "title": "WERBELL, Mitchell Livingston, III - Revocation of DOD Security Clearance/Recent Contact",
  "date": "1971-03-16",
  "locations_mentioned": [
    "Miami, Florida",
    "Powder Springs, Georgia",
    "Haiti",
    "Abaco Island, Bahamas",
    "Atlanta, Georgia",
    "Washington, D.C.",
    "Los Angeles"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Mitchell Livingston Werbell III",
    "John Creany",
    "Bart Gonzales",
    "Rolando Masferrer",
    "Justin F. Gleichauf",
    "William R. Kosh",
    "Chet Gray",
    "John McConnell",
    "Sam Papich",
    "Dan Carswell",
    "Louis Posada",
    "Cesario Diosada",
    "David Atlee Phillips",
    "Lucien Conein",
    "William Stuckey",
    "Ed Butter",
    "Priscilla Johnson McMillan",
    "Richard Snyder",
    "Alexis Davison",
    "Walter Lloyd",
    "Samuel Sheres",
    "William Warner",
    "Jack Hennessey",
    "Arnold A. Bayard",
    "Edwin Marger",
    "John Hawk",
    "Robert John Morgan",
    "John Duncan Leibolt",
    "Hubert Stewart Cotton",
    "John Sylvester Carpenter",
    "Wiley Gilmore Sims",
    "Wayne Ernest Daniel",
    "Guy Perilton"
  ],
  "recipient": "Director, Domestic Contact Service",
  "sender": "Chief, Personnel Security Division, OS"
}