{
  "classification": "Cuba",
  "document_type": "Contact Report",
  "security": "Revealing that TOMEU provided information could endanger him or his family. The report also references TOMEU's former association with ARTIME. Quoting directly: 'It should, perhaps, be noted here that in an informal exchange with Mrs. Donald WEBSTER, TOMEU's supervisor at the Defense Language Institute, Anacostia Naval Annex, 4 June 64, Mrs. WEBSTER volunteered the information that 'all of the other 'Brigade students here' have told me they think very highly of TOMEU, and that he is a very brave man, because he and his family were very wealthy in Cuba and he gave it all up to go into exile and fight the Castro Regime.''",
  "security_level": "SECRET",
  "summary": "A contact report detailing a recontact with Oliverio Antonio TOMEU Vasallo, who provided additional information on Carlos and Ana Gloria de VARONA and identified Osiel GONZALEZ and \"COCO\" as possible leads to Jose LLANIRA Sobel.",
  "summary_one_paragraph": "On June 8, 1964, C. Paul Plumb, Jr. recontacted Oliverio Antonio TOMEU Vasallo at his Washington D.C. apartment following TOMEU’s request to speak again. TOMEU provided further details on Carlos and Ana Gloria de VARONA, identifying Ana as Carlos’s sister, with whom he hid after his infiltration in Cuba. He also mentioned “COCO,” reportedly secretary to Jose LLANUZA Gobel, and Osiel GONZALEZ, a former Havana Fire Department chief, as potential leads to LLANUZA. TOMEU shared photographs of himself and others who sought asylum, while also expressing continued interest in assisting in Cuba’s liberation and reflecting on an offer from Manuel ARTIME to become an instructor, indicating his preference for following ideals or an organization rather than an individual leader. TOMEU's supervisor at the Defense Language Institute offered information that other Brigade students admire him for his sacrifice of wealth to fight the Castro regime.",
  "tags": [
    "CIA",
    "Contact Report",
    "Oliverio Antonio TOMEU Vasallo",
    "Carlos de VARONA",
    "Ana Gloria de VARONA",
    "Osiel GONZALEZ",
    "COCO",
    "Jose LLANIRA Sobel",
    "Manuel ARTIME",
    "Cuba",
    "Castro Regime",
    "JURE"
  ],
  "title": "Recontact of Oliverio A. TOMEU Vasallo",
  "date": "1964-06-15",
  "locations_mentioned": [
    "Cuba",
    "Washington, D.C.",
    "High Point Apartment House, Washington, D.C.",
    "Havana",
    "Brazil",
    "Argentina",
    "Puerto Rico",
    "United States",
    "Spain",
    "Mexico"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Oliverio Antonio TOMEU Vasallo",
    "Carlos de VARONA",
    "Ana Gloria de VARONA",
    "Osiel GONZALEZ",
    "COCO",
    "Jose LLANUZA Gobel",
    "Monsignor Eduardo BOZA Masvidal",
    "Manuel VILLAVERDE",
    "Nils DIAZ",
    "Publio RUIZ",
    "Jorge Del VALLE",
    "Manuel ARTIME",
    "Fidel Castro",
    "Manolo RAY Rivero",
    "John Hugh Crinning",
    "Donald WEBSTER",
    "Caridad TOMEU",
    "C. Paul Plumb, Jr."
  ],
  "recipient": "STROPSIS",
  "sender": "C. Paul Plumb, Jr."
}