{
  "classification": "Administrative",
  "document_type": "Information Report-Information Report",
  "security": "Disclosing the methods for monitoring and countering political activities of the NPD, particularly the recruitment of informants and the penetration of the party at various levels, could compromise ongoing intelligence operations. Quote directly: 'Through its penetration of the national organization, the BfV has been able to obtain and photograph the entire membership rolls' and 'the BfV is assisting the DGB in working out methods for the infiltration of workers into NPD organizations to report and counteract their influence within factories and workers councils.' These details expose sources and methods, endangering current and future intelligence efforts.",
  "security_level": "SECRET",
  "summary": "The report details the BfV's program to monitor and counter the National Democratic Party (NPD), including penetrating the NPD, monitoring membership and finances, and countering NPD influence through various means like infiltrating labor movements and surveying election results.",
  "summary_one_paragraph": "This information report, dated 5 January 1967, describes the West German Federal Office for the Protection of the Constitution’s (BfV) comprehensive program to monitor and counter the activities of the National Democratic Party (NPD). The BfV and its regional affiliates (LfV) have penetrated the NPD at national and regional levels, recruiting approximately 60 sources with access to NPD organizations at all levels, including local county chairmen. The BfV has also gained access to the membership rolls of the NPD, is tracing membership applications against Nazi Party membership files at the Berlin Document Center, and is attempting to obtain documentary evidence on the NPD's sources of income. Additionally, the BfV has instigated efforts involving multiple political parties and the Trade Union Movement (DGB) to counteract NPD propaganda and influence, particularly in upcoming elections.",
  "tags": [
    "BfV",
    "National Democratic Party",
    "NPD",
    "West Germany",
    "Right Radical Organizations",
    "Intelligence Gathering",
    "Counterintelligence",
    "Penetration",
    "Monitoring",
    "Finances",
    "Elections",
    "Trade Union Movement"
  ],
  "title": "BfV Program to Monitor and Counter the Activities of the National Democratic Party",
  "date": "1967-01-05",
  "locations_mentioned": [
    "West Germany",
    "Bonn",
    "Hannover",
    "Berlin",
    "Bavaria",
    "Rheinland-Pfalz",
    "Mosel River",
    "Schleswig-Holstein",
    "Hesse",
    "Cologne"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Friedrich (Fritz) Thielen",
    "Wilhelm Gutmann",
    "Adolf von Thadden",
    "Franz Florian Winter",
    "Otto Theodor Brouwer",
    "Otto Hess",
    "Karl Lankor",
    "Waldemar Schutz",
    "Horst-Günther Schweimer",
    "Fritz Winkelmann",
    "Anneliese Bandes",
    "Peter Lau",
    "Karl Mardon",
    "Karl Prinz zu Salm",
    "Gertraud Winkelvoss",
    "Adolf Gard",
    "Fritz Rapp",
    "Heinrich Farbender",
    "Lothar Kuhne",
    "Karl-Ernst Lober",
    "Benno Hermanndorfer",
    "Heinz Rudolph",
    "Kurt Knupfer",
    "Dietrich Deinen",
    "Dieter Nitsche",
    "Heins Schimmeroin",
    "Martin Schwarz"
  ],
  "recipient": "STATE DIA ARMY NAVY NSA AIR OCR",
  "sender": "A qualified American official from a senior official of the West Gorman Federal Office for the Protection of the Constitution (BfV)."
}