{
  "classification": "Personnel",
  "document_type": "Dispatch",
  "security": "Revealing that SZULC “was pro-communist at the time, and that he co-operated with Ignacy SACHS... and provided him with 'information'” could damage SZULC's reputation and career. Additionally, the assertion that SZULC had reported on U.S. political affairs and personalities to the Polish Legation in Rio de Janeiro, and his contacts within artistic and political circles in New York, could expose sources and methods.",
  "security_level": "SECRET/NOFORN",
  "summary": "A CIA dispatch from Rio de Janeiro provides information on Tadeusz SZULC, including traces from SMEDICEVA, and details concerning Ignacy SACHS's activities, noting SZULC's past pro-communist sympathies and potential cooperation with Polish intelligence.",
  "summary_one_paragraph": "This dispatch, originating from the Chief of Station in Rio de Janeiro on June 20, 1962, focuses on Tadeusz SZULC and his connections to Ignacy SACHS. It includes a SMEDIFY report and related traces. The memo indicates SZULC had pro-communist leanings and may have collaborated with SACHS by providing information, though it cautions against jumping to conclusions about espionage. Also details SACHS's career path within Polish foreign affairs and his potential involvement as a propagandist, while providing insights from various sources about SZULC’s past activities, including his interactions with the Polish Legation and efforts to secure employment in American press circles.",
  "tags": [
    "CIA",
    "Tadeusz Szulc",
    "Ignacy Sachs",
    "SMEDIFY",
    "Communism",
    "Polish Legation",
    "Propaganda",
    "Brazil",
    "Journalist",
    "HBRA 9438"
  ],
  "title": "BEDOX/Operational SMEDIFY Information Concerning RE: \"43-3\" (CHECK \"X\" ONE) Tad SZULC",
  "date": "1962-06-20",
  "locations_mentioned": [
    "Rio de Janeiro",
    "Brazil",
    "Poland",
    "New York",
    "Washington",
    "Panama",
    "Montevideo"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Tadeusz Szulc",
    "Ignacy Sachs",
    "Henryk Hrankrowski",
    "Czeslaw Slowakiewicz",
    "Raul Fernandez",
    "Seweryn Szulc",
    "Horan",
    "Harold Horan",
    "John Wiley",
    "Irene Baruch",
    "Wikinski",
    "Drew Pearson",
    "Shah of Persia"
  ],
  "recipient": "Chief, WHD; Chief, EE",
  "sender": "Chief of Station, Rio de Janeiro"
}