{
  "classification": "Personnel",
  "document_type": "Cable",
  "security": "Releasing the names of former employees who retired under cover could expose their past activities and potentially endanger them or compromise sensitive operations. The cable explicitly acknowledges this concern: \"THE IMPACT OF THE RELEASE OF THE RELATIONSHIP OF YOUR TRUE NAME AND THE AGENCY WILL HAVE TO BE LOOKED AT CAREFULLY TO DETERMINE THE VIABILITY OF CONTINUED COVER PROTECTION.\"",
  "security_level": "SECRET",
  "summary": "A cable from the CIA's Office of Covert Communications (OCC) to Paris Station requesting assistance in contacting a former employee residing in Paris to inform them about the potential public release of their name in JFK assassination records and to offer guidance on how to respond if they have concerns.",
  "summary_one_paragraph": "This SECRET cable, dated March 5, 1997, originates from the Chief of the Office of Covert Communications (OCC) at CIA Headquarters and is addressed to the Paris Station. It pertains to the President John F. Kennedy Assassination Records Collection Act of 1992 and requests that the station contact a former employee who retired under cover and now resides in Paris. The purpose is to provide the former employee with information about the potential public release of their name in documents related to the JFK assassination and to offer assistance in communicating with Headquarters if they believe the release of their name would pose a threat to them, their family, or any sensitive activity they were associated with.",
  "tags": [
    "JFK Assassination Records Collection Act",
    "Covert Operations",
    "Personnel Security",
    "Public Disclosure",
    "Former Employee",
    "OCC",
    "Paris Station"
  ],
  "title": "Request for Station Assistance Regarding JFK Assassination Records Collection Act",
  "date": "1997-03-05",
  "locations_mentioned": [
    "Paris",
    "Washington, DC"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Beth Mills"
  ],
  "recipient": "Paris Station",
  "sender": "Chief/OCC"
}