{
  "classification": "Operations",
  "document_type": "Memorandum",
  "security": "Revealing Cooper's willingness to cooperate with the Agency \"in whatever manner would be most appropriate\" could compromise his relationships with individuals and governments, especially in the context of his business dealings with casinos and airlines. Exposing his offer to be approached \"personally at any time on any matter of interest to CIA\" could damage his reputation and potentially endanger his business ventures.",
  "security_level": "CONFIDENTIAL",
  "summary": "A memo from the Miami Field Office to the Director of the Domestic Contact Service regarding Gordon Cooper and Associates (GCA), detailing Cooper's business ventures, including his association with Casino Management International (CMI) and his willingness to cooperate with the CIA.",
  "summary_one_paragraph": "This memorandum, sent from the Chief of the Miami Field Office to the Director of the Domestic Contact Service on June 22, 1972, provides details about Leroy Gordon Cooper and his business ventures. It reports on Cooper's aerospace and airline management firm, Gordon Cooper and Associates (GCA), its potential disbandment due to disagreements with partner Mel Adler, and the planned formation of Gordon Cooper Consultants Corporation. The memo also highlights Cooper's involvement with Casino Management International (CMI), a gambling casino operation, his role in establishing casinos in Turkey and Yugoslavia, and his plans for a travel club associated with CMI. Additionally, it mentions Cooper's interest in establishing an airline in Haiti, his association with Norman Dupree, and his expressed willingness to cooperate with the CIA.",
  "tags": [
    "Gordon Cooper",
    "Casino Management International",
    "CMI",
    "Mel Adler",
    "Casino",
    "Gambling",
    "Haiti",
    "Airlines",
    "Aerospace",
    "Miami Field Office",
    "Domestic Contact Service"
  ],
  "title": "Gordon Cooper and Associates",
  "date": "1972-06-22",
  "locations_mentioned": [
    "Opa-Locka, Florida",
    "Nevada",
    "Republic of Panama",
    "Grand Cayman Island",
    "Istanbul, Turkey",
    "Ankara, Turkey",
    "Izmir, Turkey",
    "Yugoslavia",
    "Haiti"
  ],
  "origin_agency": "Miami Field Office",
  "persons_mentioned": [
    "Leroy Gordon Cooper",
    "Mel Adler",
    "Edward Cellini",
    "Robert Cellini",
    "Dino Cellini",
    "Norman Dupree"
  ],
  "recipient": "Director, Domestic Contact Service",
  "sender": "Chief, Miami Field Office"
}