{
  "classification": "Liaison",
  "document_type": "Message",
  "security": "This document discusses proposed topics for discussion with a foreign intelligence service (JYVAPOROUS/1), including sensitive files related to Lee Harvey Oswald and potential joint operations targeting military officers from Iraq and Iran in Belarus. Disclosing these topics could compromise ongoing liaison relationships, reveal intelligence-gathering priorities, and negatively impact relationships with Belarus, Iraq, and Iran. Quoting: \"During previous meetings with V/1, he had offered to provide summaries of GYVAPOROUS files on *<LEE HARVEY OSWALD>AND also allow 'EXPERTS' to examine documents within these files in order to confirm their authenticity\" and \"JYVAPOROUS/PNINFINITE-JOINT-OPERATION-TARGETING-IRAQI OR IRANIAN MILITARY OFFICERS IN BELARUS POSES SOME EXCITING POSSIBILITIES FOR THIS LIAISON RELATIONSHIP.\"",
  "security_level": "SECRET",
  "summary": "This message outlines proposed discussion topics for an upcoming visit of JYVAPOROUS/1 to headquarters, including Lee Harvey Oswald files and potential joint operations targeting Iraqi and Iranian military officers in Belarus, and requests comments and availability for lunch/dinner.",
  "summary_one_paragraph": "This SECRET message, dated July 2, 1993, from LIMIT CETF/W/BLO, outlines proposed topics for discussion during JYVAPOROUS/1's visit to headquarters, including the exchange of Lee Harvey Oswald files and potential joint operations targeting Iraqi and Iranian military officers in Belarus, specifically requesting COS's comments on these proposals and JYVAPOROUS/1's availability for a luncheon/dinner with CHIEF/CE; the message also references a previous offer from JYVAPOROUS/1 to allow experts to examine Oswald-related documents and expresses enthusiasm for a potential collaboration targeting foreign military officers.",
  "tags": [
    "JYVAPOROUS",
    "Liaison",
    "Lee Harvey Oswald",
    "Iraq",
    "Iran",
    "Belarus",
    "Joint Operation",
    "WNINTEL",
    "HGDHARMA",
    "JYVAPOROUS"
  ],
  "title": "Official Visit of JYVAPOROUS/1 to HQS",
  "date": "1993-07-02",
  "locations_mentioned": [
    "Minsk",
    "Belarus"
  ],
  "persons_mentioned": [
    "Lee Harvey Oswald",
    "JYVAPOROUS/1",
    "PNINFINITE"
  ],
  "recipient": "IMMEDIATE MINSK",
  "sender": "LIMIT CETF/W/BLO"
}