{
  "classification": "Personnel",
  "document_type": "Memorandum and Request",
  "security": "This document contains personal and operational details about Antonio Soto Vazquez, including his operational use in project WITHRUSH, his background check results, and assessments of his reliability and character. Releasing this information could compromise ongoing operations, expose intelligence-gathering methods, and violate privacy. As stated in the document, it includes 'CHARACTER, RELIABILITY AND SECURITY' evaluations, and also details of his 'PROPOSED PP/PM TYPE USE OR DUTIES.'",
  "security_level": "SECRET/RYBAT",
  "summary": "This document details the background, operational use, and cancellation of Antonio Soto Vazquez (201-294544) from project WITHRUSH, including a request to cancel his CA (Controlled Agent) status due to lack of further operational interest, along with related security checks and operational approvals.",
  "summary_one_paragraph": "This collection of documents relates to Antonio Soto Vazquez, a Cuban exile involved in the CIA's WITHRUSH project. The documents include a request to cancel his status as a controlled agent due to a lack of operational interest, a memorandum detailing positive security checks, a request for operational approval, and a personal record questionnaire outlining his background, motivations, and potential use as a pilot. The documents also contain details of his employment history, references, and travel records, as well as assessments of his character and reliability, culminating in the cancellation of his operational status in September 1966.",
  "tags": [
    "CIA",
    "WITHRUSH",
    "Antonio Soto Vazquez",
    "Operational Approval",
    "Background Check",
    "Cuban Exile",
    "Agent Cancellation",
    "Security"
  ],
  "title": "Antonio Soto Vazquez: Operational Use and Cancellation from Project WITHRUSH",
  "date": "1965-05-24",
  "locations_mentioned": [
    "Havana, Cuba",
    "Miami, Florida",
    "Daytona Beach, Florida",
    "Dominican Republic",
    "San Juan, Puerto Rico",
    "Guatemala",
    "Toronto, Canada",
    "Republic of Congo"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Antonio Soto Vazquez",
    "Roberto Medell",
    "George N. Sohl",
    "Gerald Saunders",
    "Dolores Inocenta Becerra",
    "Ralph H. Aguilera",
    "Victor H. M. Bark",
    "Sam Kratish",
    "J. C. Wilder",
    "Carlos Marther",
    "Marie Rodriguez",
    "Mary Diener",
    "Lawrence Murphy",
    "Edward P. Brown"
  ],
  "recipient": "Chief, CI/OA",
  "sender": "Director (SOD W. Wainwright)"
}