{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "This memorandum details plans for covert actions to disrupt or discredit Khrushchev's visit to Cuba. Specifically, it outlines the instigation of a 'massive church manifestation' to protest the visit and the propagation of rumors about a planned assassination attempt on Khrushchev. This information could compromise ongoing operations by revealing specific tactics and sources, thereby endangering assets and disrupting operations. Quoting directly: '...it has been determined that such assets would be used only as a means of instigating the church to hold the rally,' and 'instigation of rumors that Khrushchev's life will be in danger while in Cuba from a well-planned assassination attempt would be propagated from other Latin American countries.'",
  "security_level": "SECRET",
  "summary": "A CIA memorandum discusses plans to exploit Khrushchev's visit to Cuba by instigating a massive church rally to demonstrate opposition and spreading rumors of an assassination attempt.",
  "summary_one_paragraph": "This secret memorandum, dated July 5, 1960, outlines plans to counteract the establishment of a solid Soviet understanding with Cuba following Khrushchev's official visit. The proposed strategy includes orchestrating a massive church manifestation in Cuba to express public opposition and instigating rumors from outside Cuba regarding a planned assassination attempt on Khrushchev. The CIA's Western Hemisphere Division, led by J.C. King, proposed these actions, emphasizing the use of Cuban assets to instigate the church rally while avoiding direct action that could imperil Station assets, and calling upon press assets to support both the rallies and the assassination rumors through various media channels.",
  "tags": [
    "CIA",
    "Khrushchev",
    "Cuba",
    "Covert Operations",
    "Church Rally",
    "Assassination Rumors",
    "Propaganda",
    "WRUL",
    "Western Hemisphere Division"
  ],
  "title": "Operational Exploitation of Khrushchev Visit to Cuba",
  "date": "1960-07-05",
  "locations_mentioned": [
    "Cuba",
    "Habana",
    "Camaguey",
    "Santiago",
    "Latin America",
    "Bogota",
    "Miami"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Khrushchev",
    "Bishop Boza Masvidal",
    "Rose Lavastida",
    "J.C. King",
    "David A. Phillips",
    "Eisenhower",
    "Helms",
    "Rudy Gomez"
  ],
  "recipient": "Director of Central Intelligence",
  "sender": "J. C. King, Chief, Western Hemisphere Division"
}