{
  "classification": "Cuba",
  "document_type": "Cable",
  "security": "Sharing information about subjects potentially involved in drug trafficking and exile activities could compromise ongoing investigations and relationships with foreign intelligence agencies. For example, the cable mentions \"HERMINIO DIAZ BARCIA (201-203846) WAS REPORTEDLY SMUGGLING NARCOTICS\" and discusses his connections and movements.",
  "security_level": "SECRET",
  "summary": "A cable discusses station traces on Evelio Duque and Herminio Diaz, focusing on their involvement in anti-Castro activities, potential connections to drug trafficking, and exile group affiliations.",
  "summary_one_paragraph": "This secret cable from August 1973 details station traces on Evelio Duque and Herminio Diaz. Duque, possibly identical to Evelio Duque Miyar, was a wanted guerrilla leader in the Escambray and later a commander of anti-Castro forces, entering the U.S. in 1961. Herminio Diaz was reportedly involved in narcotics smuggling between Mexico and the U.S., using Puerto Rican documentation, and had connections to the 30th November Movement, attempting infiltration into Cuba in 1966. SLIGO traces suggest Diaz may be Sandalio Hermino Diaz Garcia, reported killed during the 1966 invasion attempt and possibly a GOC agent infiltrated into the U.S. Additional information indicates Duque was active in U.S. exile groups and accused of misappropriating funds for anti-Cuba activities by Orlando Bosch Avila.",
  "tags": [
    "Evelio Duque",
    "Herminio Diaz",
    "Cuba",
    "Anti-Castro",
    "Drug Trafficking",
    "Exile Groups",
    "Guerrilla",
    "Miami",
    "Mexico",
    "Narcotics",
    "201-302006",
    "201-203846",
    "Orlando Bosch Avila"
  ],
  "title": "Station Traces on Evelio Duque and Herminio Diaz",
  "date": "1973-08",
  "locations_mentioned": [
    "Guayaquil",
    "San Jose",
    "Quito",
    "Guatemala",
    "Mexico City",
    "Escambray",
    "Cuba",
    "Miami",
    "Mexico",
    "U.S.",
    "Havana",
    "New York",
    "Las Villas"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Evelio Duque",
    "Evelio Duque Miyar",
    "Luis Martin Hernandez",
    "Herminio Diaz",
    "Herminio Diaz Barcia",
    "Sandalio Hermino Diaz Garcia",
    "Orlando Bosch Avila",
    "Batista"
  ],
  "recipient": "Guayaquil, Director, San Jose, Quito, Guatemala, Mexico City"
}