{
  "classification": "Personnel",
  "document_type": "File Review",
  "security": "Disclosing details about Harold R. NOFMAYR's (aka Arthur C. VAIVADA) cover activities, projects like AMPHODARCH and LIEDGE, and his relationships with his wife and sister-in-law could compromise ongoing operations and agent identities. The document states: 'NOFHAYR will continue to live under cover and will probably be reassigned overseas after a two year tour at Headquarters' and references CSA requests for his wife and sister-in-law. Revealing the nature or location of safehouse briefings (Area of Subject's Assignment: For briefing by CI/ICD and WH/III/Vexico representatives in safehouse) could expose operational methods and locations.",
  "security_level": "SECRET",
  "summary": "A file documenting the review of materials related to Ross Lester Crozier (C-25507) by the House Select Committee on Assassinations (HSCA) staff members at CIA Headquarters. The file includes memoranda, instruction sheets, and a Personal Record Questionnaire (PRQ) pertaining to Harold R. NOFMAYR, aka Arthur C. VAIVADA, covering his activities under Projects AMPHODARCH and LIEDGE, along with security approvals and biographical information.",
  "summary_one_paragraph": "This file documents the review of materials pertaining to Ross Lester Crozier by the House Select Committee on Assassinations (HSCA) staff at CIA Headquarters. The documents primarily concern Harold R. NOFMAYR (Arthur C. VAIVADA), detailing his involvement in Projects AMPHODARCH (Cuba) and LIEDGE (Mexico), and include requests for Covert Security Approvals (CSA) for his activities in various locations, including Headquarters. The file contains memoranda outlining security considerations, operational approvals, biographical information, and a PRQ that assesses NOFMAYR's background, reliability, and suitability for covert operations. Additional materials include requests for indices checks, field traces, and green list information, reflecting routine security procedures and project management within the CIA.",
  "tags": [
    "CIA",
    "HSCA",
    "Ross Lester Crozier",
    "Harold R. NOFMAYR",
    "Arthur C. VAIVADA",
    "AMPHODARCH",
    "LIEDGE",
    "Covert Security Approval",
    "PRQ",
    "Mexico",
    "Cuba"
  ],
  "title": "CROZIER, ROSS LESTER",
  "date": "1958-04-11",
  "locations_mentioned": [
    "Cuba",
    "Mexico City",
    "Washington, D.C."
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Ross Lester Crozier",
    "Harold R. NOFMAYR",
    "Arthur C. VAIVADA",
    "J. C. King",
    "David E. Hanlon",
    "Robert H. Cunninghan",
    "Lou Hemby",
    "Jim Burton",
    "Emily Brockinbram",
    "Larry Sulc",
    "Maurice S. Brady"
  ],
  "recipient": "Chief, Office of Security",
  "sender": "Chief, CI/OA"
}