{
  "classification": "Commission",
  "document_type": "Memorandum",
  "security": "Disclosing that Marie L. PRISBECH was a pseudonym for Heda Massing, an Agency contract agent, including her dates of service and the nature of the files maintained (cover establishment and maintenance), could expose past operational methods and compromise the identities of individuals associated with those activities. Sharing could reveal covert operational methods, and providing details about the use of pseudonyms and cover stories could undermine the Agency's ability to conduct future operations effectively. Directly quoting: \"CCS files contain information on a Marie L. PRISBECH, a pseudonym (officially assigned to Heda Massing, U.S. citizen...who was an Agency contract agent from 1956 until her retirement in 1975. The information is contained in approximately 60 documents, virtually all of which concern the establishment and maintenance of cover.\"",
  "security_level": "SECRET",
  "summary": "A memo from V. L. Latta to DDO/ISS/IP/LIS, regarding a request from the House Select Committee on Assassinations (HSCA), stating that CCS files contain information on Marie L. PRISBECH, a pseudonym for Heda Massing, an Agency contract agent, and that the information mainly concerns the establishment and maintenance of cover.",
  "summary_one_paragraph": "This SECRET memorandum, authored by V. L. Latta of the Central Cover Staff (CCS) Plans and Review Group, addresses a request from the House Select Committee on Assassinations (HSCA) concerning information on individuals. The memo indicates that CCS files contain approximately 60 documents related to Marie L. PRISBECH, a pseudonym assigned to Heda Massing, a U.S. citizen and Agency contract agent from 1956 to 1975; these documents pertain to the establishment and maintenance of Massing's cover. The memo clarifies that CCS files do not contain information on any other individuals listed in the HSCA's request.",
  "tags": [
    "HSCA",
    "Marie L. PRISBECH",
    "Heda Massing",
    "Cover",
    "Pseudonym",
    "Central Cover Staff",
    "FOIA"
  ],
  "title": "House Select Committee on Assassinations (HSCA) Request",
  "date": "1978-06-08",
  "origin_agency": "CIA",
  "persons_mentioned": [
    "V. L. Latta",
    "Heda Massing",
    "Marie L. PRISBECH"
  ],
  "recipient": "DDO/ISS/IP/LIS",
  "sender": "V. L. Latta, Plans and Review Group, Central Cover Staff"
}