{
  "classification": "Mexico",
  "document_type": "Project Outline",
  "security": "This document outlines a covert operation involving support for a U.S. contract agent (LIHUFF/1) operating within right-wing political circles in Mexico. Revealing this information could expose the agent, compromise ongoing intelligence activities, and damage relations with the Mexican government. The document states, \"Support for singleton contract agent operating into right-wing political milieu in Mexico for intelligence purposes with some covert action by-product.\" Additionally, disclosing that the Station would explain \"the Station Interest in right-wing circles as attempting to follow what they were up to in case they became a threat to the stability of the present government” could be seen as admitting to interference in Mexican internal affairs.",
  "security_level": "SECRET",
  "summary": "This document outlines a project in Mexico City to support a U.S. contract agent, LIHUFF/1, who is operating within right-wing political elements and organizations in Mexico for intelligence purposes and potential covert action.",
  "summary_one_paragraph": "The project outline details a plan to support LIHUFF/1, a U.S. contract agent embedded within Mexico's right-wing political landscape. LIHUFF/1, the Executive Director of the U.S. Chamber of Commerce of Mexico City, leverages his position to gather intelligence and potentially conduct covert actions. The project aims to monitor right-wing entities, including Lic. Agustin NAVARRO Vasquez's organization, IISE, “Espejo”, MURO, and other figures like Hugo SALINAS Price and Jorge SIEGRIST Clamont, with a secondary objective of gathering information on the Mexican education system. The project, budgeted at $9,000 annually, aligns with the Station's mission to understand the stability of the Mexican government through penetrating political groups.",
  "tags": [
    "CIA",
    "Mexico",
    "Project Outline",
    "LIHUFF/1",
    "Right-Wing Politics",
    "Covert Action",
    "Intelligence Gathering",
    "Willard C. Curtis"
  ],
  "title": "Project Outline",
  "date": "1965-07-01",
  "locations_mentioned": [
    "Mexico City, Mexico",
    "Panama",
    "China"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Willard C. Curtis",
    "LIHUFF/1",
    "Lic. Agustin NAVARRO Vasquez",
    "LIHUFF/2",
    "LICHANT/1",
    "Hugo SALINAS Price",
    "Jorge SIEGRIST Clamont"
  ],
  "recipient": "Unspecified",
  "sender": "Willard C. Curtis"
}