{
  "classification": "Personnel, Operations, Cuba",
  "document_type": "Dispatch, Memorandum",
  "security": "Revealing Peter Di Gerveno's proposed non-official cover operation could compromise current and future intelligence activities. The document explicitly mentions: 'Subject will be a Principal Agent for established agents, specifically tested penetrations of leftist/extremist groups in Venezuela.' Exposing this information, alongside cover details such as affiliations with HUNKELER's sales organization and the project cryptonym CIELBOW, could endanger agents, sources, and ongoing operations by revealing CIA methods.",
  "security_level": "SECRET",
  "summary": "This collection of documents details the CIA's plans to establish a non-official cover for Peter J. Di Gerveno in Caracas, Venezuela, utilizing Robert S. Hunkeler's business enterprises, and also includes correspondence regarding Di Gerveno's death and its impact on associated operations.",
  "summary_one_paragraph": "The documents outline a CIA plan to place Peter J. Di Gerveno under non-official cover in Caracas as a representative for Robert S. Hunkeler's sales lines, including marketing firms and industrial products, to facilitate intelligence operations targeting leftist groups in Venezuela. The plan includes extensive training, financial arrangements, and logistical considerations for Di Gerveno and his family's relocation. However, Di Gerveno's death leads to a request to retain the cover proposal and find a suitable replacement with similar commercial and linguistic skills. Included is a letter from Richard Helms to Di Gerveno's widow expressing gratitude for Di Gerveno's dedication and agency service, alongside internal communications regarding Di Gerveno's cover status, family matters, and discussions on managing the cover following his death.",
  "tags": [
    "CIA",
    "Non-Official Cover",
    "Peter J. Di Gerveno",
    "Venezuela",
    "JMWAVE",
    "Robert S. Hunkeler",
    "Covert Operations",
    "Personnel",
    "CIELBOW"
  ],
  "title": "Cover for Peter J. Di Gerveno",
  "date": "1968-05-06",
  "locations_mentioned": [
    "Caracas, Venezuela",
    "Havana, Cuba",
    "Miami, Florida",
    "New Jersey"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Peter J. Di Gerveno",
    "Fletcher M. Knight",
    "Paula R. Rodriguez",
    "Richard Helms",
    "Robert S. Hunkeler",
    "Chester B. Dagnillo",
    "William V. Broe"
  ],
  "recipient": "Chief of Station, JMWAVE",
  "sender": "Chief, Western Hemisphere Division"
}