{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Cable",
  "security": "Revealing that Herbert Itkin, a Mafia-linked figure and espionage suspect, provided information to BKCROWN (likely a CIA component) on persons in the Dominican Republic could compromise intelligence sources and methods, potentially damaging relationships with other agencies. Additionally, the request to interview Luis E. Gutierrez and disclose ITKIN’s FBI informant status (\"ITKIN has been an FBI informant since March 1963. He has now claimed to have worked for this Organization during the period 1954/55 to 1960.\") could jeopardize ITKIN’s safety and the integrity of ongoing legal proceedings.",
  "security_level": "SECRET",
  "summary": "A collection of cables related to Herbert Itkin, a person of interest due to alleged Mafia connections, espionage activities, and claims of providing information to U.S. intelligence. The cables document his travel restrictions in Santo Domingo, his past associations, and requests for further investigation into his background and activities.",
  "summary_one_paragraph": "This compilation of cables focuses on Herbert Itkin, an individual with alleged ties to the Mafia and suspected involvement in espionage. Itkin was denied entry into Santo Domingo on August 22, 1972, and subsequently returned to New York. Intelligence records indicate he was blacklisted for espionage activities and Mafia connections, with reports suggesting he provided information to BKCROWN on persons in the Dominican Republic. The cables detail requests for traces, background checks, and an interview with Luis E. Gutierrez in El Salvador, to verify Itkin's claims of past associations with the CIA and a man named Philip Harbin. The documents also reference a London Telegraph article linking Itkin to JKLANCE (likely a misspelling for a CIA component).",
  "tags": [
    "Herbert Itkin",
    "Mafia",
    "Espionage",
    "Santo Domingo",
    "BKCROWN",
    "Philip Harbin",
    "Luis E. Gutierrez",
    "FBI Informant",
    "WOMUSE",
    "EMPYREX",
    "PYBAT KEYWAY",
    "JKLANCE",
    "Foreign Agent",
    "Louis Dejoie",
    "Haitian Government in Exile"
  ],
  "title": "ITKIN, HERBERT",
  "date": "1972-08-28",
  "persons_mentioned": [
    "Herbert Itkin",
    "Luis E. Gutierrez",
    "Philip Harbin",
    "Louis Dejoie",
    "James L. Marcus",
    "William P. Maclean",
    "Theodore G. Shackley"
  ],
  "sender": "Chief, WH Division (WOMUSE), Chief of Station, San Salvador, DIPECTOR (cable messages), William P. Kosterman (Special Agent in Charge), OGC 2/13/69 (official routing slip), RID/SD 17 (Routing and Record Sheet message)"
}