{
  "classification": "Soviet",
  "document_type": "Classified Message",
  "security": "Revealing details of liaison activities and potential Soviet connections to the assassination could compromise ongoing operations and damage international relations. Specifically, 'CARL plans any cutork or liaison contact with Polish driver and results such contact. NOIR NECID-5 assigns responsibility this activity to KUBARK' indicates sensitive operational planning.",
  "security_level": "SECRET",
  "summary": "A message regarding a potential Soviet connection to the JFK assassination, specifically referencing a Polish driver with information and tasking KUBARK with liaison activities.",
  "summary_one_paragraph": "This classified message, dated November 25, 1963, relays information about a possible Soviet link to the JFK assassination. It references a telephone conversation where a Polish driver claimed a Soviet government connection to the assassination. It tasks KUBARK to plan contact with the Polish driver to gather further details. The message also highlights that all aspects of the assassination are under Tagatine AED operational control.",
  "tags": [
    "JFK Assassination",
    "Soviet Union",
    "Polish Driver",
    "KUBARK",
    "Liaison",
    "Tagatine AED",
    "ALDERA",
    "JETATIS",
    "OPIM"
  ],
  "title": "Potential Soviet Connection to JFK Assassination",
  "conspiracy": "The document explicitly mentions a 'possible Soviet connection supplvis money to individual in U.S. to assassinate President, possible Soviet implication in U.3.S. Thre her incident, etc.' This directly suggests a potential link between the Soviet government and the assassination of President Kennedy.",
  "date": "1963-11-25",
  "locations_mentioned": [
    "U.S."
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "William Johnson",
    "Tant Erhark",
    "J. Roman",
    "Ollar Cilua",
    "President John F. Kennedy"
  ],
  "recipient": "STDEY INFO CANBERRA",
  "sender": "DIRECTOR"
}