{
  "classification": "Cuba, Operations, Personnel",
  "document_type": "Dispatch, Memoranda, Personal Record Questionnaire",
  "security": "Several elements within this document would constitute a security risk if exposed. The dispatch discusses ongoing operations and intelligence activities related to WITHRUSH and the employment of PBPRIME pilots. Furthermore, the operational use of Antonio Soto Vazquez and Cecilio Padron Sanchez, including details about their training, motivations, and known connections would be exposed, as well as details on WITHRUSH pilots being used to carry out certain operations. For instance, from: \"It is requested that OA on Subject be canceled as he is of no further operational interest to this office...\", and \"indications with ODURGE...inform future contractees tint if they commit such acts while on duty in the Congo trey will be relieved of their jobs.\"",
  "security_level": "SECRET",
  "summary": "This collection of documents pertains to Antonio Soto Vasquez and Cecilio Juan Padron Sanchez, two pilots involved in the WITHRUSH project, detailing their backgrounds, training, operational approvals, and investigations into forged passports.",
  "summary_one_paragraph": "This collection of documents details the activities, backgrounds, and operational involvement of Antonio Soto Vasquez and Cecilio Juan Padron Sanchez, two pilots associated with the WITHRUSH project. The documents include dispatches, memoranda for record, and a Personal Record Questionnaire (PRQ) providing information on Soto's motivations, training, and connections. They cover aspects such as helicopter training in 1965, investigations into forged passports used to obtain visas to Spain, operational approvals, and the eventual cancellation of operational interest in Soto. Key events include their arrival in Leopoldville, training in New Mexico, and their interactions with various intelligence officers and agencies.",
  "tags": [
    "CIA",
    "WITHRUSH",
    "Antonio Soto Vasquez",
    "Cecilio Juan Padron Sanchez",
    "Pilot Training",
    "Passport Forgery",
    "Operational Approval",
    "KUCURL",
    "IUPAGAN",
    "JMWAVE",
    "Leopoldville",
    "PBPRIME"
  ],
  "title": "Soto Vazquez, Antonio: Documentation on WITHRUSH Project and Pilot Activities",
  "date": "1966-12-16",
  "locations_mentioned": [
    "Maya, Cuba",
    "Miami, Florida",
    "Leopoldville, Congo",
    "Athens, Greece",
    "Madrid, Spain",
    "New York",
    "Albuquerque, New Mexico",
    "Santa Fe, New Mexico",
    "Deming, New Mexico",
    "Silver City, New Mexico"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Antonio Soto Vasquez",
    "Cecilio Juan Padron Sanchez",
    "Ernesto Despaigne",
    "Colonel Touart",
    "Varella",
    "Larry Murphy",
    "Edward P. Brown",
    "Alfred F. Pelander",
    "Alexander V. DeClipel",
    "Philip L. Musher",
    "Carlos Justi",
    "Thomas Baldwin",
    "Edward Scholz",
    "Andrew G. Brennus",
    "Orlando Izquierdo",
    "Elwood W. Nelson",
    "Mario Sineara Aistonis Exte",
    "Ar. Garcia",
    "Rojas",
    "Vallicerco",
    "Piedra",
    "Lorentz"
  ],
  "recipient": "Chief, CI/OA, Chief, KUCURL, Chief, JAWAVE, Chief, Africa Division",
  "sender": "80D W. Wainwright, Chief of Station, Leopoldville, Chief, IUPAGAN"
}