{
  "classification": "Cuba",
  "document_type": "Office Memorandum",
  "security": "Revealing contact with a source providing information on anti-Castro groups could expose the source and compromise ongoing intelligence operations. Quoting the document: '...represent to us the ambitions, operations and proposed sabotage activities of Alpha-66 so that they can either be controlled, encouraged or discouraged...' This reveals an intention to possibly manipulate the Cuban action group, which could cause diplomatic issues if exposed.",
  "security_level": "SECRET",
  "summary": "The New York Office reports contact with Robert A. Pratchett, a US citizen with extensive Cuban experience, who is in contact with the anti-Castro group Alpha-66 and offers to provide detailed information about their operations and sabotage activities for potential control or influence.",
  "summary_one_paragraph": "On August 31, 1962, the Chief of the New York Office sent a memorandum to the Chief of the Contact Division, Support Branch, regarding Robert A. Pratchett, a new US citizen source with 27 years of Cuban experience. Pratchett is in direct contact with the Cuban counterrevolutionary group Alpha-66 and anti-Castro Cubans in Havana, offering to provide detailed insights into Alpha-66's ambitions, operations, and proposed sabotage activities, including plans to blow up all the power plants in Cuba, for the US Government's consideration in controlling, encouraging, or discouraging their actions; Pratchett is willing to assist in a non-pay status due to his extensive knowledge of Cubans, Cuba, and the Spanish language.",
  "tags": [
    "Cuban Counterrevolution",
    "Alpha-66",
    "Robert A. Pratchett",
    "Sabotage",
    "Contact Division",
    "New York Office",
    "Intelligence Source"
  ],
  "title": "Robert Pratchett Cuban Counterrevolutionary Group, Alpha-66",
  "date": "1962-08-31",
  "locations_mentioned": [
    "Cuba",
    "Havana",
    "New York",
    "New Providence, New Jersey"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Robert A. Pratchett",
    "Robert Pratchett",
    "Fidaniels",
    "DJ. Connor",
    "AJAY JAY B. B. L. REEVES"
  ],
  "recipient": "Chief, Contact Division Support Branch",
  "sender": "Chief, New York Office"
}