{
  "classification": "Cuba",
  "document_type": "Telegram Information Report",
  "security": "This document concerns military intelligence on Cuba, reporting the observation of previously unseen tanks with twin cannons near Habana. Disclosing the specifics of the tanks and their location (Via Monumental and Carretera Central) could compromise sources and intelligence-gathering methods. It also reveals that intelligence is being gathered from a 'Cuban of Western European extraction' working as a manager. Sharing the details of this source, or the locations of military installations, could threaten their safety and compromise intelligence operations. Quoting directly: 'Source has reported military information acquired by personal observation. Source's reliability has not yet been established...Many of the tanks had twin cannon mounted and were a type previously not observed by the eyewitness.'",
  "security_level": "SECRET",
  "summary": "A SECRET intelligence report details the sighting of approximately 200 tanks, many with previously unseen twin cannons, participating in maneuvers near Habana, Cuba, on 23 November 1963.",
  "summary_one_paragraph": "This intelligence report, dated 27 November 1963, describes a sighting on 23 November 1963 of around 200 tanks maneuvering near the intersection of Via Monumental and Carretera Central in Habana, Cuba. According to an educated Cuban source, a manager of an agricultural enterprise, many of these tanks were equipped with twin cannons, a type not previously observed. The report notes the presence of a large military camp west of Via Monumental, possibly the Loma de Tierra military area experiencing an influx of vehicles and materiel. The report also references an earlier account of armored vehicles, possibly flame throwers, arriving from the USSR via the ship 'Orenburg' in October.",
  "tags": [
    "CIA",
    "Cuba",
    "Military Intelligence",
    "Tanks",
    "Twin Cannons",
    "Habana",
    "Soviet Union",
    "AMKHAN-2",
    "TDCS DB-3/658,079",
    "JFK Assassination Records Act"
  ],
  "title": "Sighting of Tanks with Twin Cannons in the Area of Habana",
  "date": "1963-11-27",
  "locations_mentioned": [
    "Cuba",
    "Habana",
    "Via Monumental",
    "Carretera Central",
    "United States, Miami",
    "Western Europe"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Eduardo Perez Duaney"
  ],
  "recipient": "LANT PACY BARR",
  "sender": "DIRECTOR"
}