{
  "classification": "Oswald",
  "document_type": "Cable",
  "security": "Revealing NOPIGGIN as a source in contact with Nechiporenko, as well as detailing the extent of FBI involvement, could compromise ongoing intelligence operations. Additionally, confirming the CIA's interest in approaching Nechiporenko under a 'commercial guise' could damage the agency's reputation if exposed.  Quoting directly: 'NOP was offered a one-time interpreting job...under FBI direction, NOP tried to elicit updated CI info...SUBJECT IS LONELY, AND COULD BE APPROACHED SECURELY UNDER AN APPROPRIATE COMMERCIAL GUISE'.",
  "security_level": "SECRET",
  "summary": "A cable details interactions with retired KGB Colonel Oleg M. Nechiporenko, known for his involvement with Lee Harvey Oswald, during his U.S. visit to promote his book, and suggests potential recruitment under commercial cover.",
  "summary_one_paragraph": "This secret cable from November 1993 discusses retired KGB Colonel Oleg M. Nechiporenko's visit to the U.S. to promote his book related to Lee Harvey Oswald. The cable describes how NOPIGGIN, a source, interacted with Nechiporenko as an interpreter during a TV interview where Nechiporenko extensively discussed his meetings with Oswald. It notes Nechiporenko's loneliness and suggests he could be approached under a commercial guise, possibly as a speaker for retired intelligence officers, while also detailing his background, including his time in Mexico, Cuba, and his views on POW/MIA issues. The cable also mentions FBI's involvement in directing NOP to elicit information.",
  "tags": [
    "KGB",
    "Oleg M. Nechiporenko",
    "Lee Harvey Oswald",
    "NOPIGGIN",
    "Recruitment",
    "Commercial Cover",
    "FBI",
    "Kennedy Assassination"
  ],
  "title": "OLEG M. NECHIPORENKO",
  "conspiracy": "The document discusses Oleg Nechiporenko's views on his meetings with Lee Harvey Oswald. It also mentions Nechiporenko's participation in a symposium on the Kennedy assassination.",
  "date": "1993-11-23",
  "locations_mentioned": [
    "New York",
    "Houston",
    "Mexico",
    "Cuba",
    "Moscow",
    "Vietnam"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Oleg M. Nechiporenko",
    "Lee Harvey Oswald",
    "Kalugin",
    "Kapitsa"
  ],
  "recipient": "Director",
  "sender": "STAFF"
}