{
  "classification": "Commission",
  "document_type": "Classified Fax Transmission",
  "security": "Questions touch on sensitive areas such as records of destroyed records, covert operations, and relationships with journalists. Answering some questions could reveal sources and methods. Specifically, Question 5 asks about 'all technical and surveillance operations in and on the Cuban and Soviet consulates and embassies in Mexico City between September 1 and December 1, 1963,' revealing specific targets and timeframes of interest.  Question 9 asks 'How should a query be framed to search for connections between the Agency and journalists or publishing companies?' This could reveal how the CIA gathers intelligence on journalists and potentially exposes covert relationships.",
  "security_level": "SECRET",
  "summary": "A fax transmission from Michelle Combs to Barry Harrelson (ARRB) containing a list of questions regarding CIA records related to the JFK assassination, including destroyed records, Mexico City operations, contacts with journalists, and the QKENCHANT project, intended for a briefing on April 1, 1997.",
  "summary_one_paragraph": "This classified fax transmission, dated March 31, 1997, from Michelle Combs to Barry Harrelson at the ARRB, includes a 17-page document containing questions for a follow-up briefing concerning CIA records related to the JFK assassination. These questions delve into various topics, such as the CIA's record-keeping practices for destroyed records, search strategies for retired records at the CIA's Record's Center, technical and surveillance operations in Mexico City in 1963, Agency connections to journalists and publishing houses, and details about the QKENCHANT project and Clay Shaw's involvement. The document also references specific ARRB requests for additional information and poses questions about backchannel communications and annual station reports for Mexico City.",
  "tags": [
    "ARRB",
    "CIA",
    "JFK Assassination",
    "Records",
    "Mexico City",
    "QKENCHANT",
    "Clay Shaw",
    "Journalists",
    "Surveillance",
    "Destroyed Records"
  ],
  "title": "DS&T and DO Briefing Questions",
  "persons_mentioned": [
    "Barry Harrelson",
    "Michelle Combs",
    "Tom Mangold",
    "George Kalaris",
    "Angleton",
    "Oswald",
    "Clay Shaw",
    "Howard Hunt",
    "J. Monroe Sullivan",
    "Jack S. Martin",
    "Louis Ivon",
    "Lloyd A. Ray",
    "Hunter Leake",
    "V. Yermakov",
    "George Lardner Jr.",
    "Russo",
    "Clem Bertrand",
    "Ramsey Clark",
    "General C.P. Cabell",
    "Ferrie",
    "Abram Chayes",
    "Allen Dulles",
    "Snyder",
    "Ford",
    "Coleman",
    "George Ball",
    "Ehrlich",
    "Lowenfeld"
  ],
  "recipient": "Barry Harrelson",
  "sender": "Michelle Combs (ARRB, 202-724-0088) via fax 703-613-3060 on March 31, 1997, at 12:05 pm. Pages: 17, including this cover sheet. Subject: DS&T and DO Briefing Questions COMMENTS: Barry, Attached are the final versions of the DS&T and DO briefing questions. There are no changes in the DS&T questions. Questions have been added to the DO list to reflect our conversation March 19 and 20. You, of course, already have our detailed explanations for the earlier DO questions. If you have any questions or if there are any problems, please give me a call. I should be in all day. See you tomorrow. Michelle"
}