{
  "classification": "Cuba",
  "document_type": "Classified Message",
  "security": "Disclosing the identities and positions of Cuban officials could compromise them and hinder ongoing or future intelligence operations. Directly quoting: 'IDENTITY A (ISIDRO CONTRERAS) COMMANDING OFFICER OF PINAR DEL RIO NAVAL DISTRICT... IDENTITY BFNU (IGNARRA MATARRAN) COMMANDING OFFICER OF EASTERN SOUGE DISTRICT (ORIENTE).'",
  "security_level": "SECRET",
  "summary": "A CIA message identifies several Cuban officials, detailing their positions, backgrounds, and affiliations within the Cuban military, police, and government.",
  "summary_one_paragraph": "This SECRET message, dated October 30, 1963, relays information regarding the identities and positions of various Cuban officials. These individuals include Isidro Contreras, Commanding Officer of the Pinar del Rio Naval District; Ignarra Matarran, Commanding Officer of the Eastern Souge District; Jose Ponce, former commander taking a guided missile course in the US; and numerous others holding positions in the Cuban army, navy, police, and government. The message provides details about their backgrounds, such as participation in the Moncada attack, the Gramma landing, and service during the Batista regime.",
  "tags": [
    "CIA",
    "Cuba",
    "Cuban Officials",
    "Intelligence",
    "Military",
    "Police",
    "Government",
    "Personnel"
  ],
  "title": "Identities of Cuban Officials",
  "date": "1963-10-30",
  "locations_mentioned": [
    "Cuba",
    "Pinar del Rio",
    "Bahia Honda",
    "Oriente",
    "Santa Clara",
    "Havana",
    "Sierra Maestra"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Isidro Contreras",
    "Azterain",
    "Ignarra Matarran",
    "Jose Ponce",
    "Rasimo Valdez",
    "Orlando Fernandez",
    "FNU Jomaron",
    "Jose Castanera",
    "Roman Alvarez",
    "Enrique Camara",
    "FNU Sauret",
    "Jose Suarez",
    "Enrique Santana",
    "FNU Ventura",
    "Pepin Arruti",
    "Orlando Mirret",
    "FNU Ojeda",
    "FNU Llaneras",
    "Roberto Roque Nunez",
    "Pedro Miret",
    "Faustino Perez",
    "Fidel Castro",
    "Batista"
  ],
  "recipient": "Paris (FMM)",
  "sender": "Director"
}