{
  "classification": "Liaison",
  "document_type": "Journal",
  "security": "Disclosing the internal tracking of employment requests and the provision of specific publications like 'Soviet Commercial Operations in the West' could provide insights into the CIA's interaction with Congress, which could be exploited. Additionally, the document mentions providing security information to the House Select Committee staff, which, if exposed, could compromise internal security protocols. Mentioning, \"Keith Raffel, Senate Select Committee on Intelligence staff, visited the Badge Office and received his Headquarters badge. He then proceeded to the C&R conference room where he reviewed extracts of NIS's relating to the security services of the United Kingdom, Australia, and France Evvy Vidal, O/SA/DO/O, assisted with the United Kingdom liaison) service aspects\" could expose security protocols and internal practices.",
  "security_level": "INTERNAL USE ONLY",
  "summary": "This journal entry from the Office of Legislative Counsel details various liaison activities, including responding to employment requests, providing information to Congressional offices, arranging meetings with the House Select Committee on Assassinations, and managing access for Senate Select Committee on Intelligence staff to sensitive materials.",
  "summary_one_paragraph": "This document is a journal entry from the CIA's Office of Legislative Counsel on Thursday, November 10, 1977, summarizing daily activities related to Congressional liaison. It includes updates on employment inquiries from constituents of Representative Douglas Applegate, forwarding press releases to Representative Mario Biaggi’s office, and providing a copy of 'Soviet Commercial Operations in the West' to Representative Richard T. Schulze’s office. The entry also notes the scheduling of a meeting between Sidney Stembridge and Mr. Cummins with Professor G. Robert Blakey of the House Select Committee on Assassinations, informing Blakey about Privacy Act requests from committee staff, and facilitating Keith Raffel's review of NIS extracts related to foreign security services.",
  "tags": [
    "CIA",
    "Office of Legislative Counsel",
    "Congressional Liaison",
    "House Select Committee on Assassinations",
    "Senate Select Committee on Intelligence",
    "Employment Requests",
    "Privacy Act",
    "Security Information"
  ],
  "title": "Journal - Office of Legislative Counsel - Thursday - 10 November 1977",
  "date": "1977-11-10",
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Debbie",
    "Douglas Applegate",
    "Robert Sensibaugh",
    "Karen",
    "Mario Biaggi",
    "Ted Winicov",
    "Richard T. Schulze",
    "Dawn",
    "G. Robert Blakey",
    "Sidney Stembridge",
    "Cummins",
    "Keith Raffel",
    "Evvy Vidal"
  ],
  "recipient": "Office of Legislative Counsel",
  "sender": "Office of Legislative Counsel"
}