{
  "classification": "John F. Kennedy Assassination",
  "document_type": "Memo",
  "security": "Revealing the CIA's contacts with individuals and organizations, such as Samuel Cummings and INTERARMCO, could compromise intelligence operations and sources. Disclosing the Agency's past involvement in arms procurement, disposal, and related financial transactions may also damage its reputation. Specifically: 'Shortly after CUMMINGS left his staff position for Interarmco, contact with him was established by the WH Division...Until recently the principal purpose was to dispose of arms, (and CLA made a sizeable profit on these transactions.'",
  "security_level": "SECRET",
  "summary": "This memorandum discusses a Ramparts article linking John Garrett Underhill Jr., Samuel George Cummings, and INTERARMCO to the JFK assassination, providing details from Agency records about Underhill's background and Cummings's relationship with the CIA and arms dealing.",
  "summary_one_paragraph": "This SECRET RYBAT memorandum, dated 19 July 1967, addresses allegations from a Ramparts article connecting John Garrett Underhill Jr., Samuel George Cummings, and INTERARMCO to the JFK assassination. The memo reviews Agency records on Underhill, detailing his intelligence background and contacts, and provides extensive information on Cummings's history with the CIA, including his role in arms procurement and dealings with INTERARMCO, a company once owned by the CIA. It notes Cummings's ongoing contact with the Agency, his provision of information, and his dealings with other intelligence services, like the BND. The document concludes by mentioning that none of these individuals or INTERARMCO have prominently appeared in the Garrison investigation reports, save for the referenced Ramparts article.",
  "tags": [
    "CIA",
    "JFK Assassination",
    "Ramparts",
    "John Garrett Underhill Jr.",
    "Samuel George Cummings",
    "INTERARMCO",
    "Arms Dealing",
    "Garrison Investigation",
    "RYBAT"
  ],
  "title": "Ramparts: John Garrett UNDERHILL Jr., Samuel George CUMMINGS, and INTERARMCO",
  "conspiracy": "The document references allegations from a Ramparts article suggesting that a CIA clique was responsible for the JFK assassination and that Underhill was privy to this information. It also mentions Underhill’s claim that Kennedy was killed before he could expose the gun-running and narcotics racket: 'A small clique within the CIA was responsible for the assassination...Kennedy supposedly got wind that something was going on and was killed before he could 'blow the whistle on it'.'",
  "date": "1967-07-19",
  "persons_mentioned": [
    "John Garrett Underhill Jr.",
    "Samuel George Cummings",
    "Gary Underhill",
    "Asher Brynes",
    "Herman Axelbank",
    "Ricky Haskins",
    "Lee Harvey Oswald",
    "President John F. Kennedy"
  ],
  "recipient": "Unknown",
  "sender": "Unknown (likely CIA internal office/division as it's a memorandum)"
}