{
  "classification": "Operations",
  "document_type": "Classified Message",
  "security": "Disclosing the identities and operational connections of individuals like Maude L. Burris (alias Mrs. Browning), a joint ODOPAL/KUBARK asset, and the details of locations such as the Berezka Restaurant being a suspected meeting place for Soviet intelligence, could jeopardize ongoing intelligence operations and endanger involved personnel. Specifically, the document states: \"BURRIS WAS JOINT ODOPAL/KUBARK ASSET THROUGH WHOM ACTUAL DEFECTION CONTACT JAN 54 ESTABLISHED...SUSPECTED AS MTG PLACE AND POSS BASE OF OPS FOR SOV INTEL ORGANI ZATION...\"",
  "security_level": "S-E-C-R-E-T",
  "summary": "A classified message discusses ongoing intelligence operations in Tokyo, focusing on contacts related to Martin and potential connections to Soviet intelligence, including details about individuals like Maude L. Burris and locations such as the Berezka Restaurant.",
  "summary_one_paragraph": "This SECRET message from the Director to Tokyo station, dated April 17, 1961, delves into intelligence matters related to individuals named Martin and their contacts. The message references a previous report (TOKY-6171) and assesses the interactions between Martin and Dr. Jakob Y. Fischer. The communication highlights Maude L. Burris, a joint ODOPAL/KUBARK asset involved in a defection contact, and investigates connections to the Berezka Restaurant as a suspected Soviet intelligence meeting place. The message also requests tracing John Joseph Casey, Joseph W. Jason, and Major Paul Rochelle and seeks confirmation on Burris's current location in Tokyo.",
  "tags": [
    "Intelligence Operations",
    "Tokyo",
    "Martin",
    "Jakob Y. Fischer",
    "Maude L. Burris",
    "ODOPAL",
    "KUBARK",
    "Berezka Restaurant",
    "Soviet Intelligence",
    "AETANKARD",
    "ONI",
    "Counterintelligence"
  ],
  "title": "Intelligence Operations and Contacts in Tokyo",
  "date": "1961-04-17",
  "locations_mentioned": [
    "Tokyo",
    "Yokosuka",
    "Kamiseya",
    "Manila",
    "Okinawa",
    "Ryukyu Island",
    "Osaka",
    "Camp Croft",
    "Natick, Mass",
    "Worcester, Mass",
    "Paris",
    "Hawan"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Anita Potocki",
    "Martin",
    "Dr. Jakob Y. Fischer",
    "Yuri Rastvorov",
    "Maude L. Burris (Mrs. Browning)",
    "Yevgeniy Arbenov",
    "Antonina Johansson",
    "Vera Dunayeva",
    "Valentin Valkov",
    "Mrs. Twilley",
    "Antonios E. Papadopoulos",
    "Muehlenberg",
    "Twilley",
    "Aksenov",
    "Bishop Ireney",
    "George Peris",
    "John J. Casey",
    "Mitchell",
    "Gary A. Long",
    "Joseph W. Jason (Joseph W. Gesuse)",
    "Major Paul Rochelle",
    "Roland Ora Belcher",
    "AETANKARD-4",
    "AETANKARDS 1",
    "AETANKARD 2"
  ],
  "recipient": "Tokyo",
  "sender": "Director"
}