{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "This document contains internal codes and communication methods for the DRE, along with information about individuals involved in anti-Castro activities. Exposing these codes and methods would compromise ongoing DRE operations and endanger the individuals mentioned. Quoting directly: 'List Gods they will use is the followings...The code name to be used whan transmitting will to CUFARILLERO...Code for numberss'. Also, revealing details of individuals like 'Adolfo BARRO Garcia' or 'Rafael SANTANA Alvarez' and their activities could expose them to danger.",
  "security_level": "SECRET",
  "summary": "A CIA dispatch forwards internal codes and information related to the Directorio Revolucionario Estudiantil (DRE) and Cuban refugees who contacted PBPRIME, including details about their activities, contacts, and escape from Cuba.",
  "summary_one_paragraph": "This dispatch from the Chief of Base, JMBAR, to the Chief of Station, JHNAVE UFG, forwards internal codes and source information related to the DRE, a Cuban student revolutionary group. The dispatch details the activities and contacts of Adolfo BARRO Garcia and other DRE representatives who traveled to PBPRIME (Miami, Florida) to contact Manuel SALVAT. It also includes information about Rafael SANTANA Alvarez, a taxi driver who assisted others to escape Cuba, including details about his escape, G-2 agents in Caibarien, and his willingness to return to Cuba for underground work. The document provides coded communication methods, locations for potential arms delivery, and phone call codes.",
  "tags": [
    "CIA",
    "DRE",
    "Cuban Revolution",
    "PBPRIME",
    "Internal Codes",
    "Sources",
    "Anti-Castro",
    "G-2 Agents"
  ],
  "title": "JMZIP/KUTUBE/KUDES/KUSODA DRS Internal Codes/Sources and Companion",
  "date": "1962-02-07",
  "locations_mentioned": [
    "Cuba",
    "Las Villas",
    "Sagua la Grande",
    "Caibarien",
    "Miami, Florida",
    "Anguila"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Adolfo BARRO Garcia",
    "Rafael SANTANA Alvarez",
    "Manuel SALVAT",
    "Israel SATAJA Alvares",
    "Antonis OBREGON Correa",
    "Une TOYO",
    "VILLASON",
    "Evaristo HERRERA",
    "Roberte ROJOS",
    "Luciano DETAJA",
    "Juanito HESTAJA",
    "Guillermo SANTANA",
    "Andres SATANA",
    "Lorenzo SATAMA",
    "Pedro HOTERO",
    "Alejo HOTERO",
    "Eduardo MONTERO",
    "Francisco ROBLE",
    "Andres GONZALEZ",
    "Guillermo GONZALEZ",
    "Jose (Pepe) MIRO",
    "Evelio GARCIA",
    "Lado CUMA",
    "Elidio"
  ],
  "recipient": "Chief of Station, JHNAVE UFG",
  "sender": "Chief of Base, JMBAR"
}