{
  "classification": "Operations",
  "document_type": "Cable",
  "security": "Disclosing KAVAJA's file number, potential contacts, and past operations could expose sources, methods, and ongoing investigations.",
  "security_level": "SECRET",
  "summary": "This cable discusses Nikola Kavaja, a Yugoslavian émigré with a history of anti-communist activities and potential terrorist connections, and provides information from his file in response to a request from Belgrade.",
  "summary_one_paragraph": "A SECRET RYBAT cable from the CIA to Belgrade provides information on Nikola Kavaja (subject of file 201-0764698), a Yugoslavian émigré known for anti-communist activities, including a plane hijacking and discussions of violence against communist figures like Tito, Khrushchev, and Castro. The cable summarizes Kavaja's background, including his military service, imprisonment, escape to Austria, and life in the U.S., noting his involvement with the Serbian National Defense Council and suspicions of bomb-making. It also mentions Austrian concerns about Kavaja potentially disrupting the Sarajevo Olympic Games and his alleged involvement in the bombing of the Yugoslav Embassy in Washington, D.C.",
  "tags": [
    "Nikola Kavaja",
    "Anti-Communism",
    "Terrorism",
    "Yugoslavia",
    "Emigre",
    "RYBAT",
    "Serbian National Defense Council",
    "SOPO"
  ],
  "title": "TRACE RESPONSE NIKOLA KAVAJA",
  "date": "1997-09-30",
  "locations_mentioned": [
    "Istinic, Yugoslavia",
    "Austria",
    "Doljna Radonja",
    "Salzburg",
    "British Columbia",
    "United States",
    "Paterson, New Jersey",
    "Chicago",
    "Los Angeles",
    "New York City",
    "Shannon, Ireland",
    "Washington, D.C.",
    "Sarajevo"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Nikola Kavaja",
    "Marte (Moseg)",
    "Castro",
    "Tito",
    "Khrushchev",
    "Tomislav Djordjevic",
    "Petar G. Bozinovic",
    "Njegoslav Pantelic",
    "Nino Kopac",
    "Osman Gasi",
    "Veselin Veskovic"
  ],
  "recipient": "Belgrade",
  "sender": "LIMITED DISSEM CE/BOGYA"
}