{
  "classification": "Personnel",
  "document_type": "File",
  "security": "These documents contain personal and organizational information about a CIA officer, David A. Phillips, including details of his assignments, performance, retirement, and contact information. Specifically, the file includes a letter from the Director of Personnel regarding releasing Phillips' contact information to individuals seeking contact with the Association of Retired Intelligence Officers, along with multiple 'REQUEST FOR PERSONNEL ACTION' forms outlining Phillips' reassignments and promotions. Sharing such information could compromise Phillips' privacy and reveal internal CIA personnel management practices.",
  "security_level": "SECRET",
  "summary": "This file contains documents related to the career of David A. Phillips, a CIA officer, including personnel actions, reassignments, promotions, and his involvement with the Association of Retired Intelligence Officers.",
  "summary_one_paragraph": "This file contains documents spanning from 1952 to 1975 detailing the career of CIA officer David A. Phillips. The records include personnel action requests showing his promotions, reassignments, and eventual retirement, along with correspondence regarding his role in the Association of Retired Intelligence Officers. The documents outline his positions in various locations, such as Brazil, Venezuela, and other overseas stations, highlighting his progression through the ranks and his contributions to the agency.",
  "tags": [
    "CIA",
    "David Atlee Phillips",
    "Personnel File",
    "Reassignment",
    "Promotion",
    "Retirement",
    "Association of Retired Intelligence Officers",
    "Venezuela",
    "Brazil"
  ],
  "title": "Phillips, DAVID ATLEE",
  "date": "1975-05-13",
  "locations_mentioned": [
    "Bethesda, Maryland",
    "Washington, D.C.",
    "Caracas, Venezuela",
    "Brasilia, Brazil",
    "Rio de Janeiro, Brazil",
    "Santo Domingo",
    "Mexico City",
    "Havana",
    "Beirut",
    "Guatemala",
    "Santiago"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "David A. Phillips",
    "B. DeFelice",
    "P. W. M. Janney",
    "W. E. Colby",
    "H.L. Berthold",
    "Olmstead",
    "Robert W. Sheay",
    "Jean Ferguson",
    "A. Sort",
    "Robert D. Gahagen",
    "Thomas J. Flores",
    "Theodore G. Shackley",
    "James U. Flannery"
  ],
  "sender": "B. DeFelice, P. W. M. Janney, W. E. Colby, James U. Flannery, H.L. Berthold, Robert W. Sheay, Jean Ferguson, Harry B. Fisher, William V. Broe, Deputy Director for Plans, Director of Central Intelligence"
}