{
  "classification": "Administrative",
  "document_type": "Memo",
  "security": "Protecting book cable dissemination list, even if they contain stations that are releasable, demonstrates a concern for operational security and information control. Quoting directly: “The Board accepted the Agency's request that book cable dissemination list be protected in full even if they contain stations that are releasable.” Sharing these lists could reveal methods for disseminating intelligence or the structure of CIA communications.",
  "security_level": "SECRET",
  "summary": "This memorandum summarizes the results of an ARRB meeting on November 17, 1997, detailing decisions on the release of CIA records related to the JFK assassination, including Warrenton Records Center, CIA use of State Cover, and Nosenko NBR records.",
  "summary_one_paragraph": "J. Barry Harrelson, the JFK Project Officer from CSI/HRG, authored two memoranda on November 21 and 24, 1997, to John Pereira, Fredrick C. Wickham, Lee Strickland, and Linda Cipriani, summarizing the outcomes of an ARRB meeting held on November 17, 1997. Key decisions included the postponement of the release of Warrenton as CIA Records Center until 2017, the release of documents concerning CIA use of State Cover, a change in the Nosenko NBR records release date from 2017 to 2010, and the determination of NBR status for the majority of Cuban Revolutionary Council (CRC) financial records. The board also addressed the Ramparts Damage Assessment Document, Book Cables Dissemination Lists, and Document #104-10072-10232, outlining specific actions and providing instructions for reconsideration and appeals.",
  "tags": [
    "ARRB",
    "JFK Assassination Records",
    "CIA Records",
    "Warrenton",
    "State Cover",
    "Nosenko",
    "Cuban Revolutionary Council",
    "Ramparts",
    "Book Cables",
    "LINLUCK"
  ],
  "title": "ARRB meeting 17 November - Results",
  "date": "1997-11-24",
  "persons_mentioned": [
    "J. Barry Harrelson",
    "John Pereira",
    "Fredrick C. Wickham",
    "Lee Strickland",
    "Linda Cipriani",
    "Eileen Wukitch",
    "Kathryn Dyer",
    "Becky Dyer",
    "Oswald"
  ],
  "recipient": "John Pereira, Fredrick C. Wickham, Lee Strickland, Linda Cipriani",
  "sender": "J. Barry Harrelson (JFK Project Officer, CSI/HRG)"
}