{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Disclosing information about the identities of individuals involved in covert operations, such as AMLILAC/33, IDEN A, IDEN B, AMBIDDY/1, AMWORLD members, or the AMTHUG/1 assassination team, could compromise ongoing activities and endanger the safety of these individuals. Revealing operational details, such as the location of camps near IDEN D or the use of AMWORLD for operational briefings in conjunction with KUBARK, could expose sensitive methods and capabilities. Quoting directly: 'AMLILAC/33 obtained the following information from IDEN A and IDEN B, former members of the AMWORLD Group... the infiltration team with the mission of assassinating AMTHUG/1 is headed by IDEN M. Date of the operation is unknown.'",
  "security_level": "SECRET",
  "summary": "A dispatch from the Chief of Station, JMWAVE, reports on the activities of AMWORLD based on information obtained from former members IDEN A and IDEN B, covering command structure, intelligence operations, naval activities, operational briefings, and plans for future operations, including an assassination attempt.",
  "summary_one_paragraph": "This secret dispatch from the Chief of Station, JMWAVE, dated September 3, 1964, relays information gathered by AMLILAC/33 from IDEN A and IDEN B, former members of the AMWORLD group. The report details the command structure, highlighting issues of trust and morale within the commando section. It also outlines intelligence operations, naval activities including low ship crew morale and arms storage, the use of KUBARK photos for operational briefings, and AMBIDDY/1's promotional efforts. The dispatch also mentions plans for future guerrilla operations and an assassination attempt on AMTHUG/1, led by IDEN M.",
  "tags": [
    "AMWORLD",
    "JMWAVE",
    "Cuba",
    "Covert Operations",
    "Intelligence",
    "Assassination",
    "Guerrilla Teams",
    "RYBAT",
    "TYPIC",
    "AMWORLD",
    "AMLILAC"
  ],
  "title": "Report on Activities of AMWORLD",
  "date": "1964-09-03",
  "locations_mentioned": [
    "Puerto Cabezas",
    "Nicaragua",
    "Dominican Republic",
    "Central America"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "AMLILAC/33",
    "IDEN A",
    "IDEN B",
    "IDEN C",
    "IDEN D",
    "IDEN E",
    "IDEN F",
    "AMBIDDY/1",
    "IDEN G",
    "IDEN H",
    "IDEN I",
    "IDEN J",
    "IDEN K",
    "IDEN L",
    "IDEN M",
    "AMTHUG/1",
    "IDEN N",
    "Humberto Casas",
    "Tulio Leiseca",
    "FNU Acebo",
    "Reynaldo Garcia",
    "Chino Mole",
    "Manoline Gutierrez",
    "Ricardo \"The Mexican\"",
    "Generoso Bringa",
    "Guayo Hernandez",
    "Marco Ulloa",
    "Juan Jose Abreu"
  ],
  "recipient": "Deputy Chief, WH/SA",
  "sender": "Chief of Station, JMWAVE"
}