{
  "classification": "Personnel",
  "document_type": "Initial Review Form/Office Memorandum",
  "security": "Releasing information about CIA contacts and interests could expose their operations and endanger individuals. Directly quoting, \"Subject came to the attention of the Clandestine Services...\" and \"Subject could write a contract...\" illustrates active interest and potential exploitation of relationships, warranting protection.",
  "security_level": "SECRET",
  "summary": "This document includes an initial review form and an office memorandum regarding Rolando MacFerrer, Jr., Vice President of Sales at Military Armament Corporation, focusing on his connections to individuals of interest and potential links to Cuban communists.",
  "summary_one_paragraph": "The document contains an initial review form and an office memorandum highlighting Rolando MacFerrer, Jr., who is the Vice President of Sales at Military Armament Corporation in Powder Springs, Georgia. It details that MacFerrer came to the attention of the office due to his directorship of \"Lonerose, Inc.\" and registered agents outside the U.S., specifically in South America. The memo also mentions his previous associations, questioned character, and potential current connections to communists in Cuba, which raises concerns regarding his trustworthiness. Furthermore, the document alludes to MacFerrer's possible exploitation of contracts and continued contact with individuals of interest.",
  "tags": [
    "Rolando MacFerrer Jr.",
    "Military Armament Corporation",
    "Lonerose, Inc.",
    "Cuba",
    "Communists",
    "FOIA",
    "CIA",
    "Personnel"
  ],
  "title": "Rolando MacFerrer, Jr.",
  "date": "1972-03-29",
  "locations_mentioned": [
    "Powder Springs, Georgia",
    "Hialeoh, Florida",
    "South America",
    "Cleveland, Ohio",
    "Cuba"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Rolando MacFerrer, Jr.",
    "Castro",
    "Robert Jean Contica"
  ]
}