{
  "classification": "Personnel",
  "document_type": "Cable",
  "security": "Releasing Whitten’s affiliation with the CIA could endanger him in Vienna, due to proximity to hostile groups. Quoting the document: “On a map, he pointed out his apartment and indicated what he believed to be serious threats to his safety should his affiliation with CIA become known. Within a block of his apartment he pointed out the headquarters of the Kurdish Workers' Party (PKK), the Anarchist party, and a bar where many Middle Easterners would congregate. He made it clear that there was no way he could defend himself from any attack.” The document also reveals that Whitten committed perjury, which could expose him to legal repercussions.",
  "security_level": "SECRET",
  "summary": "A CIA cable details a meeting between a JFK Board attorney and John Whitten in Vienna, expressing concerns over Whitten's safety if his CIA affiliation is revealed and discussing his past testimony and current life.",
  "summary_one_paragraph": "This SECRET CIA cable, dated May 2, 1996, outlines a meeting between a JFK Board attorney (Iden A) and John Whitten in Vienna concerning Whitten's prior testimony before the HSCA. Whitten expressed significant distress and fear over the potential release of his name, citing threats to his safety due to his proximity to hostile groups in Vienna and the possibility of legal repercussions for committing perjury on his Austrian residency application. Iden A assured Whitten of CIA's efforts to protect him, and the cable relays the assessment that Whitten’s testimony added nothing significant beyond his previous statements.",
  "tags": [
    "CIA",
    "John Whitten",
    "JFK Board",
    "Vienna",
    "HSCA",
    "Perjury",
    "Safety Concerns",
    "EUR/GA",
    "RYBAT",
    "WNINTEL"
  ],
  "title": "EYES ONLY APRIL 1996 MEETING BETWEEN JFK BOARD ATTORNEY AND JOHN WHITTEN",
  "date": "1996-05-02",
  "locations_mentioned": [
    "Vienna",
    "Austria",
    "United States"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "John Whitten",
    "Iden A",
    "Iden B",
    "JFK"
  ],
  "recipient": "Vienna",
  "sender": "STAFF"
}