{
  "classification": "Operations",
  "document_type": "Dispatch",
  "security": "Revealing CORBUSTON’s involvement with the Catholic Association for International Peace could compromise his cover and future intelligence-gathering efforts. The document states: “The above items were received by Oliver H. CORBUSTON who had joined the CAIP for cover purposes in the course of a previous assignment.” This could risk exposure, damage trust, and shut down potential info channels.",
  "security_level": "CONFIDENTIAL",
  "summary": "A dispatch from the Chief of Base, Washington, forwarding materials related to the Catholic Association for International Peace (CAIP) to Headquarters, including literature on \"Negotiation Now!\" and the 40th Annual Conference on \"Selective Conscientious Objection in an Age of Conflict.\"",
  "summary_one_paragraph": "On October 11, 1967, a dispatch was sent from the Chief of Base, Washington, to the DO/I, providing copies of literature mailed by the Catholic Association for International Peace (CAIP) concerning \"Negotiation Now!\" and materials regarding its 40th Annual Conference, scheduled for October 27-29, with the theme \"Selective Conscientious Objection in an Age of Conflict.\" The items were obtained by Oliver H. CORBUSTON, who had joined the CAIP for cover purposes during a prior assignment, and are being forwarded for Headquarters' information in response to Director 39871.",
  "tags": [
    "CIA",
    "Catholic Association for International Peace",
    "CAIP",
    "Peace Demonstrations",
    "Covert Operations",
    "Oliver H. CorbuSTON",
    "Negotiation Now!",
    "Selective Conscientious Objection",
    "Vietnam War"
  ],
  "title": "WOMUSE \"Peace\" Demonstrations",
  "date": "1967-10-11",
  "locations_mentioned": [
    "Washington, D. C.",
    "Dunbarton College of Holy Cross, 2935 Upton Street N.W."
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Oliver H. CORBUSTON"
  ],
  "recipient": "Chief, DO/I",
  "sender": "Chief of Base, Washington"
}