{
  "classification": "Personnel",
  "document_type": "Biographic Profile/Personnel Actions",
  "security": "The documents detail Robert M. Zambernardi's personnel actions, including transfers, promotions, and disability claims. Releasing specific details about an employee’s career path, job roles, and potential disabilities could reveal sensitive operational structures or methodologies used within the CIA, particularly regarding photographic operations and foreign field assignments. Revealing disability claims could violate privacy.",
  "security_level": "SECRET",
  "summary": "This file contains Robert M. Zambernardi's biographic profile and personnel actions within the CIA, spanning from 1956 to 1965, including assignments in Mexico City and details related to a disability claim.",
  "summary_one_paragraph": "This collection of documents pertains to Robert M. Zambernardi, a CIA employee, and includes his biographic profile and records of his personnel actions between July 6, 1956, and September 15, 1965. The file contains a transfer request to Vouchered Funds & Reassignment effective July 5, 1964, a promotion request dated April 2, 1963, and a notice of an official disability claim file related to an incident on December 28, 1963, with cross-references to the Benefits and Counseling Branch. Zambernardi’s assignments included roles in Operational Aids, Photographic Operations Branch, and Foreign Field assignments within Mexico City.",
  "tags": [
    "CIA",
    "Personnel File",
    "Robert M. Zambernardi",
    "Biographic Profile",
    "Personnel Actions",
    "Disability Claim",
    "Mexico City"
  ],
  "title": "Robert M. Zambernardi Biographic Profile",
  "date": "1964-06-15",
  "locations_mentioned": [
    "Mexico City, Mexico",
    "Washington, D.C."
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Robert M. Zambernardi",
    "H. Lee Olson",
    "James R. Shields",
    "Philip Edward Zambernardi"
  ],
  "recipient": "Office of Personnel",
  "sender": "H. Lee Olson, James R. Shields"
}