{
  "classification": "INTERNAL SECURITY CUBA",
  "document_type": "Report",
  "security": "Disclosing that the FBI relies on information from other government agencies (MM T-1) and Cuban refugees (MM T-2, T-3, T-4) as sources could compromise those sources or their methods. For example, the report states, \"Investigation in this matter was based upon information from MM T-1, another government agency which conducts security and intelligence-type investigations...\" and \"On October 3, 1962, MM T-2, a Cuban refugee familiar with certain phases of anti-CASTRO activity...advised that captioned subject was personally known to him in Cuba...\"",
  "security_level": "SECRET",
  "summary": "This FBI report details the background and activities of FELIPE VIDAL SANTIAGO, a Cuban refugee and former naval attache who defected from the CASTRO government and became involved in anti-CASTRO activities in Miami, Florida.",
  "summary_one_paragraph": "This report, dated December 6, 1962, from the FBI's Miami office, outlines the background and activities of FELIPE VIDAL SANTIAGO, a Cuban refugee who defected from his position as a Cuban Naval Attache in Caracas, Venezuela, in 1960. It details his arrival in the U.S., his anti-CASTRO activities in Miami, affiliations with various anti-CASTRO organizations, and alleged involvement with individuals suspected of working for the CASTRO regime. The report also includes information obtained from INS records and various confidential informants (MM T-1, T-2, T-3, T-4) regarding Vidal's past affiliations, his participation in anti-CASTRO missions, and his physical description.",
  "tags": [
    "FBI",
    "Felipe Vidal Santiago",
    "Cuban Refugee",
    "Anti-Castro Activities",
    "Internal Security",
    "Cuba",
    "Miami",
    "Immigration and Naturalization Service",
    "Informant",
    "Jack Cannon",
    "Roy Hargraves"
  ],
  "title": "Report on FELIPE VIDAL SANTIAGO",
  "date": "1962-12-06",
  "locations_mentioned": [
    "Miami, Florida",
    "Havana, Cuba",
    "Caracas, Venezuela",
    "Bogota, Colombia",
    "Cuba",
    "Guatemala",
    "Cienfuegos, Cuba",
    "New York",
    "Vaca Key, Marathon, Florida",
    "Matanzas Province, Cuba"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "EUGENE L. PAYNE",
    "FELIPE VIDAL SANTIAGO",
    "FIDEL CASTRO",
    "JACK CANNON",
    "JACK SHEA",
    "CHARLES CHALLANDES",
    "FULGENCIO BATISTA",
    "MANUEL URRUTIA",
    "ROMULO BETANCOURT",
    "CARLOS PRIO SOCARRAS",
    "JULIO GARCERAN",
    "MARIA SUAREZ",
    "DUVAL",
    "MORGAN",
    "FRANK FIORINI",
    "ROY HARGRAVES",
    "JOHN BONILLA",
    "RAQUEL GONZALEZ FEAL",
    "HONORATO VIDAL MADRAZO",
    "MARIA DEL CARMEN SANTIAGO ALVAREZ"
  ],
  "recipient": "INS, Miami, Florida",
  "sender": "EUGENE L. PAYNE, FBI"
}