{
  "classification": "John F. Kennedy Assassination",
  "document_type": "File",
  "security": "These files contain information about CIA assets (LIRING-3 and LIRING-4) and their activities related to Central American revolutionary groups and Cuban intelligence. Revealing the identities and operational details of these assets could expose them to harm, compromise ongoing intelligence operations, and damage relationships with foreign entities. The files also discuss the potential for the CIA to intervene in the legal proceedings of LIRING-3, which could be seen as an overreach of authority and a violation of sovereignty.",
  "security_level": "SECRET",
  "summary": "This file contains documents related to LIRING-3 and LIRING-4, CIA assets involved in intelligence gathering on Central American revolutionary groups and Cuban activities, including concerns about LIRING-3's imprisonment and potential operational risks.",
  "summary_one_paragraph": "This file compiles various documents spanning from 1968 to 1972 concerning the CIA's management and utilization of assets LIRING-3 and LIRING-4, focusing on their roles in gathering intelligence on Central American revolutionary groups and Cuban interests. Key issues include LIRING-3's imprisonment in Guatemala, the potential risks of exposing the CIA's involvement in seeking his release, LIRING-4's activities and contacts, and assessments of their operational potential. The documents also cover internal discussions on the handling of these assets, security concerns, and the coordination between different CIA stations.",
  "tags": [
    "CIA",
    "LIRING-3",
    "LIRING-4",
    "Guatemala",
    "Mexico",
    "Cuban Intelligence",
    "Central American Revolutionary Groups",
    "Asset Management",
    "FOIA"
  ],
  "title": "LIRING-3 VOL VI",
  "date": "1969-01-07",
  "locations_mentioned": [
    "Mexico City",
    "Guatemala City",
    "Cuba"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Wallace P. Rowton",
    "Leonard S. Tormet",
    "Horace E. Prallett",
    "Carrillo Flores",
    "Driscoll",
    "Kerbe",
    "Francis",
    "Laurence Piper",
    "Calvin M. Quula",
    "William V. Brob",
    "Walter J. Kaufman",
    "Marvin Francis",
    "Huberto Alvarado Arellano",
    "Jose Alberto Cardoza Aguilar",
    "Jose Luis Balcarcel Orozco",
    "Alfonso Solorzano Aldana",
    "Pereyra Gomez",
    "Jesus Rodriguez",
    "Carlos Caceres Luis",
    "Horacio Landa Castaneda",
    "Olga de Balcarcel",
    "Mercedes de Pereyra",
    "Carlos Illescas Aguirre",
    "Kraeste Capuano del Vecchio",
    "Ramiro Diaz Ramirez"
  ],
  "recipient": "Chief, WH Division; Chief of Station, Guatemala City; Acting Chief of Station, Mexico City",
  "sender": "PBRUMEN"
}