{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Revealing communication methods and addresses could compromise agent Rolando Cubela Secades and AMWHIP/2 and/or expose their operations. Quoting directly: \"Upon receipt of any letter from agent in true first name or from unknown Cuban in Havana, AMWHIP/2 will forward same immediately to AMWHIP/1's business address in New York City.\"",
  "security_level": "SECRET",
  "summary": "This memo outlines the communication methods and addresses for Rolando CUBELA Secades (AM/LASH) and his contacts, including secure writing systems and emergency contact procedures.",
  "summary_one_paragraph": "This SECRET memo details the communication procedures for Rolando CUBELA Secades, also known as AM/LASH, a medical doctor in Havana, Cuba, working with the CIA. It outlines the use of secure writing (S/W) systems for communication, including specific carbon agent sending and receiving methods, as well as addresses for AMWHIP/2 in Rome and Geneva. It also provides alternate addresses in Havana, including Srta Ernestina Acosta and Virginia Secades, for routine and emergency communications, specifying code names and return addresses to maintain operational security. The memo notes that AMWHIP/1 in NYC can assist with emergency contact if other methods fail.",
  "tags": [
    "Rolando CUBELA Secades",
    "AM/LASH",
    "AMWHIP/2",
    "AMWHIP/1",
    "Secure Communication",
    "Cuba",
    "CIA",
    "S/W System",
    "Contact Procedures"
  ],
  "title": "Communication Methods for Rolando CUBELA Secades (AM/LASH)",
  "locations_mentioned": [
    "Havana, Cuba",
    "Rome, Italy",
    "Geneva, Switzerland",
    "Madrid, Espana",
    "New York City"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Rolando CUBELA Secades",
    "AMWHIP/2",
    "AMWHIP/1",
    "Ernestina Acosta",
    "Virginia Secades",
    "Jose Calderon",
    "Wainwright",
    "Sanchez"
  ],
  "recipient": "Unknown",
  "sender": "C/O: Wainwright (Formerly) SANCHEZ"
}