{
  "classification": "Cuba",
  "document_type": "File",
  "security": "Disclosing the movement and planned usage of personnel (Cuban exiles) and equipment, especially 'silence weapons, other weapons, commo gear, medical equipment and parachute drop equipment', could jeopardize current or future operations.",
  "security_level": "SECRET",
  "summary": "This file contains information about the return of Cuban exiles to the U.S. around December 1964, including details on their transportation, arrival location (Andrews Air Force Base), personnel involved (Gambino, Scanlan, Fitchett), and the equipment being transported with them.",
  "summary_one_paragraph": "This file details the planned return of a group of Cuban exiles (listed by name and number) to the U.S. around December 1964. Bob Gambino informed that subjects were returning to the U.S. around November 30, 1964. Jack Scanlan advised that the arrival would be in the first week of December 1964. All subjects but 1142 and 1143 would be arriving about December 5, 1964. They are expected to arrive at Andrews Air Force Base on a C-118 aircraft (tail number 3820) with Bob Gambino, Arthur Garza, William Robertson, and Dr. James Fearon aboard. James Fitchett, under Air Force cover, will transfer the subjects to a C-54 for travel to Camp Pickett. The aircraft will also carry cargo including outboard motors, radio beacons, silence weapons, other weapons, commo gear, medical equipment, and parachute drop equipment. Customs and I&NS will meet Fitchett at Base Operations. Lawrence Fleishmann (Customs) and Frank Braden (I&NS) were notified of the arrival.",
  "tags": [
    "Cuban Exiles",
    "Andrews Air Force Base",
    "Camp Pickett",
    "Transportation",
    "Weapons",
    "Bob Gambino",
    "James Fitchett",
    "Customs",
    "I&NS",
    "Alien Affairs Staff"
  ],
  "title": "Santiago ARGUELLES Izquierdo (AAC-1130) - #244420(C)",
  "date": "1964-11-24",
  "persons_mentioned": [
    "Santiago ARGUELLES Izquierdo",
    "Angel Manuel BENITEZ Benitez",
    "Alicio CALAS Roque",
    "Alfredo FERNANDEZ Martinez",
    "Conrado FERNANDEZ Morales",
    "Felix FUENTES Games",
    "Orlando GARCIA Duarte",
    "Jose Angel GONZALEZ Castro",
    "Guillermo GONZALEZ Lazo",
    "Jose Severino HERNANDEZ Martinez",
    "Pedro LOPEZ Cristo",
    "Raimundo MARTINEZ Gonzalez",
    "Ricardo Anibal MORALES Navarrete",
    "Alberto PEREZ Martinez",
    "Manuel A. RIVERO Colona",
    "Jorge Delio RODRIGUEZ Triana",
    "Mario Andres ROMERO Arias",
    "Jorge Luis SILVA Del Monte",
    "Juan Cornelio TAMAYO Cordovi",
    "Bob Gambino",
    "Jack Scanlan",
    "Arthur Garza",
    "William Robertson",
    "James Fearon",
    "James Fitchett",
    "Lawrence Fleishmann",
    "Frank Braden",
    "W. M. Knott"
  ],
  "recipient": "Chief, Alien Affairs Staff",
  "sender": "W. M. Knott, OS/AAS"
}