{
  "classification": "Liaison",
  "document_type": "Journal Addendum",
  "security": "Discusses the potential exposure of sensitive information (Nosenko and/or Mexico operations) in open fora. The Agency's position is that as Close has retired, the Agency has no control over his activities other than through his secrecy agreement which he signed and which remains in effect. These actions could potentially reveal covert operations and compromise agreements.",
  "security_level": "CONFIDENTIAL",
  "summary": "This journal addendum discusses liaison activities related to the House Select Committee on Assassinations and its potential exposure of sensitive information, as well as inquiries regarding former Agency employees working for foreign governments.",
  "summary_one_paragraph": "This addendum to the Office of Legislative Counsel's journal details a briefing for Thomas K. Latimer of the House Permanent Select Committee on Intelligence regarding the House Select Committee on Assassinations' potential exposure of sensitive Agency information (Nosenko and/or Mexico operations). It also covers a request from Spencer Davis of the Senate Select Committee on Intelligence for contact information of former Agency employee Newton S. Miler and clarifies the Agency's position on retired employees like Raymond Close consulting for foreign governments, emphasizing their continued adherence to secrecy agreements.",
  "tags": [
    "House Select Committee on Assassinations",
    "Nosenko",
    "Mexico operations",
    "House Permanent Select Committee on Intelligence",
    "Senate Select Committee on Intelligence",
    "Newton S. Miler",
    "Raymond Close",
    "Saudi Arabia",
    "Amman",
    "Secrecy agreement",
    "FOIA"
  ],
  "title": "Addendum to Journal - Office of Legislative Counsel",
  "date": "1978-07-06",
  "origin_agency": "Office of Legislative Counsel",
  "persons_mentioned": [
    "Scott Breckinridge",
    "Rodger Gabrielson",
    "Thomas K. Latimer",
    "Edward P. Boland",
    "Louis Stokes",
    "Thomas P. O'Neill",
    "Spencer Davis",
    "Newton S. Miler",
    "Raymond Close"
  ]
}