{
  "classification": "Operations",
  "document_type": "Cable",
  "security": "Revealing details about the operation involving Franz Olah, including the placement of weapons caches and the training of paramilitary groups, could jeopardize current security interests and expose sensitive information regarding clandestine activities. Specifically, disclosing the identities of case officers and the methods used to maintain secrecy (e.g., not using true names) could compromise future operations. Quoting the document: 'OUR PARAMILITARY PEOPLE PUT CACHES OF WEAPONS, AMMUNITION, FOOD, AND UNIFORMS INTO THE GROUND IN OVER 70 PLACES... AT NO TIME WERE OUR NAMES... I DON'T THINK OLAH KNEW OUR TRUE NAMES, BUT HE KNEW I WAS IN THE EMBASSY.'",
  "security_level": "SECRET",
  "summary": "A CIA cable from Vienna provides further response to the JFK Records Collection Act, detailing an operation involving Franz Olah and the establishment of weapons caches in Austria. It includes a handwritten note from a former case officer requesting that his name not be publicly released due to his involvement in these sensitive activities.",
  "summary_one_paragraph": "This secret CIA cable, originating from Vienna on March 4, 1996, relays additional information concerning the JFK Records Collection Act. The cable includes a handwritten note from a former case officer (referred to as IDEN) who managed an operation involving Franz Olah, a key figure in Austrian labor unions. The operation involved organizing paramilitary groups to counter Soviet influence and establishing weapons caches across Austria. The former case officer requests that his name not be disclosed to the public due to potential recognition by Austrian officers and historians, especially given recent press coverage of the revealed weapons caches. The operation, which involved training and equipping paramilitary forces, is documented in the case officer's note, addressed to Bert Mills.",
  "tags": [
    "CIA",
    "JFK Records Collection Act",
    "Franz Olah",
    "Weapons Caches",
    "Austria",
    "Paramilitary Groups",
    "Cold War",
    "Secrecy",
    "NOBLEHORSE"
  ],
  "title": "Further Response for JFK Records Collection Act",
  "date": "1996-03-04",
  "locations_mentioned": [
    "Austria",
    "Vienna",
    "United States Zone (Austria)",
    "British Zone (Austria)",
    "French Zone (Austria)",
    "USA Zone (Austria)",
    "Bern, Switzerland"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Franz Olah",
    "Bert Mills",
    "Josef Las",
    "Heinrich Daurer",
    "Paul Von Marx",
    "Dichand",
    "Falk",
    "Eveson"
  ],
  "recipient": "Director",
  "sender": "STAFF"
}