{
  "classification": "Administrative",
  "document_type": "Memo",
  "security": "Protecting dissemination lists, even if they contain releasable stations, could be interpreted as prioritizing the concealment of intelligence networks over transparency. \"The Board accepted the Agency's request that book cable dissemination list be protected in full even if they contain stations that are releasable.\"",
  "security_level": "SECRET",
  "summary": "This memorandum summarizes the results of an ARRB meeting on November 17, 1997, detailing decisions regarding the release of CIA records related to the JFK assassination, including the status of the Warrenton Records Center, CIA's use of State Cover, Nosenko NBR records, Cuban Revolutionary Council financial records, the Ramparts Damage Assessment Document, Book Cables Dissemination Lists, and Document #104-10072-10232.",
  "summary_one_paragraph": "J. Barry Harrelson's memorandum to John Pereira and others at the DCI, DO, and DA summarizes the outcomes of an ARRB meeting concerning the release of JFK assassination records. Key decisions included postponing the reconsideration of Warrenton as a CIA Records Center until 2017, releasing documents related to CIA's use of State Cover, moving the release date of Nosenko NBR records to 2010, limiting the processing of Cuban Revolutionary Council financial records, processing only relevant paragraphs of the Ramparts Damage Assessment Document, protecting book cable dissemination lists in full, and rejecting the Agency's request to protect the full crypt (LINLUCK) of Document #104-10072-10232. The memo also outlines procedures for reconsideration and appeals.",
  "tags": [
    "ARRB",
    "JFK Assassination Records",
    "CIA Records Center",
    "State Cover",
    "Nosenko",
    "Cuban Revolutionary Council",
    "Ramparts",
    "Book Cables",
    "LINLUCK",
    "Reconsideration",
    "Appeals"
  ],
  "title": "ARRB meeting 17 November - Results",
  "date": "1997-11-21",
  "persons_mentioned": [
    "John Pereira",
    "Frederick C. Wickham",
    "Lee Strickland",
    "Linda Cipriani",
    "J. Barry Harrelson",
    "Eileen Wukitch",
    "Kathryn Dyer",
    "Becky Dyer",
    "Oswald"
  ],
  "sender": "J. Barry Harrelson, JFK Project Officer, CSI/HRG"
}