{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "The memorandum discusses internal CIA operations, specifically the review of files related to the creation of the Special Counterintelligence Operation and a study on \"International Connections with the United States Peace Movement.\" Disclosing details about these operations, the individuals involved (such as Mr. Ober, Mr. Knoche, Mr. Houston, and Mr. Davis), and the internal communications (memoranda and cables) could reveal sensitive information about CIA activities and sources. Additionally, the document mentions specific files and their locations within the CIA, which could compromise the security of these records. For example: \"Mr. Ober returned to Headquarters the afternoon of 6 February and the morning of 7 February to continue his review of the files he had developed while Chief, CI/SO.\"",
  "security_level": "SECRET SENSITIVE",
  "summary": "A memorandum for the record detailing Mr. Ober's requests for documentation related to the creation of the Special Counterintelligence Operation in mid-1967 and a study on \"International Connections with the United States Peace Movement,\" including the search for a directive from the President or White House. It outlines the documents shown to Mr. Ober, their locations, and the process for him to obtain copies for his appearance before the Rockefeller Commission.",
  "summary_one_paragraph": "This memorandum, dated February 7, 1975, records Mr. Ober's requests and review of CIA files concerning the establishment of a Special Counterintelligence Operation in 1967 and a study on international connections within the U.S. Peace Movement, as part of his preparation for the Rockefeller Commission. Robert D. Brown, Jr., Deputy Chief, East Asia Division, details the documents presented to Mr. Ober, including memoranda, cables, and correspondence with the Department of Justice related to Stokely Carmichael, noting that Mr. Ober sought documentation of a directive from the President, which was ultimately found in cover sheets transmitting the finished study; the memo also describes the clearance process, involving Mr. Knoche, for Mr. Ober to use copies of these documents before the Commission and the distribution of this memo and attachments to the Inspector General, Mr. Knoche, DC/OPS, ADDO, and DCEA.",
  "tags": [
    "CIA",
    "Rockefeller Commission",
    "Counterintelligence",
    "International Peace Movement",
    "Stokely Carmichael",
    "Documentation",
    "FOIA",
    "Sensitive Information"
  ],
  "title": "Requests from Mr. Ober for Basic Documentation Circa Mid-1967",
  "date": "1975-02-07",
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Mr. Ober",
    "Mr. Knoche",
    "Mr. Fred Vinson, Jr.",
    "Mr. Broe",
    "Mr. Houston",
    "J. Walter Yeagley",
    "Mr. Helms",
    "Stokely Carmichael",
    "Mr. Godfrey",
    "Mr. Lehman",
    "Mr. Peter Dixon Davis",
    "Mr. Angleton",
    "Mr. Cord Meyer",
    "Mr. White",
    "Robert D. Brown, Jr."
  ],
  "recipient": "Inspector General, Mr. Knoche, DC/OPS, ADDO, DCEA",
  "sender": "Robert D. Brown, Jr."
}