{
  "classification": "Operations",
  "document_type": "Cable",
  "security": "Disclosing the details of covert funding and manipulation of labor unions in Brazil could damage U.S. relations with Brazil, compromise ongoing operations, and undermine trust in democratic processes. The cable explicitly mentions providing funds to influence labor elections: \"HE PROVIDING CR$ 5,999,999 TO ARI CALPISTA PRESIDENT GUANABARA CHEMICAL WORKERS FEDERATION...CAMPISTA USING FUNDS GAIN SUPPORT FOR DEMOCRATIC SLATE...FTI RIOD PREPARING PROVIDE FUNDS TO HUGO GOMES DA COSTA.\"",
  "security_level": "ROUTINE",
  "summary": "A cable discusses providing funds to Ari Campista, president of the Guanabara Chemical Workers Federation, to support a democratic slate in union elections and seeks clarification on potential conflicts with a parallel election plan.",
  "summary_one_paragraph": "This cable, dated 02 06, relays information about providing CR$ 5,999,999 to Ari Campista, the president of the Guanabara Chemical Workers Federation, through the RIOD Woodcap office to support a democratic slate in December union elections. The funds are intended to help Campista gain support for his slate, but the democratic group is struggling to agree on a leader. The cable requests operational details from REINBEING to avoid potential conflicts with RIOD's parallel election plan, as RIOD is also preparing to provide funds to Hugo Gomes da Costa, a member of Campista's democratic group from the alcohol and sugar workers union.",
  "tags": [
    "Labor Union",
    "Funding",
    "Covert Operation",
    "Brazil",
    "Elections",
    "Guanabara Chemical Workers Federation"
  ],
  "title": "Funding of Democratic Slate in Guanabara Chemical Workers Federation Election",
  "date": "Unknown",
  "locations_mentioned": [
    "Brazil",
    "Guanabara"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Ari Campista",
    "Hugo Gomes da Costa",
    "Boizelle",
    "Reichert",
    "J. C. King",
    "Ozga"
  ],
  "recipient": "Director",
  "sender": "MEXI"
}