{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "Disclosing details of planned sabotage operations against Cuba, including specific requests for explosives and the potential caching of materials inside Cuba, could compromise these operations and endanger individuals involved. Detailing contact methods and safe houses could also expose assets and disrupt ongoing intelligence efforts. For example, the memo states, '...it was conceivable that we could begin the caching of needed materiel inside Cuba. AMBANG-1 assured me that they were in a position to sabotage the electrical plant in Havana.'",
  "security_level": "UNCLASSIFIED",
  "summary": "A memorandum detailing a meeting with AMBANG-1, a Cuban exile leader, discussing potential sabotage operations in Cuba, including a request for explosives to target the Havana power plant and plans for political activities to undermine the Castro regime.",
  "summary_one_paragraph": "This memorandum, dated August 2, 1963, summarizes a meeting between a CIA officer and AMBANG-1 in Miami, focusing on JURE’s plans to sabotage the Havana power plant, for which AMBANG-1 requested twenty pounds of high explosives and thermite grenades. They discussed the possibility of caching materials inside Cuba, establishing contact with individuals at Guantanamo, and AMBANG-1's intentions to raise funds and coordinate efforts through travels to New York, Santo Domingo, Caracas, and Central America. The memo also covers JURE’s organizational strength, their interest in resuming PAA flights for contact maintenance within Cuba, AMBANG-1's impending full-time commitment to Cuba's liberation, and requests for radio link assistance and aerial maps.",
  "tags": [
    "CIA",
    "AMBANG-1",
    "JURE",
    "Sabotage",
    "Cuba",
    "Explosives",
    "Castro Regime",
    "Political Activities",
    "Clandestine Operations"
  ],
  "title": "Meeting with AMBANG-1",
  "date": "1963-08-02",
  "locations_mentioned": [
    "Miami",
    "Cuba",
    "Havana",
    "San Juan",
    "Washington",
    "New York",
    "Santo Domingo",
    "Caracas",
    "Central America",
    "Costa Rica",
    "Mexico",
    "Guantanamo",
    "Dallas",
    "San Francisco",
    "Philadelphia",
    "Paris",
    "Brussels"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "AMBANG-1",
    "Rogelio Cisneros",
    "Ramon Cisneros Diaz",
    "Juan Bosch",
    "Betancourt",
    "Manuel Artime",
    "Somoza",
    "Miro Cardona",
    "Gustavo Arcos",
    "Franqui",
    "Cabrera Infante",
    "Jorge Volsky",
    "German Arcienegas",
    "Culver Ladd",
    "Munoz Marin"
  ],
  "sender": "Alfenso Rodriguez (SAS/SO)"
}