{
  "classification": "Mexico",
  "document_type": "Memo",
  "security": "This directive details specific operational activities and intelligence collection methods against foreign entities in Mexico, including the recruitment and exploitation of agents, surveillance of installations, and penetration of government and media organizations. Revealing these methods could compromise ongoing operations, expose intelligence assets, and damage relationships with the Mexican government. For example, the directive states: 'Continue and, where possible, increase physical and technical surveillance of bloc installations and residences' and 'Develop political action penetration agents in key functional groups...in order to disrupt and reduce their capacity for carrying out action harmful to U. S. objectives and interests.'",
  "security_level": "UNCLASSIFIED",
  "summary": "This memorandum forwards a revised Related Mission Directive for Mexico, outlining U.S. objectives to counter Communist influence, promote democratic governance, and maintain favorable relations with the Mexican government, with a primary focus on clandestine and covert operations against Sino-Soviet, Cuban, and Communist elements in Mexico.",
  "summary_one_paragraph": "This memorandum, dated January 24, 1961, transmits a revised Related Mission Directive for Mexico, requesting approval from the Deputy Director (Plans). Signed by A. King, Chief of the WH Division, and approved by Richard Helms on June 3, 1961, the directive outlines U.S. national policy objectives, emphasizing the reduction of international Communist influence, encouragement of democratic government, and maintenance of friendly relations with Mexico. The directive prioritizes clandestine collection and covert action operations against Sino-Soviet, Cuban, and Communist elements, including physical and technical surveillance, agent recruitment, and manipulation of media and political organizations. It also details contingency reporting requirements and amendments to previous directives, specifically focusing on Cuban revolutionary activities and the development of potential political leaders.",
  "tags": [
    "CIA",
    "Mexico",
    "Mission Directive",
    "Cold War",
    "Communism",
    "Covert Operations",
    "Intelligence",
    "Sino-Soviet Bloc",
    "Cuba",
    "Richard Helms"
  ],
  "title": "Related Mission Directive for Mexico",
  "date": "1961-01-24",
  "locations_mentioned": [
    "Mexico",
    "United States",
    "Latin America",
    "Cuba",
    "Mexico City"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "A. King",
    "Richard Helms",
    "Fidel Castro"
  ],
  "recipient": "Deputy Director (Plans)",
  "sender": "A. King (Chief, WH Division)"
}