{
  "classification": "Operations",
  "document_type": "Memorandum",
  "security": "This memo contains specific details about individuals and foundations used by the CIA for covert operations and funding, including names, project codes, and security clearance levels. Releasing this information could expose witting and unwitting participants in these operations, compromise ongoing projects, and reveal sensitive funding mechanisms.  For example: 'Each Vernon Fund board member is being advised that he will receive a copy of the NEA and WCOTP letters regarding press allegations, he will acknowledge his membership on the Vernon Fund board if confronted with the facts...he will decline any further comment on the origin or operation of the Vernon Fund...'",
  "security_level": "SECRET",
  "summary": "This memorandum details individuals and organizations, including Brown and Root, Inc., the Vernon Fund, American Friends of the Middle East, and various foundations, connected to CIA projects and operations. It outlines security clearances, contact protocols, and concerns about potential exposure of Agency activities.",
  "summary_one_paragraph": "This SECRET memorandum, dated December 20, 1967, from the Chief, LEOR/SRE, outlines the CIA's relationships with various individuals and organizations, including employees of Brown and Root, Inc. approved for contact use, details concerning the Vernon Fund's covert funding of educational organizations, information on security clearances and contact protocols for individuals like Albert Blake Dick III and William G. Carr, and concerns about the potential exposure of Agency operations through foundations such as the Brown Foundation, San Jacinto Fund, and Marshall Foundation. The memo also touches on American Friends of the Middle East, M. D. Anderson Foundation, and provides negative results for certain individuals like Ed Clark and Ben Moody.",
  "tags": [
    "CIA",
    "Covert Operations",
    "Funding",
    "Security Clearances",
    "Brown and Root",
    "Vernon Fund",
    "American Friends of the Middle East",
    "Foundations",
    "Project DILAMPREY",
    "Project LECOIN",
    "Project LPCORSET",
    "RAMPARTS Article"
  ],
  "title": "December 1967 RAMPARTS Article Entitled \"The CIA's Brown and Root Dimensions!\"",
  "date": "1967-12-20",
  "locations_mentioned": [
    "Houston, Texas",
    "Udorn, Thailand",
    "Laos",
    "Washington, D. C.",
    "Lausanne, Switzerland"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "Rosa White",
    "Isaac Newton Towne",
    "Merritt Allen Warner",
    "Thomas Kenneth Montgomery",
    "Louis Dell Bradberry",
    "Bobby Joe Williams",
    "Richard Andrew Wagner",
    "Elmer Ray Remkes",
    "John Gilman Mackin, Jr.",
    "Congressman Patman",
    "Albert Blake Dick, III",
    "William George Carr",
    "Bryce Rea, Jr.",
    "John Thompson",
    "Ray Smeke",
    "Mike MacManus",
    "Raymond Joseph Emke",
    "John Thompson",
    "Thomas D. Cabot",
    "Thomas Dudley Cabot",
    "William A. Smith",
    "Leon Jaworski",
    "Lyndon B. Johnson",
    "John Henry Freeman",
    "Ernest Dashiell Cockrell, Jr.",
    "Douglas B. Marshall",
    "Margaret Cullen Marshall",
    "Hugh Roy Cullen",
    "Oveta Culp Hobby",
    "George Rufus Brown",
    "Herman Brown",
    "Allen Shivers",
    "William Pettus Hobby, Jr.",
    "Dorothy Thompson"
  ],
  "recipient": "Chief, LEOR/SRE",
  "sender": "Sarah K. Hall"
}