{
  "classification": "Cuba",
  "document_type": "Message",
  "security": "Revealing that AMRUGB-5 was 'recruited by Miami Station as radio operator/infiltree' and 'favorably swirled' exposes the CIA's method of recruiting and using Cuban exiles for intelligence gathering and infiltration operations. This could compromise future recruitment efforts and damage relationships with exile communities.",
  "security_level": "SECRET",
  "summary": "A message concerning AMRUGB-5, a former member of Castro's forces, detailing his background, recruitment as a radio operator/infiltree by the Miami Station, and his activities with various anti-Castro groups; the message also notes his travel history and lack of recent agency contact.",
  "summary_one_paragraph": "This SECRET message details the background of AMRUGB-5, born in Cuba in 1918 and a former member of Castro's forces who left Cuba in 1960. He became active with anti-Castro groups in Florida, participated in the Bay of Pigs invasion, and was later recruited by the CIA's Miami Station as a radio operator/infiltree in 1964 before being terminated in 1965. Information from 1973 indicates he traveled from Managua to Miami on a private plane owned by Cuban-born Guatemalan industrialist Domingo Moreira Martinez, with no agency contact since his termination in 1965, with his file containing an I&NS 'Adjustment of Status' request filed in 1967.",
  "tags": [
    "AMRUGB-5",
    "Castro",
    "Cuban Exile",
    "Miami Station",
    "Infiltration",
    "Radio Operator",
    "Bay of Pigs",
    "I&NS",
    "Domingo Moreira Martinez"
  ],
  "title": "AMRUGB-5 Background Information",
  "date": "1973-09-14",
  "locations_mentioned": [
    "Holguin, Cuba",
    "Cuba",
    "Miami, Florida",
    "New York",
    "Managua",
    "Guatemala"
  ],
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "AMRUGB-5",
    "Raul Castro",
    "Dr. Orlando Bosch",
    "Domingo Moreira Martinez"
  ],
  "recipient": "MANAGUAY",
  "sender": "E. Charles Payne"
}