{
  "classification": "Operations",
  "document_type": "Memo",
  "security": "Disclosing operational details like cover stories, contact methods, and financial arrangements could expose ongoing intelligence activities and endanger individuals involved. Quoting directly: 'Your initial contact in Havana will be with IDEN A...you will identify yourself as Fred Morse' and 'Your cover story will be...on the behalf of some (unnamed) American businessmen'.",
  "security_level": "UNCLASSIFIED",
  "summary": "This memo outlines the operational procedures and cover story for Mr. Tichborn's mission in Havana, Cuba, including contact protocols, expense accounting, and the overall objective of gathering political intelligence.",
  "summary_one_paragraph": "This memo, addressed to Mr. Tichborn, details his mission to Havana, Cuba, where he will pose as a tourist and later as a representative of unnamed American businessmen to assess the political situation, particularly the opposition groups. The memo outlines contact procedures with IDEN A, instructions for expense reporting using both a true name and a pseudonym (Henry W. Darkin), and the use of a cover company letter as a plausible explanation if questioned by Cuban authorities. The overall objective is to gather information on the strengths, weaknesses, plans, and potential coalescence of opposition groups in Cuba.",
  "tags": [
    "Cuba",
    "Havana",
    "Intelligence Gathering",
    "Cover Story",
    "Operational Procedures",
    "Political Situation",
    "Opposition Groups",
    "Mr. Tichborn",
    "IDEN A"
  ],
  "title": "Clarification of Mission and Procedures for Mr. Tichborn in Cuba",
  "date": "1960",
  "locations_mentioned": [
    "Washington",
    "Havana",
    "Cuba",
    "Philadelphia, Pennsylvania",
    "Washington, D. C."
  ],
  "origin_agency": "Unknown",
  "persons_mentioned": [
    "Mr. Tichborn",
    "IDEN A",
    "Fred Morse",
    "Henry W. Darkin"
  ],
  "recipient": "Mr. Tichborn",
  "sender": "Unknown"
}