{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "MORENO's indiscretions were a serious problem that limited his effectiveness as a direct participant in the AMTRUNK Operation by arousing the concern of other participants...MORENO, SZULC, and VOLSKY believed they had an inside track in Washington because of their contacts there and all three disliked following Agency instructions that conflicted with their own diverse interests. However, because JMWAVE Station and AMICE-14 (Miguel A. DIAZ Isalgue) objected to MORENO's continued involvement in the AMTRUNK Operation after learning of his free talk with SZULC and others, the Station terminated MORENO's involvement in the sensitive aspects of AMTRUNK in November 1963.",
  "security_level": "SECRET",
  "summary": "This memo details the CIA's assessment and involvement of Nestor Antonio MORENO Lopez (AMICE-27) in the AMTRUNK operation, highlighting his indiscretions, conflicts of interest, and eventual termination due to security concerns.",
  "summary_one_paragraph": "A memorandum dated February 14, 1977, discusses Nestor Antonio MORENO Lopez's (AMICE-27) background and his role in the anti-CASTRO AMTRUNK operation, noting his prior involvement in the anti-BATISTA movement and his connections to Tad SZULC and Jorge VOLSKY; the memo reveals that MORENO's loose talk and conflicting interests, exacerbated by SZULC and VOLSKY, compromised the operation's security, leading to his termination from sensitive aspects of AMTRUNK in November 1963 after JMWAVE Station and AMICE-14 (Miguel A. DIAZ Isalgue) raised concerns.",
  "tags": [
    "CIA",
    "AMTRUNK Operation",
    "Nestor Antonio MORENO Lopez",
    "Tad SZULC",
    "Jorge VOLSKY",
    "Cuba",
    "Anti-CASTRO",
    "Security Breach",
    "JMWAVE Station"
  ],
  "title": "Nestor Antonio MORENO Lopez (AMICE-27) (201-312091)",
  "date": "1977-02-14",
  "locations_mentioned": [
    "Havana, Cuba",
    "Miami",
    "Washington",
    "South Carolina"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Nestor Antonio MORENO Lopez",
    "Camilo CIENFUEGOS",
    "Tad SZULC",
    "Jorge VOLSKY",
    "Robert HURWITCH",
    "KENNEDY",
    "Miguel A. DIAZ Isalgue",
    "G. Harvey SUMM",
    "BATISTA",
    "CASTRO"
  ],
  "recipient": "LAD/JFK Task Force",
  "sender": "Marty Millen"
}