{
  "classification": "Operations",
  "document_type": "Airgram/Contact Report/Memorandum",
  "security": "The airgrams, contact reports, and memos detail interactions with Clemard Joseph Charles, who is described as a confidant of President Duvalier and a businessman of questionable repute. Sharing these assessments could reveal sources and methods used to gather information on Haitian officials and could compromise ongoing or planned operations involving Charles. For example, it is noted that Charles \"could be expected to report on all Americans with whom he had conversations.\" Furthermore, specific details about Charles's alleged dishonesty and financial dealings could damage his reputation and hinder future intelligence-gathering efforts.",
  "security_level": "SECRET",
  "summary": "This collection of documents pertains to Clemard Joseph Charles, a Haitian businessman and confidant of President Duvalier, who is of interest to the CIA and State Department; these documents include airgrams, contact reports, and memos detailing interactions with Charles, assessments of his character and business dealings, and inquiries into his potential as a political figure.",
  "summary_one_paragraph": "This collection of documents from April and May 1963 centers on Clemard Joseph Charles, a Haitian businessman and confidant of President Duvalier, who is also president of the Commercial Bank of Haiti. The documents, comprising State Department airgrams, CIA contact reports, and internal memos, reveal assessments of Charles's character as 'slippery' and his business practices as questionable, including allegations of dishonesty and financial impropriety. The documents also explore Charles's potential political ambitions and his interactions with U.S. officials, with concerns raised about his trustworthiness and the security implications of engaging with him. The documents also reflect ongoing efforts to gather intelligence on Charles and his activities, including requests for traces and background information.",
  "tags": [
    "Clemard Joseph Charles",
    "Haiti",
    "Duvalier",
    "CIA",
    "State Department",
    "WUBRINY",
    "VERIFI",
    "Intelligence Gathering",
    "Commercial Bank of Haiti"
  ],
  "title": "Clemard Joseph Charles Investigation",
  "date": "1963-04-11",
  "locations_mentioned": [
    "Port-au-Prince",
    "Haiti",
    "Long Beach",
    "Long Island",
    "New York",
    "Gonaives"
  ],
  "origin_agency": "U.S. Department of State, Central Intelligence Agency",
  "persons_mentioned": [
    "Clemard Joseph Charles",
    "President François Duvalier",
    "Joseph D. Charles",
    "Sophie Charles",
    "André",
    "Le Moniteur",
    "Rert Cindine TARDIEU",
    "Gale W. Allen",
    "Dick Leach",
    "Dr. Earve Boyer",
    "Ambrose Haring",
    "Timothy Petit",
    "Col. Honorat",
    "Col. H. leemin",
    "Dr. Emile Seint-lot",
    "Col. (fnu) Cham",
    "Trujillo",
    "Anna Panor"
  ],
  "recipient": "Various CIA and State Department officials",
  "sender": "AmEmbassy, Port-au-Prince; Chief, DO/COEO; DO/HQT; Central Intelligence Agency"
}