{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Revealing associations between the CIA, Cuban exiles, and the Mafia for assassination plots could severely damage the CIA's reputation and international relations. Direct involvement with criminal organizations is also illegal. Quoting from the document: 'The latter reportedly offered to assassinate CASTRO at a price of $150,000 dollars' and 'CAMERON made fairly clear that the MAFIA was involved.' This reveals a willingness to use criminal elements for political assassinations.",
  "security_level": "SECRET",
  "summary": "This memorandum details a CIA project (AMCANOE) supporting Cuban resistance groups to overthrow CASTRO, revealing connections between Cuban exiles, the Mafia, and potential assassination plots against Cuban leaders.",
  "summary_one_paragraph": "A SECRET memorandum summarizes the AMCANOE project, concerning U.S. support for the Unidad de Liberacion Nacional (ULN) and efforts to oust Fidel CASTRO. The project involved key figures such as Eduardo GARCIA Molina, Enrique Alfredo GARCIA Molina, and others. A review of files uncovered a potential offer by the Cosa Nostra to assassinate CASTRO for $150,000, facilitated through a businessman connected to AMCANOE-1 and a former St. Louis police officer. The memo also references Byron CAMERON, who claimed to represent a group in contact with Cuban gangsters willing to kill Fidel, Raul CASTRO, and Che GUEVARA, indicating MAFIA involvement.",
  "tags": [
    "AMCANOE",
    "Cuba",
    "Castro",
    "Assassination",
    "Mafia",
    "CIA",
    "Cuban Exiles",
    "ULN",
    "Secret"
  ],
  "title": "AMCANOE Job # 65-535/28",
  "conspiracy": "This document does not directly relate to the JFK assassination, but it does reveal a potential willingness by the CIA to engage with criminal elements, including the Mafia, for assassination plots. It shows that the CIA was actively involved in attempts to overthrow or assassinate foreign leaders.",
  "date": "1964-05-11",
  "locations_mentioned": [
    "Cuba",
    "Chicago",
    "St. Louis",
    "Miami Springs, Fla.",
    "Fort Lauderdale, Fla.",
    "Caribbean"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Eduardo GARCIA Molina (AMCANOE-1)",
    "Enrique Alfredo GARCIA Molina (AMCANOE-2)",
    "Antonio Jose RAMIREZ Mendez (AMCANOE-3)",
    "Armando SOSA Rodriguez (AMCANOE-4)",
    "Marcelino PEREZ Diez (AMCANOE-5)",
    "Orlando OROPESA Perez (AMCANOE-6)",
    "Benjamin ACOSTA Valdes (AMCANOE-7)",
    "Juan AMESTOY Dominguez (AMCANOE-9)",
    "Fidel CASTRO",
    "Paulino A SIERRA",
    "Byron CAMERON",
    "S.W. TYLER",
    "Herbert F. JENNE",
    "Raul CASTRO",
    "Che GUEVARA",
    "Jane Zerance"
  ]
}