{
  "classification": "Cuba",
  "document_type": "Dispatch",
  "security": "Revealing details about AMGAME-1, AMOTs, and operational use of subjects could compromise sources and methods. Quoting the dispatch, 'As stated in the reference, AMGAME-1 claims that Guitart has relatives living in the U.S. The AMOTs were asked for any information they might be able to provide on such relatives' highlights reliance on specific sources and their information-gathering activities, which could expose them to risk.",
  "security_level": "SECRET",
  "summary": "A CIA dispatch from January 1972 provides information on relatives of Dario Guitart Manday residing in the U.S., including Agustin and Miguel Antonio Guitart Campuzano, and his mistress, Mar Juarez Fernandez, based on information from AMGAME-1 and AMOTs.",
  "summary_one_paragraph": "This secret dispatch, dated January 10, 1972, from the Chief of Station, WH/Miami, to the Chief of the Western Hemisphere Division, details information gathered on Dario Guitart Manday's relatives in the U.S., namely Agustin and Miguel Antonio Guitart Campuzano, along with data on his mistress, Mar Juarez Fernandez. The information, sourced from AMGAME-1, explores the relationships and backgrounds of these individuals, noting Agustin's professorship at Xavier University in New Orleans and Miguel Antonio's professorship at Alabama College. It also references Mar Juarez Fernandez's position at the Oceanographic Institute in Cuba and her previous opposition to the Cuban regime.",
  "tags": [
    "CIA",
    "Dario Guitart Manday",
    "Agustin Guitart Campuzano",
    "Miguel Antonio Guitart Campuzano",
    "Mar Juarez Fernandez",
    "AMGAME-1",
    "AMOTs",
    "Cuba",
    "Western Hemisphere Division",
    "Xavier University",
    "Alabama College",
    "Oceanographic Institute"
  ],
  "title": "Dario Guitart Manday Relatives Information",
  "date": "1972-01-10",
  "locations_mentioned": [
    "United States",
    "Cuba",
    "Miami",
    "New Orleans, Louisiana",
    "Montevallo, Alabama",
    "Havana"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Dario Guitart Manday",
    "Agustin Guitart Campuzano",
    "Miguel Antonio Guitart Campuzano",
    "Mar Juarez Fernandez",
    "Helena Toro Abril",
    "Emma Rosalia Tabares Gutierrez",
    "Orlando Bambu Fernandez"
  ],
  "recipient": "Chief, Western Hemisphere Division",
  "sender": "Chief of Station, WH/Miami"
}