{
  "classification": "Administrative",
  "document_type": "Memorandum",
  "security": "Disclosure of specific information on alias documentation and accommodation addresses runs the gamut from 'certain' to 'unpredictable.' Based on past evidence, public release of references to the forged Mexican and Panamanian passports would be virtually certain to draw a reaction from those governments that would harm US diplomatic relations and deny CIA its use of a currently valuable tool. The probability of litigation from disclosure of business documents is also quite high.",
  "security_level": "SECRET",
  "summary": "A CIA memorandum from J. Barry Harrelson to the Assassination Records Review Board regarding a proposal to postpone the release of alias documentation and accommodation addresses in assassination records, citing potential damage to diplomatic relations, litigation, and intelligence collection methods.",
  "summary_one_paragraph": "This SECRET memorandum, dated May 13, 1998, from J. Barry Harrelson, JFK Project Officer, to the Executive Director of the Assassination Records Review Board, addresses the CIA's proposal to postpone the release of specific information on alias documentation and accommodation addresses in assassination records. The memo argues that releasing details about forged passports, federal and state documents, business documents, and accommodation addresses used by CIA officers and assets could damage diplomatic relations with countries like Mexico and Panama, lead to litigation from private sector firms, compromise intelligence collection methods, endanger CIA personnel, and threaten agreements with other US government entities; it recommends using generic substitute language instead.",
  "tags": [
    "CIA",
    "Alias Documentation",
    "Accommodation Addresses",
    "Assassination Records Review Board",
    "JFK Assassination",
    "Covert Operations",
    "Diplomatic Relations",
    "Litigation",
    "Intelligence Collection"
  ],
  "title": "CIA Proposal on Alias Documentation and Accommodation Addresses in Assassination Records",
  "date": "1998-05-13",
  "origin_agency": "Central Intelligence Agency (CIA)",
  "persons_mentioned": [
    "J. Barry Harrelson",
    "David Morales"
  ],
  "recipient": "Executive Director, Assassination Records Review Board",
  "sender": "J. Barry Harrelson, JFK Project Officer"
}