{
  "classification": "Operations",
  "document_type": "Memo",
  "security": "Revealing operational details of contacting individuals like A-1 and Tegel, as well as the use of Charlie Davis as a contact, could compromise ongoing intelligence operations and expose individuals connected to the CIA. Specifically, the memo states: \"Please get word to A-l that if he sees (Tegel) to get as much info from him on his current situation in Brazil, who he knows in Cuban community and Cubans he knows in Cuba. Naturally, without exposing his (A-l's) connections with us. NE/5 will handle contact with (Charlie Davis) and subsequent contact, if ary, with (Tegel).\"",
  "security_level": "SECRET",
  "summary": "A memo from Joe B. to Bill Wainwright and Bryant, requesting that A-1 gather information from Tegel about the Cuban community in Brazil and Cuba without revealing A-1's connection to the CIA, and noting NE/5 will handle contact with Charlie Davis and Tegel.",
  "summary_one_paragraph": "This secret memo, sent from Joe B. to Bill Wainwright and Bryant, instructs that A-1 should gather information from Tegel regarding his current situation in Brazil, including his contacts within the Cuban community and in Cuba. The communication emphasizes the importance of concealing A-1's association with the CIA during this information-gathering process. Furthermore, it specifies that NE/5 will manage the contact with Charlie Davis and any subsequent interaction with Tegel.",
  "tags": [
    "CIA",
    "Intelligence Gathering",
    "Cuban Community",
    "Brazil",
    "Contact Operation",
    "Covert Operation",
    "PERUKCEN",
    "ALEHIP-1",
    "Tegel",
    "Charlie Davis",
    "Tourist Visa"
  ],
  "title": "Subject of 201-720615",
  "date": "1964-04-30",
  "locations_mentioned": [
    "Rio de Janeiro",
    "United States",
    "France",
    "New York",
    "New Orleans, LA",
    "Brazil",
    "Cuba"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Bill Wainwright",
    "Bryant",
    "Joe B.",
    "A-1",
    "Tegel",
    "Charlie Davis",
    "Benri Maslich",
    "John Duys",
    "H. Gilbert Smith",
    "Harry V. Withers"
  ],
  "recipient": "Bill Wainwright, Bryant",
  "sender": "Joe B."
}