{
  "classification": "Liaison",
  "document_type": "Journal Entry",
  "security": "This document does not contain sensitive information that would compromise national security. It primarily concerns routine communications between the CIA's Office of Legislative Counsel and various congressional offices regarding information requests and meeting arrangements.",
  "security_level": "CIA INTERNAL USE ONLY",
  "summary": "This CIA Office of Legislative Counsel journal entry from March 30, 1977, details communications with congressional offices regarding requests for information on the Kennedy assassination, intelligence process course participation, African Affairs Subcommittee hearings, and climatological research.",
  "summary_one_paragraph": "On March 30, 1977, the CIA's Office of Legislative Counsel (OLC) recorded several interactions in its journal: James Fiesta from Representative Clarence D. Long's office requested Kennedy assassination material for a constituent, Ernest F. Rethschulte; Anne Karalekas of the Senate Select Committee on Intelligence confirmed her participation in an Intelligence Process Course; Linda, secretary to Pauline Baker of the Senate Foreign Relations Subcommittee on African Affairs, provided information about published hearings; and Winslow Wheeler from Senator Jacob K. Javits' office requested a study on climatological research.",
  "tags": [
    "CIA",
    "Office of Legislative Counsel",
    "HSCA",
    "Kennedy Assassination",
    "FOIA",
    "Congressional Liaison",
    "Intelligence Process Course",
    "African Affairs Subcommittee",
    "Climatological Research"
  ],
  "title": "Journal - Office of Legislative Counsel, Wednesday - 30 March 1977",
  "date": "1977-03-30",
  "persons_mentioned": [
    "James Fiesta",
    "Clarence D. Long",
    "Ernest F. Rethschulte",
    "Anne Karalekas",
    "George Frates",
    "Pauline Baker",
    "Molly Kreimer",
    "Winslow Wheeler",
    "Jacob K. Javits"
  ],
  "recipient": "CIA Internal Use",
  "sender": "Office of Legislative Counsel"
}