{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Dissemination would also lead to the disclosure of MM 761-S. Although questioned closely, MM 761-S was not able to furnish any further details.",
  "security_level": "Secret",
  "summary": "An FBI memo discusses Rolando L. Cubela's contact with the CIA through Carlos Tepedino and Cubela's desire for equipment to eliminate Fidel Castro, along with a potential plan involving Cubela to assassinate Castro that was allegedly reconsidered with President Johnson's awareness.",
  "summary_one_paragraph": "This FBI memorandum from the Miami SAC to the Director, dated July 29, 1964, concerns Rolando L. Cubela y Secades, a Cuban government official who expressed a desire to defect in 1962. It details how Cubela was contacted by the CIA in Europe through Carlos Tepedino, a Cuban exile, who informed the FBI that Cubela was complaining about not receiving necessary equipment from the CIA to take action in Cuba, specifically to eliminate Fidel Castro. Tepedino also mentioned a potential plan involving Cubela to assassinate Castro, which had been previously shelved due to Attorney General Robert Kennedy's opposition but was allegedly being reconsidered with President Johnson's awareness, scheduled before the November elections.",
  "tags": [
    "FBI",
    "Rolando L. Cubela",
    "Carlos Tepedino",
    "Fidel Castro",
    "CIA",
    "Assassination Plot",
    "Cuba",
    "Defection",
    "Robert Kennedy",
    "Lyndon B. Johnson"
  ],
  "title": "ROLANDO L. CUBELA Y SECADES",
  "conspiracy": "The document discusses a potential plan to assassinate Fidel Castro, involving Rolando L. Cubela and possibly others from Europe, which was allegedly reconsidered with President Johnson's awareness. This suggests high-level knowledge and potential involvement in assassination plots.",
  "date": "1964-07-29",
  "locations_mentioned": [
    "Cuba",
    "Europe",
    "Paris",
    "Rego Park, Queens, New York"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Rolando L. Cubela y Secades",
    "Carlos Tepedino",
    "Fidel Castro",
    "Robert Kennedy",
    "Lyndon B. Johnson",
    "Carrillo"
  ],
  "recipient": "Director, FBI",
  "sender": "SAC, MM"
}