{
  "classification": "Security",
  "document_type": "Memo",
  "security": "Disclosing internal procedures for investigating and handling federal employee disloyalty, particularly concerning the FBI's role, could compromise national security. Quoting directly: 'It is my view that the Bureau's practice of passing along to the various Government departments and agencies information which comes to its attention in connection with the conduct of investigations normally and regularly within the Bureau's juris- diction is entirely appropriate and correct.' Revealing the FBI's practices and the types of information it collects and shares could allow adversaries to circumvent security measures and identify vulnerabilities.",
  "security_level": "UNCLASSIFIED",
  "summary": "A collection of memoranda and executive orders concerning security requirements for government employment, investigations of federal employees, and the role of the FBI in these matters, including loyalty checks and handling information on potential disloyalty.",
  "summary_one_paragraph": "This collection of documents, including executive orders and memoranda from 1947 to 1976, outlines the security requirements for government employment, the investigative processes for federal employees' loyalty, and the FBI's role in these security measures. Key points include the FBI's practice of sharing information with government departments and agencies, procedures for investigating employees stationed overseas, and amendments to Executive Order 10450 regarding security requirements. The documents also cover the Subversive Activities Control Board's role and guidelines for determining if an organization is subversive or communist.",
  "tags": [
    "Security",
    "Federal Bureau of Investigation",
    "FBI",
    "Executive Order 10450",
    "Employee Loyalty",
    "Government Employment",
    "Subversive Activities Control Board",
    "Investigations"
  ],
  "title": "Security Requirements For Government Employment",
  "date": "1976-02-06",
  "locations_mentioned": [
    "Washington, D.C.",
    "United States",
    "Alaska",
    "Hawaii",
    "Puerto Rico",
    "Virgin Islands"
  ],
  "origin_agency": "Office of the Deputy Attorney General / Federal Bureau of Investigation",
  "persons_mentioned": [
    "John A. Mintz",
    "Steven K. Blackhurst",
    "Paul Daly",
    "Dwight D. Eisenhower",
    "Richard Nixon",
    "J. Edgar Hoover",
    "Marquis Childs",
    "Clifford J. Durr",
    "Paul A. Walker"
  ],
  "recipient": "John A. Mintz, Assistant Director Legal Counsel Division, Federal Bureau of Investigation",
  "sender": "Steven K. Blackhurst, Assistant Special Counsel for Intelligence Coordination"
}