{
  "classification": "Commission",
  "document_type": "Memo",
  "security": "Several documents discuss intelligence operations and coordination between different government agencies, including the CIA, FBI, NSA, and State Department. Releasing information about specific intelligence operations or the involvement of these agencies could compromise ongoing intelligence activities and reveal sensitive sources and methods.  For example, one memo mentions a close association with the Chief Postal Inspector, which \"could possibly be construed to include opening of mail.\" Disclosing such details could expose past or present intelligence practices.",
  "security_level": "SECRET",
  "summary": "This collection of memoranda primarily concerns responses to requests from the Senate Select Committee on Intelligence Activities regarding various intelligence operations, the Cabinet Committee to Combat Terrorism, and the FBI's involvement in domestic intelligence and counterintelligence activities, including those related to Martin Luther King Jr.",
  "summary_one_paragraph": "This set of documents, dated between June and July 1975, includes memoranda from the Department of State, the FBI, and the CIA, addressing the Senate Select Committee's inquiries into intelligence activities. It covers topics such as the structure and functions of the Cabinet Committee to Combat Terrorism, FBI's domestic intelligence operations (including the HILEV program and potential mail opening activities), the release of former employees from secrecy agreements for interviews related to the Martin Luther King Jr. case, and task force assignments related to assassinations and political abuses. The documents also detail the FBI's interactions with various Congressional committees and its stance on providing former employees access to government documents.",
  "tags": [
    "Senate Select Committee on Intelligence Activities",
    "Intelligence Operations",
    "Cabinet Committee to Combat Terrorism",
    "FBI",
    "Domestic Intelligence",
    "COINTELPRO",
    "Martin Luther King Jr.",
    "Secrecy Agreements",
    "Electronic Surveillances",
    "Mail Covers",
    "Task Force Assignments",
    "HILEV Program",
    "FOIA"
  ],
  "title": "Senate Select Committee Request for Documents and Status of Responses to Congressional Committee Requests",
  "date": "1975-07",
  "locations_mentioned": [
    "Washington, D.C.",
    "McLean, Virginia"
  ],
  "origin_agency": "Department of State, Federal Bureau of Investigation (FBI), CIA",
  "persons_mentioned": [
    "Brent Scowcroft",
    "William P. Rogers",
    "Richard M. Nixon",
    "George S. Springsteen",
    "K. William O'Connor",
    "John Mintz",
    "John Doar",
    "W. R. Wannall",
    "J. B. Adams",
    "Alan Parker",
    "Ken Klee",
    "L. Patrick Gray III",
    "Kevin Maroney",
    "Bill D. Williams",
    "Edward D. Hagerty",
    "Wilderotter",
    "Sayre Stevens",
    "James Gardner",
    "Malcolm Lawrence",
    "Hunter Helgeson",
    "John Martin",
    "Charles Kane",
    "Verne St. Mars",
    "George Calhoun",
    "J. G. Deegan",
    "William Jones",
    "J. W. Dalseg",
    "John Thomas",
    "Erich Isenstead",
    "Phil White",
    "Benson Buffham",
    "David Cooke",
    "Lee Peters",
    "W. A. Branigan",
    "J. P. Lee",
    "Ernest Tsikerdanos",
    "R. L. Shackelford",
    "James Henderson",
    "Bayard King",
    "Patricia Barnett",
    "Emerson Brown",
    "John R. Borys",
    "Ivan Conrad",
    "Michael Epstein",
    "Elmer Larson",
    "William O. Cregar",
    "John B. Hotis",
    "Paul V. Daly",
    "John Elliff",
    "Lester B. Seidel",
    "John Smith",
    "William Ricks",
    "Mark Gitenstein",
    "Henry B. Montague",
    "E. S. Miller",
    "Mr. Felt",
    "Daniel M. Armstrong III",
    "Kissinger"
  ],
  "recipient": "Lieutenant General Brent Scowcroft, Mr. J. B. Adams, Director of Central Intelligence",
  "sender": "George S. Springsteen, Legal Counsel, W. O. Cregar, Harriett Mowitt"
}