{
  "classification": "Liaison",
  "document_type": "Memorandum",
  "security": "This document discusses sensitive cases involving conflicts between the FBI and CIA, including concerns about compromised operations, uncoordinated intelligence activities, and potential breaches of security. Sharing these details could expose past intelligence failures, reveal sources and methods, and damage the working relationship between the FBI and CIA. Examples: \"the FBI did not play it square with CIA in the Abel age by not making certain that the Agency was given the proper recognition for its contri-butions\", \"former Special Agent George Munro handled many of our operations in Mexico, including key informants, and subsequently begän performing services for CIA after he left the Bureau\"",
  "security_level": "Secret",
  "summary": "A memorandum from Sam Papich to the Director of the FBI, forwarding a list of approximately 75 items detailing justified grievances against the CIA and discussing relations between the FBI and CIA, including instances of conflict and cooperation.",
  "summary_one_paragraph": "This secret memorandum, dated March 13, 1970, is from SA Sam Papich to the Director of the FBI, addressing relations with the CIA and referencing previous letters outlining justified grievances. Enclosing a list of approximately 75 items of conflict and cooperation, Papich notes the list is based on personal recollection and Bureau records, but not exhaustive. He highlights the importance of this list for evaluating alleged CIA grievances. The memo also refers to ongoing discussion, review of positive intelligence, reexamination of 1966 ground rules, domestic clandestine collection of positive intelligence and offers a personal discussion with the Director until April 3, 1970. Also included is a letter from Richard Helms to J. Edgar Hoover about positive intelligence collection",
  "tags": [
    "FBI",
    "CIA",
    "Relations",
    "Grievances",
    "Conflicts",
    "Cooperation",
    "Positive Intelligence",
    "Audio Coverage",
    "Mail Coverage",
    "Technical Services",
    "New Left",
    "Racial Matters",
    "Legal Attaches",
    "Internal Security"
  ],
  "title": "CIA ACT, ANTI-CASTRO ACT",
  "date": "1970-03-13",
  "locations_mentioned": [
    "Washington, D. C.",
    "Moscow",
    "France",
    "Mexico",
    "Switzerland",
    "Guatemala",
    "Cuba",
    "Brazil"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Sam Papich",
    "J. Edgar Hoover",
    "Richard Helms",
    "William F. Raborn, Jr.",
    "Boris Morros",
    "George Munro",
    "Reino Hayhanen",
    "Rudolph Abel",
    "John Grombach",
    "Pat O'Brien",
    "Joseph McCarthy",
    "Mark W. Clark",
    "Castro",
    "William I. Friedman",
    "W. C. Sullivan"
  ],
  "recipient": "Director, FBI",
  "sender": "PAPICH, SAM"
}