{
  "classification": "Liaison",
  "document_type": "Memo",
  "security": "Revealing that Angleton requested his identity not be revealed to other agencies because he is involved in several sensitive projects, such as Israeli Intelligence, and if his identity were known to the other agencies, the security of CIA operations could be prejudiced. Quoting directly: 'Angleton also asked when the Bureau found it necessary to disseminate information to him and other agencies, that his identity not be revealed to the other agencies...if his identity were known to the other agencies, the security of CIA operations could be prejudiced.'",
  "security_level": "Secret",
  "summary": "V.P. Keay informs A. Belmont about James Angleton's request for a uniform procedure in transmitting mail to him, specifying that it should be directed to the Director of CIA, Attention: James Angleton, with Allen Dulles' approval, and that his identity should not be revealed to other agencies to protect sensitive projects like Israeli Intelligence.",
  "summary_one_paragraph": "On March 9, 1954, V.P. Keay of the FBI sent a memo to A. Belmont regarding James Angleton of the CIA, who was providing the Bureau with sensitive information. Angleton requested that all future mail be directed to the Director of CIA, \"Attention: James Angleton,\" a procedure approved by CIA Director Allen Dulles. Keay also noted Angleton's request to keep his identity concealed from other agencies due to his involvement in sensitive projects like Israeli Intelligence, as disclosure could jeopardize CIA operations. An attachment recommending approval of these guidelines for all Section Chiefs was included.",
  "tags": [
    "FBI",
    "CIA",
    "James Angleton",
    "Allen Dulles",
    "Israeli Intelligence",
    "Bureau Source 100",
    "Liaison",
    "Security"
  ],
  "title": "",
  "date": "1954-03-09",
  "origin_agency": "FBI",
  "persons_mentioned": [
    "James Angleton",
    "A. Belmont",
    "V. P. Keay",
    "Allen Dulles",
    "E.F. Hall",
    "Wannall"
  ],
  "recipient": "A. Belmont",
  "sender": "V. P. Keay"
}