{
  "classification": "Administrative",
  "document_type": "Memo",
  "security": "This document reveals intelligence community concerns about disclosing specific foreign targets of electronic surveillance to the Senate Select Committee. Specifically, it mentions that \"efforts would be made to avoid identifying specific foreign targets of surreptitious entries or warrantless electronic surveillances.\" Additionally, it notes that the SSC Staff is aware of CIA's domestic electronic surveillance against foreign targets, including the Czech Embassy, the UAR Embassy, the Chilean Embassy, the Soviet Consulate in San Francisco, the Soviet Embassy, and the quarters occupied by the Chinese Communists in New York City. \"Notwithstanding this regrettable breach in the principle we have agreed to try to maintain, I believe we should resist pressures to expand on the number of identified target s\"",
  "security_level": "SECRET",
  "summary": "The document pertains to preparations for a briefing to Senators Church and Tower of the Senate Select Committee (SSC) regarding warrantless electronic surveillances and surreptitious entries, with specific concerns about identifying foreign targets and a disclosure that the SSC staff is already aware of CIA's domestic electronic surveillance operations against various embassies and establishments.",
  "summary_one_paragraph": "This memorandum details preparations for a briefing to Senators Church and Tower of the Senate Select Committee (SSC) on warrantless electronic surveillances and surreptitious entries, outlining that NSA, FBI, and CIA would provide briefings while White House representatives monitored a preview. It highlights an agreement among the agencies to avoid identifying specific foreign targets of these operations. However, it notes that the SSC staff is already aware, through CIA-provided materials, of domestic electronic surveillance operations targeting the Czech Embassy, UAR Embassy, Chilean Embassy, Soviet Consulate in San Francisco, Soviet Embassy, and Chinese Communist quarters in New York City, necessitating factual responses while resisting further expansion of identified targets.",
  "tags": [
    "Senate Select Committee",
    "Electronic Surveillance",
    "Surreptitious Entries",
    "Foreign Targets",
    "CIA",
    "FBI",
    "NSA",
    "Intelligence Community",
    "Domestic Surveillance"
  ],
  "title": "Informative Note: Senate Select Committee Briefing on Warrantless Electronic Surveillances and Surreptitious Entries",
  "date": "1975-08-04",
  "locations_mentioned": [
    "U.S.",
    "New York City"
  ],
  "origin_agency": "FBI/Intelligence Division",
  "persons_mentioned": [
    "Senators Church",
    "Senator Tower",
    "Daniel M. (Mac) Armstrong, III",
    "John Elliff",
    "Gray",
    "Dave Kinley",
    "Mr. Wannall",
    "Mr. Hotis",
    "Mr. Mintz",
    "Mr. Herington",
    "Richard Kern",
    "William Cregar",
    "Adm. Showers",
    "Edward Ryan"
  ],
  "recipient": "Mr. J. B. Adams"
}