{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "This document reveals intelligence sources and methods used to gather information on Cuban exile groups in Miami, including the use of an agent (Carlos Miguel KASSEL) who reports to both the Soviets and the CIA. It details KASSEL's contacts, the information he gathered, and his planned activities, such as contributing articles to Miami Extra. Disclosing these details could compromise intelligence operations, endanger sources, and expose CIA's methods of gathering information on exile groups. The document includes a \"WARNING NOTICE: SENSITIVE INTELLIGENCE SOURCES AND METHODS INVOLVED\".",
  "security_level": "Secret",
  "summary": "This document is a report from the CIA to the FBI regarding Carlos Miguel KASSEL's (GACEL) trip to Miami to gather information on Cuban exile activities, including meetings with various exile leaders and his assessment of their plans and capabilities.",
  "summary_one_paragraph": "In a report dated July 18, 1978, the CIA informs the FBI about Carlos Miguel KASSEL (alias GACEL), a Soviet agent who traveled to Miami in August 1974 to gather intelligence on Cuban exile groups. KASSEL, posing as an \"Asistente Internacional\" for a Colombian workers' union, met with key figures like Ignacio LEDON Iglesias, Mario RIVADULLA, Rolando MASFERRER, and others, assessing their political positions, fundraising efforts, and plans to overthrow Castro. KASSEL reported on the disintegration of the PRP, MASFERRER's call for paramilitary training, and the formation of the MIRC, all while drafting a report for his Soviet contact that downplayed U.S. government support for the exiles.",
  "tags": [
    "FBI",
    "CIA",
    "Carlos Miguel KASSEL",
    "GACEL",
    "Cuban exiles",
    "Miami",
    "Soviet contact",
    "Intelligence",
    "Partido Revolucionario del Pueblo",
    "MIRC",
    "Movimiento Independente Radical de Cuba",
    "Rolando MASFERRER",
    "Fidel Castro"
  ],
  "title": "Travel to Florida of an agent for the Soviets in Bogota to report on Cuban Exile Activities",
  "date": "1978-07-18",
  "locations_mentioned": [
    "Miami, Florida",
    "Bogota, Colombia",
    "Cuba",
    "Santo Domingo, Dominican Republic",
    "Venezuela",
    "Chile",
    "Brazil"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Carlos Miguel KASSEL",
    "GACEL",
    "Ignacio LEDON Iglesias",
    "Mario RIVADULLA",
    "Ramiro de LA FE",
    "Ernesto de LA FE",
    "Rolando MASFERRER",
    "Alberto DIAZ Masvidal",
    "Max LESNIK",
    "Vicente RUBIERA",
    "Santiago REY Pernas",
    "Alberto del RIO Chaviano",
    "Antonio SANTIAGO",
    "Armando MEDINA",
    "Manuel CAVEDAS",
    "Miguel AZERQUEIRA",
    "Juan LÓPEZ",
    "Patricia BERDUGO",
    "Orlando BOSCH",
    "Antonio VECIANA",
    "Jose de Jesus QINQAUMA",
    "Fidel Castro",
    "David A. Phillips"
  ],
  "recipient": "HQ",
  "sender": "NIS"
}