{
  "classification": "Liaison",
  "document_type": "Memo",
  "security": "Disclosing details about liaison relationships with foreign intelligence services, like the Israeli Intelligence Service (IIS), could jeopardize those relationships. Specifically, mentioning the exchange of 'extremely sensitive information' and the FBI's liaison with IIS representatives Menachem Navoth and Paul Korem could damage trust and future cooperation. Also, revealing that the FBI used a 'double agent' paid by the Israelis could harm diplomatic relations and expose intelligence-gathering methods. Quoting from the document: 'Angleton, in his official capacity at CIA, had frequent personal liaison contacts with Israeli Intelligence Service (IIS) representatives... involving the exchange of extremely sensitive information.' and 'Navoth met with an FBI double agent...and paid the double agent $250.00 for cooperating with the Israelis.'",
  "security_level": "SECRET/SCOPE(S)",
  "summary": "This memorandum summarizes FBI files concerning Israeli intelligence collection capabilities in the United States, including information from James Angleton, former Chief of Counterintelligence Operations at the CIA, and details liaison activities between the FBI, CIA, and Israeli intelligence.",
  "summary_one_paragraph": "This SECRET/SCOPE(S) memorandum, dated July 15, 1975, summarizes information in FBI files regarding Israeli intelligence collection capabilities within the United States. It references James Angleton's testimony before the Senate Select Committee (SSC) and details frequent liaison contacts between Angleton (while at the CIA) and Israeli Intelligence Service (IIS) representatives, involving the exchange of sensitive information. The memo also notes FBI technical source coverage of the Israeli Embassy between 1969 and 1972, investigations into an Israeli technical intelligence network, IIS attempts to penetrate the UN and Arab establishments, and ongoing liaison between the FBI and IIS representatives, including past instances of intelligence activities and payments to a double agent.",
  "tags": [
    "FBI",
    "CIA",
    "Israeli Intelligence Service",
    "IIS",
    "James Angleton",
    "Senate Select Committee",
    "Intelligence Collection",
    "Counterintelligence",
    "Liaison",
    "Nuclear Information",
    "United Nations",
    "Arab Establishments",
    "Double Agent",
    "Menachem Navoth",
    "Paul Korem",
    "Hermoni"
  ],
  "title": "SENSTUDY 75",
  "date": "1975-07-15",
  "locations_mentioned": [
    "United States",
    "Washington, D.C.",
    "New York City",
    "Israel",
    "Belgium",
    "Italy"
  ],
  "origin_agency": "Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "J. B. Adams",
    "W. R. Wannall",
    "W. O. Cregar",
    "T. S. Partiman",
    "F. S. Putman",
    "W. A. Branigan",
    "L. F. Schwartz",
    "M. R. L'Allier",
    "James J. Angleton",
    "Avraham Hermoni",
    "Zalman Mordecai Shapiro",
    "General Dayan",
    "Paul Korem",
    "Menachem Navoth"
  ],
  "recipient": "Mr. W. R. Wannall"
}