{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "This document details ongoing investigations into individuals and organizations linked to Cuba and communism. Disclosing informant information (NY T-1, NY T-2, NY T-3, Bureau Source 6) would compromise their safety and intelligence-gathering capabilities. Revealing surveillance of individuals like Richard Thomas Gibson, Frances Kelley, Leo Huberman, and Robert Williams, along with the FBI's coordination with the CIA (“According to Bureau Source 6, on 9-21-65 Richard Gibson in London contacted Robert Williams in Cuba and indicated he had received an unidentified message from Williams...CIA's operational interests in Gibson must be maintained in strictest confidence”), could jeopardize ongoing counterintelligence efforts and damage relationships with other agencies.",
  "security_level": "SECRET",
  "summary": "An FBI memorandum details investigations into Richard Thomas Gibson, Frances Kelley, and their connections to Cuban and communist activities, including Gibson's past leadership in the Fair Play for Cuba Committee and Kelley's involvement with the 'Monthly Review.' The memo reveals coordination with the CIA, which is operating Gibson as a source, and concerns regarding Gibson's contact with Robert Williams in Cuba.",
  "summary_one_paragraph": "This FBI memorandum, dated June 28, 1965, outlines investigations into Richard Thomas Gibson, formerly of the Fair Play for Cuba Committee, and Frances Kelley, associated with the 'Monthly Review,' due to their suspected involvement with Cuban and communist activities. The report details Gibson's contact with Robert Williams in Cuba, while also revealing that the CIA is actively using Gibson as an operative ('SUGAR'). It also includes information on Kelley's background, her work with Leo Huberman, and her travel between the United States, Mexico, and England. The document emphasizes the need for discretion regarding CIA's operational interest in Gibson and includes characterizations of the Fair Play for Cuba Committee and the 'Monthly Review.'",
  "tags": [
    "FBI",
    "Richard Thomas Gibson",
    "Frances Kelley",
    "Fair Play for Cuba Committee",
    "Monthly Review",
    "Cuba",
    "Communism",
    "CIA",
    "Robert Williams",
    "Lee H. Oswald"
  ],
  "title": "Richard Thomas Gibson",
  "date": "1965-06-28",
  "locations_mentioned": [
    "Cuba",
    "London, England",
    "New York, New York",
    "Mexico",
    "Algeria",
    "Accra, Ghana"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Richard Thomas Gibson",
    "Frances Kelley",
    "Leo Huberman",
    "Robert Williams",
    "Lee H. Oswald",
    "Charles A. Santos-Buch",
    "Robert Taber",
    "Vincent \"Ted\" Lee",
    "Thomas J. Dodd",
    "Paul M. Sweezy",
    "Jay Sapienza",
    "John Edward Hegarty",
    "August J. Micer",
    "Delim M. O'Brien"
  ],
  "recipient": "Director, FBI",
  "sender": "SAC, New York"
}