{
  "classification": "Martin Luther King, Jr.",
  "document_type": "Memorandum",
  "security": "Dissemination of information from NY 694-S*, a valuable informant, must be handled with extreme caution to protect their identity. The document details FBI investigations into Martin Luther King Jr. and Stanley Levison's alleged Communist affiliations, potentially jeopardizing ongoing intelligence operations and sensitive sources.",
  "security_level": "TOP SECRET",
  "summary": "FBI documents from 1962-1975 detail the investigation into Martin Luther King Jr.'s connections with Stanley Levison and alleged Communist ties, responding to requests from the Senate Select Committee on Intelligence Activities (SSC). The FBI provided materials to the SSC, including information from informants and airtels, while emphasizing the sensitivity of the sources.",
  "summary_one_paragraph": "This collection of FBI documents, dated between 1962 and 1975, outlines the Bureau's investigation into Martin Luther King Jr.'s relationships with individuals suspected of Communist affiliations, particularly Stanley Levison. Responding to requests from the Senate Select Committee on Intelligence Activities (SSC), the FBI provided various materials, including memoranda, airtels, and informant reports, while also expressing concerns about protecting sensitive sources. Key themes involve Levison's alleged secret membership in the Communist Party USA (CPUSA) and the extent of Communist influence within the Southern Christian Leadership Conference (SCLC).",
  "tags": [
    "FBI",
    "Martin Luther King Jr.",
    "Stanley Levison",
    "Communist Party USA",
    "SCLC",
    "Senate Select Committee",
    "Intelligence Activities",
    "Informant",
    "COMINFIL"
  ],
  "title": "U. S. SENATE SELECT COMMITTEE ON INTELLIGENCE ACTIVITIES (SSC)",
  "conspiracy": "The documents discuss allegations that Stanley Levison was a secret member of the Communist Party and that Martin Luther King Jr. was influenced by Communists. One document quotes Lement Harris, stating King is considered a \"true, genuine, Marxist-Leninist\" by top Communist Party officials and that Levison described King as a \"wholehearted Marxist.\" However, the document also notes conflicting information about the extent of Communist control over King's activities.",
  "date": "1975-11-20",
  "persons_mentioned": [
    "J. A. Mintz",
    "J. B. Hotis",
    "W. R. Wannall",
    "W. O. Cregar",
    "J. T. Aldhizer",
    "Frank Church",
    "Michael E. Shaheen, Jr.",
    "Martin Luther King, Jr.",
    "Stanley David Levison",
    "Hunter Pitts O'Dell",
    "Roy Levison",
    "Lement Harris",
    "Ben Davis",
    "Gus Hall",
    "Jim Jackson",
    "Claude Lightfoot",
    "James M. Kirby",
    "Francis T. Leonard",
    "Alexander C. Burlinson"
  ],
  "recipient": "The Attorney General, Director, FBI",
  "sender": "FBI"
}