{
  "classification": "Liaison",
  "document_type": "Memorandum",
  "security": "Disclosing the potential kidnapping target (child of a CIA employee) and the coordination between the FBI and CIA could compromise the safety of the individuals involved and reveal sensitive information about CIA employees. Quoting directly: 'This relates to information received from CIA indicating the possibility that the Communist Party of Venezuela may attempt to kidnap the child of a CIA employee Thomas Keogh.'",
  "security_level": "Secret",
  "summary": "An FBI memo details information received from the CIA regarding a potential kidnapping threat against the child of CIA employee Thomas Keogh by the Communist Party of Venezuela, with fingerprints and photographs of the Keogh children being collected for identification purposes.",
  "summary_one_paragraph": "This FBI memorandum, dated March 15, 1967, from I. Shroder to Mr. Rosen, outlines information received from the CIA indicating a potential threat from the Communist Party of Venezuela to kidnap the child of CIA employee Thomas Keogh. The FBI, while not conducting its own investigation, coordinated with the CIA to obtain fingerprints and photographs of Joseph Edward Keogh, Thomas Patrick Keogh, Jr., Christina Margarita Keogh, Elizabeth Teresa Keogh, Francis Xavier Keogh, Thomas Patrick Keogh, III, and Maria Rita Keogh. These materials were furnished to SA W. O. Cregar by Mrs. Jane Roman of CIA and filed for possible use in the event of a kidnapping.",
  "tags": [
    "FBI",
    "CIA",
    "Kidnapping",
    "Communist Party of Venezuela",
    "Thomas Keogh",
    "Fingerprints"
  ],
  "title": "COMMUNIST PARTY OF VENEZUELA CENTRAL INTELLIGENCE AGENCE (CIA VENEZUELA KIDNAPING",
  "date": "1967-03-15",
  "persons_mentioned": [
    "R. I. Shroder",
    "Rosen",
    "Thomas Keogh",
    "W. O. Cregar",
    "Jane Roman",
    "Joseph Edward Keogh",
    "Thomas Patrick Keogh, Jr.",
    "Christina Margarita Keogh",
    "Elizabeth Teresa Keogh",
    "Francis Xavier Keogh",
    "Thomas Patrick Keogh, III",
    "Maria Rita Keogh",
    "Thompson",
    "Sullivan",
    "Trotter",
    "Phil"
  ],
  "sender": "SHRODER, R. I. (FBI)"
}