{
  "classification": "Mexico",
  "document_type": "Intelligence Information Cable",
  "security": "Disclosing the arrest of a Mexican Federal Deputy, Cesar Del Angel Fuentes, based on information from a Mexican security officer, could strain relations with Mexico. This is due to CIA involvement in potentially sensitive internal matters. Furthermore, revealing the identity of the source, described as having 'access to information derived from investigative activities,' might compromise their safety and future intelligence gathering efforts.",
  "security_level": "Confidential",
  "summary": "An intelligence cable reports the arrest of Mexican Federal Deputy Cesar del Angel Fuentes for agitational activities in Guerrero related to the Acapulco murders.",
  "summary_one_paragraph": "This confidential intelligence cable, dated August 30, 1967, reports the arrest of Mexican Federal Deputy Cesar del Angel Fuentes by agents of the Ministry of Government (GOBERNACION) on August 28, 1967. The arrest occurred as Fuentes was leaving the home of Elena Garro de Paz, a leftist Mexican playwright, and he is being interrogated about his involvement in the 'Acapulco Murders,' stemming from a clash between rival factions of the Copra Growers' Union in Acapulco, Guerrero, that resulted in numerous deaths and injuries. The information was acquired from a Mexican security officer in Mexico City, and the FBI has unclassified all their information contained herein.",
  "tags": [
    "CIA",
    "FBI",
    "Mexico",
    "Cesar del Angel Fuentes",
    "Acapulco Murders",
    "Guerrero",
    "Elena Garro de Paz",
    "Agitational Activities",
    "Political Arrest",
    "JFK Assassination Records Act"
  ],
  "title": "Arrest of Federal Deputy Cesar del Angel Fuentes (JFK) for Agitational Activities in Guerrero",
  "date": "1967-08-30",
  "locations_mentioned": [
    "Mexico",
    "Mexico City",
    "Guerrero",
    "Acapulco",
    "Veracruz"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Cesar del Angel Fuentes",
    "Elena Garro de Paz"
  ],
  "sender": "CIA"
}