{
  "classification": "Liaison",
  "document_type": "Memo",
  "security": "This memo details sensitive collaborations between the FBI and CIA, including electronic surveillance of embassies, handling of Iron Curtain defectors, and involvement with domestic dissident groups. Revealing these activities could compromise ongoing intelligence operations and damage relationships with foreign governments. The memo also references potentially illegal activities, such as the acquisition of electronic equipment in violation of U.S. Code: “Refers to CIA proprietary interest in a legitimate Maryland electronics firm for the purpose of obtaining electronic equipment in violation of Title 18, Section 2512, U. S. Code.”",
  "security_level": "TOP SECRET",
  "summary": "FBI memorandum summarizing a CIA document that cites instances where CIA operations may have exceeded its mandate and highlighting references to the FBI, including technical support, handling of defectors, and involvement with domestic dissident groups.",
  "summary_one_paragraph": "This TOP SECRET memorandum, dated July 23, 1975, from W. O. Cregar of the FBI to W. R. Wannall, summarizes a 693-page CIA document prepared in 1973 that cites instances where CIA operations may have exceeded its mandate. The memo highlights references to the FBI within the CIA document, including various forms of technical support provided by the CIA, such as electronic coverage of embassies, handling of Iron Curtain country defectors, CIA proprietary operations used to procure technical equipment for the FBI, CIA-FBI cooperation in training related to counter-espionage, interception of mail from behind the Iron Curtain, CIA briefing and debriefing of FBI sources, and CIA involvement with domestic dissident groups. The memo also notes that the Senate Select Committee on Intelligence Activities (SSC) has had access to this document and that attempts are being made to fully identify all references for possible damage assessment.",
  "tags": [
    "FBI",
    "CIA",
    "Electronic Surveillance",
    "Defectors",
    "Domestic Dissidents",
    "Watergate",
    "Iron Curtain",
    "Espionage",
    "Intelligence Activities",
    "McCone",
    "MHDOZEN",
    "MOHAWK",
    "UNION",
    "WUGRAVEL",
    "ORKID",
    "ROSE",
    "Restless Youth",
    "Robert Vesco",
    "Foreign Broadcast Information Service",
    "Jane Fonda",
    "Ramsey Clark",
    "WESTPOINTER",
    "SPROINTER",
    "SALVAGE",
    "WUDOOR",
    "PIMPLODESTAR"
  ],
  "title": "",
  "date": "1975-07-23",
  "locations_mentioned": [
    "United States",
    "Maryland",
    "Hanoi",
    "Vietnam",
    "New York City",
    "San Francisco, California",
    "Washington, D.C.",
    "Caribbean",
    "Chile"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "W. O. Cregar",
    "W. R. Wannall",
    "J. B. Adams",
    "J. A. Mintz",
    "V. V. Kolombatovic",
    "T. J. McNiff",
    "McCone",
    "Attorney General Kennedy",
    "President Johnson",
    "Jane Fonda",
    "Ramsey Clark",
    "Robert Vesco",
    "Stokely Carmichael",
    "Belmont"
  ],
  "recipient": "W. R. Wannall",
  "sender": "W. O. Cregar"
}