{
  "classification": "Liaison",
  "document_type": "Memorandum and Teletype",
  "security": "The teletype reveals that the FBI is monitoring individuals who may be contacted by Senate or House Committees, potentially interfering with the Senate Select Committee's (SSC) investigation into intelligence activities. Quote: \"IN EVENT HE IS CONTACTED BY STAFF OF SENATE OR HOUSE COMMITTEES, HE MAY REFUSE TO BE INTERVIEWED, BUT IF HE CONSENTS TO BE INTERVIEWED HE WILL REQUEST PRESENCE OF FRI AGENT, IF QUESTIONS ARE ASKED RELATIVE TO SENSATIVE TO BUREAU OPERATIONS.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This document consists of memoranda and a teletype related to the Senate Select Committee (SSC) investigation into intelligence activities, including FBI coordination with the SSC, inquiries into historical memoranda, and monitoring individuals contacted by the SSC.",
  "summary_one_paragraph": "This collection of documents pertains to the FBI's interaction with the Senate Select Committee (SSC) investigating intelligence activities in 1975. Included are memoranda detailing the FBI's agreement to provide the SSC with a list of Intelligence Division personnel for review at FBIHQ, summaries of investigative efforts to authenticate older Hoover memoranda, and updates regarding Douglas Durham (an informant for FBI) potentially being called as a witness by Senator Frank Church's committee, and the monitoring of former FBI agents' interactions with Senate or House Committees. The documents also reference research conducted at the Franklin D. Roosevelt Library to find information related to discussions between President Roosevelt, Cordell Hull, and J. Edgar Hoover in 1936.",
  "tags": [
    "Senate Select Committee",
    "SSC",
    "FBI",
    "Intelligence Activities",
    "Hoover Memoranda",
    "Douglas Durham",
    "Frank Church",
    "Franklin D. Roosevelt Library",
    "Cordell Hull",
    "J. Edgar Hoover",
    "SENStudy 75"
  ],
  "title": "Material for Senate Select Committee (SSC) Investigating Intelligence Activities",
  "date": "1975-04-30",
  "locations_mentioned": [
    "Washington, D.C.",
    "Omaha",
    "Hyde Park, NY",
    "Alexandria, VA",
    "Mc Lean, VA",
    "CLES MEDITERRANEAN, HOTEL CARAVELLE, ST. ANNE, GUADALUPE, FRENCH",
    "Franklin D. Roosevelt Library",
    "White House",
    "Ohio",
    "Pennsylvania",
    "Maine",
    "South Dakota",
    "North Dakota"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "S. F. Phillips",
    "William Miller",
    "Douglas Durham",
    "Keith E. Uhl",
    "Frank Church",
    "W. R. Wannall",
    "W. O. Cregar",
    "James Wilderotter",
    "Alonzo L. Lacey",
    "J. A. Mintz",
    "Donald B. Schewe",
    "Franklin D. Roosevelt",
    "Cordell Hull",
    "John Edgar Hoover",
    "Tamm",
    "Mr. White",
    "J. H. Mortimer",
    "Mr. Oberg",
    "Grace Tully",
    "William P. George",
    "Harold P. Leinbaugh"
  ],
  "recipient": "Senate Select Committee (SSC)",
  "sender": "FBI"
}