{
  "classification": "Liaison",
  "document_type": "Memorandum",
  "security": "Reiterating instructions regarding Bureau Informant 100 could reveal sensitive liaison arrangements between the FBI and CIA, as well as the use of information sourced from the Israeli Intelligence Service. Disclosing that information developed by Angleton was not disseminated within CIA but passed on to the Bureau, and Dulles authorized this handling, could damage relationships and reveal internal operational practices.",
  "security_level": "Secret",
  "summary": "This memo from D.J. Brennan to W.C. Sullivan, dated March 17, 1965, reiterates instructions regarding 'Bureau Informant 100,' a procedure established in 1954 for attributing information received from James Angleton of the CIA, largely sourced from a Liaison arrangement with the Israeli Intelligence Service.",
  "summary_one_paragraph": "A memorandum from D. J. Brennan, Jr. to W. C. Sullivan, dated March 17, 1965, serves to reiterate procedures for handling information received under the designation 'Bureau Informant 100,' which originates from James Angleton at the CIA. The process, approved in 1954, allowed the FBI to attribute certain intelligence, primarily from the Israeli Intelligence Service via CIA liaison, to this informant designation. Allen Dulles authorized Angleton to disseminate this information to the Bureau, even when it was not widely shared within the CIA, and the memo recommends re-issuing instructions to field offices regarding the appropriate handling and description of this information, particularly concerning the recent development of data related to U.S. citizens traveling to Russia via Israel.",
  "tags": [
    "FBI",
    "CIA",
    "James Angleton",
    "Bureau Informant 100",
    "Israeli Intelligence Service",
    "Liaison",
    "Russia",
    "Travel",
    "U.S. Citizens"
  ],
  "title": "BUREAU INFORMANT 100 (ANGLETON)",
  "date": "1965-03-17",
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Brennan",
    "Sullivan",
    "James Angleton",
    "Allen Dulles",
    "Tolson",
    "Belmont",
    "Mohr",
    "DeLoach",
    "Casper",
    "Callahan",
    "Conrad",
    "Felt",
    "Gale",
    "Rosen",
    "Tavel",
    "Trotter",
    "Holmes",
    "Gandy"
  ],
  "recipient": "Sullivan",
  "sender": "Brennan"
}