{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "Disclosure of CIA contacts (Herbert, Maechin) and their opinions could compromise operations and sources. \"HERBERT of the CIA...informed him that CIA had separated the section in CIA which deals solely with Cuban matters.\" Also, revealing planned military build-up in Florida. \"MAECHIN iso indicated to MALONE that a military build-up can be expected in the Florida area.\"",
  "security_level": "Secret",
  "summary": "An FBI document details Michael Malone's reports on conversations with CIA contacts Herbert and Maechin, discussing U.S. policy and potential actions regarding Cuba and anti-Castro activities in 1962.",
  "summary_one_paragraph": "This FBI document, dated April 5, 1962, summarizes information provided by Michael J. P. Malone concerning anti-Castro activities and U.S. policy toward Cuba; Malone reported on conversations with CIA contacts Herbert and Charles Maechin, relaying information about a separated CIA section dealing solely with Cuban matters, disagreements with Vice President Lyndon B. Johnson's views on President Kennedy's plans for Cuba, potential military build-up in Florida and Guantanamo, and opinions regarding financial aid to Chile and encouragement for Colombia and Argentina; Malone also discussed the influence of Arthur Schlesinger and Adlai Stevenson on President Kennedy's Cuba policy, as well as recommendations to engage with Attorney General Robert F. Kennedy and Senators Humphrey and McCarthy.",
  "tags": [
    "FBI",
    "CIA",
    "Anti-Castro Activities",
    "Cuba",
    "Michael Malone",
    "Herbert (CIA)",
    "Charles Maechin (CIA)",
    "Lyndon B. Johnson",
    "John F. Kennedy",
    "Robert F. Kennedy",
    "Robert Kleberg",
    "Serafino Romualdi",
    "Arthur Schlesinger",
    "Adlai Stevenson",
    "Richard N. Goodwin",
    "Guantanamo",
    "Florida"
  ],
  "title": "",
  "date": "1962-04-05",
  "origin_agency": "FBI",
  "sender": "NY (New York Field Office, FBI) to HQ (FBI Headquarters) regarding Anti Castro Activities and IS-CUBA activities based on ReNYlet to Bureau dated 3/29/62. (JFK). Document refers to anti-Fidel Castro Activities classified by 5608 SUD/ILSR, also includes conversations from Vice-President, Czarnikow-Rionda Company, 106 Wall St., NYC, also employed by ROBERT KLEBERG of the King Ranch, Kingsville, Texas, advised on 380/62, that he had memoranda of his recent conversations in Washington, D.C., which he furnished the NYO. The memoranda of MALONE were written for ROBERT KLEBERG as a result of KLEBERG's meeting with Vice President LYNDON B. JOHNSON on 3/15/62. Also includes conversation of Malone with CIA contacts and other U.S. Government officials regarding the CUBA situation.) Based on memo that: CIA HAS NO OBJECTION TO DECLASSION AND/OR RELEAS*RMALDONECTOR, FBI (109-584) APR 5 1962 IN THIS DOOD SENT. EXCEPT BRACKETS MAG 2-27-98 SAC, NEW YORK (105-35253) 6-23-98 ANTI-FIDEL CASTRO ACTIVITIES CLASSIFIED BY 5608 SUD/ILSR DECLASSIFY ON: 25人 (JFK). Michael J. P. Malone, Vice-President, Czarnikow-Rionda Company, 106 Wall St., NYC, who is also employed by Robert Kleberg of the King Ranch, Kingsville, Texas, advised on 380/62, that he had memoranda of his recent conversations in Washington, D.C., which he furnished the NYO. The memoranda of MALONE were written for ROBERT KLEBERG as a result of KLEBERG's meeting with Vice President LYNDON B. JOHNSON on 3/15/62, Malone advised on 380/62, that he had memoranda of his recent conversations in Washington, D.C., which he furnished the NYO. The memoranda of MALONE were written for ROBERT KLEBERG as a result of KLEBERG's meeting with Vice President LYNDON B. JOHNSON on 3/15/62 with Mr. Herbert of the CIA, described as assistant to Colonel KING, and he states he believes John F. Kennedy would act in the event of a crisis in Cuba, Also mentioned is Teodoro Moscoso from the Alliance for Progress Program. Also mentioned the Attorney General ROBERT F. KENNEDY and Senators HUMPHREY and MC CARTHY from the \"New Frontier\""
}