{
  "classification": "Intelligence",
  "document_type": "Memorandum and Letters",
  "security": "Disclosing the specific intelligence targets and the nature of the relationship between the FBI, NSA, and CIA, as described in the document, could compromise ongoing intelligence operations and reveal sensitive methods of intelligence gathering. The document states: \"UNDER NO CIRCUMSTANCES SHOULD TARGETS BE IDENTIFIED, AND NO DISCUSSION SHOULD ENSUE WITH REGARD TO COVERAGE OF OR PROBLEMS ENCOUNTERED WITH COVERAGE OF NON-HOSTILE TARGETS.\" This clearly indicates that such information is considered highly sensitive.",
  "security_level": "SECRET",
  "summary": "These documents consist of letters and memoranda from the Senate Select Committee on Intelligence (SSCI) to various agency heads (FBI, CIA, Department of Defense, and Department of State) regarding U.S. counterintelligence and security programs, along with internal FBI memoranda discussing responses to SSCI inquiries, particularly focusing on the FBI's role, interagency relationships, and counterintelligence activities in locations such as West Berlin.",
  "summary_one_paragraph": "This collection includes correspondence from the Senate Select Committee on Intelligence (SSCI) to the heads of the FBI, CIA, Department of Defense, and Department of State, pertaining to U.S. counterintelligence and security programs in the late 1980s and early 1990. The letters invite agency representatives to testify at a hearing on May 10, 1990, to discuss the Administration's review of these programs, evolving threats, and resource allocation, while also posing specific questions regarding the impact of political changes in the Soviet Union and Eastern Europe, emerging threats from other nations, and technological challenges. Accompanying memoranda detail internal FBI discussions on responding to SSCI inquiries, especially concerning FBI representation in West Berlin, relationships with other intelligence agencies (NSA and CIA), and the handling of undercover operations.",
  "tags": [
    "Senate Select Committee on Intelligence",
    "Counterintelligence",
    "Security Programs",
    "FBI",
    "CIA",
    "Department of Defense",
    "Department of State",
    "West Berlin",
    "Interagency Cooperation",
    "Technology Transfer",
    "Undercover Operations"
  ],
  "title": "Senate Select Committee on Intelligence Inquiries and FBI Internal Discussions on Counterintelligence Programs",
  "date": "1990-02-07",
  "locations_mentioned": [
    "Washington, D.C.",
    "Soviet Union",
    "Eastern Europe",
    "PRC (People's Republic of China)",
    "Cuba",
    "West Berlin",
    "New York"
  ],
  "origin_agency": "Senate Select Committee on Intelligence (SSCI) and Federal Bureau of Investigation (FBI)",
  "persons_mentioned": [
    "David L. Boren",
    "James A. Baker III",
    "William S. Sessions",
    "William H. Webster",
    "Dick Cheney",
    "Ivan Selin",
    "Ted Price",
    "Gardner Hathaway",
    "Rich Haver",
    "George J. Tenet",
    "James H. Dykstra",
    "L. Britt Snider",
    "Kathleen P. McGhee",
    "John Eliff",
    "John S. Hooks, Jr.",
    "Roland O. L'Allier, Jr.",
    "Martin V. Hale",
    "Allan Kornblum",
    "Jeff Smith",
    "Sam Nunn",
    "S. M. McWeeney"
  ],
  "recipient": "James A. Baker III, William Sessions, William H. Webster, Dick Cheney",
  "sender": "David L. Boren, M. V. Hale"
}