{
  "classification": "Security",
  "document_type": "Memo",
  "security": "Several sections detail sensitive intelligence operations, including surveillance of journalists (Project Mockingbird, GELOTEX I, MUDHEN), covert recruitment and security clearance support to the Bureau of Narcotics and Dangerous Drugs, mail intercepts (SRPOINTER), and physical penetrations (REDFACE). The revelation of these operations could severely compromise intelligence sources, methods, and relationships with other agencies. Examples of this are included in the following quotes: \"This operation included not only the photographing of envelopes but also surreptitious opening and photographing of selected items of mail\" and \"This has been accomplished through the medium of a proprietary of the Office of Security [REDACTED]operating in [REDACTED] Falls Church, Virginia. Support includes covert recruitment, investigation, polygraph, medical clearance, and training.\"",
  "security_level": "SECRET",
  "summary": "This document contains various memoranda and reports detailing CIA activities, including support to the Secret Service for national conventions, investigations into leaks of classified information, the MHCHAOS program, corporate cover operations, and sensitive security operations like surveillance of journalists and mail intercepts.",
  "summary_one_paragraph": "This collection of memoranda and reports from 1972-1975 covers a range of CIA activities, including agency support to the U.S. Secret Service for the Democratic and Republican National Conventions, investigations into information leaks (such as those related to the SALT talks), details on the MHCHAOS program for collecting information on foreign-supported U.S. extremism, and the use of corporate and devised facilities for cover. It also discusses sensitive security operations, including surveillance of journalists (Project Mockingbird, GELOTEX I, MUDHEN), support to law enforcement agencies, mail intercepts (SRPOINTER), and the handling of Soviet defectors. One memorandum also highlights concerns about an ex-employee's contact with a Cuban national and potential security breaches.",
  "tags": [
    "CIA",
    "Secret Service",
    "National Conventions",
    "MHCHAOS",
    "Corporate Cover",
    "Security Operations",
    "Surveillance",
    "Project Mockingbird",
    "Mail Intercept",
    "Soviet Defector",
    "Counter Intelligence",
    "Internal Security",
    "Information Leak",
    "BNDD",
    "Polygraph"
  ],
  "title": "Various Memoranda and Reports on CIA Activities",
  "conspiracy": "The document references \"Project Mockingbird, a telephone intercept activity... targeted two Washington-based newsmen\" who were publishing articles based on classified materials. The document claims the purpose of Mockingbird was to identify the newsmen's contacts and their method of operation to help determine the source of classified information, suggesting an effort to control media access to certain information.",
  "date": "1973-05-11",
  "locations_mentioned": [
    "Miami",
    "Caribbean",
    "Latin America",
    "Cuba",
    "United States",
    "Washington, D.C.",
    "Fairfax City, Virginia",
    "New York City",
    "Detroit",
    "Silver Spring, Maryland",
    "Falls Church, Virginia"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "John F. Kennedy",
    "Deborah Fitzgerald",
    "Orlando Toro Nunez",
    "Vice-President Agnew",
    "John Dean",
    "Robert Mardian",
    "William Olsen",
    "Director Helms",
    "Robert Kennedy",
    "Robert McNamara",
    "Joseph Carroll",
    "Marshall S. Carter",
    "Lyman Kirkpatrick",
    "Lawrence Houston",
    "Bruce Solie",
    "Iden 69",
    "Iden 180",
    "Jack Anderson",
    "Britt Hume",
    "Leslie Whitten",
    "Joseph Spear",
    "Victor L. Marchetti",
    "Gerard Smith",
    "W. R. Wannall",
    "J. Cochran, Jr.",
    "R. J. Gallagher",
    "W. Wegar",
    "W. A. Branigan",
    "A. B. Fulton",
    "J. G. Deegan",
    "R. L. Shackelford",
    "F. S. Putman",
    "J. W. Redfield",
    "T. J. McNiff",
    "Sheffield Edwards",
    "John A. McCone",
    "Rufus Taylor",
    "Chuck Briggs",
    "Angleton",
    "Bill Sullivan",
    "Hoover",
    "Ehrlichman"
  ],
  "recipient": "Executive Director/Comptroller, Deputy Director for Operations, Deputy Director for Management & Services",
  "sender": "James Angleton, Chief, Counter Intelligence Staff"
}