{
  "classification": "Liaison",
  "document_type": "Memo",
  "security": "This document details sensitive intelligence operations and sources, including penetrations of Soviet and Czech intelligence services (TOPHAT R, GIMME(S), FEDORA). It describes cooperative arrangements between the FBI and CIA regarding Soviet and Satellite nationals, Cuban sources, and technical data. Disclosing these details could compromise sources, methods, and ongoing investigations. Specific examples include: 'We have furnished CIA information from our sensitive Communist Party source...This information has been most valuable to CIA...' and 'CIA did an excellent job of servicing drops in Moscow in this very sensitive case.'",
  "security_level": "Secret",
  "summary": "This memo from Brennan to Sullivan, dated September 11, 1963, outlines the status of FBI-CIA relations, including past conflicts and numerous instances of cooperation, such as sharing sensitive sources and technical data.",
  "summary_one_paragraph": "The memo, addressed from Brennan to Sullivan on September 11, 1963, details the complex relationship between the FBI and CIA, noting that while complete harmony is absent, effective working relations have been established with key CIA figures. It highlights past conflicts, like CIA's delayed notification about a Cuban exile trained as an intelligence agent and a dispute over information disseminated to the President's Foreign Intelligence Advisory Board. The memo also lists examples of excellent cooperation, including intelligence sharing from sensitive sources penetrating Soviet, Czech, and KGB operations, as well as technical support and collaborative efforts in counterintelligence activities. Additionally, it mentions potential topics for discussion with J. McCone, such as the Jack Edward Dunlap case, personnel security, and coverage of non-Soviet bloc diplomatic establishments.",
  "tags": [
    "FBI",
    "CIA",
    "Liaison",
    "Intelligence Sharing",
    "Counterintelligence",
    "Soviet",
    "Czech",
    "KGB",
    "Cooperation",
    "Conflicts",
    "McCone",
    "Security"
  ],
  "title": "CIA Liaison File",
  "date": "1963-09-11",
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Brennan",
    "Sullivan",
    "J. McCone",
    "Belmont",
    "Alwin Odio Tamayo",
    "Jack Edward Dunlap",
    "Oleg Penkovsky",
    "Anatoli Golitzyn",
    "Anatoli Klimov",
    "Michal Goleniewski",
    "Clark Clifford",
    "J. Patrick Coyne",
    "Stig Wennerstrom",
    "John S. Barescu",
    "Franz Froehlich",
    "De Gaulle"
  ],
  "recipient": "Sullivan",
  "sender": "Brennan"
}