{
  "classification": "Cuba",
  "document_type": "Index Cards",
  "security": "This document discusses Operation Mongoose, including the contamination of POL (petroleum, oil, and lubricants) supplies for Cuba and potential assassination plots. This could expose sensitive operational details and past covert actions. Quote: \"CIA has initiated action to contaminate POL supplies for Cuba...\" and \"the term 'assassinate' was used in the discussion of A.M. LASH's future role in Cuba...\"",
  "security_level": "TOP SECRET",
  "summary": "This document consists of index cards summarizing information related to Operation Mongoose, CIA activities against Castro, and discussions of assassination plots. It references various individuals involved and specific actions undertaken.",
  "summary_one_paragraph": "This collection of index cards from June and July 1975 summarizes various aspects of Operation Mongoose, focusing on CIA activities against Fidel Castro's regime in Cuba during the early 1960s. The cards reference individuals like Richard Helms, General Lansdale, William Harvey, and A.M. Lash, and detail activities ranging from the contamination of Cuban fuel supplies to discussions about the potential assassination of Castro. The documents also include references to CIA attempts to create the illusion of a popular movement to justify overt actions and efforts to disrupt Cuban economic activities like oil deliveries and bus sales.",
  "tags": [
    "SSCIA",
    "JFK Assassination Records Act",
    "Operation Mongoose",
    "Castro",
    "CIA",
    "Helms",
    "Lansdale",
    "Assassination",
    "Cuba",
    "Index Cards"
  ],
  "title": "Index Cards",
  "date": "1975-06-00",
  "persons_mentioned": [
    "Castro, Al",
    "Helms, Richard",
    "Lansdale",
    "McNamara",
    "McCone",
    "Wainwright, William",
    "Tepedino, Carlos",
    "Williamson, Earl",
    "Lash, A. M.",
    "Kirkpatrick",
    "Harvey, William",
    "Elder, Walter",
    "Halpern",
    "Cheever",
    "Gilpatrick",
    "Wilson, Don",
    "Edwards",
    "King",
    "Bannerman",
    "Gomez",
    "Holcomb",
    "O'Connell"
  ],
  "sender": "SSCIA (Senate Select Committee on Intelligence Activities )"
}