{
  "classification": "Security",
  "document_type": "Memo",
  "security": "This memorandum reveals sensitive CIA activities, including technical operations like wiretaps and bugging, surveillance operations against US citizens (including newsmen), and cooperation with local police departments that blurs the lines between intelligence gathering and law enforcement. This could compromise ongoing investigations and expose sensitive relationships with local law enforcement. For example, \"It would appear that the Washington Field Office did conduct much, if not most, of the physical and technical surveillance directed against American citizens subsequent to 1968.\" Also, \"Most disturbing is the incident where CIA agents assisted MPD officers in a bona fide police surveillance (a law enforcement function), but this seems to have been an isolated case.\"",
  "security_level": "SECRET/SENSITIVE",
  "summary": "James N. Roethe's memorandum summarizes further information obtained from George Brewer regarding the CIA's Washington Field Office activities, including technical operations, surveillance operations, assistance to local police, and interactions with dissident groups.",
  "summary_one_paragraph": "This memorandum, dated February 24, 1975, documents James N. Roethe's interview with George Brewer, focusing on the activities of the CIA's Washington Field Office. Brewer provides details on technical operations involving wiretaps and bugging, surveillance of employees, former employees, and newsmen, assistance given to local police departments, and CIA monitoring of peace and anti-war demonstrations. The document reveals instances of CIA agents assisting local police in law enforcement functions and the use of local police facilities for CIA training, highlighting the extent of cooperation between the CIA and local law enforcement agencies.",
  "tags": [
    "CIA",
    "Washington Field Office",
    "George Brewer",
    "Technical Operations",
    "Surveillance Operations",
    "Local Police Assistance",
    "Dissident Groups",
    "Wiretaps",
    "Bugging",
    "Police Cover",
    "Project SIESTA",
    "Project PARAGON",
    "SSCI",
    "James N. Roethe"
  ],
  "title": "Further Info Obtained From Brewer, George",
  "date": "1975-02-24",
  "locations_mentioned": [
    "Washington, D.C.",
    "Miami",
    "Los Angeles",
    "Bethesda, Maryland",
    "New York",
    "Detroit",
    "Champaign, Illinois",
    "Arlington",
    "Lewes, Delaware",
    "Virginia",
    "Maryland"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "George Brewer",
    "James N. Roethe",
    "Jack Cryer",
    "Hal Tittsler",
    "Bill Simpson",
    "President Johnson",
    "Golitzen",
    "Paul Garble",
    "John Briggman",
    "Colonel Durner",
    "Assistant Chief Hughes",
    "Chief Watson",
    "John Hutchinson",
    "Charles Kane",
    "Marvin Gentile",
    "John Noble",
    "Ed Klippa",
    "Director Helms",
    "Vice President Agnew",
    "Jack Anderson",
    "Les Whitten",
    "Joe Spear",
    "Michael Getler",
    "Director McCone",
    "Captain George Suter",
    "Director Schlessinger",
    "Ed Sayle",
    "Inspectors R. L. Dollard",
    "William Foran",
    "Sigt Brandari",
    "Inspector Thrallkili",
    "Lt. Glazer",
    "Osborn"
  ],
  "recipient": "File",
  "sender": "Roethe, James N."
}