{
  "classification": "Cuba",
  "document_type": "Index Cards",
  "security": "These records outline potential policy questions regarding activities in Phase II of Operation MONGOOSE, including balloon operations, radio broadcasts, sabotage, attacks on agriculture, and actions involving Cuban exiles. The document details discussions about agricultural sabotage using biological agents that would appear of natural origin, as well as activities against Castro. Exposing these plans could be highly damaging by revealing the extent to which the U.S. government considered and planned covert actions to destabilize Cuba.",
  "security_level": "TOP SECRET",
  "summary": "This document contains index cards referencing memos and meeting minutes related to Operation MONGOOSE, covering discussions and activities from July to October 1962, including sabotage, psychological operations, and potential policy questions.",
  "summary_one_paragraph": "This collection of index cards references various documents related to Operation MONGOOSE, a covert operation against Cuba in 1962. The cards summarize memos and meeting minutes from July to October 1962, detailing discussions on psychological activities, sabotage, and intelligence collection efforts. Key figures like Lansdale, McCone, Bundy, and Helms are mentioned, along with specific activities like agricultural sabotage and actions involving Cuban exiles. The documents highlight the intensity of the operation, the pressure to remove Castro, and potential policy questions related to the execution of the operation's various phases.",
  "tags": [
    "Operation MONGOOSE",
    "Castro",
    "SSCIA",
    "Covert Operations",
    "Sabotage",
    "Psychological Warfare"
  ],
  "title": "Index Cards",
  "conspiracy": "The document does not directly address the JFK assassination. However, it does refer to a report from Helms stating \"The pressure led to several very nutty schemes,\" in reference to Operation Mongoose.",
  "date": "1975-06-00",
  "locations_mentioned": [
    "Cuba",
    "Latin American countries"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Castro",
    "Lansdale",
    "Taylor",
    "Johnson",
    "Gilpatrick",
    "McCone",
    "RFK",
    "Lemnitzer",
    "Rusk",
    "McNamara",
    "Harvey",
    "Bundy",
    "Helms",
    "Kirkpatrick",
    "Cheever",
    "Elder",
    "Murrow",
    "Carter",
    "Wilson",
    "Huston",
    "Ryan",
    "Halpern",
    "Patchel",
    "Hurwitch"
  ]
}