{
  "classification": "Commission",
  "document_type": "Transcript",
  "security": "This document is a transcript of a Senate Select Committee hearing, marked TOP SECRET. Releasing the details of discussions regarding intelligence activities, such as covert use of media organizations and personnel, could expose ongoing or planned operations, compromise intelligence sources, and damage relationships with media entities.",
  "security_level": "TOP SECRET",
  "summary": "A transcript from a March 10, 1976, Senate Select Committee hearing discussing the covert use of media and academics by the CIA, including prohibitions on unattributed distribution of CIA-funded publications and the operational use of American media organizations.",
  "summary_one_paragraph": "This document is a Top Secret transcript from a United States Senate Select Committee hearing held on March 10, 1976, focusing on governmental operations related to intelligence activities. The committee, led by Senator Huddleston, discusses recommendations regarding the covert use of books, publishing houses, academics, and U.S. journalists by the CIA. Key topics include prohibiting the unattributed distribution of CIA-funded publications within the United States, restricting the operational use of educational and cultural grantees, and extending prohibitions to cover all American individuals and media organizations, even those operating in foreign media contexts. Committee members debate whether these prohibitions should be enforced through internal directives or by statute, considering the potential impact on intelligence collection and the rights of American citizens.",
  "tags": [
    "SSCIA",
    "Church Committee",
    "Covert Operations",
    "CIA",
    "Media",
    "Academics",
    "Propaganda",
    "Committee Business",
    "SSCSGO",
    "Methodology"
  ],
  "title": "Senate Select Committee to Study Governmental Operations With Respect to Intelligence Activities Hearing",
  "date": "1976-03-10",
  "persons_mentioned": [
    "Walter D. Huddleston",
    "Gary Hart",
    "William G. Miller",
    "David Aaron",
    "Joseph diGenova",
    "Lynn Davis",
    "William Bader",
    "Elizabeth Culbreath",
    "Charles Kirbow",
    "Rick Inderfurth",
    "Pat Shea",
    "Elliot Maxwell",
    "Al Quanbeck",
    "John McCloy",
    "Art Buchwald",
    "Senator Tower"
  ],
  "recipient": "Senate Select Committee to Study Governmental Operations With Respect to Intelligence Activities",
  "sender": "SSCIA"
}