{
  "classification": "JFK Assassination",
  "document_type": "Transcript",
  "security": "This document discusses counterintelligence methodologies, including penetration of foreign intelligence services and the handling of defectors. Specifically, it describes instances where the CIA acted without informing other agencies, even concealing information from them to protect operations. Disclosure of these practices could reveal sensitive operational details and compromise relationships with foreign intelligence services. For instance, Angleton states, \"With the added fact that we did not disclose all of the facts, nor identity.\" ",
  "security_level": "Top Secret",
  "summary": "A transcript of a hearing before the Senate Select Committee to Study Governmental Operations with Respect to Intelligence Activities on January 22, 1976, featuring testimony from James Angleton and Scotty Miler regarding CIA counterintelligence methodologies and changes within the agency.",
  "summary_one_paragraph": "This document is a transcript from a Senate Select Committee hearing in 1976, featuring James Angleton and Scotty Miler discussing CIA counterintelligence practices. They detail changes since 1973, including decentralization, curtailed research, and altered record procedures, arguing that these changes have increased the risk of penetration by foreign intelligence services. Angleton and Miler also address criticisms about information control during their tenure and describe instances where the CIA conducted counterespionage activities without informing other agencies, including the FBI, sometimes requiring approval from the White House or Attorney General.",
  "tags": [
    "SSCIA",
    "Hearings",
    "Angleton, James",
    "Miler, Scotty",
    "CIA",
    "Methodology",
    "Defectors",
    "FBI",
    "Counterintelligence",
    "Transcript",
    "Top Secret",
    "Decentralization",
    "Penetration",
    "Espionage",
    "Soviet",
    "DeGaul",
    "Helms",
    "Hoover",
    "Vassil",
    "Vlasov"
  ],
  "title": "Hearing on CIA Counterintelligence Methodologies",
  "date": "1976-01-22",
  "locations_mentioned": [
    "Washington, D.C.",
    "London",
    "Italy",
    "China",
    "Japan",
    "Thailand",
    "Philippines",
    "Ethiopia",
    "Germany",
    "France",
    "Soviet Union",
    "United States"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Angleton, James",
    "Miler, Scotty",
    "Hart, Gary",
    "Schweiker",
    "Miller, William G.",
    "DiGenova, Joseph",
    "Kirbow, Charles",
    "Johnston, Jim",
    "Snider, Brict",
    "Johnson, Loch",
    "Maxwell, Elliot",
    "Culbreath, Elizabeth",
    "Kelley, Bob",
    "Epstein, Michael",
    "Inderfurth, Rick",
    "Lombard, Charles",
    "Shea, Pat",
    "McCone",
    "Kennedy, President",
    "DeGaul",
    "Helms",
    "Hoover",
    "Vassil",
    "Vlasov"
  ],
  "sender": "ANGLETON, JAMES; MILER, SCOTTY"
}