{
  "classification": "Commission",
  "document_type": "Report",
  "security": "This document reveals sensitive details about covert CIA operations, including assassination plots, and discussions about potentially illegal activities. Disclosing specifics about these operations, the individuals involved, and the methods used could expose classified intelligence activities, compromise ongoing or future operations, and damage the CIA's reputation. Quoting directly: 'The Committee has received solid evidence of a CIA plot to assassinate Patrice Lumumba... instruments specifically intended for use in an assassination were placed in the hands of the CIA Chief of Station'.",
  "security_level": "TOP SECRET",
  "summary": "This is the Senate Select Committee Assassination Report (updated October 16, 1975), it details covert actions, including plots to assassinate foreign leaders such as Patrice Lumumba, and discusses the extent of authorization within the CIA and US government for these operations.",
  "summary_one_paragraph": "The Senate Select Committee Assassination Report, updated on October 16, 1975, is a comprehensive document spanning 678 pages, that covers a wide array of subjects related to assassinations. Topics include covert actions as a vehicle for foreign policy implementation, with specific focuses on Cuba, the Congo, the Dominican Republic, Chile, and South Vietnam. The report also details executive action capabilities and presents findings, conclusions, and recommendations. Notably, the report contains evidence of a CIA plot to assassinate Patrice Lumumba, revealing the delivery of lethal substances to the Chief of Station in Leopoldville and discussions about authorization for the assassination within the US government.",
  "tags": [
    "SSCIA",
    "Assassination Report",
    "Covert Action",
    "Cuba",
    "Congo",
    "Dominican Republic",
    "Chile",
    "South Vietnam",
    "Executive Action",
    "Patrice Lumumba",
    "CIA",
    "Assassination Plot",
    "TOP SECRET",
    "Gottlieb"
  ],
  "title": "Select Committee: Assassination Report (Updated Oct 16, 1975)",
  "allies": "The report discusses U.S. interventions and covert actions in foreign countries, including potential violations of sovereignty and ethical considerations in relation to allied nations or international agreements. Revealing the extent of U.S. involvement in such activities and its disregard for international norms could harm diplomatic relations and undermine trust with allies.",
  "conspiracy": "This report details a CIA plot to assassinate Patrice Lumumba, including the delivery of lethal substances and discussions about the authorization for the assassination. Although the plot was not successful, the report suggests that there was no direct evidence linking the CIA assassination plot to the events that actually led to Lumumba's death, but also indicates that the assassination operation was not terminated before Lumumba's death.",
  "date": "1975-09-01",
  "persons_mentioned": [
    "Patrice Lumumba",
    "Allen Dulles",
    "Richard Bissell",
    "Bronson Tweedy",
    "Sidney Gottlieb",
    "President Eisenhower",
    "Fidel Castro",
    "Raul Castro",
    "Che Guevara",
    "Mobutu",
    "Gizenga",
    "Mulele",
    "Kasavubu"
  ],
  "sender": "SSCIA (Senate Select Committee on Assassinations report - document information implies originator and author are the same.)"
}