{
  "classification": "Assassination",
  "document_type": "Transcript/Report of Proceedings/and Exhibits",
  "security": "Revealing details about discussions of assassination plots, even if hypothetical, and naming individuals involved (Colonel Pash, Artie Lazarus, Tracy Barnes, John Baker) could expose sensitive intelligence operations and compromise individuals. Quoting directly: \"Colonel Pash with the idea in mind of seeing if an assassination or a kidnapping couldn't be arranged?\", \"the function, if indeed it existed...was centralized or focused in Colonel Pash and Artie Lazarus.\"",
  "security_level": "TOP SECRET",
  "summary": "This document is a transcript of a Senate Select Committee hearing featuring the testimony of E. Howard Hunt concerning his inquiries into the possibility of CIA involvement in assassinations, specifically his contact with Colonel Boris Pash and others regarding the potential liquidation of a suspected double agent.",
  "summary_one_paragraph": "On January 10, 1976, E. Howard Hunt testified before the Senate Select Committee to Study Governmental Operations With Respect to Intelligence Activities, detailing his investigation into whether the CIA had personnel capable of carrying out assassinations. Hunt described his approach to Colonel Boris Pash, who he believed headed a unit specializing in \"wet affairs\" (assassinations, kidnappings), to explore the possibility of liquidating a suspected double agent in the Albanian branch, although the plan never materialized. The testimony identifies several individuals who may have been aware of Pash's alleged capabilities, organizational structures within the CIA related to these matters, and the context of Hunt’s inquiries within the broader political and psychological operations of the agency.",
  "tags": [
    "E. Howard Hunt",
    "Boris Pash",
    "Assassination",
    "Senate Select Committee",
    "CIA",
    "Albanian Branch",
    "Double Agent",
    "Top Secret",
    "Frederick D. Baron",
    "Howard Liebengood",
    "King Zog"
  ],
  "title": "Transcript/Report of Proceedings/and Exhibits as Listed - Testimony of E. Howard Hunt",
  "conspiracy": "Hunt's testimony explores potential CIA capabilities for assassination and mentions an alleged unit run by Colonel Pash that specialized in 'wet affairs.' While not directly related to the JFK assassination, the document reveals discussions and inquiries within the CIA about assassination as a potential operational tool, which could be contextually relevant to understanding potential motives or actors involved in the JFK assassination.",
  "date": "1976-01-10",
  "persons_mentioned": [
    "E. Howard Hunt",
    "Frederick D. Baron",
    "Howard Liebengood",
    "Randall C. Coleman",
    "Boris Pash",
    "Artie Lazarus",
    "Tracy Barnes",
    "John Baker",
    "Charles English",
    "John Richardson",
    "Milton Buffington",
    "Lewis W. Thompson",
    "Gates Lloyd",
    "Harold Burris Meyer",
    "Cord Myer, Jr.",
    "Tom Braden",
    "Peter Sichel",
    "Jim Angleton",
    "William Harvey",
    "Richard Bissell",
    "Frank Wisner",
    "Richard Helms",
    "General Cushman",
    "Joseph Bryan",
    "Dong Blaufarb",
    "Kim Philby",
    "King Zog"
  ],
  "recipient": "Senate Select Committee to Study Governmental Operations With Respect to Intelligence Activities",
  "sender": "SSCIA"
}