{
  "classification": "Commission",
  "document_type": "Testimony/Report of Proceedings with Exhibits",
  "security": "This document contains testimony regarding CIA operations and relationships with other agencies and proprietary companies. Disclosing details about the insurance companies used for covert operations ('we needed our own insurance business, and we started by buying two very small off-shore insurance companies, and started writing death and health policies') could compromise sensitive methods and sources. It also discusses potential conflicts of interest regarding investment decisions and the use of economic intelligence.",
  "security_level": "TOP SECRET",
  "summary": "This document is a testimony/report of proceedings with exhibits from August 12, 1975, concerning the testimony of Lawrence Houston regarding the CIA and Castro, and includes information about the CIA's relationship with various administrative agencies, proprietary companies like MH MUTUAL, and insurance operations.",
  "summary_one_paragraph": "On August 12, 1975, Lawrence Houston provided testimony concerning the CIA's involvement with Castro, relationships with administrative agencies, and operations of proprietary companies such as MH MUTUAL. The testimony discusses the establishment and management of offshore insurance companies to cover covert operations, interactions with outside investment counsel and banks for managing funds, and potential conflicts of interest related to investment decisions. It also touches on the agency's economic intelligence gathering and the use of such information in investment strategies, as well as the financial sources for these operations, which initially came from reprogrammed operational funds.",
  "tags": [
    "SSCIA",
    "Lawrence Houston",
    "CIA",
    "Castro",
    "MH MUTUAL",
    "Insurance Operations",
    "Proprietary Companies",
    "Investment Decisions",
    "Economic Intelligence",
    "Covert Operations"
  ],
  "title": "Testimony/Report of Proceedings with Exhibits",
  "date": "1975-08-12",
  "persons_mentioned": [
    "Lawrence Houston",
    "Castro",
    "Wides",
    "Maxwell",
    "Kilham",
    "Joost",
    "Dennis Fleming",
    "Justin O'Donnell",
    "Wiesner",
    "Kirkpatrick",
    "Allen Dulles",
    "Colonel Rack",
    "Mrs. Thunberg",
    "John Keaney"
  ],
  "recipient": "SSCIA",
  "sender": "SSCIA"
}