{
  "classification": "Commission",
  "document_type": "Transcript",
  "security": "This document reveals discussions of internal committee deliberations and potential policy decisions regarding the use of academics and grantees in intelligence operations, including foreign students and military personnel. Disclosing these discussions could harm the agency’s ability to conduct covert operations.",
  "security_level": "TOP SECRET",
  "summary": "This is a transcript of a Senate Select Committee meeting from March 25, 1976, discussing proposed restrictions on the CIA's operational use of academics and grantees, including those in foreign exchange programs, and debating the extent to which military training programs should be exempt.",
  "summary_one_paragraph": "The transcript details a meeting of the Senate Select Committee to Study Governmental Operations with Respect to Intelligence Activities (SSCIA) on March 25, 1976, where senators debated recommendations concerning the CIA's relationship with academics and foreign grantees. Discussions centered on whether to restrict the recruitment of foreign students and grantees, the use of US-sponsored programs for operational purposes, and whether to create exceptions for military personnel. Senators considered the vulnerability of grantees, the integrity of government-sponsored programs, and potential abuses while trying to balance intelligence-gathering needs with ethical considerations.",
  "tags": [
    "SSCSGO",
    "Methodology",
    "Committee Business",
    "Church Committee",
    "CIA",
    "Academics",
    "Foreign Grantees",
    "Intelligence Activities",
    "Restrictions"
  ],
  "title": "Senate Select Committee to Study Governmental Operations With Respect to Intelligence Activities Hearing, March 25, 1976",
  "date": "1976-03-25",
  "locations_mentioned": [
    "Washington, D.C.",
    "United States",
    "Fort McNair",
    "Fort Knox, Kentucky"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Frank Church",
    "Mondale",
    "Huddleston",
    "Hart of Michigan",
    "Morgan",
    "Hart of Colorado",
    "Tower",
    "Mathias",
    "Baker",
    "Schweiker",
    "William G. Miller",
    "Frederick A. O. Scwharz, Jr.",
    "Charles Kirbow",
    "Elizabeth Culbreath",
    "Michael Madican",
    "Charles Lombard",
    "William Bader",
    "Ted Rolson",
    "Burt Wides",
    "Walter Ricks",
    "Rick Inderfurth",
    "John Bayly",
    "David Aaron",
    "Elliot Maxwell",
    "Joseph Dennin",
    "Margaret Carpenter",
    "Martha Talley",
    "Paul Wallach",
    "Jim Johnston",
    "Fulbright",
    "Senator Goldwater"
  ],
  "recipient": "N/A",
  "sender": "SSCIA"
}