{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "The memo from Bowman to Bundy on 12 November 1964 discusses a “contemptable proposal intiated by the Army to use germ warfare against Cuban sugar and livestock.” Bowman and Bundy agreed the White House should \"remain aloof from formal consideration of 'Square Dance' at this stage.\" Exposing such a plan would be highly damaging to U.S. foreign relations and reputation.",
  "security_level": "Unclassified",
  "summary": "This document is a summary of documents retrieved from the LBJ Library concerning US policy and actions toward Cuba, including covert actions, assassination plots, and discussions within the Johnson administration.",
  "summary_one_paragraph": "A memorandum from Loch Johnson (SSCIA) to Senior Staff, dated July 21, 1975, summarizes documents retrieved from the LBJ Library related to Cuban policy and covert actions. The documents detail discussions within the Johnson administration about Castro, covert actions against Cuba, including CIA activities, sabotage plans, assassination plots, and the views of key figures like Bundy, Rusk, McNamara, and McCone on these matters. It also covers the US government's awareness of plans by Cuban exiles and the Cosa Nostra to assassinate Castro and a proposal to use germ warfare against Cuban sugar and livestock.",
  "tags": [
    "Castro",
    "Covert Action",
    "Cuba",
    "LBJ Library",
    "Assassination Plots",
    "Exile Groups",
    "Germ Warfare"
  ],
  "title": "SUMMARY OF DOCUMENTS RETRIEVED FROM LBJ LIBRARY",
  "conspiracy": "The document includes a memo from Helms, DDP, to DCI, 10 June 1961, regarding \"Plans of Cuban Exiles to Assassinate Selected Cuban Government Leaders\", in which the CIA was made aware of certain plans to kill Castro. It also details a Cosa Nostra offer to assassinate Castro for $150,000, which could be related to plots surrounding JFK's assassination.",
  "date": "1975-07-21",
  "persons_mentioned": [
    "Castro",
    "Lyndon B. Johnson",
    "Bundy",
    "Rusk",
    "Ed Martin",
    "McNamara",
    "McCone",
    "Helms",
    "Desmond FitzGerald",
    "Don Wilson",
    "Chase",
    "John Crimmins",
    "Manuel Artine",
    "Manolo Ray",
    "Alexis Johnson",
    "Byron Cameron",
    "Julio Lobo Olavarria",
    "Tom Mann",
    "Peter Jessup",
    "Tommy Thompson",
    "Cy Vance",
    "Raborn",
    "Rostow",
    "Karamessines",
    "Dave Phillips",
    "W.G. Bowdler",
    "Grant Hilliker",
    "R.C. Bowman"
  ],
  "sender": "JOHNSON, LOCH"
}