{
  "classification": "Security",
  "document_type": "Memo",
  "security": "The document reveals details of a covert operation involving the use of individuals to satisfy the desires of a foreign head of state during an official visit. Disclosing such operations, especially the use of a 'controlled source' and a 'prominent Los Angeles figure' to arrange a party and introduce a 'screen and stage actress,' could severely damage the CIA's reputation and compromise future operations. Additionally, the document describes how the actress was transported to a 'confidential meeting place' and met with the foreign official each evening. The discussions about publicity and the actress's interactions with security representatives could be sensitive. Quoting directly: 'was asked to arrange a party...This was done by Mr. Maheu through Mr. Bautzer...the foreign official was Introduced to a screen and stage actress...arrangements were made to rent the home of an Office of Security source...the actress discussed the publicity in the case at some length with the Security representatives.'",
  "security_level": "SECRET",
  "summary": "A CIA Office of Security memorandum details the arrangements made to accommodate a foreign Head of State's request for female companionship during an official visit to Los Angeles and New York in 1959.",
  "summary_one_paragraph": "This memorandum, dated 1959, describes the Office of Security's involvement in arranging a party and securing female companionship for a visiting foreign Head of State during his stay in Los Angeles and New York. Robert Maheu and Gregson Bautzer were enlisted to arrange a party in Los Angeles where the foreign official met a screen actress. Subsequently, a confidential meeting place was secured in Long Beach, Long Island, to continue the relationship during the New York leg of the visit, with State Department Security Agents, a New York City police lieutenant and hired chauffeur facilitating the meetings. The actress and the foreign official met each evening and remained for about four to five hours, but Maheu was kept at arm's length.",
  "tags": [
    "CIA",
    "Robert Maheu",
    "Office of Security",
    "Gregson Bautzer",
    "Foreign Head of State",
    "Covert Operation",
    "Female Companionship",
    "Los Angeles",
    "New York",
    "1959"
  ],
  "title": "Robert Maheu",
  "date": "1959-04-03",
  "locations_mentioned": [
    "Los Angeles, California",
    "New York City",
    "Long Beach, Long Island"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Robert Maheu",
    "Gregson Bautzer",
    "Foreign Head of State"
  ],
  "recipient": "Office of Security",
  "sender": "CIA"
}