{
  "classification": "Commission",
  "document_type": "List of Material",
  "security": "Potentially sensitive information includes references to CIA covert activities, assassination plots, and intelligence exploitation of the United Nations. Releasing details about these activities could damage the CIA's reputation and compromise intelligence operations. Examples: Discussions of ways to assassinate. C-X-12 TOP SEC Memorandum/Meeting with (IMDECK 4, February 16, 1961 2 (IMDECK the 'King pin of the plot.'",
  "security_level": "T",
  "summary": "This document is a list of materials contained in the Rockefeller Commission file, including phone interviews, memoranda, letters, and notes related to various subjects such as gun passage, poison pills, NSC documents, plots to assassinate Castro, Cuban operations, Dominican Republic operations, and CIA activities.",
  "summary_one_paragraph": "This document, dated October 7, 1993, is a list compiled by the SSCIA (originator Rick Inderfurth) detailing the materials contained within the Rockefeller Commission file (box 437-16). The listed items include records such as phone interviews (Richard Goodwin), memoranda (Cargill), letters (Jeanne Davis, Dean Rusk, Dearborn), and notes related to diverse topics. Key subjects referenced include Kennedy's awareness of gun passage, 'poison pills,' NSC documents pertaining to assassination plots, Justice Department documents on plots to assassinate Castro, Cuban operations from 1959-1961, individuals identified in a 1967 IG Report, CIA activities against the Dominican Republic, and alleged CIA plots against Castro involving the United Nations 15th General Assembly.",
  "tags": [
    "Rockefeller Commission",
    "SSCIA",
    "CIA",
    "Assassination Plots",
    "Cuba",
    "Dominican Republic",
    "NSC Documents",
    "Interviews",
    "Memoranda",
    "Gun Passage",
    "Poison Pills"
  ],
  "title": "Commission Files",
  "conspiracy": "The document contains references to discussions of ways to assassinate, indicating the existence of plots and plans related to assassinations, including possible CIA involvement. Specific reference: C-X-12 TOP SEC Memorandum/Meeting with (IMDECK 4, February 16, 1961 2 (IMDECK the 'King pin of the plot.' Discussion of ways to assassinate.",
  "date": "1993-10-07",
  "locations_mentioned": [
    "Las Vegas",
    "Dominican Republic",
    "Cuba",
    "New York"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "Richard Goodwin",
    "John Gorden",
    "Edward Gunn",
    "William Harvey",
    "McCone",
    "Robert McNamara",
    "Robert Murphy",
    "James O'Connell",
    "Fletcher Prouty",
    "Roy Rubottom",
    "Dean Rusk",
    "Nestor Sanchez",
    "Frank Sturgis",
    "Maxwell Taylor",
    "Will Wilson",
    "Jeanne Davis",
    "Belin",
    "Cargill",
    "Castro",
    "Knoche",
    "Gray",
    "Trujillo",
    "Bissell",
    "Richard Goodwin",
    "Devine",
    "Sheffield Edwards",
    "R. Kennedy"
  ],
  "sender": "INDERFURTH, RICK"
}