{
  "classification": "JFK Assassination",
  "document_type": "Index Cards",
  "security": "This document contains information about covert operations, assassination plots, and sensitive meetings involving high-ranking officials. Revealing these details could expose past intelligence activities, compromise relationships with foreign governments, and undermine trust in government institutions. For example, the document mentions plans by Cuban exiles to assassinate Cuban government leaders and U.S. officials' responses to those plans, as well as discussions about using biological agents for sabotage. Directly quoting: \"Agency officers told Cubans that U.S. would not condone the planned actions... producing crop failures by the introduction of biological agents...\"",
  "security_level": "Unclassified",
  "summary": "This document consists of index cards summarizing various meetings, memos, and reports related to Operation MONGOOSE, covert activities against Cuba, and discussions regarding Vietnam, covering topics such as assassination plots, sabotage proposals, and high-level policy decisions.",
  "summary_one_paragraph": "This collection of index cards summarizes various documents and meetings, predominantly concerning Operation MONGOOSE and other covert activities related to Cuba and Vietnam. The cards reference discussions about potential assassination attempts against Fidel Castro, sabotage operations involving biological agents, and meetings with high-ranking officials such as President Kennedy, Robert Kennedy, and members of the Special Group. They also detail CIA activities in Vietnam, including coup planning and covert support, as well as concerns over press leaks and the effectiveness of economic denial programs against Cuba, spanning from 1962 to 1964.",
  "tags": [
    "OPERATION MONGOOSE",
    "Special Group",
    "Cuba",
    "Vietnam",
    "Assassination",
    "Sabotage",
    "Covert Operations",
    "CIA",
    "President Kennedy",
    "Robert Kennedy"
  ],
  "title": "Index Cards",
  "conspiracy": "The document contains information about discussions and plans related to the potential assassination of Fidel Castro, including involvement from Cuban exiles and potential connections to organized crime. It also mentions a meeting where the Attorney General expressed concern about the U.S. risking too much based on flimsy evidence regarding a coup in Saigon.",
  "date": "1975-06-00",
  "locations_mentioned": [
    "Cuba",
    "Vietnam",
    "Saigon",
    "Argentina",
    "Bolivia",
    "Brazil",
    "Chile",
    "Columbia",
    "Costa Rica",
    "Ecuador",
    "Guatemala",
    "Mexico",
    "Panama",
    "Peru",
    "Uruguay",
    "Venezuela"
  ],
  "origin_agency": "SSCIA",
  "persons_mentioned": [
    "CARTER, MARSILALL",
    "PRES. KENNEDY",
    "HARVEY, TAYLOR",
    "HELMS",
    "MOCONE",
    "JFK",
    "Maxwell Taylor",
    "Robert Kennedy",
    "RUSK",
    "BUNDY",
    "MCNAMARA",
    "Nhun",
    "Coloy Hillsman",
    "Kennedy, John F.",
    "McNamarra Tung",
    "Lodge",
    "SMITH DAVID",
    "HARKINS, GENERAL",
    "MCCONE",
    "TRUEHARD, WILLIAM",
    "COLBY",
    "SPECIAL GROUP AUGMENTED",
    "GILPATRICK",
    "LEMNITZER",
    "CLANSDALE",
    "CLINE",
    "PARROTT",
    "Harvey",
    "HALPERN",
    "Bissell",
    "GENERAL DECKER",
    "MR. MURROW",
    "GENERAL LANSDALE",
    "MARTIN",
    "GENERAL HARRIS",
    "WILLIAM BUND",
    "GENERAL CARTER",
    "WALT ELDER",
    "MCGEORGE BUNDY",
    "BRUCE CHEEVER",
    "Necter SANCHEZ",
    "Desmond FITZGERALD",
    "LAR. KENNEDY",
    "HOOVER"
  ]
}