{
  "classification": "Liaison",
  "document_type": "Interview Summary",
  "security": "Information about intelligence sources and methods, including electronic surveillance and recruitment of foreign officials, is contained within the document. Specific discussions about cooperation between the FBI and CIA, as well as details about legal attachés and their operations, could expose sensitive operational details. For instance, the document states, \"Hoover would agree to expand on certain issues but proposals for major new operations went to PFIAB for support. Clifford was chairman. Papich doesn't know what Hoover said to Clifford, but the answer on the proposal was negative. The proposal involved more extensive and sophisticated electronic surveillance.\"",
  "security_level": "SECRET",
  "summary": "An interview with Sam Papich in 1975 provides insights into FBI-CIA relations, intelligence operations, and controversies, particularly regarding Soviet activities, domestic dissidents, and coordination challenges during Hoover's tenure.",
  "summary_one_paragraph": "In May 1975, John Elliff, Mike Epstein, John Bayly and Burt Wides interviewed Sam Papich, former FBI liaison to the CIA, about his experiences and perspectives on intelligence matters. Papich discussed his role as a \"devil's advocate\" between the FBI and CIA, the historical friction between the agencies stemming from OSS activities and jurisdictional disputes, and challenges in coordinating intelligence efforts, particularly concerning Soviet operations, domestic surveillance, and the recruitment of foreign officials. He highlighted Hoover's mistrust of the CIA, the limitations of U.S. intelligence regarding Soviet illegals, and the difficulties in managing relationships with foreign intelligence services, while also commenting on the FBI's view of domestic dissident groups and the Warren Commission.",
  "tags": [
    "FBI",
    "CIA",
    "Sam Papich",
    "Hoover",
    "Intelligence Operations",
    "Soviet Activities",
    "Domestic Dissidents",
    "Legal Attaches",
    "OSS",
    "Warren Commission",
    "KGB",
    "USIB",
    "COINTELPRO",
    "New Left"
  ],
  "title": "Interview with Sam Papich",
  "date": "1975-05-29",
  "persons_mentioned": [
    "Sam Papich",
    "J. Edgar Hoover",
    "Allen Dulles",
    "John McCone",
    "Richard Helms",
    "Robert Kennedy",
    "Lee Harvey Oswald",
    "Stokely Carmichael",
    "Martin Luther King Jr.",
    "Alan Belmont",
    "W. C. Sullivan"
  ],
  "sender": "SSCIA (Senate Select Committee on Intelligence Activities - interviewer(s))"
}