{
  "classification": "Security",
  "document_type": "Transcript",
  "security": "This testimony reveals details about CIA's mail opening operations (SR POINTER, HT LINGUAL, West Pointer) and cooperative arrangements with the Bureau of Customs, including specific instances of intercepting mail to and from the Soviet Union and potential involvement with diplomatic pouches. The testimony also discusses misleading Congress by referring to operations as 'mail covers', when they actually involved opening mail.  Quoting directly: 'While mail was opened and photographed by Agency personnel in New York City under SR POINTER...neither is there written order not to do so. In West Pointer the opening of mail was contrary to specific orders that mail was not to out of post office control.' and 'Osborn said he was under instructions from Colby to the effect that no pressure should be put on Cotter.'",
  "security_level": "TOP SECRET",
  "summary": "Howard Osborn testifies about CIA mail opening projects like SR POINTER and West Pointer, as well as cooperative arrangements with Customs, clarifying that some operations involved opening mail without explicit authorization and acknowledging that higher-ups like Mr. Helms were aware of the New York mail openings.",
  "summary_one_paragraph": "This document contains the testimony of Howard J. Osborn, given on August 28, 1975, concerning CIA mail programs and his role in them, specifically SR POINTER (New York), a San Francisco project (West Pointer), and arrangements with the Bureau of Customs. Osborn discusses his career within the CIA, including his time as Chief of the Soviet Russian Division and Deputy Director of the Office of Security, and details his knowledge of mail intercepts, diplomatic pouches, and propaganda. He admits to being misled about the extent of the West Pointer operation, believing it was a mail cover and not a mail opening project, and mentions discussions with colleagues like Bill Cotter and Rod Kenner regarding these operations. He also touches on the termination of SR POINTER under directives from Colby and Schlesinger and acknowledges Helms' awareness of mail opening activities.",
  "tags": [
    "CIA",
    "Howard J. Osborn",
    "Testimony",
    "Mail Opening",
    "SR POINTER",
    "HT LINGUAL",
    "West Pointer",
    "Bureau of Customs",
    "Helms",
    "Colby",
    "Schlesinger",
    "Angleton",
    "Karamessines",
    "San Francisco",
    "New Orleans"
  ],
  "title": "Testimony of Howard J. Osborn",
  "date": "1975-08-28",
  "persons_mentioned": [
    "Howard J. Osborn",
    "John W. Debelius",
    "Sam Giancana",
    "Robert Maheu",
    "Castro",
    "Johnny Rosselli",
    "William Harvey",
    "Sam Papich",
    "Gambino",
    "Director Schlesinger",
    "Robert Kennedy",
    "Mr. White",
    "Mr. Favorini",
    "Mr. Cotter",
    "Mr. Helms",
    "Jack Turton",
    "Rod Keaner",
    "Mr. Mikashawa",
    "Marv Gentile",
    "Huston",
    "Mr. Colby",
    "Stan Ense",
    "James Angleton",
    "Dave Ellis"
  ],
  "recipient": "SSCIA",
  "sender": "SSCIA"
}