{
  "classification": "Cuba",
  "document_type": "Draft Briefing Notes",
  "security": "This document details the CIA's knowledge of Cuban financing of subversive operations and guerrilla activities in Latin America. Specifically, it mentions sources within Communist parties providing information, as well as methods used to transfer funds and smuggle weapons. \"One of our reliable sources in the Communist Party ((a regional Communist leader in contact with the Cuban chargé in Chile, and a member of the PCE inquiry commission)) has informed us that the next-to-last Cuban chargé in Quito blamed the fiasco on the fact that his successor had passed the money to the URJE without coordinating with the regular Communist party.\"",
  "security_level": "SECRET",
  "summary": "These draft briefing notes from February 1963 outline Cuban financing of subversive operations in Latin America, detailing specific instances of cash transfers, guerrilla training, and bank robberies by communist groups.",
  "summary_one_paragraph": "Draft briefing notes dated February 18, 1963, detail the CIA's understanding of Cuban financing of subversive activities in Latin America. The document cites examples of Cuban couriers carrying cash to Venezuelan politicians and Nicaraguan exiles, Ecuadorean guerrilla training camps funded by Cuba, and the procedures by which Cuba sent cash to Mexico to buy weapons for Guatemala. It also notes how Cuban money reaches Latin American front groups for political and propaganda activity, as well as the principle that guerrillas must be self-sustaining through bank robberies, such as those in Venezuela, Peru, and Argentina.",
  "tags": [
    "Cuban financing",
    "subversive operations",
    "Latin America",
    "guerrilla activity",
    "bank robberies",
    "communist groups",
    "CIA",
    "Fabricio Ojeda",
    "Julio Cesar Mayorga Portocarrera",
    "URJE",
    "Hugo Blanco",
    "FALN",
    "Peasant Leagues",
    "National Security Files",
    "JFK Assassination Records Act"
  ],
  "title": "Draft Briefing Notes: Funding",
  "date": "1963-02-18",
  "locations_mentioned": [
    "Latin America",
    "Venezuela",
    "Cuba",
    "Nicaragua",
    "Mexico",
    "Honduras",
    "Ecuador",
    "Quito",
    "Chile",
    "Guatemala",
    "Brazil",
    "Peru",
    "Argentina",
    "Lima",
    "Cuzco Valley",
    "Rio de Janeiro",
    "Buenos Aires"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Fabricio Ojeda",
    "Julio Cesar Mayorga Portocarrera",
    "Hugo Blanco"
  ]
}