{
  "classification": "Administrative",
  "document_type": "Memoranda",
  "security": "This document outlines a proposed reorganization of the CIA, including granting the State Department general clearance authority over all clandestine activity. It also discusses the balance between intelligence gathering and policy, raising concerns about potential overreach and the impact on an open society. For example, it mentions potential problems with CIA recruiting agents in friendly countries without informing the local U.S. Ambassador.  Revealing such proposed reforms and specific operational details could compromise intelligence activities and damage relationships with foreign governments.  Quoting directly: 'Clandestine intelligence operations should plainly be cleared both with the Department of State and...with the local U.S. Ambassador.' and 'CIA operations have not been held effectively subordinate to U. S. foreign policy.'",
  "security_level": "SECRET",
  "summary": "Arthur Schlesinger Jr. sends a memorandum to President Kennedy proposing a reorganization of the CIA to address concerns about its autonomy and impact on U.S. foreign policy, suggesting increased State Department oversight and a more balanced approach to intelligence operations.",
  "summary_one_paragraph": "Arthur Schlesinger Jr.'s memorandum to President Kennedy, dated June 30, 1961, addresses CIA reorganization, stemming from concerns about its autonomy and its effect on U.S. foreign policy. Schlesinger proposes giving the State Department clearance authority over all clandestine activities, establishing a Joint Intelligence Board, and reconstituting the CIA's operating branches under a new agency, the National Information Service. It also suggests creating a separate agency for research and analysis, aiming to balance intelligence gathering with policy considerations and prevent potential abuses of power, all while acknowledging the need for a capable State Department to oversee the intelligence community effectively.",
  "tags": [
    "CIA",
    "Reorganization",
    "State Department",
    "Intelligence",
    "Clandestine Operations",
    "Arthur Schlesinger Jr.",
    "Kennedy Administration",
    "Foreign Policy",
    "National Information Service",
    "Foreign Research Agency"
  ],
  "title": "Memo to President CIA Reorganization",
  "date": "1961-06-30",
  "locations_mentioned": [
    "Singapore",
    "Pakistan",
    "Japan",
    "Sasebo",
    "Vienna",
    "Chile",
    "Laos",
    "Paris",
    "Algeria",
    "Miami",
    "Cuba",
    "Guatemala",
    "Indonesia",
    "Philippines",
    "Malaya",
    "Greece",
    "Cyprus"
  ],
  "origin_agency": "NARA (National Archives and Records Administration)",
  "persons_mentioned": [
    "President Kennedy",
    "Arthur Schlesinger, Jr.",
    "Allen Dulles",
    "Tom Mann",
    "Richard Harkness",
    "Gladys Harkness",
    "General Marshall",
    "Van Mook",
    "Field Marshal Templer",
    "Mao Tse-tung",
    "Sir Patrick Dean",
    "Mr. Bundy",
    "Mr. Dungan"
  ],
  "recipient": "President Kennedy",
  "sender": "Schlesinger, Jr."
}