{
  "classification": "Liaison",
  "document_type": "Memo",
  "security": "Revealing the sensitive telephone surveillance operation in Mexico City and the intimate relationship between the CIA station chief and the Mexican President could severely damage relations between the U.S. and Mexico. Additionally, the discussion about Nosenko and the differing views between the CIA and the President on his legitimacy could expose counterintelligence methods and create diplomatic tensions with the Soviet Union/Russia. Quoting directly: '...a very sensitive effective operation working in Mexico City jointly with President Mateos which involved telephone surveillance...'; '...our counterintelligence people were inclined to feel he was a plant but had not made up their minds. President said he thought he was probably legitimate...'",
  "security_level": "Secret",
  "summary": "John McCone briefs President Johnson on several sensitive matters, including a telephone surveillance operation in Mexico City in collaboration with President Mateos, the ongoing interrogation of Nosenko, and the situation with Spain regarding trade with Cuba.",
  "summary_one_paragraph": "On February 20, 1964, John McCone met with President Johnson to discuss several key issues. McCone informed the President about a sensitive telephone surveillance operation in Mexico City conducted jointly with President Mateos, emphasizing the close relationship between the CIA station chief, Win Scott, and Mateos. McCone also updated Johnson on the interrogation of Nosenko, noting the counterintelligence's skepticism about his legitimacy. Furthermore, the President raised concerns about aid to Spain and its trade relations with Cuba, prompting McCone to task O'Ryan and Ball to investigate Spanish actions to curtail trade with Cuba. The President also expressed his desire to move the CIA away from its 'cloak and dagger image'.",
  "tags": [
    "CIA",
    "John McCone",
    "Lyndon B. Johnson",
    "Mexico City",
    "Telephone Surveillance",
    "Win Scott",
    "Nosenko",
    "Defector",
    "Counterintelligence",
    "Spain",
    "Franco",
    "Cuba",
    "Trade Relations",
    "Public Image"
  ],
  "title": "Meeting with the President 20 February 1964 Alone",
  "date": "1964-02-21",
  "locations_mentioned": [
    "Mexico City",
    "Spain",
    "Cuba"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "John McCone",
    "Lyndon B. Johnson",
    "Dwight D. Eisenhower",
    "President Mateos",
    "Win Scott",
    "Ambassador Mann",
    "Nosenko",
    "Franco",
    "O'Ryan",
    "Noel",
    "Ball",
    "Ambassador Woodward"
  ],
  "sender": "MCCONE, JOHN"
}