{
  "classification": "Cuba",
  "document_type": "Draft Briefing Notes",
  "security": "Disclosing the specific methods and sources used to track Cuban funding of subversive activities in Latin America could compromise ongoing intelligence operations and endanger sources. Quoting directly: \"Our evidence shows that it is generally effected by couriers carrying cash...One of our reliable sources in the Communist Party...has informed us...\"",
  "security_level": "SECRET",
  "summary": "A CIA document from February 1963 outlines Cuban financing of subversive operations in Latin America through couriers carrying cash, bank transfers, and guerrilla-led bank robberies, detailing specific instances in Venezuela, Nicaragua, Ecuador, Guatemala, Brazil, Peru and Argentina.",
  "summary_one_paragraph": "This CIA document, dated February 18, 1963, details Cuban methods for funding subversive activities in Latin America, including the use of couriers carrying cash, involved bank transfers, and the financing of guerrilla groups to conduct bank robberies. Specific incidents mentioned include Venezuelan politician Fabricio Ojeda’s return from Cuba with US currency, a Nicaraguan exile carrying cash from Cuba to Honduras, the URJE's misuse of Cuban funds in Ecuador, and Cuban support for guerrilla warfare training camps in Brazil, with money potentially sourced from Communist China. The document also highlights bank robberies by Communist and Peronist groups in Venezuela, Peru, and Argentina as self-sustaining financial operations.",
  "tags": [
    "Cuban Subversion",
    "Latin America",
    "Funding",
    "Guerrilla Activity",
    "Bank Robberies",
    "Communist Party",
    "CIA",
    "Fabricio Ojeda",
    "URJE",
    "Varig",
    "Hugo Blanco",
    "FALN",
    "Peronists",
    "LBJ"
  ],
  "title": "Draft Briefing Notes",
  "date": "1963-02-18",
  "locations_mentioned": [
    "Cuba",
    "Latin America",
    "Venezuela",
    "Nicaragua",
    "Honduras",
    "Ecuador",
    "Quito",
    "Chile",
    "Guatemala",
    "Mexico",
    "Brazil",
    "Peru",
    "Argentina",
    "Lima",
    "Cuzco Valley",
    "Buenos Aires"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Fabricio Ojeda",
    "Julio Cesar Mayorga Portocarrera",
    "Hugo Blanco"
  ]
}