{
  "classification": "Mexico",
  "document_type": "Memorandum",
  "security": "This memo reveals sensitivities in US-Mexico relations, including the need to avoid any appearance of Mexican subservience to the U.S. and the secret assurances provided by Lopez Mateos regarding Red China. Publicizing these assurances could jeopardize future intelligence sharing and damage diplomatic relations. Specifically: “Mexico is very sensitive about publicizing its cooperation and we have carefully avoided any public comment on Mexican control measures...Lopez Mateos has given us secret assurances, through CIA channels, that he has no intention of recognizing Red China.” Discussing the termination of the Bracero Program and potential community development efforts further risks alienating Mexico if these discussions are made public without a resolution.",
  "security_level": "SECRET",
  "summary": "A memorandum from Dean Rusk to the President, dated February 18, 1964, outlines key discussion points and sensitivities for the President's upcoming meeting with Mexican President Lopez Mateos, emphasizing the need to reassure Mexico of continued friendly relations and address issues like trade policies, the Bracero Program, and cooperation on controlling Castro Communism and narcotics.",
  "summary_one_paragraph": "This secret memorandum from Dean Rusk to the President provides guidance for an upcoming meeting with President Lopez Mateos of Mexico. It stresses the importance of maintaining strong and friendly relations, acknowledging Mexico's sensitivity regarding sovereignty and the need to address various issues, including the salinity problem on the Lower Colorado River, the termination of the Bracero Program, U.S. trade policies affecting Mexico, and continued cooperation on controlling Castro Communism and narcotics. The memo also highlights Lopez Mateos's desire to be recorded in history for resolving the Chamizal settlement and the power transition to his chosen successor, Gustavo DIAZ Ordaz.",
  "tags": [
    "Mexico",
    "Lopez Mateos",
    "Dean Rusk",
    "Presidential Meeting",
    "US-Mexico Relations",
    "Castro Communism",
    "Bracero Program",
    "Trade Policies",
    "Chamizal Settlement",
    "Narcotics Control"
  ],
  "title": "Your Meeting with President Lopez Mateos",
  "date": "1964-02-18",
  "locations_mentioned": [
    "Mexico",
    "United States",
    "Los Angeles",
    "El Paso",
    "Ciudad Juarez",
    "Rio Grande Valley",
    "Yuma",
    "Tijuana"
  ],
  "origin_agency": "STATE",
  "persons_mentioned": [
    "Dean Rusk",
    "President Lyndon B. Johnson",
    "President Lopez Mateos",
    "President John F. Kennedy",
    "Gustavo DIAZ Ordaz",
    "Fidel Castro",
    "President Orlich"
  ],
  "recipient": "The President",
  "sender": "Dean Rusk"
}