{
  "classification": "Commission",
  "document_type": "Memo",
  "security": "The memo discusses the CIA's involvement in domestic activities and its relationship with the FBI and Secret Service. Disclosing the specific methods of coordinating with the FBI (“horse’ the FBI into doing something”) or details about tracing potential defectors for the Secret Service (“CIA did trace the names which the Bureau and Secret Service provided in this regard”) could reveal sensitive intelligence-gathering techniques and inter-agency operational details, potentially compromising current and future operations. It also mentions the 'American Targets Program' (ATP) and the collection of information on contacts between Americans and foreign intelligence officers, particularly those from the USSR. Revealing details about this program could expose the CIA’s methods of gathering and indexing information on U.S. citizens and their interactions with foreign entities.",
  "security_level": "Secret",
  "summary": "James B. Weidner interviews John Stein at CIA Headquarters regarding alleged domestic activities of the CIA, focusing on the counter-intelligence (CI) staff's role and files on Americans.",
  "summary_one_paragraph": "On March 18, 1975, James B. Weidner interviewed John Stein at CIA Headquarters as part of a review of alleged domestic activities of the CIA; Stein, who reviewed the counter-intelligence staff's actions (excluding CI/SO and mail intercepts), stated that their primary role was to prompt the FBI into action and that their files, beyond those exceptions, were mostly benign, containing records of American contacts with foreign intelligence officers, particularly Soviets, under the 'American Targets Program' (ATP), which collected and indexed information reported by various agencies, including the State Department, and also addressed topics such as defectors and the Agency's cooperation with the Secret Service in tracing potential defectors after the Kennedy assassination.",
  "tags": [
    "CIA",
    "John Stein",
    "James B. Weidner",
    "Counter-Intelligence",
    "Domestic Activities",
    "FBI",
    "Secret Service",
    "American Targets Program",
    "Defectors",
    "Nosenko",
    "Rockefeller Commission",
    "FOIA"
  ],
  "title": "Interview with John Stein",
  "date": "1975-03-18",
  "origin_agency": "ROCKCOM",
  "persons_mentioned": [
    "John Stein",
    "James B. Weidner",
    "Yuri Nosenko",
    "Lee Harvey Oswald",
    "Nelson A. Rockefeller",
    "David W. Belin",
    "John T. Connor",
    "C. Douglas Dillon",
    "Erwin N. Griswold",
    "Lane Kirkland",
    "Lyman L. Lemnitzer",
    "Ronald Reagan",
    "Edgar F. Shannon, Jr.",
    "George Blake",
    "John Dean",
    "President Nixon",
    "Vesco"
  ],
  "recipient": "File",
  "sender": "Weidner, John"
}