{
  "classification": "Commission",
  "document_type": "Deposition",
  "security": "Revealing specific details of CIA operations against Cuba, including locations of Miami and Key West bases, and the names of individuals involved, such as Ted Shackley, Paul Henze, Jake Esterline, and Desmond Fitzgerald, could expose sensitive operational details and compromise current or future intelligence activities. Stating “Well, there was it was an across-the-board intelligence operation consisting of collection of foreign positive intelligence, counterintelligence, paramilitary activities, covert action, economic activities. That is about the breadth of the thing” shares information about a wide variety of intelligence activities, making it sensitive.",
  "security_level": "Secret",
  "summary": "This document is the deposition of William C. Sturbitts, a CIA employee, taken on April 16, 1975, by the Rockefeller Commission, concerning CIA activities related to Cuba, including paramilitary operations, discussions of possible assassination attempts against Fidel Castro, and the agency's relationship with individuals like Frank Sturgis.",
  "summary_one_paragraph": "The deposition of William C. Sturbitts, a CIA Special Assistant for Latin America, was taken on April 16, 1975, by the Rockefeller Commission. Sturbitts discussed his involvement in Cuban operations from 1964 to 1973, reporting to the Deputy Director, Plans. He detailed the structure of CIA's Cuban operations, including Task Force W and the Miami Station, mentioning figures like Desmond Fitzgerald, Ted Shackley, and Paul Henze. Sturbitts recounted discussions about possible assassination attempts against Fidel Castro, including overhearing conversations about providing weapons to a member of Castro's military and addressed the agency's lack of formal connection with Frank Sturgis, characterizing him as an 'intelligence nuisance'.",
  "tags": [
    "Anti-Castro Activities",
    "CIA",
    "William Sturbitts",
    "Desmond Fitzgerald",
    "Robert Kennedy",
    "Cuban Exiles",
    "Rockefeller Commission",
    "Frank Sturgis",
    "Fidel Castro",
    "Miami Station",
    "Cuban Operations",
    "Task Force W"
  ],
  "title": "Deposition of William Sturbitts",
  "date": "1975-04-16",
  "locations_mentioned": [
    "Langley, Virginia",
    "Washington, D.C.",
    "Miami, Florida",
    "Cuba",
    "Paris",
    "Europe",
    "Key West"
  ],
  "origin_agency": "Rockefeller Commission",
  "persons_mentioned": [
    "William Sturbitts",
    "Desmond Fitzgerald",
    "Robert Kennedy",
    "Fidel Castro",
    "Frank Sturgis",
    "Ted Shackley",
    "Paul Henze",
    "Jake Esterline",
    "Bill Harvey",
    "Karamessines",
    "Helms",
    "Nestor Sanchez",
    "Eugenio Martinez",
    "John Dimmer",
    "George Manfredi",
    "Robert B. Olsen",
    "Thomas C. Hogan"
  ]
}