{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "The document discusses Operation MONGOOSE, which included sabotage operations against Cuba. Specifically, it mentions \"agricultural sabotage\" using biological agents to cause crop failures that \"would appear to be of natural origin.\" The discussion of such covert and potentially deniable operations, particularly those involving biological agents, poses a high risk if exposed, as it could severely damage the reputation of the U.S. and implicate it in acts of aggression or violations of international norms.",
  "security_level": "Unclassified",
  "summary": "Minutes from a Special Group (Augmented) meeting on Operation MONGOOSE, held on September 6, 1962, discuss sabotage operations, propaganda efforts, and potential actions against Cuba, including the possible use of biological agents to cause crop failures, as well as contingencies beyond the MONGOOSE program.",
  "summary_one_paragraph": "These minutes detail the discussions of the Special Group (Augmented) concerning Operation MONGOOSE on September 6, 1962, covering various aspects of the anti-Castro campaign. The meeting addressed a range of actions, including a sabotage operation, propaganda through Radio Swan, potential intrusion into Cuban radio and TV, and sabotage outside of Cuba targeting Cuban commerce. The group also considered economic harassment and sabotage of Cuban agriculture, exploring the use of biological agents to induce crop failures that would appear natural, while emphasizing the need for deniability to avoid direct attribution to the U.S. Furthermore, the group discussed potential responses in the event of a revolt in Cuba and planning for contingencies beyond the scope of MONGOOSE.",
  "tags": [
    "JFK Assassination",
    "Operation MONGOOSE",
    "Special Group (Augmented)",
    "Sabotage",
    "Biological Warfare",
    "Anti-Castro Activities",
    "Cuban Exiles",
    "Propaganda",
    "NSAM 181"
  ],
  "title": "Minutes of Meeting of Special Group (Augmented) on MONGOOSE, 9/6/62",
  "date": "1962-09-06",
  "locations_mentioned": [
    "Cuba"
  ],
  "origin_agency": "NSC",
  "persons_mentioned": [
    "McGeorge Bundy",
    "Attorney General",
    "Mr. Martin",
    "William Bundy",
    "General Decker",
    "General Lansdale",
    "General Harris",
    "General Carter",
    "Mr. Murrow"
  ],
  "sender": "RECORD"
}