{
  "classification": "Administrative",
  "document_type": "Final Determination Notification and Payroll Authorization Forms",
  "security": "The document is redacted to protect Social Security numbers, as \"the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This document includes the Assassination Records Review Board's final determination to postpone in part the release of HSCA staff payroll records, specifically redacting Social Security numbers to protect personal privacy, and payroll authorization forms for Mel Waxman.",
  "summary_one_paragraph": "The document consists of a Final Determination Notification from the Assassination Records Review Board regarding the postponement of certain information within the House Select Committee on Assassinations (HSCA) staff payroll records, citing the need to protect Social Security numbers from unwarranted invasion of personal privacy. It also includes several payroll authorization forms for Mel Waxman, documenting his appointment, salary, and position as a Staff Investigator for the HSCA's investigation, authorized by Louis Stokes. The forms cover the period from August 1977 to December 1978 and confirm Waxman's employment terms and lack of familial relationship with any current Member of Congress.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Mel Waxman",
    "Louis Stokes",
    "Privacy",
    "Social Security Numbers",
    "Payroll Authorization"
  ],
  "title": "Assassination Records Review Board Final Determination Notification and HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "persons_mentioned": [
    "Mel Waxman",
    "Louis Stokes",
    "Robert J. Lehner",
    "Blakey"
  ],
  "recipient": "Mr. Blakey",
  "sender": "Robert J. Lehner aka. RJL"
}