{
  "classification": "Administrative",
  "document_type": "Final Determination Notification",
  "security": "The document includes Alan B. Hausman's Social Security number (SSN), which is redacted to protect personal privacy. Releasing this information could lead to identity theft or other forms of personal harm.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a notification from the Assassination Records Review Board regarding the postponed release of certain information within HSCA staff payroll records, specifically Social Security numbers, to protect personal privacy, while acknowledging the historical interest in the document.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, regarding HSCA Staff Payroll Records. While acknowledging significant historical interest, the Board decided to postpone the release of specific information, particularly Social Security numbers, citing concerns that public disclosure could constitute an unwarranted invasion of personal privacy. The document details the reasons for the postponements, the number of prior releases, and indicates that the redacted text is replaced with 'SSN.' A review was scheduled for 2017, in accordance with the John F. Kennedy Assassination Records Collection Act of 1992.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Alan B. Hausman",
    "Social Security Number",
    "Privacy",
    "Postponement",
    "FOIA",
    "John F. Kennedy Assassination Records Collection Act"
  ],
  "title": "Final Determination Notification",
  "date": "1995-12-08",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Alan B. Hausman",
    "Louis Stokes",
    "Thomas Howarth",
    "Richardson Preyer",
    "Walter E. Fauntroy",
    "Yvonne Brathwaite Burke",
    "Christopher J. Dodd",
    "Samuel L. Devine",
    "Stewart B. McKinney",
    "Charles Thone",
    "Harold S. Sawyer",
    "Harold E. Ford",
    "Floyd J. Fithian",
    "Robert W. Edgar"
  ],
  "recipient": "District Unemployment Compensation Board",
  "sender": "THOMAS HOWARTH, Deputy Staff Director and Budget Officer"
}