{
  "classification": "Administrative",
  "document_type": "Printed Form",
  "security": "This document contains payroll information and employee relationships, which could be used to identify and potentially harass individuals. Specifically, employee Social Security numbers are redacted as 'the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.'",
  "security_level": "Unclassified (U)",
  "summary": "This document contains payroll records and related information for Kenneth D. Klein, an employee of the Select Committee on Assassinations, including salary adjustments and termination details.",
  "summary_one_paragraph": "This collection of documents primarily consists of payroll authorization forms and related correspondence pertaining to Kenneth D. Klein, an employee of the Select Committee on Assassinations. The forms detail Klein's salary adjustments, appointment, and eventual termination from the committee. These records span from January 1977 to January 1979 and include information such as Klein's Social Security number, position titles, gross annual salaries, and authorizing signatures from committee members such as Louis Stokes and Thomas N. Downing. Also included is a memo to all staff employees from the Budget Officer regarding payroll certification and disclosure of relationships to current members of Congress.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Kenneth D. Klein",
    "Salary",
    "Termination",
    "Social Security Number",
    "Payroll Authorization",
    "Louis Stokes",
    "Thomas Howarth",
    "Payroll Certification",
    "Relationships to Congress Members"
  ],
  "title": "Staff Payroll Records for Kenneth D. Klein, HSCA",
  "date": "1977-01-01",
  "persons_mentioned": [
    "Kenneth D. Klein",
    "Louis Stokes",
    "Thomas Howarth",
    "Richard A. Sprague",
    "Thomas N. Downing",
    "Richardson Preyer",
    "Walter E. Fauntroy",
    "Yvonne Brathwaite Burke",
    "Christopher J. Dodd",
    "Samuel L. Devine",
    "Stewart B. McKinney",
    "Charles Thone",
    "Harold E. Ford",
    "Harold S. Sawyer",
    "Floyd J. Fithian",
    "Robert W. Edgar"
  ],
  "recipient": "District Unemployment Compensation Board; Clerk of the House of Representatives; All Staff Employees",
  "sender": "Select Committee on Assassinations; Thomas Howarth (Deputy Staff Director and Budget Officer); Budget Officer; Henry B. Gonzalez"
}