{
  "classification": "Personnel",
  "document_type": "Final Determination Notification/Payroll Authorization Forms/Memorandum/Certificate",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document consists of a Final Determination Notification from the Assassination Records Review Board regarding the postponement in part of HSCA staff payroll records due to privacy concerns related to Social Security numbers, along with payroll authorization forms, a memorandum, and a certificate of non-relationship for Dean B. Webb.",
  "summary_one_paragraph": "This collection of documents pertains to Dean B. Webb's employment with the House Select Committee on Assassinations (HSCA). It includes payroll authorization forms detailing his appointment as a Research Attorney with a salary of $18,000, a memorandum confirming his position with the Martin Luther King Task Force, and a certificate attesting to his non-relationship with any current members of Congress. The collection also contains a notification from the Assassination Records Review Board that portions of the staff payroll records are postponed due to privacy concerns regarding the release of Social Security numbers, which were deemed to outweigh public interest.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Dean B. Webb",
    "Payroll Authorization",
    "Social Security Number",
    "Privacy",
    "Martin Luther King Task Force"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "persons_mentioned": [
    "Dean B. Webb",
    "Louis Stokes",
    "Thomas Howarth",
    "Elizabeth Berning",
    "G. Robert Blakey"
  ],
  "recipient": "Thomas Howarth, Elizabeth Berning, Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board, Louis Stokes, G. Robert Blakey, Dean B. Webb, HSCA"
}