{
  "classification": "Personnel",
  "document_type": "Printed Form, Memorandum",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "U",
  "summary": "This document contains payroll records and related correspondence for Dominick K. Giangrasso, a staff investigator for the House Select Committee on Assassinations (HSCA), including his appointment, resignation, and administrative leave, along with his resume and a form concerning relationships to members of Congress.",
  "summary_one_paragraph": "This collection of documents pertains to Dominick K. Giangrasso's employment with the House Select Committee on Assassinations (HSCA) in 1977, including a payroll authorization form for his appointment as a Staff Investigator effective September 6, 1977, at an annual salary of $24,000, followed by memoranda detailing his resignation and subsequent administrative leave leading to his termination on October 31, 1977; it also contains his resume outlining his experience as a Baltimore City Police Department detective and a form certifying any relationships to members of Congress, with redactions of his Social Security Number due to privacy concerns.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Dominick K. Giangrasso",
    "Staff Investigator",
    "Personnel Records",
    "Social Security Number",
    "Louis Stokes",
    "G. Robert Blakey",
    "Edward M. Evans",
    "Administrative Leave",
    "Termination",
    "Baltimore City Police Department"
  ],
  "title": "Final Determination Notification & Staff Payroll Records Regarding Dominick K. Giangrasso",
  "date": "1977-09-06",
  "locations_mentioned": [
    "Washington, D.C.",
    "Baltimore, Maryland"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Dominick K. Giangrasso",
    "Louis Stokes",
    "G. Robert Blakey",
    "Tom Howarth",
    "Edward M. Evans",
    "Lorraine M. Novak"
  ],
  "recipient": "Clerk of the House of Representatives, Tom Howarth, All Staff",
  "sender": "HSCA, Louis Stokes, G. Robert Blakey, Edward M. Evans"
}