{
  "classification": "Personnel",
  "document_type": "Printed Form/Memorandum",
  "security": "The document contains Social Security numbers which are redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified",
  "summary": "This document contains payroll records and related correspondence for Robin David Lindley, who worked as a researcher and staff counsel for the House Select Committee on Assassinations (HSCA) from 1977 to 1979, including his initial hiring, salary adjustments, and a request for a salary increase.",
  "summary_one_paragraph": "This collection of documents pertains to Robin David Lindley's employment with the HSCA. Included are memoranda, payroll authorization forms, and a request for a salary increase. Lindley's documents detail his initial hiring as a researcher in October 1977 at a salary of $15,000, subsequent adjustments to $18,000 and $19,000, and a final increase to $24,000 by January 1979 when he was a Staff Counsel. Lindley’s memo requests the raise, citing increased responsibilities like contributing to ad hoc writing projects and the King Task Force final report, as well as his educational background and experience.",
  "tags": [
    "HSCA",
    "Robin David Lindley",
    "Staff Payroll Records",
    "Salary",
    "Employment",
    "Administration",
    "King Task Force",
    "Personnel Records",
    "FOIA",
    "Social Security Number"
  ],
  "title": "HSCA Staff Payroll Records for Robin David Lindley",
  "date": "1977-10-18",
  "persons_mentioned": [
    "Robin David Lindley",
    "G. Robert Blakey",
    "Dick Billings",
    "Louis Stokes",
    "Thomas Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews"
  ],
  "recipient": "G. Robert Blakey, Thomas Howarth, Elizabeth Berning, Clerk of the House of Representatives",
  "sender": "Robin Lindley, I. Charles Mathews, Louis Stokes (Authorizing Official), Assassination Records Review Board"
}