{
  "classification": "Administrative",
  "document_type": "Final Determination Notification and Payroll Authorization Forms",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document consists of a Final Determination Notification from the Assassination Records Review Board regarding the postponement of certain information within HSCA staff payroll records, specifically Social Security numbers, due to privacy concerns, and includes payroll authorization forms for Mark A. Speiser.",
  "summary_one_paragraph": "The document comprises a Final Determination Notification from the Assassination Records Review Board concerning HSCA's staff payroll records, specifically document number 180-10147-10260, where Social Security numbers are postponed from release to protect personal privacy. The document also includes payroll authorization forms for Mark A. Speiser, detailing his employment with the House Select Committee on Assassinations (HSCA) in various roles, his salary adjustments, and his effective dates of employment, along with a memorandum noting his acceptance of a position as Senior Staff Counsel with the Martin Luther King Task Force.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Mark A. Speiser",
    "Payroll Authorization",
    "Louis Stokes",
    "Martin Luther King Task Force"
  ],
  "title": "Assassination Records Review Board Final Determination Notification and HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Mark A. Speiser",
    "Louis Stokes",
    "Thomas Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews"
  ],
  "recipient": "Thomas Howarth, Budget Officer; Elizabeth Berning, Chief Clerk"
}