{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Documents",
  "security": "The document contains Social Security numbers which have been redacted under the reason that disclosure could reasonably be expected to constitute an unwarranted invasion of personal privacy. Specifically, the notification states: 'The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.'",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically concerning Linda M. Connor. It includes payroll authorization forms, a resignation letter, and a resume, with Social Security numbers postponed due to privacy concerns.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, concerning HSCA staff payroll records related to Linda M. Connor. The document, part of the JFK Assassination Records Collection Act of 1992, includes payroll authorization forms detailing Connor's employment and salary adjustments within the Select Committee on Assassinations, along with her resignation letter and resume outlining her qualifications and previous experience. Social Security numbers within the document have been postponed, with the redaction indicated by 'SSN', due to privacy concerns, and the next review is scheduled for 2017.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Linda M. Connor",
    "Social Security Numbers",
    "Privacy",
    "Assassination Records Review Board"
  ],
  "title": "HSCA Staff Payroll Records - Linda M. Connor",
  "date": "1976-12-15",
  "locations_mentioned": [
    "Washington, D.C.",
    "Arlington, Virginia",
    "Hampton, Virginia",
    "Fort Monroe, Virginia"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Linda M. Connor",
    "Thomas N. Downing",
    "Henry B. Gonzalez",
    "Louis Stokes",
    "Richard A. Sprague",
    "E. M. (Tiny) Hutton"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Thomas N. Downing, Henry B. Gonzalez, Louis Stokes, Budget Officer"
}