{
  "classification": "Administrative",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (originally restricted)",
  "summary": "This document is a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically concerning the postponement of Social Security numbers to protect personal privacy, along with payroll authorization forms and related memoranda for HSCA employee Miriam Rudder.",
  "summary_one_paragraph": "This document consists of a Final Determination Notification from the Assassination Records Review Board concerning HSCA staff payroll records. It details the reason for postponing the release of Social Security numbers contained within the records, citing unwarranted invasion of personal privacy. The document also includes payroll authorization forms, memoranda, and related information for HSCA employee Miriam Rudder, including her appointment, salary adjustments, and termination, as well as a recommendation for her hiring, revealing her qualifications and relationships within the committee.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Personal Privacy",
    "Miriam Rudder",
    "Payroll Authorization",
    "Employment Records"
  ],
  "title": "HSCA Staff Payroll Records: Miriam Rudder",
  "date": "1977-01-01",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Miriam Rudder",
    "Louis Stokes",
    "Tom Howarth",
    "Donovan L. Gay",
    "Henry B. Gonzalez",
    "Thomas H. Downing",
    "Richard A. Sprague",
    "Patricia Price"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Various HSCA Officials"
}