{
  "classification": "Administrative",
  "document_type": "Final Determination Notification and Payroll Authorization Forms",
  "security": "The document is partially postponed due to the redaction of Social Security numbers, as the public disclosure could reasonably be expected to constitute an unwarranted invasion of personal privacy. The Board determined that this invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (U)",
  "summary": "This document is a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically concerning Joyce Ann Larkin. It details the postponement of information (Social Security numbers) due to privacy concerns and includes multiple Payroll Authorization Forms outlining Larkin's employment history with the Select Committee on Assassinations.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, regarding HSCA staff payroll records, specifically document number 180-10060-10462, which includes payroll authorization forms for Joyce Ann Larkin. The document outlines the board's decision to postpone the release of Social Security numbers contained within the records, citing concerns over unwarranted invasion of personal privacy. Accompanying the notification are copies of Larkin's payroll authorization forms, spanning from January 1977 to December 1978, documenting her employment history with the Select Committee on Assassinations under the authority of various House Resolutions and the signatures of authorizing officials such as Louis Stokes and Thomas H. Downing.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Assassination Records Review Board",
    "Joyce Ann Larkin",
    "Social Security Number",
    "Privacy",
    "Louis Stokes",
    "Thomas H. Downing"
  ],
  "title": "HSCA Staff Payroll Records - Joyce Ann Larkin",
  "date": "1977-01-01",
  "locations_mentioned": [
    "Washington, D.C."
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Joyce Ann Larkin",
    "Louis Stokes",
    "Thomas H. Downing",
    "Richard A. Sprague",
    "Henry B. Gonzalez"
  ],
  "recipient": "Clerk of the House of Representatives"
}