{
  "classification": "Numbered Files",
  "document_type": "Memo",
  "security": "Releasing information on Lawrence Huber Florer's military service, physical characteristics, and personal life could potentially violate his privacy. The document does not contain information that would compromise national security or intelligence operations.",
  "security_level": "Unclassified",
  "summary": "Jack Moriarty, an investigator with the HSCA, details his review of Lawrence Huber Florer's USAF file, noting his enlistment, assignment within the Texas Air National Guard, and personal details such as his birthdate, family, education, and physical characteristics.",
  "summary_one_paragraph": "On June 28, 1978, HSCA investigator Jack Moriarty reviewed Lawrence Huber Florer's U.S. Air Force file at the Pentagon in response to a request from Judy Miller's office. The file indicated that Florer enlisted in the USAF on August 30, 1962, in Dallas, Texas, and received an honorable discharge on August 29, 1968, at Hensley Field, Dallas. His assignment was with the 136th Air Refueling Group, Texas Air National Guard, where he rose from Basic Airman to Sergeant (Specialty Accounting). The file also contained his birthdate (July 25, 1940), information about his family, his educational background, marriage details, physical characteristics (including height, weight, and a scar), and a record of weekend attendance.",
  "tags": [
    "HSCA",
    "Lawrence Huber Florer",
    "USAF",
    "Military Records",
    "Hensley Field",
    "Texas Air National Guard"
  ],
  "title": "Lawrence Huber Florer",
  "date": "1978-06-28",
  "locations_mentioned": [
    "Dallas, Texas",
    "Hensley Field, Dallas, Texas",
    "Wichita Falls, Texas",
    "Denton, Texas"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Lawrence Huber Florer",
    "Jack Moriarty",
    "Surell Brady",
    "Judy Miller",
    "Gladys H. Florer",
    "Barbara Watson"
  ],
  "recipient": "Surell Brady",
  "sender": "Jack Moriarty"
}