{
  "classification": "Administrative",
  "document_type": "Final Determination Notification and Payroll Forms",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (originally)",
  "summary": "This document contains the Assassination Records Review Board's final determination regarding a HSCA staff payroll record, specifying that Social Security Numbers are postponed from release to protect personal privacy. It also includes payroll authorization forms and memoranda related to Yvonne Briggs' employment with the HSCA.",
  "summary_one_paragraph": "This collection of documents consists of the Assassination Records Review Board's final determination notification concerning HSCA staff payroll records, alongside payroll authorization forms and memoranda detailing the employment of Yvonne Briggs. The Review Board postponed the release of Social Security Numbers to prevent unwarranted invasion of personal privacy, with a next review date set for 2017. The attached payroll documents outline Yvonne Briggs' position, salary adjustments, and committee assignments within the HSCA, authorized by Louis Stokes and documented by I. Charles Mathews.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Yvonne Briggs",
    "Louis Stokes",
    "I. Charles Mathews",
    "Social Security Numbers",
    "Privacy",
    "Payroll Authorization"
  ],
  "title": "Final Determination Notification and Payroll Records Regarding Yvonne Briggs",
  "date": "1978-03-15",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Yvonne Briggs",
    "Louis Stokes",
    "Thomas Howarth",
    "I. Charles Mathews"
  ],
  "recipient": "Clerk of the House of Representatives, Thomas Howarth",
  "sender": "Assassination Records Review Board, Louis Stokes, I. Charles Mathews"
}