{
  "classification": "Administrative",
  "document_type": "Memoranda and Personnel Records",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (Initially Restricted)",
  "summary": "This document pertains to the release status of HSCA staff payroll records related to Rita L. Morton, with Social Security numbers postponed due to privacy concerns, and includes related correspondence and payroll authorizations.",
  "summary_one_paragraph": "This document details the status of HSCA staff payroll records, specifically concerning Rita L. Morton, and notes the postponements related to the release of her Social Security number due to privacy concerns. It includes correspondence from Louis Stokes and Alvin B. Lewis, Jr. regarding Morton's resignation from the Select Committee on Assassinations, payroll authorization forms detailing her employment and salary adjustments, a resume outlining her previous work experience, and internal memoranda related to her employment with the committee. The Review Board has determined that the public interest is outweighed by the unwarranted invasion of personal privacy that would result from the release of her Social Security number.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Rita L. Morton",
    "Social Security Number",
    "Privacy",
    "Personnel Records",
    "Employment History"
  ],
  "title": "HSCA Staff Payroll Records Regarding Rita L. Morton",
  "date": "1976-12-27",
  "locations_mentioned": [
    "Washington, D.C.",
    "Suitland, Maryland"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Rita L. Morton",
    "Louis Stokes",
    "Alvin B. Lewis, Jr.",
    "Robert K. Tanenbaum",
    "Rebecca Wheeler Martin",
    "Henry B. Gonzalez",
    "Thomas N. Downing",
    "Richard A. Sprague",
    "Lindy (Mrs. Hale) Boggs",
    "Wallace O. Green",
    "Bea Smith",
    "Karen Butler",
    "Tommy Goines",
    "Joan Thornell"
  ],
  "recipient": "Clerk of the House of Representatives; All Staff Employees"
}