{
  "classification": "Leads and Information",
  "document_type": "Memo",
  "security": "This memorandum details information received from Jimmy Johnson, who is acting as an informant, regarding David Ferrie's activities, including potential illegal activities such as possession of incendiary bombs and suspicious conversations about a secluded island. Revealing these details could compromise the informant, jeopardize the ongoing investigation, and alert the subject, Ferrie, to the scrutiny he is under.",
  "security_level": "Unclassified",
  "summary": "A memorandum from Lynn Loisel to Louis Ivon details a phone call from Jimmy Johnson regarding David Ferrie's activities, including possible illegal activities and suspicious conversations.",
  "summary_one_paragraph": "On January 11, 1967, Lynn Loisel sent a memorandum to Louis Ivon detailing a phone call received on January 10 from Jimmy Johnson, a former associate of David Ferrie who was acting as an informant for the New Orleans District Attorney's office. Johnson reported that Ferrie had been in contact with Pershing regarding information in a Saturday Evening Post article, spoke with an unnamed lawyer about being investigated, possessed army paraphernalia including incendiary bombs, and showed nude films to young boys. Johnson also reported that Ferrie and Steve Littleton discussed a small island where they might land a twin-engine beachcraft, possibly scouting it by smaller plane.",
  "tags": [
    "David Ferrie",
    "Jimmy Johnson",
    "Steve Littleton",
    "New Orleans District Attorney",
    "Informant",
    "Possible Illegal Activities",
    "Cuban Woman",
    "Smith Case",
    "Twin-Engine Beachcraft",
    "Incendiary Bombs"
  ],
  "title": "PHONE CALL FROM JIMMY JOHNSON REGARDING FERRIE AND THE SMITH CASE",
  "date": "1967-01-11",
  "locations_mentioned": [
    "New Orleans"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "David Ferrie",
    "Jimmy Johnson",
    "Louis Ivon",
    "Lynn Loisel",
    "Steve Littleton",
    "Pershing"
  ],
  "recipient": "Louis Ivon",
  "sender": "Lynn Loisel"
}