{
  "classification": "Personnel",
  "document_type": "Final Determination Notification & Payroll Records",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified",
  "summary": "This document is a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically concerning the postponement of Social Security numbers to protect personal privacy. It includes payroll authorization forms and related documents for Ann Furnald Taylor, detailing her employment with the Select Committee on Assassinations from 1977 to 1978.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, concerning HSCA staff payroll records, which includes a decision to postpone the release of Social Security numbers due to privacy concerns. The document also contains payroll authorization forms and a personal leave record for Ann Furnald Taylor, who was employed by the Select Committee on Assassinations from January 1977 to July 1978. These records detail her position, salary adjustments, leave usage, and termination, with authorizations signed by Louis Stokes and Henry B. Gonzalez, among others.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Ann Furnald Taylor",
    "Social Security Numbers",
    "Privacy",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Termination",
    "Select Committee on Assassinations"
  ],
  "title": "Assassination Records Review Board Final Determination Notification and HSCA Staff Payroll Records",
  "date": "1977-01-01",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Ann Furnald Taylor",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas H. Downing",
    "Richard A. Sprague"
  ],
  "recipient": "All Staff Employees",
  "sender": "Budget Officer"
}