{
  "classification": "Personnel",
  "document_type": "Interview",
  "security": "Revealing Langelle's continued CIA affiliation while posing as a State Department employee, his role in handling CIA communications in Moscow, his recruitment efforts, and his role in the Popov case could expose covert operations, compromise relationships with foreign intelligence services, and damage the CIA's reputation.  Specifically, the document states 'Langelle was deliberately tough on CIA personnel who breached security, in order to build his cover as a non- CIA foreign service officer' and 'In 1959 the Soviets declared Langelle persona non grata as a result of his involvement with P.S. Popov'.",
  "security_level": "SECRET",
  "summary": "Russell August Langelle was interviewed in May 1978 regarding his CIA service, including his cover as a State Department employee, his work in Moscow, and his knowledge of Lee Harvey Oswald.",
  "summary_one_paragraph": "On May 4, 1978, Robert Genzman and Harold Lep interviewed Russell August Langelle at CIA Headquarters, where Langelle provided details about his career, which began in September 1950 within the Soviet Russia Division. Langelle explained that he resigned from the Agency in November 1955 as a cover, later working for the State Department while secretly remaining with the CIA. Langelle served as a Security Officer at the Moscow Embassy, also acting as the senior CIA officer.  He was declared persona non grata by the Soviets due to his involvement with P.S. Popov, and he recalled hearing about Lee Harvey Oswald's defection while in Moscow. At the time of the interview, Langelle was still with the CIA, paid by the State Department, and planning to retire.",
  "tags": [
    "CIA",
    "Langelle",
    "Covert Operations",
    "Moscow",
    "Oswald",
    "Soviet Russia Division",
    "State Department",
    "Popov",
    "Security Officer"
  ],
  "title": "Russell August Langelle Interview",
  "date": "1978-05-04",
  "locations_mentioned": [
    "Moscow",
    "Vienna",
    "Soviet Union",
    "United States"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Russell August Langelle",
    "Robert Genzman",
    "Harold Lep",
    "Allan Dulles",
    "John Maury",
    "Joe Bulik",
    "Quentin Johnson",
    "George Risevaljer",
    "Frank Levy",
    "Ted Polling",
    "Jack Kindschi",
    "June Sworbuck",
    "Ed Galloway",
    "Leonard Mc Coy",
    "Pierre de Silva",
    "Lee Harvey Oswald",
    "P.S. Popov",
    "George P. Winters",
    "Mahoney",
    "Wenables",
    "Steveos Washenko",
    "Jean Leberman",
    "Leo Dulacki",
    "Paul Adams",
    "John Munson",
    "Ted Hoffman",
    "Alexis Davison",
    "John Abidian",
    "Hugh Montgomery",
    "Garbler",
    "Rodney Carlson",
    "Bill Horvaly",
    "John D. Hemenway",
    "John Mawry",
    "Howard Osborne",
    "David E. Murphy",
    "R. G. Korengold",
    "Alive Mosby",
    "A. I. Goldberg",
    "Priscilla Johnson"
  ],
  "recipient": "C/A Headquarters",
  "sender": "Robert Genzman and Harold Lep"
}