{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Authorization Forms",
  "security": "The document contains employee social security numbers, which are redacted to prevent an unwarranted invasion of personal privacy. \"The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "Unclassified (U)",
  "summary": "This document includes a Final Determination Notification from the Assassination Records Review Board regarding the postponement of certain information, specifically Social Security numbers, within the HSCA's staff payroll records, along with several payroll authorization forms for Elizabeth Ann Wolf. The Review Board postponed the release of Social Security numbers to protect personal privacy, deeming that their disclosure would cause an unwarranted invasion of privacy outweighing public interest.",
  "summary_one_paragraph": "The document is composed of a Final Determination Notification from the Assassination Records Review Board regarding the postponement of Social Security numbers in the HSCA's staff payroll records and several payroll authorization forms for Elizabeth Ann Wolf. The Review Board's decision to postpone the release was based on privacy concerns, stating that disclosure of Social Security numbers would constitute an unwarranted invasion of personal privacy. Additionally, the document contains multiple payroll authorization forms detailing Elizabeth Ann Wolf's employment history with the Select Committee on Assassinations, including her appointments, salary adjustments, and positions held between 1977 and 1979, under the authorization of Louis Stokes, Henry B. Gonzalez and Thomas Downing.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Elizabeth Ann Wolf",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas N. Downing",
    "Assassination Records Review Board"
  ],
  "title": "Final Determination Notification and Payroll Records of Elizabeth Ann Wolf",
  "date": "1995-12-08",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Elizabeth Ann Wolf",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas N. Downing",
    "Richard A. Sprague"
  ],
  "recipient": "All Staff Employees",
  "sender": "Budget Officer"
}