{
  "classification": "Administrative",
  "document_type": "Printed Form/Memorandum",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest. Postponements: All the postponements in this document represent Social Security numbers.",
  "security_level": "Unclassified (Originally Restricted)",
  "summary": "This document is a payroll authorization form and related memorandum for Charlotte Green, who joined the House Select Committee on Assassinations (HSCA) as a summer intern in 1978, along with a final determination notification regarding the redaction of Social Security numbers.",
  "summary_one_paragraph": "This collection of documents pertains to the employment of Charlotte Green by the House Select Committee on Assassinations (HSCA) in 1978, including her appointment as a summer intern and subsequent payroll authorization. Included is a memorandum from I. Charles Mathews advising of Green's employment and salary, payroll authorization forms specifying her effective date and gross annual salary of $6240.00, and a certificate confirming her lack of familial relationship with any current member of Congress. Furthermore, there's a final determination notification from the Assassination Records Review Board regarding the postponement of Social Security numbers within the document to protect personal privacy, with a scheduled review in 2017.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Administration",
    "Charlotte Green",
    "Payroll Authorization",
    "Summer Intern",
    "Social Security Number Redaction",
    "Assassination Records Review Board",
    "FOIA"
  ],
  "title": "Payroll Authorization Form for Charlotte Green",
  "date": "1978-05-12",
  "locations_mentioned": [
    "Washington, D.C."
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Charlotte Green",
    "Louis Stokes",
    "Thomas Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews"
  ],
  "recipient": "Clerk of the House of Representatives"
}