{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "This document concerns Orlando Bosch, a figure known for anti-Castro activities and alleged involvement in terrorist acts. Referring to him as a \"paranoid psychopath\" and outlining his connections to various anti-Cuba groups (MI group, Amador Caval Zone) reveal details about sources and analytical methods used to assess individuals of interest. The cable states that none are \"Industelle currently active assets\"",
  "security_level": "SECRET",
  "summary": "This document summarizes six volumes of material on Orlando Bosch Avila, detailing his background, activities against Cuba, and relationships with various organizations. It includes assessments of Bosch's character and involvement in reported bombings and threats, as well as CIA's denials of his status as an active asset.",
  "summary_one_paragraph": "This is a summary of six volumes of documents regarding Orlando Bosch Avila, a Cuban exile involved in anti-Castro activities. It contains reports from the FBI, State Department cables, and CIA analyses covering the period from 1962 to 1978. Included are assessments of Bosch’s character, his connections to groups involved in operations against Cuba, and investigations into his alleged participation in terrorist acts, such as bombings. The document also references an inquiry into the possible CIA connections with Bosch and others named in a news article, with the CIA denying their active asset status.",
  "tags": [
    "Orlando Bosch Avila",
    "DDO",
    "Cuban Exile",
    "Anti-Castro Activities",
    "Terrorism",
    "Bay of Pigs",
    "CIA",
    "FBI",
    "State Department",
    "Venezuela",
    "WKSCARLET",
    "Kissinger",
    "Ricardo Morales Navarette",
    "Luis Posada Carriles"
  ],
  "title": "Orlando Bosch Avila - DDO - Six Volumes",
  "date": "1978-08-01",
  "persons_mentioned": [
    "Orlando Bosch Avila",
    "Evelio Duques",
    "Henry Kissinger",
    "Norberto Hernandez Gurbeto",
    "Justavs A. Vollmer",
    "Frank Castro",
    "Allende",
    "Morales",
    "Byson W. Jutradt",
    "Ricardo Morales Navarette",
    "Orlando Garcia Vasquez",
    "Luis Posada Carriles",
    "John F Sullivan Jr.",
    "Mechiael W. Renich"
  ],
  "recipient": "Palmer",
  "sender": "Palmer, John F Sullivan Jr. / Mechiael W. Renich Office of Security"
}