{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Personnel Records",
  "security": "The document contains Kevin Sean Doyle's Social Security number which is redacted because public disclosure could \"reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a notification from the Assassination Records Review Board regarding the status of HSCA staff payroll records, specifically concerning Kevin Sean Doyle. It details the postponements related to Social Security numbers and the reasons for those postponements, citing privacy concerns.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, regarding HSCA staff payroll records, including those of Kevin Sean Doyle. The Board decided to postpone in part the release of these records due to privacy concerns related to Social Security numbers, which were redacted. The Board determined that releasing these numbers would constitute an unwarranted invasion of personal privacy, outweighing the public interest. The document includes payroll authorization forms, a personal leave record, a duty status report, and Doyle's resume, all pertaining to his employment with the Select Committee on Assassinations.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Kevin Sean Doyle",
    "Social Security Number",
    "Privacy",
    "Assassination Records Review Board",
    "Personnel Records"
  ],
  "title": "Final Determination Notification regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "persons_mentioned": [
    "Kevin Sean Doyle",
    "Louis Stokes",
    "Richard Smith",
    "Donovan Gay",
    "Bob Morrison",
    "Henry B. Gonzalez",
    "Thomas N. Downing",
    "Richard A. Sprague"
  ],
  "recipient": "All Staff Employees",
  "sender": "Budget Officer, HSCA"
}