{
  "classification": "Personnel",
  "document_type": "Payroll Authorization Forms and Memorandum",
  "security": "The document contains employee Social Security numbers which are redacted. Reason for Board Action: The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified",
  "summary": "This document consists of payroll authorization forms and a memorandum related to Belford L. Lawson III's employment with the House Select Committee on Assassinations (HSCA) from December 1976 to December 1978, including changes in his position title and gross annual salary. A memorandum requests staff to disclose any relationships to current members of Congress.",
  "summary_one_paragraph": "This collection of documents pertains to the employment history of Belford L. Lawson III within the House Select Committee on Assassinations (HSCA). It includes payroll authorization forms indicating various appointments, salary adjustments, and Lawson's termination, spanning from December 1, 1976, to December 31, 1978. The forms detail Lawson’s role as Staff Counsel, along with his corresponding gross annual salary, which varied between $12,300 and $27,100. Additionally, the collection contains a memorandum dated January 3, 1977, requesting all staff employees to disclose any familial relationships with current members of Congress for payroll certification purposes, ensuring compliance with regulations prohibiting the employment of relatives.",
  "tags": [
    "HSCA",
    "Payroll",
    "Belford L. Lawson III",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas M. Downing",
    "Employment Records",
    "Social Security Numbers",
    "Personnel Records",
    "House Select Committee on Assassinations"
  ],
  "title": "HSCA Staff Payroll Records: Payroll Authorization Forms for Belford L. Lawson III",
  "date": "1976-12-01",
  "locations_mentioned": [
    "Washington, D.C."
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Belford L. Lawson III",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas M. Downing",
    "Richard A. Sprague"
  ],
  "recipient": "Clerk of the House of Representatives, All Staff Employees",
  "sender": "Thomas M. Downing, Henry B. Gonzalez, Louis Stokes, Budget Officer"
}