{
  "classification": "Investigation",
  "document_type": "Summary",
  "security": "This document primarily contains interview information and personal details, but the mention of potential confessions among George De Mohrenschildt's papers could generate significant public interest and speculation. ",
  "security_level": "Unclassified",
  "summary": "This document is a summary of an interview with Gary Edward Taylor on June 11, 1978, conducted by the HSCA regarding his knowledge of Lee Harvey Oswald and George De Mohrenschildt.",
  "summary_one_paragraph": "On June 11, 1978, the HSCA interviewed Gary Edward Taylor, a cab driver from Dallas, Texas, concerning his associations with Lee Harvey Oswald and George De Mohrenschildt in 1962. Taylor described Oswald as unsociable and generally disliked his time in Russia. He recounted De Mohrenschildt's unusual interest in helping Oswald, including providing financial assistance and introducing him to friends. Taylor also mentioned that Marina Oswald had shown him a rifle and appeared to be afraid of Lee. The interview touched on Taylor's past employment, acquaintances, and a rumor from Alexandra De Mohrenschildt about a potential confession among George De Mohrenschildt's estate papers.",
  "tags": [
    "HSCA",
    "Gary Edward Taylor",
    "Lee Harvey Oswald",
    "Marina Oswald",
    "George De Mohrenschildt",
    "Interview",
    "Warren Commission",
    "Confession"
  ],
  "title": "Interview Schedule and Outside Contact Report Regarding Gary Edward Taylor",
  "conspiracy": "The document alludes to a potential confession among George De Mohrenschildt's papers, based on information from Alexandra De Mohrenschildt, which could provide insight into the circumstances surrounding JFK's assassination. However, the document offers no further details other than Taylor mentioning this to the interviewer.",
  "date": "1978-06-11",
  "locations_mentioned": [
    "Dallas, Texas",
    "Fort Worth, Texas",
    "Oakcliff, Texas",
    "Russia",
    "Minsk",
    "Redstone Arsenal, Alabama"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Gary Edward Taylor",
    "Lee Harvey Oswald",
    "Marina Oswald",
    "George De Mohrenschildt",
    "Alexandra De Mohrenschildt",
    "Lila Marie Taylor",
    "Cynthia Marie Taylor",
    "Clarence J. Day",
    "Jack Genner",
    "Edward Epstein",
    "Donald Waltrum",
    "Jack Moore",
    "R. K. Johnson",
    "Sigmund Andrews",
    "Norma Holiman",
    "William Holiman",
    "Ken Brown",
    "J. E. Sellers",
    "Lenin",
    "Karl Marx",
    "Adolph Hitler"
  ],
  "sender": "Taylor, Gary"
}