{
  "classification": "Cuba",
  "document_type": "DDO - SIP Volumes",
  "security": "Agency afraid they will compromise WK. Searlet/3",
  "security_level": "SECRET",
  "summary": "This document contains information on Orlando Bosch Avila, including his association with anti-Cuba operations, his CIA involvement and subsequent clearance cancellation, and his activities related to bombings and assassination attempts. It includes reports from the FBI, State Department, and other agencies, as well as details on his contacts and investigations related to the Cuban ambassador and Henry Kissinger.",
  "summary_one_paragraph": "This collection of documents, spanning from 1962 to 1978, focuses on Orlando Bosch Avila, a Cuban exile involved in anti-Cuba activities. The records detail Bosch's initial cooperation with the CIA, his subsequent clearance cancellation despite passing polygraphs, and his leadership role in securing financial backing for operations against Cuba. The documents include biographical data describing him as shrewd and possibly a paranoid psychopath, reports of bombings, assassination attempts (including against Kissinger and Allende), and his contacts with individuals like WK Scarlet/3 and Frank Cartes. The collection also references sealed FBI and State Department documents and cables related to Bosch's activities and investigations into his involvement in various events.",
  "tags": [
    "Orlando Bosch Avila",
    "Cuba",
    "CIA",
    "FBI",
    "State Department",
    "Bay of Pigs",
    "WK Scarlet/3",
    "Henry Kissinger",
    "Salvador Allende",
    "Terrorism",
    "Bombings",
    "Assassination Attempts"
  ],
  "title": "Orlando Bosch Avila - DDO - SIP Volumes",
  "date": "1978-08-01",
  "locations_mentioned": [
    "Santa Clara, Cuba",
    "Caracas",
    "Santiago",
    "Buenos Aires",
    "Miami"
  ],
  "origin_agency": "Central Intelligence Agency",
  "persons_mentioned": [
    "Orlando Bosch Avila",
    "Evelis Duques",
    "Henry Kissinger",
    "Juan Bosch",
    "Norberto Hernandez Curbelo",
    "Gustavo A. Vollmer",
    "Frank Cartes",
    "Salvador Allende",
    "W. Jutradt",
    "Morales"
  ],
  "recipient": "US"
}