{
  "classification": "Mexico, Oswald",
  "document_type": "Report, Interview",
  "security": "Phillips stated that he did have access, and did use in some of his propaganda activities, agents who were located outside of Mexico. In response to a direct question Mr. Phillips acknowledged that the Station other than just reporting could, and often did, take actions/in regard to Americans in Mexico that were in contact with Soviet or Bloc Embassies without a specific request from another interested agency; i.e., they often took investigative and operational action on their own initiative.",
  "security_level": "Unclassified",
  "summary": "This document contains a chronology of Lee Harvey Oswald's visits to the Soviet and Cuban embassies in Mexico City in September 1963, including descriptions of his interactions and physical appearance, along with an interview of David Atlee Phillips regarding CIA activities in Mexico, particularly concerning Cuban operations and knowledge of Oswald and Silvia Duran.",
  "summary_one_paragraph": "This document presents a timeline of Lee Harvey Oswald's activities at the Soviet and Cuban embassies in Mexico City in September 1963, detailing his visa applications, contacts, and physical descriptions provided by embassy staff. It also includes a 1978 HSCA interview with David Atlee Phillips, former Chief of Covert Action in Mexico City, discussing CIA propaganda efforts, Cuban operations, relationships with other agencies like the FBI, and his knowledge of individuals like Silvia Duran and potential agency interest in her. Phillips provides insights into the CIA's handling of agents, surveillance activities, and the extent of their interest in Americans contacting Soviet or Bloc embassies.",
  "tags": [
    "Lee Harvey Oswald",
    "Mexico City",
    "Soviet Embassy",
    "Cuban Embassy",
    "Visa",
    "David Atlee Phillips",
    "CIA",
    "HSCA",
    "Silvia Duran",
    "Propaganda",
    "Cuban Operations",
    "Win Scott",
    "Counter-Intelligence",
    "Carlos Blanco",
    "Teresa Proenza"
  ],
  "title": "Chronology of Oswald's Visits to the Soviet and Cuban Embassies & HSCA Interview of David Atlee Phillips",
  "date": "1963-09-26",
  "locations_mentioned": [
    "Mexico City",
    "Cuba",
    "Russia",
    "Odessa",
    "Miami"
  ],
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Lee Harvey Oswald",
    "Marina Oswald",
    "Silvia Duran",
    "Azcue",
    "TelTry",
    "David Atlee Phillips",
    "Win Scott",
    "Robert Shaw",
    "Hal Swenson",
    "William Kent",
    "James Flannery",
    "Clarence Boonstra",
    "Lachuga",
    "Carlos Blanco",
    "Teresa Proenza",
    "Barney Hidalgo",
    "Thomas Mann"
  ],
  "recipient": "Unknown",
  "sender": "CIA"
}