{
  "classification": "Personnel",
  "document_type": "Memoranda, Payroll Records, Resumes, Letters, Printed Form",
  "security": "The redaction of Social Security numbers is to prevent unwarranted invasion of personal privacy. As stated: “The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.” Releasing unredacted forms with SSNs could violate privacy laws and harm individuals.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document consists of Cornish F. Hitchcock's personnel records, including his resume, payroll authorizations, and related correspondence, documenting his employment with the HSCA from January to June 1977, including a recommendation for a salary adjustment.",
  "summary_one_paragraph": "This collection of documents details the employment history of Cornish F. Hitchcock with the House Select Committee on Assassinations (HSCA) during 1977. It includes his resume highlighting his educational background and prior work experience, memoranda recommending his hiring and a subsequent salary adjustment, payroll authorization forms showing his changing salary, correspondence related to his resignation, and a letter of recommendation from Stewart B. McKinney. The documents chronicle his time with the committee from January to June, providing a comprehensive overview of his short tenure and the administrative processes surrounding his employment.",
  "tags": [
    "HSCA",
    "Cornish F. Hitchcock",
    "Payroll Records",
    "Employment History",
    "Personnel Records",
    "Salary Adjustments",
    "House Select Committee on Assassinations"
  ],
  "title": "Staff Payroll Records Regarding Cornish F. Hitchcock",
  "date": "1977-01-01",
  "locations_mentioned": [
    "Washington, D.C.",
    "Connecticut",
    "Chicago, Illinois"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Cornish F. Hitchcock",
    "Stewart B. McKinney",
    "Richard Feeney",
    "Louis Stokes",
    "Thomas Lambeth",
    "Robert J. Lehner",
    "Sheila Jackson Lee",
    "Al Lewis",
    "Richard A. Sprague",
    "Henry B. Gonzalez",
    "William A. Dobrovir",
    "John P. Cotter"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Various (Richard J. Feeney, Stewart B. McKinney, Louis Stokes, Robert J. Lehner)"
}