{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "Redactions are made to protect Social Security numbers, as the public disclosure could reasonably be expected to constitute an unwarranted invasion of personal privacy. Quoting directly: 'The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.'",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a notification from the Assassination Records Review Board regarding the postponed release of information, specifically Social Security numbers, in HSCA staff payroll records. It also includes payroll records and related correspondence regarding Robert K. Tanenbaum's employment with the Select Committee on Assassinations, including authorizations, leave records, and a resume.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a final determination postponing in part the release of HSCA staff payroll records, specifically redacting Social Security numbers to protect personal privacy. The document, originating from the HSCA, includes various payroll authorization forms, a leave record, and correspondence relating to Robert K. Tanenbaum's employment as Deputy Chief Counsel for the Select Committee on Assassinations. These records detail his salary adjustments, dates of employment, and a request for retroactive payment due to an administrative error, along with Tanenbaum's resume outlining his legal career and qualifications.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Payroll Records",
    "Robert K. Tanenbaum",
    "Social Security Numbers",
    "Privacy",
    "Retroactive Pay",
    "Personnel Records"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C.",
    "New York, New York",
    "Philadelphia, PA",
    "Houston, Texas",
    "Berkeley, California"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Robert K. Tanenbaum",
    "Louis Stokes",
    "Frank Thompson, Jr.",
    "Edmund L. Henshaw, Jr.",
    "G. Robert Blakey",
    "Thomas H. Downing",
    "Henry B. Gonzalez",
    "Patricia Tyre Tanenbaum",
    "Rachael Katherine",
    "Frank Hogan",
    "Robert M. Morgenthau",
    "Joseph Piagentini",
    "Waverly Jones",
    "Joseph Gallo",
    "Vincent Aloi",
    "Peter Diapolous",
    "Joseph Gorgone",
    "Phillip Gambino",
    "John Arcaro",
    "Alphonse Indelicato",
    "Dominick Trinchera",
    "Jerry Langella",
    "Vic Orena",
    "Robert Bongiovi",
    "Samuel Wuyak",
    "Fritz Montalalou",
    "Marilyn Mackey",
    "Shaw Mackey",
    "Hosie Turner",
    "Roberta Herbert",
    "Charles Yukl",
    "Karin Schlegel",
    "Brian Murray",
    "Richard A. Sprague",
    "Robert H. Smith"
  ],
  "recipient": "All Staff Employees, Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board, Budget Officer, Louis Stokes, Frank Thompson, Jr., G. Robert Blakey, Robert M. Morgenthau"
}