{
  "classification": "Oswald",
  "document_type": "Report",
  "security": "Revealing the specific individuals within ONI who had knowledge of the Oswald file, along with their contact information, could expose intelligence sources and methods. Additionally, confirming the CIA's request for Oswald's photograph and its subsequent mailing to Mexico City could be seen as an operational detail that should remain protected. This request could also be seen as an operational detail that should remain protected. ",
  "security_level": "Unclassified",
  "summary": "This document is a report from the Department of Defense (DOD) to the House Select Committee on Assassinations (HSCA), providing information on Lee Harvey Oswald and responses to various inquiries regarding individuals and organizations related to the JFK assassination investigation, including details on Naval Investigative Service (NIS) activities, Lee Harvey Oswald's military service, and the handling of his photograph by the CIA and Navy.",
  "summary_one_paragraph": "In a letter dated June 22, 1978, Judith A. Miller of the DOD informs G. Robert Blakey, Chief Counsel and Director of the HSCA, that attached are fact sheets from the Department of the Navy responding to HSCA inquiries from March to June 1978. The fact sheets include negative results for many name checks, details about John Andrew LaRocca and Angelo Frank Bruno, and information on individuals like Zack Stout, George Arthur Wilkins, Jr., and Kerry Wendall Thornley. Additionally, the report outlines the Naval Investigative Service's (NIS) involvement and its relationship with the FBI and CIA during the 1960-1964 period, details regarding Lee Harvey Oswald's Marine Corps service and security clearance, and an explanation of the photograph of Oswald that was sent to Mexico City at the request of the CIA, along with a list of individuals knowledgeable about the ONI file on Oswald.",
  "tags": [
    "HSCA",
    "DOD",
    "Navy",
    "Lee Harvey Oswald",
    "Naval Investigative Service",
    "CIA",
    "FBI",
    "Mexico City",
    "ONI",
    "Military Intelligence"
  ],
  "title": "Fact sheets submitted by the Department of the Navy in response to inquiries from the Select Committee",
  "conspiracy": "The document confirms that the CIA requested a photograph of Oswald from the Navy to determine if he was the same person who contacted the Soviet Embassy in Mexico City, and that the photograph was subsequently mailed to Mexico City. This information could be relevant to understanding the extent of intelligence agency interest in Oswald prior to the assassination.",
  "date": "1978-06-22",
  "locations_mentioned": [
    "Washington, D.C.",
    "Mexico City",
    "Miami",
    "New Orleans",
    "Guantanamo Bay, Cuba",
    "Yokosuka, Japan",
    "NAS Atsugi, Japan"
  ],
  "origin_agency": "DOD",
  "persons_mentioned": [
    "G. Robert Blakey",
    "Judith A. Miller",
    "Lee Harvey Oswald",
    "Marina Nikolaevna Pusakova",
    "Valeriy Valdimirovich Kostiko",
    "Yuri Ivanovich Nosenko",
    "William P. Dolzel",
    "Alberto Hernandez Hechevarri",
    "Orest Pena",
    "Rolando Pelasz",
    "Clay Shaw",
    "Kerry Wendall Thornley",
    "Jonquin Villoda",
    "Luis Balbuena",
    "Eleanor E. Archer",
    "Anthony Colosacco",
    "Herman Milton",
    "John M. Geizzaffi",
    "Maurice Lerner",
    "Gordon McLendon",
    "Albert Meadows",
    "Isadore Miller",
    "Thomas R. Peasner",
    "Victor Periera",
    "Harry Raymond Pope",
    "Helen Kay Smith",
    "John Eli Stone",
    "Charles Tourine",
    "John Benton Turns",
    "Anthony Zoppi",
    "Richard Cain",
    "Jorge Alonso Pujol",
    "Henry Savaadra",
    "Irving Davidson",
    "James Plumeri",
    "Salvatore Granello",
    "John La Rocca",
    "Angelo Bruno",
    "Sam Mannarino",
    "Garbriel Mannarino",
    "Joseph Shimon",
    "Sergio Arcaha Smith",
    "George Woodcock, Jr.",
    "Zack Stout",
    "George Arthur Wilkins, Jr.",
    "Robert Augg",
    "Nelson Delgado",
    "Carson Roberts",
    "Thomas Arthur Vallee",
    "Allan 0. Thompson",
    "John E. Donovan",
    "Roger G. Morgan",
    "Mario Silvesto",
    "Gary Taylor",
    "Leonard Calvery",
    "Jack Brown",
    "Aline Mosley",
    "Pauline Bates",
    "Adrian Alba",
    "Mrs. G. Stanley Brown Vera",
    "Emmet Charles Babe, Jr.",
    "Lt. Francis Martello",
    "G. M. Fredrickson",
    "P. C. LeSourd",
    "J. A. Hazelton",
    "Rufus L. Taylor",
    "Robert P. Jackson, Jr.",
    "Jack O. Johnson",
    "John C. Lacy",
    "William H. Clark",
    "William Abbott",
    "Prosser W. Palmer",
    "Donald R. Paschal",
    "Paul Taylor"
  ],
  "recipient": "G. Robert Blakey",
  "sender": "Judith A. Miller"
}