{
  "classification": "Administrative",
  "document_type": "Other Textual",
  "security": "This document primarily consists of summaries and notes from Immigration and Naturalization Service (INS) files on various individuals. Releasing it could reveal law enforcement sensitive information and potentially compromise privacy.",
  "security_level": "Unclassified",
  "summary": "This document contains INS file reviews conducted by Howard Shapiro, summarizing information on individuals including Benny Binion, Joe Campisi, Joseph Civello, and others, with notes on their backgrounds, activities, and connections.",
  "summary_one_paragraph": "This document, dated 10/6/201, comprises Immigration and Naturalization Service (INS) file reviews conducted by Howard Shapiro. The file reviews contain typed notes summarizing information from INS files on individuals such as Benny Binion, with details on his criminal history and tax evasion; Joe Campisi, identified as a gambler with connections to influential people; Joseph Civello, with references to Mafia connections and a narcotics conviction; Milton Jaffe, linked to gambling circles in Las Vegas; and several Cuban individuals, including Pedro Digno Fox-Zamora and Luis Eusebio Balbueka-Calzadillo, noting their entry into the U.S., occupations, and affiliations. The document also references a file on Edward Ivan Arthur which was deleted for HSCA due to the 3rd agency rule.",
  "tags": [
    "INS Files",
    "File Review",
    "Benny Binion",
    "Joe Campisi",
    "Joseph Civello",
    "Milton Jaffe",
    "Cuban exiles",
    "Gambling",
    "Organized Crime",
    "HSCA"
  ],
  "title": "INS File Reviews",
  "date": "0000-00-00",
  "locations_mentioned": [
    "Dallas",
    "Leavenworth",
    "Havana",
    "Miami",
    "Guantanamo Bay",
    "Pittsburgh",
    "Las Vegas",
    "Mexico City"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Benny Binion",
    "Joe Campisi",
    "Milton Jaffe",
    "Joseph Civello",
    "Pedro Digno Fox-Zamora",
    "Luis Eusebio Balbueka-Calzadillo",
    "Edward Browder, Jr.",
    "Norman Rothman",
    "Dominick Bartone",
    "Edward Ivan Arthur",
    "Herbert Noble",
    "Carlo Campisi",
    "Jimmy Maggiotta",
    "Frank Desimone",
    "Ross Musso",
    "John Cusach",
    "Gabriel Mannarino",
    "Sammy Mannarino",
    "Trafficante",
    "Batista",
    "Robert E. Cesner, Jr.",
    "Harry Remer Urban"
  ]
}