{
  "classification": "Personnel",
  "document_type": "Printed Form/Memorandum",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (Initially Restricted)",
  "summary": "This document includes payroll authorization forms and memoranda related to Kenneth S. McHargh's employment with the House Select Committee on Assassinations (HSCA), particularly with the Martin Luther King Task Force, including his appointment, salary, and termination. It also contains a payroll certification form regarding employees' relationships to members of Congress and a memorandum advising of McHargh's acceptance of a Staff Attorney position.",
  "summary_one_paragraph": "This collection of documents pertains to the personnel records of Kenneth S. McHargh during his time with the HSCA. It encompasses a payroll authorization form dated February 22, 1978, detailing his appointment as a Staff Attorney at an annual salary of $27,000, and another form for his termination effective December 31, 1978. Additional items include a memorandum notifying staff of McHargh's new position within the Martin Luther King Task Force and a payroll certification form used to verify relationships between staff members and current members of Congress, which McHargh signed on February 22, 1978, confirming he was not related to any member.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Kenneth S. McHargh",
    "Martin Luther King Task Force",
    "Payroll Authorization",
    "Personnel Records",
    "Social Security Number Redaction",
    "Louis Stokes"
  ],
  "title": "Payroll Records of Kenneth S. McHargh, HSCA Staff",
  "date": "1978-02-22",
  "persons_mentioned": [
    "Kenneth S. McHargh",
    "Louis Stokes",
    "Thomas Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Louis Stokes"
}