{
  "classification": "Mexico",
  "document_type": "Transcript",
  "security": "Robert T. Shaw declines to reveal the names of the Cuban penetration agents, LITAMIL-7 and LITAMIL-9, citing concerns for their safety, as they are believed to be living in Mexico. He states, \"It is my understanding that both of these people are, if they are still alive, are living in Mexico and I do not want to be in a position of revealing a name which could harm either of those people. I notice here that it says... 'To provide the affected person the opportunity to receive guidance from me or my designees on the applicability of this authorization, particularly to questions which are asked.' I would like to get Frank Carlucci to tell me that I would reveal two names of agents, if it is necessary or you can find out from the file, probably, who they are.\"",
  "security_level": "Secret",
  "summary": "This is a transcript of the testimony of Robert T. Shaw, an Inspector with the CIA's Office of the Inspector General, before the House Select Committee on Assassinations (HSCA) on May 16, 1978, focusing on CIA activities in Mexico City in 1963 related to Lee Harvey Oswald and Cuban operations.",
  "summary_one_paragraph": "On May 16, 1978, Robert T. Shaw, a CIA Inspector, testified before the HSCA regarding his experiences in Mexico City in 1963. Shaw discussed his role in Cuban operations, the presence of penetration agents within the Cuban Embassy and consulate (LITAMIL-7 and LITAMIL-9), and the telephone tap operation targeting the Cuban mission. He provided insights into the file-keeping system under Station Chief Winston Scott and the roles of individuals like Allen White, Annie Goodpasture, and David Phillips. Shaw also discussed the review process for transcripts and summaries of the tapped conversations but declined to reveal the names of the Cuban agents for their protection, citing concerns about their safety in Mexico.",
  "tags": [
    "CIA",
    "HSCA",
    "Robert T. Shaw",
    "Testimony",
    "Mexico City",
    "Lee Harvey Oswald",
    "Cuban Operations",
    "Winston Scott",
    "David Phillips",
    "Telephone Taps",
    "LITAMIL-7",
    "LITAMIL-9",
    "Penetration Agents"
  ],
  "title": "Testimony of Robert T. Shaw before the Committee",
  "date": "1978-05-16",
  "locations_mentioned": [
    "Washington, D.C.",
    "Fairfax, Virginia",
    "Honduras",
    "Mexico City",
    "Mexico",
    "Cuba",
    "Eastern Europe"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Robert T. Shaw",
    "Lee Harvey Oswald",
    "Sylvia Duran",
    "Michael Goldsmith",
    "Dan Hardway",
    "Carlucci",
    "Winston Scott",
    "Allen White",
    "Annie Goodpasture",
    "George Monroe",
    "David Phillips",
    "Ray Swider",
    "Peggy Magert",
    "Frank Carlucci"
  ],
  "sender": "SHAW, ROBERT T."
}