{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "Releasing information about Peter Carroll Glynn's work as an Intelligence Analyst by NOSIC (Naval Oceanic Surveillance Information Center) and his duties monitoring messages between Mexico and Cuba could expose sensitive intelligence operations and sources. Details of his security clearances and previous assignments are also considered security risks, particularly his comments about Cubans.",
  "security_level": "Unclassified",
  "summary": "A report by Jack Moriarty of the HSCA detailing an interview with Peter Carroll Glynn, Jr., an intelligence analyst who, while serving in the U.S. Army, monitored messages between Mexico and Cuba and overheard comments related to JFK's assassination.",
  "summary_one_paragraph": "On April 25, 1977, Jack Moriarty of the HSCA reported on an interview with Peter Carroll Glynn, Jr., an intelligence analyst at NOSIC. Glynn, who was stationed at Fort Walters, Texas, in 1963 as a radio technician, monitored communications between Mexico and Cuba. He recalled overhearing comments celebrating JFK's assassination, made by Cubans and Mexicans, and suggested that the ASA (Army Security Agency) might have recordings of these messages. Glynn provided a dossier and suggested that the HSCA investigate ASA data storage locations and other sites like Homestead Air Force Base for relevant information.",
  "tags": [
    "HSCA",
    "Peter Carroll Glynn, Jr.",
    "Pro-Castro Cubans",
    "Army Security Agency",
    "Naval Oceanic Surveillance Information Center",
    "JFK Assassination",
    "Mexico",
    "Cuba",
    "Fort Walters",
    "Homestead Air Force Base"
  ],
  "title": "Peter Carroll Glynn, Jr.",
  "date": "1977-04-25",
  "locations_mentioned": [
    "Suitland, Maryland",
    "Dumfries, Virginia",
    "Fort Walters, Mineral Wells, Texas",
    "Mexico",
    "Cuba",
    "Arlington Hall Station, Arlington, Virginia",
    "Homestead Air Force Base, Florida",
    "Fall River, Massachusetts",
    "Hubbard, Texas",
    "Omaha, Texas",
    "Baltimore, Maryland"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Peter Carroll Glynn, Jr.",
    "Jack Moriarty",
    "Clifford Fenton",
    "Charles R. Ginn",
    "Donald Noble",
    "Lawson Pilkinton",
    "Robert Lutes",
    "Carl Haller",
    "Kenneth Malzi",
    "Sidney Maddux"
  ],
  "recipient": "Clifford Fenton",
  "sender": "Jack Moriarty"
}