{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "The document contains employee Robert J. Lehner's Social Security Number (SSN), which has been redacted to protect personal privacy. As stated, 'The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.'",
  "security_level": "Unclassified",
  "summary": "This document is a notification from the Assassination Records Review Board regarding the postponed release of certain information, specifically Social Security numbers, from the HSCA's staff payroll records, along with payroll records of Robert J. Lehner.",
  "summary_one_paragraph": "This document contains a Final Determination Notification from the Assassination Records Review Board regarding HSCA's Staff Payroll Records related to Robert J. Lehner. The notification details postponements related to the release of Social Security numbers, citing unwarranted invasion of personal privacy. It also includes payroll authorization forms, leave records, and related correspondence showing Lehner's employment details with the Select Committee on Assassinations, including his positions, salary adjustments, and termination date. The board determined to postpone the release of social security numbers until a review in 2017.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Robert J. Lehner",
    "Social Security Numbers",
    "Privacy",
    "Payroll Authorizations",
    "Leave Records"
  ],
  "title": "Final Determination Notification: HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "persons_mentioned": [
    "Robert J. Lehner",
    "Louis Stokes",
    "Thomas Howarth",
    "I. Charles Mathews",
    "Henry B. Gonzalez",
    "Thomas N. Downing",
    "Richard A. Sprague",
    "Susan Reneer"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board, Budget Officer, Special Counsel, Chairman of Select Committee on Assassinations, Chairman of Committee on House Administration, U. S. Department of Justice Personnel Office: Attention: Susan Reneer, Budget Officer, All Staff Employees"
}