{
  "classification": "Administrative",
  "document_type": "Printed Form/Memorandum",
  "security": "This document contains personal information, specifically Peter G. Beeson's Social Security number, which is redacted to prevent an unwarranted invasion of personal privacy. As stated: 'The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.'",
  "security_level": "Unclassified (U)",
  "summary": "This document is a collection of payroll authorization forms, memos, and correspondence related to the employment of Peter G. Beeson by the House Select Committee on Assassinations (HSCA) in 1977-1978, including his salary, position titles, and a memo regarding his qualifications.",
  "summary_one_paragraph": "This collection of documents details the hiring and employment of Peter G. Beeson by the House Select Committee on Assassinations (HSCA) during 1977-1978. The documents include payroll authorization forms showing his appointments as Staff Counsel and Ass't Deputy Chief Counsel, his annual salaries, and a memo from Robert Lehner recommending Beeson for employment. It also includes a memo regarding payroll certification, requiring employees to disclose any relationships to current Members of Congress, and a letter from Beeson expressing interest in the position and requesting a specific salary, reflecting his prior experience with the Justice Department.",
  "tags": [
    "HSCA",
    "Peter G. Beeson",
    "Payroll Records",
    "Employment",
    "Louis Stokes",
    "Robert Blakey",
    "Robert Lehner",
    "Social Security Number",
    "Privacy"
  ],
  "title": "Final Determination Notification & Staff Payroll Records regarding Peter G. Beeson",
  "date": "1977-08-08",
  "locations_mentioned": [
    "Washington, D.C.",
    "Puerto Rico",
    "Atlanta"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Peter G. Beeson",
    "Louis Stokes",
    "Robert Blakey",
    "Robert Lehner"
  ],
  "recipient": "Clerk of the House of Representatives, All Staff"
}