{
  "classification": "Personnel",
  "document_type": "Final Determination Notification & Memoranda & Payroll Forms",
  "security": "The redaction of Social Security Numbers (SSNs) is justified to prevent \"an unwarranted invasion of personal privacy.\" Releasing SSNs could facilitate identity theft or other harmful uses of personal information.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically concerning William K. Triplett. The document also includes memoranda regarding staff employment and payroll certification, as well as payroll authorization forms.",
  "summary_one_paragraph": "This collection of documents pertains to the House Select Committee on Assassinations (HSCA) and includes a Final Determination Notification regarding staff payroll records, in particular those of William K. Triplett. It features a notification that the release of Social Security numbers is postponed due to privacy concerns, along with memoranda from Tom Lambeth and Kenneth D. Klein to Chairman Stokes recommending the employment of investigators and staff counsel, respectively. The collection also contains payroll authorization forms and a memo addressing payroll certification requirements, all contributing to an overview of administrative and personnel operations within the HSCA.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "William K. Triplett",
    "Social Security Numbers",
    "Personnel",
    "Assassination Records Review Board",
    "Louis Stokes",
    "Tom Lambeth",
    "Kenneth D. Klein"
  ],
  "title": "Assassination Records Review Board Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1977-07-17",
  "locations_mentioned": [
    "Washington, D.C."
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "William K. Triplett",
    "Louis Stokes",
    "Tom Lambeth",
    "Kenneth D. Klein",
    "Robert K. Tanenbaum"
  ],
  "recipient": "All Staff",
  "sender": "Tom Lambeth; Kenneth D. Klein"
}