{
  "classification": "Personnel",
  "document_type": "Printed Form/Memorandum",
  "security": "The document contains personal information such as social security numbers, which are redacted to prevent unwarranted invasion of personal privacy. Releasing this information could violate privacy laws. As stated in the document: 'The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.'",
  "security_level": "Unclassified (U)",
  "summary": "This document is a collection of personnel records related to Merete Muff Rosen's employment with the House Select Committee on Assassinations (HSCA) in 1977, including payroll authorizations, a relationship disclosure form, a leave record, and an inquiry regarding her character and qualifications.",
  "summary_one_paragraph": "This document comprises various personnel records pertaining to Merete Muff Rosen's employment with the HSCA in 1977. It contains payroll authorization forms detailing her salary adjustments and position as a Researcher, a form where she declares no relationship to current members of Congress, a personal leave record tracking her time off, and a personnel inquiry form completed by Thomas Howarth indicating she was a competent worker, but could not obtain security clearance due to her foreign background. The documents illustrate her employment details, including salary, position changes, and the reason for her eventual termination due to security clearance issues.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Merete Muff Rosen",
    "Personnel Records",
    "Payroll Authorization",
    "Security Clearance",
    "House Select Committee on Assassinations"
  ],
  "title": "Staff Payroll Records related to Merete Muff Rosen",
  "date": "1977-01-01",
  "locations_mentioned": [
    "Washington, D.C.",
    "Copenhagen, Denmark",
    "Beirut, Lebanon",
    "Jerusalem, Israel"
  ],
  "origin_agency": "HSCA (House Select Committee on Assassinations)",
  "persons_mentioned": [
    "Merete Muff Rosen",
    "Richard A. Sprague",
    "Thomas N. Deniny",
    "Henry B. Gonzalez",
    "Louis Stokes",
    "G. Robert Blakey",
    "Thomas Howarth",
    "Sue (unidentified)",
    "Donovan (unidentified)"
  ],
  "recipient": "All Staff Employees, Clerk of the House of Representatives, Budget Officer",
  "sender": "Budget Officer, Thomas Howarth, G. Robert Blakey"
}