{
  "classification": "Administrative",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (U)",
  "summary": "This document is a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically concerning Melvin Kreidman. Social Security numbers are postponed from release due to privacy concerns, and the document includes payroll authorizations, leave records, and internal memoranda related to Kreidman's employment.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, pertaining to HSCA staff payroll records. The document, which includes materials dated from 1977 and 1978, focuses on Melvin Kreidman's employment, detailing his appointment, leave records, and termination. Social Security numbers within the records have been postponed from release until 2017 due to privacy considerations, with the rationale that public disclosure would constitute an unwarranted invasion of personal privacy. The records encompass payroll authorizations, memoranda regarding Kreidman's administrative leave and reimbursement for expenses, and a form concerning employee relationships to members of Congress.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Melvin Kreidman",
    "Privacy",
    "Social Security Number",
    "Personnel Records"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "persons_mentioned": [
    "Melvin Kreidman",
    "Louis Stokes",
    "Thomas Howarth",
    "G. Robert Blakey",
    "Robert Edgar",
    "Charlie Mathews"
  ],
  "recipient": "Thomas Howarth, Budget Officer",
  "sender": "G. Robert Blakey, Chief Counsel and Director, Charlie Mathews, Special Counsel"
}