{
  "classification": "Personnel",
  "document_type": "Final Determination Notification & Payroll Authorization Forms",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (Initially Restricted)",
  "summary": "This document is a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically concerning Barbara L. Mosley. It includes payroll authorization forms detailing Mosley's employment history and salary adjustments within the HSCA.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification on December 8, 1995, regarding HSCA staff payroll records (Record Number 180-10060-10491), which includes payroll authorization forms for Barbara L. Mosley. The document, initially restricted, has been partially released with postponements related to Social Security numbers, which are redacted to prevent unwarranted invasion of personal privacy. The attached payroll forms, signed by Louis Stokes, detail Mosley's appointments, salary adjustments, and position titles within the HSCA from July 1977 to December 1978, including a memorandum recommending her hiring by Donovan L. Gay for the MLK Research Task Force.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Barbara L. Mosley",
    "Louis Stokes",
    "Social Security Number Redaction",
    "Assassination Records Review Board",
    "MLK Research Task Force"
  ],
  "title": "Final Determination Notification & Payroll Records for Barbara L. Mosley",
  "persons_mentioned": [
    "Barbara L. Mosley",
    "Louis Stokes",
    "Tom Lambeth",
    "Donovan L. Gay",
    "Gerald Hamilton",
    "Jackie Hess"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board, Louis Stokes (Authorizing Official, HSCA)"
}