{
  "classification": "Oswald",
  "document_type": "Summary/Interview",
  "security": "This document contains personal information about Richard Dennis Call and Lee Harvey Oswald, including their addresses, dates of birth, and social security numbers. Disclosing this information could violate their privacy. Additionally, details about Oswald's security clearance and military duties could reveal sensitive information about Marine Corps operations and security protocols.",
  "security_level": "Unclassified",
  "summary": "This document summarizes an interview with Richard Dennis Call, a former Marine Sergeant who supervised Lee Harvey Oswald at El Toro Bay Marine Air Station in 1959, providing insights into Oswald's personality, interests, and activities during his military service.",
  "summary_one_paragraph": "On June 6, 1978, Clarence Day interviewed Richard Dennis Call, a former Marine Sergeant who was Lee Harvey Oswald's supervisor at El Toro Bay Marine Air Station in 1959. Call described Oswald as a quiet, introverted 'oddball' with an interest in the Russian language and culture, noting that Oswald studied Russian, listened to Russian music, and subscribed to Russian periodicals. Call also mentioned that Oswald had a security clearance, was a good shot with a rifle, and was later granted a hardship discharge from the Marines, supposedly to attend university in Switzerland, because his mother was ill. Call stated that Oswald had never spoken to him about the U-2 program.",
  "tags": [
    "Richard Dennis Call",
    "Lee Harvey Oswald",
    "Marine Corps",
    "El Toro Bay Marine Air Station",
    "Russian Language",
    "Military Service",
    "HSCA",
    "Interview"
  ],
  "title": "Interview with Richard Dennis Call Regarding Lee Harvey Oswald's Military Service",
  "date": "1978-06-06",
  "locations_mentioned": [
    "El Toro Bay Marine Air Station, Santa Anita, California",
    "Flemington, New Jersey",
    "Switzerland"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Richard Dennis Call",
    "Lee Harvey Oswald",
    "Clarence Day",
    "Donavan",
    "Botello",
    "Edward Jay Epstein"
  ],
  "recipient": "N/A",
  "sender": "Richard Dennis Call"
}