{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Personnel Records",
  "security": "This document contains personal information such as social security numbers, which are redacted due to privacy concerns. Releasing these numbers could \"constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a notification from the Assassination Records Review Board regarding the postponed release of HSCA staff payroll records, specifically concerning Cecelia T. Morton, with redactions for Social Security numbers to protect personal privacy, as well as personnel records detailing her employment.",
  "summary_one_paragraph": "This document encompasses a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, primarily focusing on Cecelia T. Morton's employment details, including her appointment, leave record, and resignation from the Select Committee on Assassinations in 1977. Social Security numbers are redacted to prevent unwarranted invasion of personal privacy, and the document includes Morton's resume, typing test results, and internal memos related to her hiring and job duties within the HSCA.",
  "tags": [
    "HSCA",
    "Payroll Records",
    "Cecelia T. Morton",
    "Social Security Number",
    "Privacy",
    "Personnel Records",
    "Assassination Records Review Board",
    "Redaction"
  ],
  "title": "Assassination Records Review Board Final Determination Notification and HSCA Staff Payroll Records",
  "date": "1977-06-01",
  "persons_mentioned": [
    "Cecelia T. Morton",
    "Louis Stokes",
    "Tom Howarth",
    "Becky Martin",
    "Steve Fallis",
    "Eileen Copeland",
    "Nancy Schultz",
    "David Raphael",
    "Linda Porter",
    "Ken Barrington",
    "Mary Lansing",
    "Claire Earle",
    "Red Lon Burton",
    "Anne Wilander"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board, Cecelia T. Morton, Steve Fallis, Joint Committee on Congressional Operations Office of Placement and Office Management"
}