{
  "classification": "Administrative",
  "document_type": "Payroll Records",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified (Initially Restricted)",
  "summary": "This document is a collection of payroll authorization forms and related memoranda for Gene R. Johnson, an employee of the House Select Committee on Assassinations (HSCA), detailing his employment history, salary adjustments, and position titles from January 1977 to December 1978; Social Security numbers are redacted.",
  "summary_one_paragraph": "This document comprises payroll records from the House Select Committee on Assassinations (HSCA) concerning Gene R. Johnson. Included are payroll authorization forms spanning from January 1977 to December 1978, which trace Johnson's progression from an initial salary of $20,000 to a final salary of $44,500 while serving in various roles such as Assistant Deputy Chief Counsel and Deputy Chief Counsel. The forms, authorized by figures such as Louis Stokes and Henry B. Gonzalez, detail his salary adjustments, title changes, and the effective dates of these changes; a memorandum from I. Charles Mathews confirms Johnson's promotion and salary adjustment in February 1978.",
  "tags": [
    "HSCA",
    "Payroll",
    "Gene R. Johnson",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Salary",
    "Employment Records",
    "FOIA",
    "Assassinations Committee"
  ],
  "title": "Staff Payroll Records",
  "date": "1977-01-01",
  "persons_mentioned": [
    "Gene R. Johnson",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas Howarth",
    "Elizabeth Berning",
    "I. Charles Mathews",
    "Richard A. Sprague"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "House Select Committee on Assassinations (Various Officials)"
}