{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.",
  "security_level": "Unclassified",
  "summary": "This document from the Assassination Records Review Board pertains to the postponed release of certain information, specifically Social Security numbers, from the HSCA staff payroll records due to privacy concerns, with a next review date set for 2017.",
  "summary_one_paragraph": "This document is a Final Determination Notification from the Assassination Records Review Board concerning HSCA staff payroll records. The Board decided to postpone in part the release of information, specifically Social Security numbers, citing that the public disclosure of these numbers would constitute an unwarranted invasion of personal privacy. While acknowledging the significant historical interest in the document, the Board determined that the privacy concerns outweigh the public interest, and the postponed information is marked as 'SSN' with a next review date set for 2017.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Postponement",
    "Stephen J. Fallis",
    "Payroll",
    "Termination",
    "Salary Adjustment"
  ],
  "title": "Final Determination Notification and Payroll Records Regarding Stephen J. Fallis",
  "date": "1995-12-08",
  "persons_mentioned": [
    "Stephen J. Fallis",
    "Tom Howarth",
    "G. Robert Blakey",
    "Claire Brown",
    "Sari Mordana",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Richard A. Sprague",
    "Thomas N. Downing"
  ],
  "recipient": "All Staff Employees",
  "sender": "Budget Officer, HSCA, Louis Stokes, Henry B Gonzalez, Richard Sprague, Thomas N Downing, G. Robert Blakey"
}