{
  "classification": "Administrative",
  "document_type": "Final Determination Notification/Memoranda/Payroll Authorization Forms",
  "security": "Redactions are made to protect social security numbers to prevent unwarranted invasion of personal privacy.",
  "security_level": "Unclassified",
  "summary": "This document details the postponement of certain information, specifically social security numbers, from HSCA staff payroll records due to privacy concerns, and includes related memoranda and payroll authorizations regarding Joan Talbert Thornell's employment and termination.",
  "summary_one_paragraph": "This document encompasses a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically addressing the postponement of Social Security numbers to protect personal privacy. It also includes a series of memoranda and payroll authorization forms related to Joan Talbert Thornell's employment with the Select Committee on Assassinations, detailing her hiring, salary adjustments, a dispute over leave calculation upon her termination, and related correspondence with Chairman Louis Stokes and Budget Officer Thomas Howarth, along with payroll actions authorized by Louis Stokes and Henry B. Gonzalez.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Joan Talbert Thornell",
    "Louis Stokes",
    "Thomas Howarth",
    "Termination",
    "Leave Policy",
    "Payroll"
  ],
  "title": "HSCA Staff Payroll Records: Joan Talbert Thornell Employment and Termination",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C."
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Joan Talbert Thornell",
    "Louis Stokes",
    "Thomas Howarth",
    "Alvin B. Lewis, Jr.",
    "Walter E. Fauntroy",
    "Richard A. Sprague",
    "Henry B. Gonzalez"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board/Louis Stokes/Henry B. Gonzalez/Thomas N. Downing"
}