{
  "classification": "Personnel",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "The redaction of Social Security numbers is necessary because \"the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "Unclassified (Initially Postponed in Part)",
  "summary": "This document is a Final Determination Notification from the Assassination Records Review Board regarding the release status of HSCA staff payroll records. It details the postponement of information, specifically Social Security numbers, to protect personal privacy, and includes related payroll authorization forms and personnel documents for Paul A. Zevnik.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification in December 1995 regarding HSCA staff payroll records, specifically record number 180-10070-10176, deciding to postpone in part the release of information, primarily Social Security numbers, to prevent unwarranted invasion of personal privacy. The document includes payroll authorization forms, a personal leave record, and a memorandum regarding payroll certification, along with Paul A. Zevnik's resume, application letter, and notes, providing a detailed look into his employment history with the Select Committee on Assassinations.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Privacy",
    "Social Security Numbers",
    "Paul A. Zevnik",
    "Personnel Records"
  ],
  "title": "Final Determination Notification: HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Paul A. Zevnik",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas N. Downing",
    "Richard A. Sprague",
    "Alan Dershowitz",
    "Carl Albert",
    "Gail Beagle",
    "Steve Fallis",
    "Bob Lehner",
    "R. Tanenboun"
  ],
  "recipient": "All Staff Employees (Memorandum)",
  "sender": "Budget Officer (Memorandum)"
}