{
  "classification": "Administrative",
  "document_type": "Final Determination Notification and Payroll Records",
  "security": "Redactions include Social Security Numbers, which are withheld because \"the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "Unclassified",
  "summary": "This document consists of a Final Determination Notification from the Assassination Records Review Board regarding the postponement in part of a HSCA staff payroll record, specifically to redact Social Security numbers, and includes payroll authorization forms and related memoranda for Anne Paul Wilander.",
  "summary_one_paragraph": "This collection of documents relates to the payroll records of Anne Paul Wilander, a staff member of the House Select Committee on Assassinations (HSCA). Included is a Final Determination Notification from the Assassination Records Review Board, which addresses the decision to postpone the release of certain information, specifically Social Security numbers, due to privacy concerns. The record also contains payroll authorization forms detailing Wilander's employment history with the HSCA, including her appointments, salary adjustments, and eventual termination, as well as internal memoranda regarding her hiring and payroll certification.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Anne Paul Wilander",
    "Social Security Numbers",
    "Privacy",
    "Payroll Authorization"
  ],
  "title": "HSCA Staff Payroll Records Regarding Anne Paul Wilander",
  "date": "1977-06-13",
  "locations_mentioned": [
    "Washington, D.C."
  ],
  "origin_agency": "HSCA (House Select Committee on Assassinations)",
  "persons_mentioned": [
    "Anne Paul Wilander",
    "Louis Stokes",
    "Thomas Howarth",
    "Tom Lambeth",
    "Steve Fallis",
    "Tiny Hutton"
  ],
  "recipient": "District Unemployment Compensation Board, Clerk of the House of Representatives, Tom Lambeth, All Staff"
}