{
  "classification": "Security",
  "document_type": "Loose Documents and Memos",
  "security": "Disclosing that the CIA requested a covert security approval for Clare Booth Luce so that she could contact William Harvey, COS, Rome, when he visits the U.S. or she visits Italy, could reveal sensitive operational relationships and the process by which the CIA vets individuals for operational use. Quoting directly: “Covert Security approval requested so Luce can contact COS, Rome (Wm. Harvey) when he visite U.S. or she visits Italy…Covert Security Approval granted for a 6 mo. period.”",
  "security_level": "SECRET",
  "summary": "This collection of documents primarily concerns Clare Booth Luce, specifically requests for covert security approvals related to her potential role as a 'donor' for Project PBGREGALE and her contact with William Harvey, COS, Rome. It also includes FBI documents related to Lee Harvey Oswald, among other miscellaneous subjects.",
  "summary_one_paragraph": "This document compiles various loose documents, memos, and reports, predominantly concerning Clare Booth Luce, former ambassador to Italy. Key items include a canceled 1958 request to use Luce as a donor for Project PBGREGALE, a 1963 memo requesting operational approvals for Luce and another former ambassador, James David Letterbach, so William Harvey could contact them, and a subsequent covert security approval for Luce. The compilation also contains FBI documents related to Lee Harvey Oswald, dated in the 1950s, and other miscellaneous archival materials.",
  "tags": [
    "Clare Booth Luce",
    "Covert Security Approval",
    "PBGREGALE",
    "William Harvey",
    "Lee Harvey Oswald",
    "FBI",
    "CIA",
    "Operational Approval",
    "Security Clearance"
  ],
  "title": "Documents Related to Clare Booth Luce and Miscellaneous Subjects",
  "date": "1978-07-28",
  "origin_agency": "CIA",
  "persons_mentioned": [
    "Clare Booth Luce",
    "Fred Bucci",
    "F. Mark Wyatt",
    "James David Letterbach",
    "William Harvey",
    "Edward P Brown",
    "Lee Harvey Oswald",
    "Chanan Bar"
  ],
  "sender": "Palmer, Clare"
}