{
  "classification": "Administrative",
  "document_type": "Final Determination Notification/Payroll Authorization Form/Resume",
  "security": "The document includes Sheryl Lynn Bonifer's Social Security number, which is redacted. As stated in the document: \"The text is redacted because the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a final determination notification from the Assassination Records Review Board regarding HSCA staff payroll records. It includes payroll authorization forms and a resume for Sheryl Lynn Bonifer, with her Social Security number postponed from release due to privacy concerns.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a final determination notification on December 8, 1995, regarding HSCA staff payroll records, specifically document number 180-10068-10313. The document, which includes payroll authorization forms and a resume for Sheryl Lynn Bonifer, has been postponed in part due to the presence of Bonifer's Social Security number. The Review Board cited the significant historical interest in the document but also the unwarranted invasion of personal privacy that would result from releasing the Social Security number, leading to its redaction and a planned review in 2017.",
  "tags": [
    "HSCA",
    "Staff Payroll Records",
    "Sheryl Lynn Bonifer",
    "Social Security Number",
    "Privacy",
    "Assassination Records Review Board",
    "Payroll Authorization",
    "Resume",
    "Redaction"
  ],
  "title": "Final Determination Notification Regarding HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, D.C.",
    "Alexandria, Virginia",
    "Woodbridge, Virginia"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Sheryl Lynn Bonifer",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "Thomas N. Downing"
  ],
  "recipient": "Clerk of the House of Representatives",
  "sender": "Assassination Records Review Board"
}