{
  "classification": "Personnel",
  "document_type": "Report",
  "security": "Disclosing details about lie detector tests, psychological evaluations, and surveillance methods used on personnel could compromise security protocols and enable individuals to evade detection. Quoting directly: 'use SOP 9 KGB to get psych' and 'showed material to chut of Section - wert Chut Dept-Peters - Reported to him- the's nothing doesn't think it went ay higher lust tells Intourist & turn down LHO -not interesting.'",
  "security_level": "SECRET",
  "summary": "A report detailing interviews, lie detector tests, and psychological evaluations related to individuals, including those connected to Lee Harvey Oswald, and internal security protocols.",
  "summary_one_paragraph": "This document, labeled 'Noserko II', summarizes interviews and security measures undertaken, including polygraph tests and psychological evaluations, in relation to individuals like FBI agents Morris Taylor and Donald Walsh, and references to Lee Harvey Oswald. It includes details on surveillance methods, KGB standard operating procedures for psychological assessments, and internal discussions about handling individuals of interest, with specific mentions of reporting chains and decisions made regarding Oswald's case. Also notes on various personnel involved in these processes, such as those involved in lie detector tests and observations of tourists.",
  "tags": [
    "Interviews",
    "Lie Detector Tests",
    "Psychological Evaluations",
    "Personnel",
    "Security Protocols",
    "KGB",
    "Lee Harvey Oswald",
    "Surveillance",
    "FBI",
    "Intourist"
  ],
  "title": "Noserko II Report on Personnel and Security Measures",
  "date": "1964-03",
  "persons_mentioned": [
    "Lee Harvey Oswald",
    "Morris Taylor",
    "Donald Walsh",
    "James Wooton",
    "Ellized Turner",
    "John Banon",
    "Marina Oswald",
    "Epstein Elton",
    "Pete Ragly",
    "George Barley",
    "Nick Poptarich",
    "John Walth",
    "Murphy",
    "Tom Brown",
    "Halen",
    "Huk Tovan",
    "Mc Coy",
    "Tilen Harvey",
    "Vas Gemerkin",
    "Mr. Pepen",
    "John I din",
    "Dreadfas",
    "Helms",
    "Cilby",
    "Angelton",
    "Philby",
    "Krupnov",
    "Peters",
    "Kei Sher",
    "Nibe",
    "Krav",
    "Karlan",
    "Elton"
  ],
  "recipient": "Unknown"
}