{
  "classification": "Administrative",
  "document_type": "Final Determination Notification/Payroll Authorization Forms/Memorandum",
  "security": "The document contains personal information, specifically social security numbers, which are redacted because \"the public disclosure of the redaction could reasonably be expected to constitute an unwarranted invasion of personal privacy, and that invasion of privacy would be so substantial that it outweighs the public interest.\"",
  "security_level": "Unclassified",
  "summary": "This document is a Final Determination Notification from the Assassination Records Review Board regarding HSCA staff payroll records, specifically concerning the postponement of Social Security numbers. It also includes payroll authorization forms and memoranda related to HSCA staff, including Dan L. Hardway.",
  "summary_one_paragraph": "The Assassination Records Review Board issued a Final Determination Notification for HSCA staff payroll records, specifically record number 180-10060-10438, postponing the release of Social Security numbers due to privacy concerns. The document includes payroll authorization forms for Dan L. Hardway from July 1977 to December 1978, showing his appointments and salary adjustments as a Researcher, authorized by Louis Stokes. It also contains a memorandum listing new research employees, including Hardway, and a payroll certification form related to familial relationships with members of Congress.",
  "tags": [
    "Assassination Records Review Board",
    "HSCA",
    "Staff Payroll Records",
    "Social Security Numbers",
    "Privacy",
    "Dan L. Hardway",
    "Louis Stokes",
    "Payroll Authorization",
    "Personnel Records"
  ],
  "title": "Final Determination Notification & HSCA Staff Payroll Records",
  "date": "1995-12-08",
  "locations_mentioned": [
    "Washington, DC"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Dan L. Hardway",
    "Louis Stokes",
    "Thomas Mark Flanagan, Jr.",
    "Edwin Juan Lopez",
    "Leslie Wizelman",
    "Tom Howarth",
    "Donovan Gay",
    "Bob Blakey"
  ],
  "recipient": "Clerk of the House of Representatives, All Staff",
  "sender": "Assassination Records Review Board, Louis Stokes, Donovan Gay"
}