{
  "classification": "Cuba",
  "document_type": "Summary",
  "security": "This document details the questioning of Lee Harvey Oswald and several Cuban individuals, providing information about Oswald's affiliations and activities related to the Fair Play for Cuba Committee (FPCC) and the individuals' backgrounds and affiliations, all of which could be used to reconstruct intelligence leads or identify sensitive contacts. Quoting the document: \"Roberts stated that he did not see or hear anything about Oswald wanting to call or talk with an F.B.I. Agent while he was there.\" Revealing such information could expose interview techniques and compromise ongoing investigations.",
  "security_level": "Unclassified",
  "summary": "A summary of an interview conducted by the HSCA regarding Warren Roberts's recollection of an August 1963 police interview with Lee Harvey Oswald and several Cuban individuals in New Orleans, focusing on Oswald's involvement with the Fair Play for Cuba Committee (FPCC). The document includes detailed personal information about the involved individuals.",
  "summary_one_paragraph": "On May 18, 1978, HSCA investigator Robert Buras interviewed Warren Roberts, a Sergeant with the New Orleans Police Department, concerning an attached report dated August 12, 1963. Roberts recalled that, along with Sgt. Horace Austin, he interviewed Lee Harvey Oswald and three Cubans arrested after an altercation on Canal Street regarding Oswald's distribution of communist literature; the officers' primary concern at the time was assessing potential disturbances from the involved parties. Roberts remembered Oswald's denial of being a communist or that the FPCC was a communist front, and Oswald claimed he joined the FPCC after finding a leaflet, sending $5 to New York, and attending local meetings, but he refused to disclose any names. The interview, also attended by Captain James Arnold, yielded details about Oswald's background, including his Marine Corps service, employment history, and marital status, as well as details on the Cuban individuals.",
  "tags": [
    "HSCA",
    "Warren Roberts",
    "Horace Austin",
    "Lee Harvey Oswald",
    "Fair Play for Cuba Committee",
    "New Orleans",
    "Interview",
    "Cuban Exiles"
  ],
  "title": "Interview Regarding Activities, Fair Play for Cuba Committee",
  "date": "1978-05-18",
  "locations_mentioned": [
    "New Orleans, La.",
    "New York",
    "Cuba",
    "Fort Worth, Texas",
    "Miami, Florida",
    "Havana, Cuba",
    "Argentina",
    "Buenos Aires",
    "San Juan, Puerto Rico"
  ],
  "origin_agency": "HSCA",
  "persons_mentioned": [
    "Warren Roberts",
    "Horace J. Austin",
    "Lee Harvey Oswald",
    "Carlos Jose Bringuier",
    "Celso Macario Hernandez",
    "Miguel Mariano Cruz",
    "Marina Pross",
    "James Arnold",
    "Fidel Castro",
    "Margarette Oswald",
    "Robert Oswald",
    "John Oswald",
    "Presly J. Trosclair Jr.",
    "V. T. Lee",
    "A. Hidell",
    "Maria De La Caridad Valero",
    "Maria De Los Angeles",
    "Nicholas Pablo",
    "Teresita",
    "Maria Del Carmen (Bearce)",
    "Julio Bringuier",
    "Vicenta Bringuier",
    "Julio Enrique Bringuier",
    "Maria Gertrudis (Pelaez)",
    "Rolando Pelaez",
    "Juan Feliepe Bringuier",
    "Maria Del Carmen (Medina)",
    "Jorge Medina",
    "Jose Antonio Lanuza",
    "L. C. Levy",
    "Arnesto Rodriguez",
    "Arturo Frondizi",
    "Victoriana (Enriquez) Cruz",
    "Claudio Cruz",
    "Hordensia Maria Cruz",
    "Ina Josefa Cruz",
    "Maria Teresa Cruz",
    "Paul Cruz",
    "Olga",
    "Claudio Cruz",
    "Angela",
    "Enrique Cruz"
  ],
  "recipient": "",
  "sender": "ROBERTS, WARREN"
}