{
  "classification": "Personnel",
  "document_type": "Memo",
  "security": "Sharing the details of Kaczmarczyk's background, including his family connections in the USSR and Poland, as well as his detention history in the USSR, could compromise his operational security or expose sensitive personal information. The document also includes alien registration information and naturalization details, which, if disclosed, could violate privacy laws or regulations. Additionally, the form contains arrest records requests, which may include details that should not be publicly disclosed. For instance, the document states “Check of FBI investigative files based upon data submitted located no identifiable information pertinent to your inquiry.”",
  "security_level": "UNCLASSIFIED",
  "summary": "A National Agency Check request form for Edward Kaczmarczyk, including personal information, residences, employment history, and foreign connections. The document details his immigration to the U.S., travel to the USSR and Poland, and active duty in the U.S. Army.",
  "summary_one_paragraph": "This document is a National Agency Check request for Edward Kaczmarczyk, born in Bomblitz, West Germany, and serving in the U.S. Army. The request, initiated by the Commanding Officer of the 59th Ord Gp, seeks to verify Kaczmarczyk's background, including his residences, employment, and citizenship status. It reveals that Kaczmarczyk immigrated to the United States with his parents in 1950, traveled to the USSR and Poland in the 1950s, and was detained in the USSR for nine months. The form also lists his parents' alien registration details, his naturalization in 1969, and family members residing in Poland and the USSR.",
  "tags": [
    "National Agency Check",
    "Edward Kaczmarczyk",
    "Background Check",
    "Immigration",
    "USSR",
    "Poland",
    "Military",
    "Personnel Security"
  ],
  "title": "[ RESTRICTED ] RESULTS OF NATIONAL AGENCY CHECK",
  "date": "1971-11-17",
  "locations_mentioned": [
    "Bomblitz, West Germany",
    "Frampol, Poland",
    "Alexandrosk, Ukraine",
    "Newport News, VA",
    "Ft Dix, NJ",
    "Evreux-Fauville AFB, France",
    "Patrick AFB, Fla.",
    "Ft Sill, Okla",
    "Hue, RVN",
    "Ft Knox, Ky",
    "Landover, MD",
    "Pirmasens, Germany",
    "NYC, NY",
    "Honolulu, Hawaii",
    "Sluchowo, Poland",
    "Charkow, USSR",
    "Hamburg, West Germany",
    "Luton, Bedfordshire, England",
    "Canada"
  ],
  "origin_agency": "INSCOM/CSF",
  "persons_mentioned": [
    "Kaczmarczyk, George",
    "Kaczmarczyk, Edward",
    "Kaczmarczyk, Josef",
    "Iwanowa, Dorota",
    "Eason, Patricia Ann",
    "Stanley Kaczmarczyk",
    "Ann Artabolowska",
    "Kshania Hitriowa",
    "Wladimir Iwanow"
  ],
  "recipient": "USA ADVANCED WEAPONS SUPPORT COMD",
  "sender": "59TH ORD GP"
}