{
  "classification": "JFK Assassination",
  "document_type": "Report of Investigation",
  "security": "This report details an investigation into potential customs violations related to firearms shipments involving Paul Arnold Marriott and Mitchell Livingston WerBell III. Releasing specifics about the investigation's methods, individuals interviewed (e.g., KARL D. ACKERMAN, GERALD T. CARTA), and information obtained from them could reveal investigative techniques and compromise ongoing or future inquiries. Quoting the text, \"Permission to interview WERBELL granted by IRS...WERBELL advised that firearms shipped to him by SUBJECT in April 1969 were obtained by him (WERBELL) in Vietnam and registered during amnesty period, however, no authorization was obtained to import these firearms,\" showcases sensitive details. Further, disclosing the involvement of individuals such as COL WALTER ADAMS and EARLENE DOBBS could potentially expose their association with these activities.",
  "security_level": "UNCLASSIFIED",
  "summary": "The USAF Office of Special Investigations (OSI) conducted an investigation into Paul Arnold Marriott regarding customs violations involving firearms, focusing on his connections with Mitchell Livingston WerBell III and the shipment of weapons from Vietnam for alleged museum purposes.",
  "summary_one_paragraph": "This report outlines an investigation by the USAF Office of Special Investigations into Lt Col Paul Arnold Marriott concerning possible customs violations related to the importation of firearms. The investigation, initiated in October 1969, involves interviews with individuals such as Mitchell Livingston WerBell III and Karl D. Ackerman, as well as reviews of air and surface shipment records. It focuses on WerBell’s claims that firearms shipped to him by Marriott were obtained in Vietnam and were intended for Air Force museum displays, while also examining potential discrepancies in the authorization and documentation of these shipments, particularly the role of individuals like Col Patterson and Gerald T. Carta in facilitating these activities.",
  "tags": [
    "USAF",
    "Office of Special Investigations",
    "Customs Violation",
    "Paul Arnold Marriott",
    "Mitchell Livingston WerBell III",
    "Firearms",
    "Vietnam",
    "Eglin AFB",
    "ARPA",
    "IRS",
    "JFKARCA"
  ],
  "title": "Report of Investigation - Customs Violation: Paul Arnold Marriott",
  "date": "1969-10-24",
  "origin_agency": "USAF - Office of Special Investigations",
  "persons_mentioned": [
    "Paul Arnold Marriott",
    "Mitchell Livingston WerBell III",
    "Robert H. Wayland, Jr.",
    "Joseph A. Ciccone",
    "William C. Goodman",
    "Shelley F. Reeves",
    "Eugene D. Lawrence",
    "Naomi J. King",
    "William N. Griffin",
    "Charles B. Stanfill",
    "Arbie R. Odom, Jr.",
    "Fred N. Brown",
    "Jo Florence",
    "Lawrence K. Harper",
    "Robert J. Novack",
    "Karl D. Ackerman",
    "Walter Adams",
    "Gerald T. Carta",
    "Earlene Dobbs",
    "Robert Dean",
    "Jerome J. Castelucio",
    "Ronald A. Cundiff",
    "William M. Fagan",
    "Robert B. Pritchard",
    "L. L. Free",
    "W. J. Scanlon",
    "Col Patterson"
  ],
  "sender": "Robert H. Wayland, Jr. COL"
}