{
  "classification": "Personnel",
  "document_type": "Report of Investigation",
  "security": "This report details an investigation into potential customs violations, misuse of government resources, and violations of the Gun Control Act by Lt Col Paul Arnold Marriott. Releasing details about Marriott's actions, the weapons involved, and the coordination between USAF OSI and U.S. Treasury agents could expose investigative methods and compromise potential legal actions. For example, the report states, \"Investigation disclosed SUBJECT sent 12 weapons to Eglin AFB from SEA...SUBJECT had no known authority to send weapons from SEA nor to ship weapons to Sionics.\" Revealing such details could also provide insight into the types of investigations conducted by the USAF Office of Special Investigations.",
  "security_level": "UNCLASSIFIED",
  "summary": "A USAF Office of Special Investigations report regarding Lt Col Paul Arnold Marriott's potential customs violations and misuse of government resources related to the importation and shipment of captured enemy weapons.",
  "summary_one_paragraph": "This report details an investigation into Lt Col Paul Arnold Marriott concerning the importation of captured enemy weapons and their subsequent shipment to Sionics Corporation, potentially violating customs regulations and the Gun Control Act of 1968. Requested by the Commander of Eglin AFB on July 7, 1969, the investigation revealed that Marriott shipped weapons from Southeast Asia to Eglin AFB and then to Sionics without proper authorization, also misusing government resources in the process. The investigation involved coordination with U.S. Treasury agents and included interviews with involved personnel, culminating in Marriott being advised of his rights before providing a verbal statement.",
  "tags": [
    "USAF",
    "Office of Special Investigations",
    "Customs Violation",
    "Gun Control Act",
    "Paul Arnold Marriott",
    "Sionics",
    "Eglin AFB",
    "Weapons",
    "ARPA",
    "Robert H. Wayland, Jr."
  ],
  "title": "Paul Arnold Marriott - Report of Investigation - Customs Violation - Initial Report",
  "date": "1969-07-29",
  "locations_mentioned": [
    "Eglin AFB, Florida",
    "Atlanta, Georgia",
    "Bangkok, Thailand",
    "Charleston AFB, South Carolina",
    "Republic of Vietnam"
  ],
  "origin_agency": "USAF - Office of Special Investigations",
  "persons_mentioned": [
    "Paul Arnold Marriott",
    "Robert H. Wayland, Jr.",
    "Grover C. Ayers, Jr.",
    "J. T. King",
    "William D. Dixon",
    "Donald V. Thompson",
    "Josiah C. Musick",
    "Clarence M. Green",
    "William C. Goodman",
    "Robert E. Sanders",
    "Carl Cassulo",
    "John H. Hobaugh",
    "Mitchell WerBell III",
    "Bill Fagan",
    "Otis R. Frye",
    "Charlie B. Mobley",
    "S. F. Reeves",
    "Clarence M. Cooley",
    "Fred Brown",
    "John C. Lynch",
    "Lida R. McEwen",
    "Paul Arnold",
    "Jerry McEwen",
    "Jerald B. Massey",
    "Warren G. Cook",
    "Thomas F. Kern"
  ]
}