{
  "classification": "Personnel",
  "document_type": "Message",
  "security": "The message discusses handling a video tape of a North Korean press conference featuring PFC White and stresses the importance of parental consent before involving the press, stating, \"WE BELIEVE THAT UNDER NO CIRCUMSTANCES SHOULD DA ALLOW THE PRESS TO VIEW THE TAPE WITHOUT EXPRESS CONSENT OF THE PARENTS, TO DO OTHERWISE VIOLATES COMMON COURTESY.\" Releasing details about obtaining and handling the tape could compromise intelligence sources and methods, and potentially damage diplomatic relations with North Korea or affect the privacy of the involved personnel and their families.",
  "security_level": "UNCLASSIFIED",
  "summary": "A message from SSO Korea to SSO DA regarding a video tape copy of a North Korean press conference featuring PFC White, detailing its transport and instructions for handling it, particularly concerning parental viewing and press involvement.",
  "summary_one_paragraph": "This UNCLASSIFIED message, dated September 8, 1982, from SSO Korea to SSO DA, concerns a video tape of PFC White's North Korean press conference. The tape is being hand-carried by LTC Robert Turpin and is scheduled to arrive at Washington National Airport. Instructions specify that the tape should be closely held, with parents allowed to view it under DA control, but press involvement should be carefully considered and requires parental consent. The message advises against providing the tape to the press without express consent, and discourages actions that might aid North Korean propaganda efforts. The message also requests confirmation once the tape is in possession.",
  "tags": [
    "Video Tape",
    "PFC White",
    "North Korea",
    "Press Conference",
    "Propaganda",
    "SSO Korea",
    "SSO DA"
  ],
  "title": "VIDEO TAPE - PFC WHITE",
  "date": "1982-09-08",
  "persons_mentioned": [
    "Slovoda, Vladimir",
    "White, Joseph T.",
    "Robert Turpin",
    "MGE C. O'Connor",
    "MG Huoachek"
  ],
  "recipient": "SSO DA",
  "sender": "SSO Korea"
}