{
  "classification": "Personnel",
  "document_type": "Agent Report",
  "security": "Disclosing the relationship between Richard Nagell and military investigations, as well as the process of conscientious objector discharge, could reveal sensitive information about military procedures. The agent's notes mentioning shared accommodation may also expose private details about the individuals involved.",
  "security_level": "UNCLASSIFIED",
  "summary": "This agent report details an interview with Harfez Muneer regarding Richard Nagell's connections to Victor L. Trinkala's separation from military service as a conscientious objector.",
  "summary_one_paragraph": "On April 16, 1970, an agent report was submitted following an interview with Harfez Muneer, also known as Tony Muneer, who provided information regarding Richard C. Nagell's alleged involvement in assisting Victor L. Trinkala in obtaining a separation from military service. Muneer, who met Nagell while both were inmates at Fort Leavenworth Federal Prison, described Nagell as a former Army Captain and CIA/CIC investigator who had mentioned involvement in the JFK assassination investigation. Muneer stated that Nagell sent a telegram to the Sixth United States Army requesting Trinkala's transfer to the US Army Chaplain School because Trinkala was a Conscientious Objector, and noted that Trinkala's mother was also seeking assistance from her Senator. Muneer believed that either Mrs. Trinkala or her Senator was responsible for Trinkala being discharged from the Army in December 1969. Muneer, also a friend of Trinkala, vouched for Trinkala's loyalty to the United States and his willingness to defend the country, but noted his hesitance to kill due to his conscientious objector status.",
  "tags": [
    "INSCOM",
    "CSF",
    "Richard C. Nagell",
    "Victor L. Trinkala",
    "Conscientious Objector",
    "Fort Leavenworth",
    "Agent Report",
    "Military Discharge",
    "Harfez Muneer",
    "Hotel Strand",
    "Hotel Woodstock"
  ],
  "title": "AGENT REPORT",
  "date": "1970-04-16",
  "locations_mentioned": [
    "Fort Leavenworth, Kansas",
    "New York, New York",
    "Hotel Strand",
    "Hotel Woodstock",
    "Fort Gordon, Georgia",
    "Fort Hamilton, Brooklyn, New York",
    "Oakland Army Terminal",
    "Clinton Hotel, New York",
    "Pittsburgh, Pennsylvania",
    "Rochester, Pennsylvania"
  ],
  "origin_agency": "INSCOM/CSF",
  "persons_mentioned": [
    "Richard C. Nagell",
    "Victor L. Trinkala",
    "Harfez Muneer",
    "Tony Muneer",
    "Mrs. Trinkala",
    "Capistrano Pabon-Irizarry"
  ],
  "sender": "[ RESTRICTED]"
}