{
  "classification": "Security",
  "document_type": "Report",
  "security": "This report details an FBI investigation into Robert Scheer, focusing on his affiliations with various political groups, foreign travel, writings, and financial activities. Releasing this information could expose investigative techniques, sources of information (such as bank records and neighbors), and the extent of surveillance on individuals and organizations deemed security risks. Quoting from the document: 'This document contains neither recommendations nor conclusions of the FBI. It is the property of the FBI and is loaned to your agency; it and its contents are not to be distributed outside your agency.' and 'The above information is confidential and cannot be made public except in the usual procedure following the issuance of a subpoena duces tecum.'",
  "security_level": "SECRET",
  "summary": "An FBI report on Robert Scheer details his employment, residence, marital history, education, and affiliations with various political organizations, including the Fair Play For Cuba Committee and Students for a Democratic Society; it also covers his financial activities and a threat against his life.",
  "summary_one_paragraph": "This FBI report, dated April 22, 1969, summarizes an investigation into Robert Scheer, the Editor-in-Chief of 'Ramparts' magazine, focusing on his background and associations. It details his employment, residence in Oakland with his wife Anne and son, previous marriage and divorce, and education at the University of California, Berkeley. The report lists Scheer's affiliations with groups such as the Fair Play For Cuba Committee, Progressive Labor Party, and Students for a Democratic Society, and it outlines his foreign travel, writings, and speeches. It also includes information about a threat against Scheer's life, his purchase of a firearm, and an examination of his and his wife's bank account, revealing financial transactions and sources of income.",
  "tags": [
    "FBI",
    "Robert Scheer",
    "Fair Play For Cuba Committee",
    "Progressive Labor Party",
    "W. E. B. Du Bois Clubs of America",
    "Students for a Democratic Society",
    "Young Socialist Alliance",
    "Vietnam Day Committee",
    "Peace and Freedom Party",
    "Ramparts Magazine",
    "Security Matter",
    "Surveillance",
    "Domestic Intelligence"
  ],
  "title": "[ RESTRICTED ]",
  "date": "1969-04-22",
  "locations_mentioned": [
    "New York, New York",
    "Oakland, California",
    "San Francisco, California",
    "Berkeley, California",
    "Hanoi, North Vietnam",
    "Cuba"
  ],
  "origin_agency": "FBI",
  "persons_mentioned": [
    "Robert Scheer",
    "Anne Weills Scheer",
    "Serena Scheer",
    "Thomas Hayden",
    "Frederick Scheer",
    "Ida Kuran",
    "John C. S. Weills, III",
    "Audrey Davis",
    "Christopher Warren Scheer",
    "Warren Hinckle, III",
    "Dugald Stermer",
    "Sol Stein",
    "David Kolodney",
    "Christopher D. Weills",
    "Georgia Gwilliam",
    "John G. Gwilliam",
    "Leland J. Lazarus",
    "Lenore D. Underwood",
    "H. R. Medina",
    "Maurice Zeitlin",
    "Aaron C. Orton",
    "William E. Hughes",
    "Charles E. Galvin",
    "Robert L. Gibson",
    "John Vannucci",
    "Lawrence J. Nelson",
    "Marc Stone"
  ],
  "recipient": "[ RESTRICTED ]",
  "sender": "WILLIAM E. HUGHES"
}