{
  "classification": "JFK Assassination",
  "document_type": "Identification Form/National Agency Check Request",
  "security": "Revealing the subject's immigration history, family details, and travel patterns could compromise their privacy and security. The document contains personal information such as date and place of birth, addresses, and family names. Disclosing these details could potentially expose the individual and their family to unwanted attention or security risks.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a National Agency Check Request (NACR) for Edward Kaczmarczyk, including details about his birth, family, residences, and employment history, conducted by the U.S. Army Advanced Weapons Support Command in September 1971.",
  "summary_one_paragraph": "A National Agency Check Request (NACR) dated September 16, 1971, initiated by the 59th Ordnance Group for Edward Kaczmarczyk, born in Bomblitz, West Germany, on August 6, 1947. The request, directed to the U.S. Army Advanced Weapons Support Command, seeks information on Kaczmarczyk's background, including his residences from December 1964 to August 1971 in locations such as Ft. Dix, NJ, and Hue, RVN, his employment history, and family details, such as his parents Josef Kaczmarczyk and Dorota Iwanowa and his wife Patricia Ann Eason. The document also notes Kaczmarczyk's immigration to the U.S. with his parents in 1950, his naturalization in 1969, and his travels, including a visit to Luton, England, and Canada.",
  "tags": [
    "INSCOM/CSF",
    "Intelligence/Counterintelligence",
    "National Agency Check",
    "Edward Kaczmarczyk",
    "Immigration History",
    "Background Check"
  ],
  "title": "[RESTRICTED]",
  "date": "1971-09-16",
  "locations_mentioned": [
    "Bomblitz, West Germany",
    "Frampol, Poland",
    "Newport News, Va.",
    "Riverdale, Md",
    "Alexandrowsk, Ukraine",
    "Dothan, Ala.",
    "Ft Dix, NJ",
    "Evreux-Fauville AFS France",
    "Patrick AFB, Fla.",
    "Ft Sill, Okla",
    "Hue, RVN",
    "Ft Knox",
    "Landover, Md",
    "Pirmasens, Germany",
    "NYC, NY",
    "Honolulu, Hawaii",
    "Sichero, Poland",
    "Charkor, US3",
    "Chazicow, P73",
    "Hamburg, West Germany",
    "Luton, Bedfordshire, England",
    "Canada"
  ],
  "origin_agency": "INSCOM/CSF",
  "persons_mentioned": [
    "Edward Kaczmarczyk",
    "Josef Kaczmarczyk",
    "Dorota Iwanowa",
    "Patricia Ann Eason",
    "Stanley Kaczmarczyk",
    "Ann Artebolowsre",
    "Fladimir Evenow"
  ],
  "recipient": "USA Advanced Weapons Support Comd",
  "sender": "59th ORD GP"
}