{
  "classification": "Personnel",
  "document_type": "Paper, Textual Document",
  "security": "This document contains personal information about Robert Scheer, including his residences, employment history, and foreign travel. Releasing this information could violate his privacy.",
  "security_level": "UNCLASSIFIED",
  "summary": "This document is a U.S. Army request for a National Agency Check on Robert Scheer, including residences, employment, civilian school information, and foreign connections, interests, or employment. It indicates Scheer refused to execute DD Form 98 and portions of DD Form 398.",
  "summary_one_paragraph": "A U.S. Army control office initiated a National Agency Check on Robert Scheer, born on April 4, 1935, in the Bronx, New York. The request, dated November 4, 1966, includes details on Scheer's residences from 1949 to 1964 in New York and California, his employment at the University of California and City Lights Bookstore, and his education at the University of California. The document indicates Scheer's travels to Cuba, England, France, Poland, Hungary, the Soviet Union, Czechoslovakia, Vietnam, Cambodia, Indonesia, Japan, Laos, and Thailand. It also notes that Scheer refused to complete DD Form 98 and portions of DD Form 398.",
  "tags": [
    "National Agency Check",
    "Robert Scheer",
    "US Army",
    "Personnel Investigation",
    "Foreign Travel",
    "Refusal to Execute Forms"
  ],
  "title": "(RESTRICTED)",
  "date": "1966-11-04",
  "locations_mentioned": [
    "Drans, New York",
    "Bronx, New York",
    "Syracuse, New York",
    "Berkeley, California",
    "San Francisco, California",
    "Cuba",
    "England",
    "France",
    "Poland",
    "Hungary",
    "Soviet Union",
    "Czechoslovakia",
    "Vietnam",
    "Cambodia",
    "Indonesia",
    "Japan",
    "Laos",
    "Thailand"
  ],
  "origin_agency": "CSF/INSCOM",
  "persons_mentioned": [
    "Robert Scheer",
    "Fred Scheer",
    "Ide Kuren",
    "Anne Veille"
  ],
  "sender": "Nichols, WH"
}