{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "The report details specific actions by the US government and its agencies, including the CIA and Department of Defense, to counteract Cuban subversion in Latin America. This includes efforts to control travel to and from Cuba, influence foreign governments and media, and provide counter-insurgency training and equipment. Disclosing these activities could compromise ongoing operations, damage relationships with foreign governments, and reveal intelligence sources and methods. For example, the report mentions \"inspired a press campaign of hoof and mouth and smallpox epidemics in Cuba, prior to the Architects Congress to discourage participation in the Habana meeting,\" revealing a US effort to manipulate foreign media and public opinion.",
  "security_level": "SECRET",
  "summary": "This document is a report on the actions taken during September 1963 by the US government to curb Cuban subversion in Latin America, including controlling travel, propaganda, and clandestine movements, as well as strengthening counter-insurgency capabilities and exchanging intelligence.",
  "summary_one_paragraph": "This secret report, dated November 26, 1963, outlines the actions taken during September 1963 by various US government agencies, including the Department of State, CIA, and Department of Defense, to counter Cuban subversion in Latin America. The report details efforts to control travel to and from Cuba by pressuring foreign governments and monitoring airlines, managing propaganda through press campaigns and Voice of America broadcasts, controlling clandestine movements of guerrillas with logistical support to Honduras, and strengthening counter-insurgency capabilities through training programs and equipment provision to Latin American countries. The report also covers intelligence exchange with local agencies and surveillance of Cuban diplomatic activities.",
  "tags": [
    "ICCCA",
    "Cuban Subversion",
    "Latin America",
    "Counter-Insurgency",
    "Propaganda",
    "Intelligence Exchange",
    "Travel Restrictions",
    "CIA",
    "Department of Defense",
    "Department of State",
    "USIA",
    "Guerrilla Warfare",
    "Honduras",
    "Brazil",
    "Argentina",
    "Mexico",
    "Venezuela",
    "Uruguay",
    "Guatemala",
    "Panama Canal Zone",
    "Voice of America"
  ],
  "title": "ICCCA: Report on Status of Implementation of Actions Designed to Counter Subversion",
  "date": "1963-11-26",
  "locations_mentioned": [
    "Tunisia",
    "Algeria",
    "Conakry",
    "Guinea",
    "Fort au France",
    "Guadeloupe",
    "Paris",
    "Rio de Janeiro",
    "Brazil",
    "Barbados",
    "Georgetown",
    "British Guiana",
    "Habana",
    "Buenos Aires",
    "Argentina",
    "Mexico City",
    "Tegucigalpa",
    "Honduras",
    "Patuca River",
    "Nicaragua",
    "Panama Canal Zone",
    "Venezuela",
    "Lake Maracaibo",
    "Colombia",
    "Porto Alegre",
    "Uruguay"
  ],
  "origin_agency": "ARMY",
  "persons_mentioned": [
    "Joseph A. Califano, Jr.",
    "Earle G. Wheeler",
    "Frank K. Sloan",
    "J. D. Alger",
    "W. F. A. Wendt",
    "J. W. Carpenter",
    "C. J. Quilter",
    "Mr. Yarmolinsky",
    "Lt Col Haig",
    "Assistant Secretary Martin",
    "Che Guevara",
    "Roberto Perez Ondarse",
    "Richard Joyce"
  ],
  "recipient": "MULTIPLE",
  "sender": "Joseph A. Califano, Jr."
}