{
  "classification": "Cuba",
  "document_type": "Report",
  "security": "This document details U.S. efforts to counter Cuban subversion in Latin America, including specific operations, training programs, and intelligence activities. Releasing information about these activities could compromise ongoing operations and relationships with involved countries. For example, detailing the assistance provided to Venezuelan forces or the communication systems established in Ecuador could reveal sensitive operational capabilities and intelligence-gathering methods. The specific actions to control travel to and from Cuba, along with fund transfers also reveal methods that may no longer be covert if exposed.",
  "security_level": "SECRET",
  "summary": "The document is a report on the status of actions taken to counter Cuban subversion in Latin America, detailing various activities by the Department of Defense, State Department, and CIA, including controlling travel to and from Cuba, clandestine movement of guerrillas and arms, transfer of funds, and strengthening counterinsurgency capabilities.",
  "summary_one_paragraph": "This report, dated January 10, 1964, outlines the actions taken between December 1, 1963, and January 1, 1964, by the U.S. government to counter Cuban subversion in Latin America. Prepared by Joseph A. Califano, Jr. for Mr. John H. Crimmins, it details efforts across multiple departments, including the Department of Defense's surveillance and training programs, the State Department's diplomatic actions to restrict Cuban travel and financial activities, and the CIA's intelligence operations. Specific actions include supporting Honduran counterinsurgency efforts, monitoring ships and boats entering the Colon Free Zone, training Latin American officers in counterinsurgency tactics, and impeding Cuban access to aviation resources and financial transactions.",
  "tags": [
    "Counterinsurgency",
    "Cuban Subversion",
    "Latin America Security",
    "Department of Defense",
    "State Department",
    "CIA",
    "Guerrillas",
    "Arms Control",
    "Propaganda",
    "Travel Restrictions",
    "Fund Transfer"
  ],
  "title": "Interdepartmental Coordinating Committee of Cuban Affairs: Report on the Status of Actions Designed to Counter Subversion",
  "date": "1964-01-10",
  "locations_mentioned": [
    "Cuba",
    "Latin America",
    "Tunis",
    "North Africa",
    "Algeria",
    "Conakry",
    "Guinea",
    "Fort au France",
    "Guadeloupe",
    "Paris",
    "French Caribbean",
    "Rio de Janeiro",
    "Brazil",
    "Barbados",
    "British Guiana",
    "Habana",
    "Buenos Aires",
    "Mexico City",
    "Tegucigalpa",
    "Honduras",
    "Patuca River",
    "Nicaragua",
    "Panama Canal Zone",
    "Fort Bragg, North Carolina",
    "Camp Pendleton, California",
    "Ecuador",
    "Jamaica",
    "Miami",
    "Asuncion",
    "Paraguay"
  ],
  "origin_agency": "ARMY",
  "persons_mentioned": [
    "Joseph A. Califano, Jr.",
    "John H. Crimmins",
    "A. P. O'Meara",
    "Ray C. Needham",
    "William Bowdler",
    "Frank K. Sloan",
    "Earle G. Wheeler",
    "J. D. Alger",
    "W. F. A. Wendt",
    "J. W. Carpenter",
    "C. J. Quilter",
    "Herold Derber",
    "Richard Joyce"
  ],
  "recipient": "Mr. John H. Crimmins",
  "sender": "Joseph A. Califano, Jr."
}