{
  "classification": "Cuba",
  "document_type": "Paper, Textual Document",
  "security": "Releasing details about the sources and methods used to gather intelligence on Cuban subversion in Latin America could endanger ongoing operations and the safety of informants. Quoting directly: 'We have devoted a great deal of effort to monitoring Latin American travel to Cuba at the main jump-off points... We know a great deal about this travel from our penetrations of the Communist parties, from controlled agents...and from cooperative travel control authorities in Latin American countries.'",
  "security_level": "Secret",
  "summary": "This document, dated February 1963, details Cuban subversion efforts in Latin America, including support for revolutionary movements through training, propaganda, and funding, as well as analysis of rival forces and Soviet interests in the region.",
  "summary_one_paragraph": "This secret document from February 1963 provides an overview of Cuban activities aimed at subverting governments in Latin America. It describes how Fidel Castro's regime provides inspiration, guidance, training, and technical assistance to communist and revolutionary groups, acting as a 'Latin version of the old Comintern'. The report details Cuban plans, training programs for Latin American nationals, the limited direct provision of weapons, funding methods, and propaganda efforts via Radio Havana. It also assesses the influence of rival forces, particularly the differing strategies of the Chinese Communists and Soviets, and their impact on Latin American subversion, plus notes increasing Soviet interest through initiatives like the Latin American Institute in the Academy of Sciences of the USSR.",
  "tags": [
    "Cuban Missile Crisis",
    "Latin America",
    "Soviet Offensive Weapons in Cuba",
    "Cuban Subversion",
    "Soviet Military Forces in Cuba",
    "Classified Testimony",
    "Director of Central Intelligence Agency (DirCIA)",
    "Secretary of Defense (SecDef)",
    "Secretary of the Navy (SecNav)",
    "House Appropriations Committee",
    "Senate Armed Services Committee (SASC)",
    "Radio Havana",
    "Propaganda",
    "Guerrilla Warfare Training"
  ],
  "title": "Classified Congressional Testimony concerning Cuban Subversion in Latin America, Cuban Military Buildup, Soviet Military Weapons in Cuba, etc.",
  "date": "1963-02-00",
  "locations_mentioned": [
    "Cuba",
    "Latin America",
    "Venezuela",
    "Peru",
    "Ecuador",
    "Argentina",
    "Bolivia",
    "Uruguay",
    "Mexico",
    "Curacao",
    "Haiti",
    "Nicaragua",
    "Dominican Republic",
    "Iron Curtain",
    "Western Europe",
    "Soviet Bloc",
    "Brazil",
    "Colombia",
    "Guatemala",
    "Honduras",
    "China",
    "USSR"
  ],
  "origin_agency": "ARMY",
  "persons_mentioned": [
    "Fidel Castro",
    "Che Guevara",
    "Blas Roca",
    "Fabricio Ojeda",
    "Julio Cesar Mayorga Porto-carrera",
    "Juan Bosch",
    "Alberto Bayo",
    "Mao Tse-tung",
    "Joseph F. Carroll",
    "Senator Stennis",
    "General Maxwell D. Taylor",
    "Mr. Martin",
    "Mr. Bromley Smith",
    "Mr. McGiffert",
    "Bob Mandelstam",
    "LtCol Patchell",
    "Sec McNamara",
    "Mr. Robt A. Hurwitch",
    "Mr. Califano",
    "Vance",
    "William A. Tidwell"
  ],
  "recipient": "Califano"
}