{
  "classification": "Cuba",
  "document_type": "Paper, Textual Document",
  "security": "Disclosing the specific covert actions, such as 'intensified covert collection of intelligence within Cuba, especially within the regime' and 'support of Cuban exiles who are seeking to return the 26 of July Movement to its original aims,' could jeopardize ongoing operations and expose intelligence sources and methods. Moreover, revealing the contingency planning for potential military actions, including a 'POL blockade' and 'major acts of sabotage on shipping destined for Cuba,' could damage international relations and provide adversaries with insight into U.S. strategic thinking.",
  "security_level": "Secret",
  "summary": "This document contains indexed reports from various agencies (CIA, DOD, DOS, and NSC) regarding policy and contingency planning related to Cuba in 1963, including national security actions, U.S. policy toward the Cuban Brigade, and examinations of policy sources.",
  "summary_one_paragraph": "This collection of papers, dated from January to February 1963, includes reports and memos from the CIA, DOD, DOS, and NSC concerning U.S. policy and contingency planning towards Cuba. It covers subjects such as National Security Action Memoranda, actions of the National Security Council, policy statements, actions of the Executive Committee during the Cuban Crisis, resolutions of the Organization of American States, and public statements by President Kennedy. The documents outline U.S. objectives regarding Cuba, including protecting U.S. security, removing Soviet forces, preventing Cuban aggression, reducing Cuba's subversive capabilities, supporting developments to divorce Cuba from Sino-Soviet purposes, maximizing costs to the Soviet Union, and politically isolating the Castro regime. The papers also discuss potential covert actions, shipping regulations, OAS sanctions, and contingency planning for various scenarios, including potential military force.",
  "tags": [
    "Cuba",
    "National Security",
    "Contingency Planning",
    "Covert Operations",
    "OAS",
    "NSC",
    "Cuban Brigade",
    "Kennedy Administration"
  ],
  "title": "Examination of Principal Sources of Policy and Contingency Planning on Cuba",
  "date": "1963-00-00",
  "locations_mentioned": [
    "Cuba"
  ],
  "origin_agency": "ARMY",
  "persons_mentioned": [
    "Joseph A. Califano, Jr.",
    "McGeorge Bundy",
    "Mr. Cottrell",
    "John W. Ford",
    "Alexis Johnson",
    "Fidel Castro",
    "President Kennedy",
    "Roswell L. Gilpatric",
    "Mr. Vance",
    "William H. B",
    "Mr. McNamara",
    "General Taylor",
    "Mr. Yarmolinsky",
    "Bissell",
    "Achilles",
    "Sherman Kent",
    "Robert Woodward"
  ],
  "sender": "JOSEPH A. CALIFANO, JR."
}