{
  "classification": "Cuba",
  "document_type": "Paper, Textual Document",
  "security": "This document details actions taken to curb Cuban subversion in Latin America, including CIA and State Department efforts to control travel to and from Cuba, movement of Cuban propaganda, and clandestine movement of guerrillas and arms.  Specifically, it mentions the development of 'highly useful information on frequency of Cuban chartered flights to Brazil, names and nationalities of passengers and crew, and lax measures of control followed by Brazilian authorities' and the dissemination of this information. Disclosing these activities could compromise intelligence sources, methods, and ongoing operations aimed at monitoring and countering Cuban influence.",
  "security_level": "Secret",
  "summary": "A report from October 1963 outlines actions taken during July-August 1963 by the Interdepartmental Coordinating Committee of Cuban Affairs (ICCA) to curb Cuban subversion in Latin America, focusing on travel control, propaganda, and movement of guerrillas and arms.",
  "summary_one_paragraph": "This document, dated October 14, 1963, is a report from Joseph A. Califano, Jr., to Captain E.R. Zumwalt, Jr., and others, regarding the actions taken during July-August 1963 by the Interdepartmental Coordinating Committee of Cuban Affairs (ICCA) to curb Cuban subversion in Latin America.  The report details efforts by the CIA, Department of State, and Department of Defense to control travel to and from Cuba, restrict the movement of Cuban propaganda, monitor and interdict clandestine movement of guerrillas and arms, control the transfer of funds, strengthen counter-insurgency capabilities, exchange intelligence, and surveil Cuban diplomatic missions.  It includes specific examples of actions taken in various Latin American countries and lists known travel of Latin Americans to and from Cuba during July and August 1963.",
  "tags": [
    "JFK Assassination",
    "Cuban Subversion",
    "Counterinsurgency",
    "Latin America",
    "CIA",
    "Department of State",
    "Department of Defense",
    "ICCA",
    "Travel Control",
    "Propaganda",
    "Guerrillas",
    "Arms Trafficking",
    "Intelligence Sharing",
    "Surveillance"
  ],
  "title": "ICCA: Actions Taken During July-August 1963 in Curbing Cuban Subversion",
  "date": "1963-10-14",
  "locations_mentioned": [
    "Cuba",
    "Latin America",
    "Brazil",
    "Buenos Aires",
    "Bolivia",
    "Santiago",
    "Chile",
    "Costa Rica",
    "Mexico City",
    "Vera Cruz",
    "Conakry",
    "Rio",
    "Cayman Islands",
    "Mexico City",
    "Curacao",
    "Hague",
    "Ottawa",
    "Montreal",
    "Georgetown",
    "London",
    "Jamaica",
    "Netherlands",
    "New York",
    "Port of Spain",
    "Barbados",
    "Trinidad",
    "Ireland",
    "Managua",
    "Nicaragua",
    "Tegucigalpa",
    "Honduras",
    "Colombia",
    "Ecuador",
    "Panama Canal Zone",
    "Puntarenas",
    "El Salvador",
    "British Guiana",
    "La Paz",
    "Uruguay",
    "Venezuela"
  ],
  "origin_agency": "ARMY",
  "persons_mentioned": [
    "Joseph A. Califano, Jr.",
    "Capt. Zumwalt",
    "Mr. Yarmelinsky",
    "Col Nigra",
    "Mt Col Haig",
    "Raul Roa Kouri",
    "Francisco Julio",
    "Camilo Cienfuegos",
    "Che Guevara",
    "Mao Tse-tung",
    "Adolfo Garcia Barberena",
    "Alberto Serrato",
    "Hector Bogantes Zamora",
    "Cheddi Jagan",
    "Mohammed Kassim",
    "Adam Watson"
  ],
  "recipient": "CAPT. ZUMWALT ET AL",
  "sender": "JOSEPH A. CALIFANO, JR."
}