{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "The document discusses potential sabotage operations against Cuba, including the possible use of biological agents to cause crop failures. It also mentions the consideration of attacking and harassing Soviet personnel within Cuba. Releasing such information could reveal sensitive operational plans and methods, damage international relations, and expose potential violations of international law. Quoting directly, 'General Carter emphasized the extreme sensitivity of any such operation and the disastrous results that would flow from something going wrong, particularly if there were obvious attribution to the U.S. He mentioned specifically the possibility of producing crop failures by the introduction of biological agents which would appear to be of natural origin.' and 'It was suggested that the matter of attacking and harrassing of Soviet personnel within Cuba should be considered'",
  "security_level": "TOP SECRET",
  "summary": "Minutes from a September 6, 1962 meeting of the Special Group on Mongoose discussing potential actions against Cuba, including sabotage and harassment.",
  "summary_one_paragraph": "This document contains the minutes of a meeting held on September 6, 1962, by the Special Group on Mongoose, focusing on strategies to destabilize Cuba. The discussion included topics such as supporting Cuban exile groups, actions to be undertaken by other Hemisphere governments, submarine broadcasts, economic harassment, and sabotage operations. General Carter emphasized the sensitivity of agricultural sabotage, suggesting the use of biological agents to cause crop failures, while Mr. Bundy stressed the need to avoid any external activities that could be traced back to the U.S. Other suggestions included infiltrating explosives to Cubans and considering attacks on Soviet personnel in Cuba. The group also discussed the possibility of counterfeiting and the delegation of responsibilities within broad policy lines.",
  "tags": [
    "Mongoose",
    "Cuba",
    "Sabotage",
    "Biological Warfare",
    "Exiles",
    "Soviet Personnel",
    "Counterfeiting",
    "Deception"
  ],
  "title": "Minutes of Meeting of the Special Group on Mongoose 6 SEP 62",
  "date": "1962-09-06",
  "locations_mentioned": [
    "Cuba"
  ],
  "origin_agency": "OSD",
  "persons_mentioned": [
    "General Carter",
    "Mr. Martin",
    "General Lansdale",
    "Mr. Bundy",
    "Mr. Murrow",
    "Attorney General"
  ]
}