{
  "classification": "Cuba",
  "document_type": "Memo",
  "security": "This memorandum outlines specific tasks assigned to the CIA within the Cuba Project, including plans for sabotage, propaganda, and infiltration. Disclosing these activities could compromise ongoing or future operations, reveal sensitive intelligence-gathering methods, and damage relationships with other countries. Examples include the disruption of Cuban nickel supplies to the USSR by sinking ships or sabotaging plants, inducing crop failure by infiltrating agents, and conducting propaganda operations in various Latin American countries. As quoted: 'Primary methods of disrupting the supply of Cuban nickel to the USSR could, if approved, include (1) the sinking of Cuban or Bloc ships by open attack; (2) the use of \"frogman\" or UDT tactics in harbors for the same purpose…' and 'Plans for inducing the failure of crops will be submitted by 15 February. These plans will envisage both the use of controlled assets who can be infiltrated and exfiltrated and the provision of encouragement and guidance to the resistance...'",
  "security_level": "TOP SECRET",
  "summary": "This top secret memorandum details the CIA's planned tasks within the Cuba Project as of January 24, 1962, outlining actions related to intelligence gathering, sabotage, propaganda, and infiltration to undermine the Cuban regime.",
  "summary_one_paragraph": "This memorandum, dated January 24, 1962, outlines the CIA's responsibilities within the Cuba Project, a U.S. government initiative aimed at destabilizing the Cuban regime. It details 16 specific tasks assigned to the CIA, including intelligence gathering (NIE 85-62), establishing interrogation centers, assessing stay-behind networks, and recruiting third-country assets. Further plans include identifying potential Cuban officials for defection, conducting cover and deception operations, developing an organized resistance movement, and implementing economic sabotage such as disrupting nickel supplies and inducing crop failures. The memorandum also covers propaganda operations in Latin America and preparations for a TV intrusion operation in Havana.",
  "tags": [
    "JFK Assassination Records Act",
    "Cuba Project",
    "MONGOOSE",
    "CIA",
    "Sabotage",
    "Propaganda",
    "Infiltration",
    "Intelligence Gathering",
    "Economic Warfare"
  ],
  "title": "The Cuba Project",
  "date": "1962-01-24",
  "locations_mentioned": [
    "Cuba",
    "Florida",
    "Spain",
    "Belgium",
    "France",
    "Uruguay",
    "Costa Rica",
    "Caribbean",
    "Latin America",
    "Argentina",
    "Bolivia",
    "Brazil",
    "Chile",
    "Colombia",
    "Ecuador",
    "Guatemala",
    "Mexico",
    "Panama",
    "Peru",
    "Venezuela",
    "USSR",
    "Canada",
    "Havana",
    "Camaguey",
    "Santa Clara",
    "Cienfuegos",
    "Matanzas",
    "Cardenas",
    "Sancti Spiritus",
    "Escambray Mountains",
    "Holguin",
    "Santiago de Cuba",
    "Ciego de Avila",
    "Baracoa",
    "Pinar del Rio",
    "Manzanillo",
    "Colon"
  ],
  "origin_agency": "OSD (Originator)",
  "persons_mentioned": [
    "General Lansdale",
    "Castro"
  ],
  "recipient": "Unknown",
  "sender": "OSD"
}