{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "This document discusses contingency plans and potential retaliatory actions related to Cuba, outlining specific responses to potential Cuban actions against U.S. targets, aircraft, shipping, and exiles. Disclosing these plans could compromise U.S. defense strategies and reveal the extent of U.S. military and intelligence involvement in Cuban affairs. Quoting: \"There are, of course, existing and related military plans, retaliatory in nature, which range up to and include a full scale military invasion of Cuba.\"",
  "security_level": "CONFIDENTIAL",
  "summary": "A memorandum from Cyrus Vance to multiple recipients regarding Cuban affairs in the Department of Defense, including possible retaliatory actions by the Cuban government and psychological programs related to Cuba.",
  "summary_one_paragraph": "This document, dated June 26, 1965, details Cuban affairs within the Department of Defense, focusing on potential retaliatory actions by the Castro government and psychological programs aimed at Cuba. Authored by Cyrus R. Vance and addressed to various recipients including the Secretaries of the Army, Navy, and Air Force, it summarizes existing contingency plans for possible Cuban actions against U.S. targets, aircraft, shipping, and exiles. It includes an assessment that Castro is more likely to intensify support for subversive forces in Latin America than to risk direct confrontation with the United States, as well as discussions regarding the Interdepartmental Subcommittee's meeting on Cuban Affairs.",
  "tags": [
    "ICCCA",
    "Administration",
    "Psychological Programs",
    "Cuba",
    "Second Latin American Youth Congress",
    "Possible Retaliatory Actions",
    "Guantanamo",
    "Exiles",
    "Sabotage",
    "Radio Jamming",
    "Contingency Plans"
  ],
  "title": "Cuban Affairs in the Department of Defense",
  "date": "1965-06-26",
  "origin_agency": "OSD",
  "sender": "Cyrus R. Vance (from OSD: Office of the Secretary of Defense.)"
}