{
  "classification": "Cuba",
  "document_type": "Memorandum",
  "security": "This document discusses Operation Mongoose, which included plans to recruit Cuban officials, support dissident groups, disseminate propaganda, and potentially introduce counterfeit currency to destabilize the Cuban economy. Some of these activities, particularly the use of counterfeit currency, could be viewed as violations of international law and U.S. policy. The document states: 'Task 23, Counterfeit Currency to increase Cuban economic problems is considered feasible...' and 'CIA believes it can recruit some 20-man teams for possible use in beating up resistance groups within Cuba'. Revealing these details could damage the reputation of the U.S. and its intelligence agencies.",
  "security_level": "TOP SECRET",
  "summary": "A memorandum from Brig. Gen. Lansdale to the Special Group (Augmentel) on May 31, 1962, detailing the progress of Operation Mongoose, including intelligence gathering, economic pressure, propaganda efforts, and plans to fracture the Cuban regime.",
  "summary_one_paragraph": "This Top Secret memorandum, dated May 31, 1962, from Brigadier General Lansdale to the Special Group (Augmentel), outlines the progress of Operation Mongoose, a U.S. effort to destabilize the Cuban government. It reports on CIA intelligence activities, such as recruiting Cuban officials and resupplying teams in Pinar del Rio Province, as well as economic measures, including denying bunkering facilities to vessels trading with Cuba and soliciting Japan to cease sugar purchases. The memo also details propaganda efforts by USIA and CIA, a Cuban aircraft incident at Guantanamo, and CIA proposals for escalating actions against Cuba, including using a submarine for broadcasts, disseminating leaflets via balloons, recruiting teams to suppress resistance groups, and introducing counterfeit currency, while also noting the State Department's perceived lack of enthusiasm for the project.",
  "tags": [
    "JFK Assassination",
    "Operation Mongoose",
    "CIA",
    "Cuba",
    "Propaganda",
    "Economic Pressure",
    "Destabilization",
    "Guantanamo",
    "Counterfeit Currency",
    "FOIA"
  ],
  "title": "OPERATION MONGOOSE PROGRESS",
  "date": "1962-05-31",
  "locations_mentioned": [
    "Cuba",
    "Havana",
    "Pinar del Rio Province",
    "Guantanamo",
    "Kingston, Jamaica"
  ],
  "origin_agency": "OSD (Office of the Secretary of Defense)",
  "persons_mentioned": [
    "Brig. Gen. Lansdale",
    "Leon Roth",
    "General Taylor",
    "Mr. Johnson",
    "Mr. Gilpatric",
    "Mr. McCone",
    "Mr. Kennedy",
    "General Lemnitzer"
  ],
  "sender": "Brig. Gen. Lansdale Ed"
}