{
  "entity_name": "Administration",
  "entity_type": "tag",
  "document_count": 15,
  "summary": "The documents primarily relate to the administrative functions of various government entities, particularly the House Select Committee on Assassinations (HSCA) and the Department of Defense. A significant portion of the documents focuses on payroll records, personnel actions (hiring, salary adjustments, leave), and administrative procedures within the HSCA. These records detail the employment of various staff members, including researchers, counsel, and interns, and provide insights into the operational aspects of the committee. Other documents touch on administrative matters within the Department of Defense related to Cuban affairs. The documents also include requests for access to facilities and notifications regarding the redaction of sensitive information like Social Security numbers due to privacy concerns.",
  "key_connections": [
    "House Select Committee on Assassinations (HSCA)",
    "Department of Defense",
    "Cyrus Vance",
    "Charlotte Green",
    "Jeffrey Facter",
    "Robin David Lindley",
    "Clarence J. Day",
    "Johanna Lynn Smith",
    "James Lerer Wolf",
    "Charles Michael Berk",
    "Elizabeth C. Feeley",
    "Thomas N. Downing",
    "James K. Conzelman",
    "Leslie H. Wizelman",
    "Louis Stokes",
    "Henry B. Gonzalez",
    "University of New Mexico School of Medicine",
    "Mexico City Station"
  ],
  "significance": "In the context of the JFK assassination, the administrative documents primarily shed light on the inner workings and staffing of the House Select Committee on Assassinations (HSCA), which was tasked with investigating the assassination. These documents provide a glimpse into the resources, personnel, and operational procedures employed by the committee during its investigation. While not directly related to the assassination itself, they offer valuable context regarding the efforts to investigate the event and the administrative processes involved.",
  "document_ids": [
    "202-10002-10124",
    "180-10068-10362",
    "180-10096-10448",
    "104-10174-10068",
    "180-10068-10344",
    "180-10060-10471",
    "180-10068-10332",
    "180-10070-10159",
    "180-10060-10453",
    "180-10070-10175",
    "180-10068-10306",
    "180-10068-10347",
    "180-10073-10321",
    "180-10068-10326",
    "180-10070-10173"
  ]
}