{
  "entity_name": "DRE",
  "entity_type": "tag",
  "document_count": 14,
  "summary": "The Directorio Revolucionario Estudiantil (DRE) was a Cuban student resistance organization involved in anti-Castro activities, particularly in the early 1960s. They engaged in activities such as propaganda, sabotage, and seeking weapons for political assassinations. The DRE received support, including arms, and planned uprisings against the Castro regime. They were also involved in gathering intelligence and providing information on the internal situation in Cuba. The CIA monitored and interacted with the DRE, using them as sources of information and potentially as assets in covert operations. There are indications that some DRE members may have harbored animosity towards President Kennedy due to his perceived lack of forceful action against Cuba, raising concerns about possible DRE involvement in the JFK assassination investigations.",
  "key_connections": [
    "Fidel Castro",
    "CIA",
    "Cuban refugees",
    "GYROSE",
    "UFGA",
    "PBRUMEN",
    "Jose Artecona",
    "Jose Ricardo Rabel Ortega",
    "Juan Rodriguez Jobolca",
    "Salvador Jomolca",
    "Movimiento Revolucionario del Pueblo (MRP)",
    "Unidad Revolucionaria (UR)",
    "Orlando Bosch",
    "Ricardo Morales",
    "Joaquin Godoy",
    "Jorge Nobregas",
    "Dunney Perez Alamo",
    "Francisco Rodriguez Tamayo",
    "Juan Manuel Salvat Roque",
    "Jose Ignacio Rasco",
    "Amador Odio"
  ],
  "significance": "The DRE's significance in the JFK assassination context lies in the potential animosity some of its members may have held towards President Kennedy, raising concerns about possible DRE involvement in the assassination investigations. A CIA memorandum records recollections of potential animosity held by DRE leadership towards President Kennedy due to his perceived lack of forceful action against Cuba.",
  "document_ids": [
    "104-10171-10044",
    "104-10171-10013",
    "104-10170-10036",
    "104-10171-10033",
    "104-10171-10039",
    "104-10181-10117",
    "157-10014-10047",
    "104-10171-10034",
    "104-10171-10018",
    "180-10145-10308",
    "104-10226-10087",
    "194-10012-10030",
    "104-10336-10000",
    "104-10171-10020"
  ]
}