{
  "entity_name": "Employment History",
  "entity_type": "tag",
  "document_count": 23,
  "summary": "The documents tagged with \"Employment History\" primarily relate to personnel records, payroll information, and background investigations of individuals connected to the House Select Committee on Assassinations (HSCA) and the CIA. These records often include details of an individual's past employment, positions held, salary, and reasons for leaving previous jobs. The documents serve to verify employment claims, assess suitability for positions, and maintain administrative records. A notable pattern is the postponement of Social Security numbers in HSCA payroll records to protect personal privacy. Several documents also detail the employment history of individuals being investigated or considered for employment by government agencies, including the CIA and the HSCA.",
  "key_connections": [
    "HSCA",
    "CIA",
    "Giulia M. Barrow",
    "Louis H. Hindle",
    "Anthony Gennarelli",
    "Manuel Marti",
    "Bishop (individuals)",
    "Robert Scheer",
    "Mary Susan Grimes",
    "Sheila Jackson Lee",
    "William Vincent Broe",
    "Emilio Americo Rodriguez",
    "Rita L. Morton",
    "Sari Mordana",
    "Robert Tyler Shaw",
    "E. Howard Hunt, Jr.",
    "Lucien Conein",
    "Arthur R. Schwickrath",
    "Rebecca Wheeler Martin",
    "Denise L. McCray",
    "Cornish F. Hitchcock"
  ],
  "significance": "In the context of the JFK assassination, employment history is significant for several reasons. It helps establish the backgrounds and potential biases of individuals involved in the investigation (HSCA staff) or those who may have had connections to the events surrounding the assassination (CIA personnel or individuals investigated by the FBI). Verifying employment history is a standard practice in background checks and security clearances, and these records provide insight into the vetting processes and potential vulnerabilities of individuals involved.",
  "document_ids": [
    "180-10068-10303",
    "180-10060-10441",
    "194-10004-10382",
    "104-10146-10198",
    "194-10005-10105",
    "180-10068-10363",
    "194-10002-10216",
    "180-10060-10467",
    "104-10061-10207",
    "104-10136-10324",
    "104-10129-10002",
    "180-10060-10490",
    "180-10060-10486",
    "104-10222-10040",
    "104-10194-10023",
    "194-10005-10064",
    "104-10222-10041",
    "180-10060-10475",
    "194-10005-10063",
    "194-10004-10379",
    "180-10060-10480",
    "194-10004-10380",
    "180-10060-10442"
  ]
}