{
  "entity_name": "James Angleton",
  "entity_type": "tag",
  "document_count": 13,
  "summary": "James Angleton was the Chief of Counterintelligence Operations at the CIA. He served as a key liaison between the CIA and the FBI, particularly concerning Israeli intelligence. The documents reveal that Angleton provided the FBI with intelligence outside regular CIA channels, especially regarding Israeli matters, leading to the establishment of a special procedure for handling information received from him, referred to as 'Bureau Informant 100.' Angleton's identity was protected to avoid revealing CIA involvement and to safeguard sensitive projects. He also analyzed Soviet policy towards the United States based on information from a former KGB member. The House Select Committee on Assassinations (HSCA) requested information on Angleton, indicating his potential relevance to the JFK assassination investigation. His involvement spans from at least 1953 to 1975, as indicated by the document dates.",
  "key_connections": [
    "CIA",
    "FBI",
    "Israeli Intelligence Service",
    "Allen Dulles",
    "William Colby",
    "Robert Maheu",
    "House Select Committee on Assassinations (HSCA)",
    "James Schlesinger",
    "George DeMohrenschildt",
    "Richard Helms",
    "Raymond Rocca"
  ],
  "significance": "James Angleton's significance in the JFK context stems from the HSCA's interest in him and the files related to him. The documents suggest that the HSCA sought information on Angleton, potentially indicating his involvement in events or knowledge relevant to the assassination. However, the exact nature of his significance remains unclear based solely on these documents.",
  "document_ids": [
    "124-10326-10103",
    "124-10276-10400",
    "124-10326-10104",
    "124-10326-10098",
    "124-10326-10099",
    "104-10059-10057",
    "124-10326-10105",
    "104-10061-10320",
    "157-10011-10024",
    "104-10431-10006",
    "104-10061-10214",
    "124-10326-10100",
    "104-10301-10011"
  ]
}