{
  "entity_name": "John Roselli",
  "entity_type": "tag",
  "document_count": 11,
  "summary": "John Roselli, also known as \"Handsome Johnny\", was a prominent figure associated with organized crime. The documents indicate FBI surveillance and investigations into his activities, whereabouts, and connections, particularly in Los Angeles and Las Vegas, during the early 1960s. He was investigated for potential involvement in disrupting a movie filming, allegedly at the request of Frank Sinatra. The FBI also tracked his associations, including Judith E. Campbell and Sam Giancana, and investigated his financial activities, including bank accounts and tax returns. Later documents discuss his possible involvement in CIA plots against Fidel Castro. The FBI also investigated his background, including attempts to verify his birth records in Italy. His activities and movements were closely monitored by the FBI, with reports detailing his associations, meetings, and travel plans.",
  "key_connections": [
    "Judith E. Campbell",
    "Sam Giancana",
    "Frank Sinatra",
    "Hal Roach, Jr.",
    "Carroll Case",
    "Natalie V. Loughran",
    "Eugene Michael Carrafa",
    "Jay Knohl",
    "Det. Joseph Ronald Smisek",
    "Janice Mae Piccerelli",
    "CIA",
    "Fidel Castro"
  ],
  "significance": "John Roselli's significance in the JFK assassination context stems from his involvement with organized crime and his alleged participation in CIA plots against Fidel Castro. The Senate Select Committee scrutinized the CIA's failure to disclose information about these plots to the Warren Commission. Roselli's connections to both the Mafia and the CIA raise questions about potential links between anti-Castro efforts and the assassination of President Kennedy.",
  "document_ids": [
    "124-10223-10067",
    "124-10223-10088",
    "124-10223-10077",
    "180-10117-10032",
    "124-10223-10083",
    "124-10223-10164",
    "180-10145-10446",
    "124-10223-10086",
    "124-10223-10073",
    "124-10223-10121",
    "124-10223-10068"
  ]
}