{
  "entity_name": "Select Committee on Assassinations",
  "entity_type": "tag",
  "document_count": 34,
  "summary": "The Select Committee on Assassinations (HSCA) was a U.S. House of Representatives committee established to investigate the assassinations of President John F. Kennedy and Martin Luther King Jr. The documents primarily consist of payroll records and related notifications concerning the committee's staff from 1977 to 1979. These records detail employee names, positions, salaries, and social security numbers (though the latter were often redacted for privacy reasons). The Assassination Records Review Board (ARRB) played a role in reviewing and determining the release of these records, often postponing the release of sensitive information like social security numbers. The documents provide a glimpse into the administrative and financial operations of the HSCA during its investigation.",
  "key_connections": [
    "Assassination Records Review Board (ARRB)",
    "U.S. House of Representatives",
    "Louis Parisi",
    "Phoebe Curtis Orr",
    "Jacqueline Hess",
    "Antoinette M. Roberts",
    "Clifford A. Fenton, Jr.",
    "Ann Furnald Taylor",
    "Francis J. Kelly"
  ],
  "significance": "The Select Committee on Assassinations was responsible for reinvestigating the JFK assassination, aiming to provide a more thorough and conclusive understanding of the events. While the documents provided focus on the administrative aspects of the committee, the HSCA's work was crucial in re-examining evidence and testimonies related to the assassination, contributing to the ongoing discourse and analysis of the event.",
  "document_ids": [
    "180-10060-10498",
    "180-10125-10078",
    "180-10125-10081",
    "180-10125-10107",
    "180-10060-10495",
    "180-10125-10106",
    "180-10060-10440",
    "180-10125-10096",
    "180-10125-10079",
    "180-10070-10146",
    "180-10125-10075",
    "180-10125-10091",
    "180-10125-10087",
    "180-10125-10101",
    "180-10068-10349",
    "180-10125-10090",
    "180-10125-10103",
    "180-10070-10163",
    "180-10125-10085",
    "180-10125-10093",
    "180-10125-10089",
    "180-10125-10088",
    "180-10125-10092",
    "180-10125-10084",
    "180-10125-10102",
    "180-10125-10076",
    "180-10125-10105",
    "180-10125-10083",
    "180-10125-10095",
    "180-10060-10455",
    "180-10125-10094",
    "180-10125-10082",
    "180-10125-10104",
    "180-10125-10098"
  ]
}