{
  "entity_name": "TOP SECRET UMBRA",
  "entity_type": "tag",
  "document_count": 48,
  "summary": "TOP SECRET UMBRA is a classification marking used on intelligence reports, primarily from the National Security Agency (NSA), detailing global reactions and intelligence related to the assassination of President John F. Kennedy. These reports cover a wide range of information, including foreign government and public reactions, potential involvement of various groups (such as Cubans, Soviets, and Zionists), security measures taken by different countries, and diplomatic communications following the event. The reports span from the immediate aftermath of the assassination in November 1963 through 1964, and even into the 1970s with inquiries from the House Select Committee on Assassinations (HSCA) and Senate Select Committee on Intelligence (SSCI). The documents reveal a global preoccupation with the assassination and its potential implications for international relations and U.S. foreign policy.",
  "key_connections": [
    "National Security Agency (NSA)",
    "John F. Kennedy",
    "Cuba",
    "Soviet Union",
    "House Select Committee on Assassinations (HSCA)",
    "Senate Select Committee on Intelligence (SSCI)",
    "Foreign Governments (Poland, Mexico, Turkey, etc.)",
    "Lee Harvey Oswald",
    "Jack Ruby"
  ],
  "significance": "In the JFK assassination context, TOP SECRET UMBRA signifies highly sensitive intelligence reporting, primarily from the NSA, that provides insights into the global response, potential conspiracies, and international implications surrounding President Kennedy's assassination. It highlights the intense scrutiny and intelligence gathering efforts undertaken by the U.S. government in the wake of the event, as well as the concerns and reactions of various nations and organizations worldwide.",
  "document_ids": [
    "144-10001-10122",
    "144-10001-10323",
    "144-10001-10118",
    "144-10001-10092",
    "144-10001-10314",
    "144-10001-10206",
    "144-10001-10363",
    "144-10001-10089",
    "144-10001-10344",
    "144-10001-10104",
    "144-10001-10077",
    "144-10001-10348",
    "144-10001-10173",
    "144-10001-10333",
    "144-10001-10372",
    "144-10001-10109",
    "144-10001-10349",
    "144-10001-10105",
    "144-10001-10095",
    "144-10001-10311",
    "144-10001-10350",
    "144-10001-10307",
    "144-10001-10331",
    "144-10001-10366",
    "144-10001-10063",
    "144-10001-10074",
    "144-10001-10367",
    "144-10001-10371",
    "144-10001-10097",
    "144-10001-10351",
    "144-10001-10081",
    "144-10001-10347",
    "144-10001-10296",
    "144-10001-10054",
    "144-10001-10111",
    "144-10001-10399",
    "144-10001-10376",
    "144-10001-10360",
    "144-10001-10120",
    "144-10001-10065",
    "144-10001-10073",
    "144-10001-10356",
    "144-10001-10090",
    "144-10001-10068",
    "144-10001-10052",
    "144-10001-10117",
    "144-10001-10361",
    "144-10001-10320"
  ]
}