{
  "entity_name": "Rolando Masferrer",
  "entity_type": "person-mentioned",
  "document_count": 10,
  "summary": "Rolando Masferrer was a Cuban exile and former senator involved in various activities, including plotting against the Haitian government and potentially other political actions. Documents suggest he was organizing groups of Haitians and Cubans in Miami for a potential invasion of Haiti, with connections to Marquez Sterling and former Batista officers. He was also linked to an assassin and the infiltration of Abel and Antonio Diez into the Rebel Army. The CIA was concerned about the potential damage to its Miami operations due to the Justice Department's investigation into Masferrer's planned Haitian invasion. There are also allegations of CIA involvement in his assassination and investigations into his connections within the Cuban exile community. He used the covername 'POLO' and was reportedly arriving in Santo Domingo to potentially join forces with the CANTAVE/RIGAUD/VERNA group. The documents span from 1959 to 1976, indicating a long period of involvement in various political and potentially clandestine activities.",
  "key_connections": [
    "Marquez Sterling",
    "Batista officers",
    "Abel Diez",
    "Antonio Diez",
    "CANTAVE/RIGAUD/VERNA group",
    "Mitchell Livingston Werbell III"
  ],
  "significance": "The documents do not directly link Rolando Masferrer to the JFK assassination. However, they reveal his involvement in anti-Castro activities, potential connections to individuals involved in political violence, and CIA's interest in his activities. This places him within the broader context of the Cold War and the complex web of relationships between Cuban exiles, the CIA, and various political actors, which are relevant to understanding the environment surrounding the JFK assassination.",
  "document_ids": [
    "124-90090-10025",
    "124-90090-10038",
    "124-90090-10035",
    "104-10104-10094",
    "104-10221-10022",
    "104-10176-10067",
    "124-90090-10037",
    "104-10176-10070",
    "124-90090-10026",
    "124-10279-10258"
  ]
}