{
  "entity_name": "Condolences",
  "entity_type": "tag",
  "document_count": 19,
  "summary": "The documents reflect a global outpouring of condolences following the assassination of President John F. Kennedy in November 1963. These messages of sympathy and mourning came from various sources, including heads of state, government officials, diplomatic representatives, and even religious organizations from countries around the world, such as Thailand, South Vietnam, Cambodia, South Korea, Morocco, Poland, Syria, Ghana, Chile, Norway, Bulgaria and Zaire. The condolences were directed towards President Lyndon B. Johnson, Mrs. Jacqueline Kennedy, Secretary of State Dean Rusk, and the American people. The messages often expressed shock, sorrow, and admiration for Kennedy's efforts towards peace and progress, with some countries also highlighting Kennedy's support for initiatives like the Alliance for Progress. Many nations also took symbolic actions such as flying flags at half-mast and sending delegations to Kennedy's funeral.",
  "key_connections": [
    "President John F. Kennedy",
    "President Lyndon B. Johnson",
    "Jacqueline Kennedy",
    "Dean Rusk",
    "Government of Thailand",
    "Government of South Vietnam",
    "Government of Cambodia",
    "Government of South Korea",
    "Government of Morocco",
    "Government of Poland",
    "Government of Syria",
    "Government of Ghana",
    "Government of Chile",
    "Government of Norway",
    "Government of Bulgaria",
    "Government of Zaire"
  ],
  "significance": "The widespread expression of condolences underscores the global impact of President Kennedy's assassination and the respect he commanded on the international stage. These messages highlight the shared sense of loss and the desire to maintain positive relations with the United States during a time of national tragedy. The documents provide insight into the immediate reactions of various countries and their leaders to the event, reflecting the political and emotional climate of the era.",
  "document_ids": [
    "144-10001-10088",
    "144-10001-10354",
    "144-10001-10342",
    "144-10001-10378",
    "144-10001-10343",
    "144-10001-10355",
    "144-10001-10318",
    "144-10001-10344",
    "144-10001-10348",
    "144-10001-10299",
    "144-10001-10332",
    "144-10001-10298",
    "144-10001-10349",
    "144-10001-10076",
    "144-10001-10308",
    "144-10001-10297",
    "144-10001-10399",
    "144-10001-10340",
    "144-10001-10320"
  ]
}