{
  "entity_name": "Task Force W",
  "entity_type": "tag",
  "document_count": 17,
  "summary": "Task Force W was a CIA unit primarily focused on covert operations against Cuba, particularly during the early 1960s. Its activities were central to Operation Mongoose, a program aimed at destabilizing the Castro regime through intelligence gathering, economic pressure, psychological warfare, and support for anti-Castro groups. The documents reveal Task Force W's involvement in various operational plans, including infiltrating and disrupting anti-Castro organizations, gathering intelligence on Cuban military build-up, and exploring potential assassination attempts against Fidel Castro. The unit worked closely with JMWAVE, the CIA's Miami station, and coordinated with other agencies like ACSI. William Harvey played a significant role in leading and planning Task Force W's operations. The timeline of Task Force W's involvement spans from at least April 1962 to the end of 1962, with some activities continuing into 1963. Later investigations, such as the Rockefeller Commission and Senate Select Committee hearings in 1975, examined Task Force W's activities, particularly regarding potential assassination plots.",
  "key_connections": [
    "Operation Mongoose",
    "JMWAVE",
    "William Harvey",
    "Fidel Castro",
    "DRE (Directorio Revolucionario Estudiantil)",
    "ACSI (Army Counter Intelligence)",
    "General Lansdale",
    "Frank Sturgis"
  ],
  "significance": "Task Force W is significant in the JFK assassination context due to its central role in covert operations against Cuba, including potential assassination attempts against Fidel Castro. The Senate Select Committee hearings and depositions related to Task Force W's activities suggest that the unit's actions and the broader Operation Mongoose program were scrutinized for any potential links to the assassination of President Kennedy. The documents highlight the controversial nature of the CIA's anti-Castro efforts and the ethical questions surrounding assassination plots.",
  "document_ids": [
    "104-10171-10044",
    "104-10171-10013",
    "157-10008-10241",
    "104-10102-10224",
    "104-10171-10033",
    "157-10011-10083",
    "104-10307-10006",
    "104-10171-10003",
    "157-10014-10046",
    "104-10179-10104",
    "178-10002-10279",
    "104-10103-10079",
    "104-10131-10014",
    "104-10307-10024",
    "104-10069-10185",
    "157-10002-10087",
    "178-10002-10215"
  ]
}